id: sigmahq-sigma-d7fb8f0e-bd5f-45c2-b467-19571c490d7e
name: Cleartext Protocol Usage
description: 'Ensure that all account usernames and authentication credentials are
  transmitted across networks using encrypted channels.

  Ensure that an encryption is used for all sensitive information in transit. Ensure
  that an encrypted channels is used for all administrative account access.'
severity: low
enabled: true
tags:
  mitre: []
  categories:
  - network
references:
- https://www.cisecurity.org/controls/cis-controls-list/
- https://www.pcisecuritystandards.org/documents/PCI_DSS_v3-2-1.pdf
- https://nvlpubs.nist.gov/nistpubs/CSWP/NIST.CSWP.04162018.pdf
logsource:
  category: firewall
detection:
  selection:
    dst_port:
    - 8080
    - 21
    - 80
    - 23
    - 50000
    - 1521
    - 27017
    - 3306
    - 1433
    - 11211
    - 15672
    - 5900
    - 5901
    - 5902
    - 5903
    - 5904
  selection_allow1:
    action:
    - forward
    - accept
    - 2
  selection_allow2:
    blocked: 'false'
  condition: selection and 1 of selection_allow*
provenance:
  source: SigmaHQ/sigma
  source_id: d7fb8f0e-bd5f-45c2-b467-19571c490d7e
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/network/firewall/net_firewall_cleartext_protocols.yml
falsepositives:
- Unknown
