id: sigmahq-sigma-b593fd50-7335-4682-a36c-4edcb68e4641
name: Monero Crypto Coin Mining Pool Lookup
description: Detects suspicious DNS queries to Monero mining pools
severity: high
enabled: true
tags:
  mitre:
  - T1496
  - T1567
  categories:
  - network
references:
- https://www.nextron-systems.com/2021/10/24/monero-mining-pool-fqdns/
logsource:
  category: dns
detection:
  selection:
    query|contains:
    - pool.minexmr.com
    - fr.minexmr.com
    - de.minexmr.com
    - sg.minexmr.com
    - ca.minexmr.com
    - us-west.minexmr.com
    - pool.supportxmr.com
    - mine.c3pool.com
    - xmr-eu1.nanopool.org
    - xmr-eu2.nanopool.org
    - xmr-us-east1.nanopool.org
    - xmr-us-west1.nanopool.org
    - xmr-asia1.nanopool.org
    - xmr-jp1.nanopool.org
    - xmr-au1.nanopool.org
    - xmr.2miners.com
    - xmr.hashcity.org
    - xmr.f2pool.com
    - xmrpool.eu
    - pool.hashvault.pro
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: b593fd50-7335-4682-a36c-4edcb68e4641
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/network/dns/net_dns_pua_cryptocoin_mining_xmr.yml
falsepositives:
- Legitimate crypto coin mining
