id: splunk-security-content-a51bfe1a-94f0-48cc-b4e4-16a110145893
name: Attacker Tools On Endpoint
description: The following analytic detects the execution of tools commonly exploited
  by cybercriminals, such as those used for unauthorized access, network scanning,
  or data exfiltration. It leverages process activity data from Endpoint Detection
  and Response (EDR) agents, focusing on known attacker tool names. This activity
  is significant because it serves as an early warning system for potential security
  incidents, enabling prompt response. If confirmed malicious, this activity could
  lead to unauthorized access, data theft, or further network compromise, posing a
  severe threat to the organization's security infrastructure.
severity: medium
enabled: false
tags:
  mitre:
  - T1003
  - T1036.005
  - T1595
  categories:
  - endpoint
references: []
logsource:
  product: splunk
detection:
  splunk_spl: "| tstats `security_content_summariesonly` count min(_time) as firstTime\
    \ max(_time) as lastTime values(Processes.process) as process values(Processes.parent_process)\
    \ as parent_process FROM datamodel=Endpoint.Processes\n  WHERE [\n| inputlookup\
    \ attacker_tools\n| rename attacker_tool_names AS Processes.process_name\n| fields\
    \ Processes.process_name] AND Processes.dest!=unknown AND Processes.user!=unknown\
    \ by Processes.action Processes.dest Processes.original_file_name Processes.parent_process\
    \ Processes.parent_process_exec Processes.parent_process_guid Processes.parent_process_id\
    \ Processes.parent_process_name Processes.parent_process_path Processes.process\
    \ Processes.process_exec Processes.process_guid Processes.process_hash Processes.process_id\
    \ Processes.process_integrity_level Processes.process_name Processes.process_path\
    \ Processes.user Processes.user_id Processes.vendor_product\n| `security_content_ctime(firstTime)`\n\
    | `security_content_ctime(lastTime)`\n| `drop_dm_object_name(Processes)`\n| lookup\
    \ attacker_tools attacker_tool_names AS process_name OUTPUT description\n| search\
    \ description !=false\n| `attacker_tools_on_endpoint_filter`"
provenance:
  source: splunk/security_content
  source_id: a51bfe1a-94f0-48cc-b4e4-16a110145893
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/attacker_tools_on_endpoint.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
