id: splunk-security-content-10ec9031-015b-4617-b453-c0c1ab729007
name: Azure AD OAuth Application Consent Granted By User
description: The following analytic detects when a user in an Azure AD environment
  grants consent to an OAuth application. It leverages Azure AD audit logs to identify
  events where users approve application consents. This activity is significant as
  it can expose organizational data to third-party applications, a common tactic used
  by malicious actors to gain unauthorized access. If confirmed malicious, this could
  lead to unauthorized access to sensitive information and resources. Immediate investigation
  is required to validate the application's legitimacy, review permissions, and mitigate
  potential risks.
severity: medium
enabled: false
tags:
  mitre:
  - T1528
  categories:
  - cloud
references:
- https://attack.mitre.org/techniques/T1528/
- https://www.microsoft.com/en-us/security/blog/2022/09/22/malicious-oauth-applications-used-to-compromise-email-servers-and-spread-spam/
- https://learn.microsoft.com/en-us/azure/active-directory/manage-apps/protect-against-consent-phishing
- https://learn.microsoft.com/en-us/defender-cloud-apps/investigate-risky-oauth
- https://www.alteredsecurity.com/post/introduction-to-365-stealer
- https://github.com/AlteredSecurity/365-Stealer
logsource:
  product: splunk
detection:
  splunk_spl: '`azure_monitor_aad` operationName="Consent to application" properties.result=success
    | rename properties.* as * | eval permissions_index = if(mvfind(''targetResources{}.modifiedProperties{}.displayName'',
    "ConsentAction.Permissions") >= 0, mvfind(''targetResources{}.modifiedProperties{}.displayName'',
    "ConsentAction.Permissions"), -1) | eval permissions = mvindex(''targetResources{}.modifiedProperties{}.newValue'',permissions_index)
    | rex field=permissions "Scope: (?<Scope> [ ^,]+)" | fillnull | stats count min(_time)
    as firstTime max(_time) as lastTime by dest user src vendor_account vendor_product
    Scope signature | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
    | `azure_ad_oauth_application_consent_granted_by_user_filter`'
provenance:
  source: splunk/security_content
  source_id: 10ec9031-015b-4617-b453-c0c1ab729007
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/cloud/azure_ad_oauth_application_consent_granted_by_user.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
