id: splunk-security-content-337a46be-600f-11eb-ae93-0242ac130002
name: Certutil exe certificate extraction
description: 'The following analytic identifies the use of certutil.exe with arguments
  indicating the manipulation or extraction of certificates.

  It leverages data from Endpoint Detection and Response (EDR) agents, focusing on
  process names and command-line arguments.

  This activity is significant because extracting certificates can allow attackers
  to sign new authentication tokens, particularly in federated environments like Windows
  ADFS.

  If confirmed malicious, this could enable attackers to forge authentication tokens,
  potentially leading to unauthorized access and privilege escalation within the network.'
severity: medium
enabled: false
tags:
  mitre:
  - T1649
  categories:
  - endpoint
references:
- https://blog.sygnia.co/detection-and-hunting-of-golden-saml-attack
- https://strontic.github.io/xcyclopedia/library/certutil.exe-09A8A29BAA3A451713FD3D07943B4A43.html
logsource:
  product: splunk
detection:
  splunk_spl: "| tstats `security_content_summariesonly`\n  count min(_time) as firstTime\n\
    \        max(_time) as lastTime\nFROM datamodel=Endpoint.Processes\nWHERE\n(\n\
    \    Processes.process_name=certutil.exe\n    OR\n    Processes.original_file_name=certutil.exe\n\
    )\nProcesses.process = \"*-exportPFX*\"\n\nBY Processes.action Processes.dest\
    \ Processes.original_file_name\n   Processes.parent_process Processes.parent_process_exec\n\
    \   Processes.parent_process_guid Processes.parent_process_id\n   Processes.parent_process_name\
    \ Processes.parent_process_path\n   Processes.process Processes.process_exec Processes.process_guid\n\
    \   Processes.process_hash Processes.process_id Processes.process_integrity_level\n\
    \   Processes.process_name Processes.process_path Processes.user\n   Processes.user_id\
    \ Processes.vendor_product\n\n| `drop_dm_object_name(Processes)`\n| `security_content_ctime(firstTime)`\n\
    | `security_content_ctime(lastTime)`\n| `certutil_exe_certificate_extraction_filter`"
provenance:
  source: splunk/security_content
  source_id: 337a46be-600f-11eb-ae93-0242ac130002
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/certutil_exe_certificate_extraction.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
