id: splunk-security-content-aa0c4aeb-5b18-41c4-8c07-f1442d7599df
name: Child Processes of Spoolsv exe
description: The following analytic identifies child processes spawned by spoolsv.exe,
  the Print Spooler service in Windows, which typically runs with SYSTEM privileges.
  This detection leverages data from Endpoint Detection and Response (EDR) agents,
  focusing on process and parent process relationships. Monitoring this activity is
  crucial as it can indicate exploitation attempts, such as those associated with
  CVE-2018-8440, which can lead to privilege escalation. If confirmed malicious, attackers
  could gain SYSTEM-level access, allowing them to execute arbitrary code, escalate
  privileges, and potentially compromise the entire system.
severity: medium
enabled: false
tags:
  mitre:
  - T1068
  categories:
  - endpoint
references: []
logsource:
  product: splunk
detection:
  splunk_spl: "| tstats `security_content_summariesonly` count values(Processes.process_name)\
    \ as process_name values(Processes.process) as process min(_time) as firstTime\
    \ max(_time) as lastTime FROM datamodel=Endpoint.Processes\n  WHERE Processes.parent_process_name=spoolsv.exe\n\
    \    AND\n    Processes.process_name!=regsvr32.exe\n  BY Processes.action Processes.dest\
    \ Processes.original_file_name\n     Processes.parent_process Processes.parent_process_exec\
    \ Processes.parent_process_guid\n     Processes.parent_process_id Processes.parent_process_name\
    \ Processes.parent_process_path\n     Processes.process Processes.process_exec\
    \ Processes.process_guid\n     Processes.process_hash Processes.process_id Processes.process_integrity_level\n\
    \     Processes.process_name Processes.process_path Processes.user\n     Processes.user_id\
    \ Processes.vendor_product\n| `drop_dm_object_name(Processes)`\n| `security_content_ctime(firstTime)`\n\
    | `security_content_ctime(lastTime)`\n| `child_processes_of_spoolsv_exe_filter`"
provenance:
  source: splunk/security_content
  source_id: aa0c4aeb-5b18-41c4-8c07-f1442d7599df
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/child_processes_of_spoolsv_exe.yml
notes:
  splunk_status: experimental
  splunk_data_source: []
  quarantine_reason: 'upstream status: experimental'
