id: splunk-security-content-f52d5c0b-d45d-4304-b300-a4f6a1130dec
name: Cisco Configuration Archive Logging Analysis
description: This analytic provides comprehensive monitoring of configuration changes
  on Cisco devices by analyzing archive logs. Configuration archive logging captures
  all changes made to a device's configuration, providing a detailed audit trail that
  can be used to identify suspicious or malicious activities. This detection is particularly
  valuable for identifying patterns of malicious configuration changes that might
  indicate an attacker's presence, such as the creation of backdoor accounts, SNMP
  community string modifications, and TFTP server configurations for data exfiltration.
  By analyzing these logs, security teams can gain a holistic view of configuration
  changes across sessions and users, helping to detect sophisticated attack campaigns
  like those conducted by threat actors such as Static Tundra.
severity: medium
enabled: false
tags:
  mitre:
  - T1562.001
  - T1098
  - T1505.003
  categories:
  - network
references:
- https://blog.talosintelligence.com/static-tundra/
- https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20180328-smi2
- https://www.cisco.com/c/en/us/td/docs/ios-xml/ios/config-mgmt/configuration/15-mt/config-mgmt-15-mt-book/cm-config-logger.html
logsource:
  product: splunk
detection:
  splunk_spl: "| tstats `security_content_summariesonly` count values(All_Changes.command)\
    \ as commands min(_time) as firstTime max(_time) as lastTime FROM datamodel=Change.All_Changes\n\
    \  WHERE (\n        (All_Changes.command=\"*username*privilege 15*\")\n      \
    \  OR\n        (All_Changes.command=\"*username*password*\")\n        OR\n   \
    \     (All_Changes.command=\"*USER TABLE MODIFIED*\")\n        OR\n        (All_Changes.command=\"\
    *tftp-server*\")\n        OR\n        (All_Changes.command=\"*snmp-server community*\"\
    )\n    )\n  BY All_Changes.dvc All_Changes.user\n| `drop_dm_object_name(\"All_Changes\"\
    )`\n| rename dvc as dest\n| `security_content_ctime(firstTime)`\n| `security_content_ctime(lastTime)`\n\
    | `cisco_configuration_archive_logging_analysis_filter`"
provenance:
  source: splunk/security_content
  source_id: f52d5c0b-d45d-4304-b300-a4f6a1130dec
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/network/cisco_configuration_archive_logging_analysis.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
