id: splunk-security-content-7fb15084-b14e-405a-bd61-a6de15a40722
name: Cloud Instance Modified By Previously Unseen User
description: The following analytic identifies cloud instances being modified by users
  who have not previously modified them. It leverages data from the Change data model,
  focusing on successful modifications of EC2 instances. This activity is significant
  because it can indicate unauthorized or suspicious changes by potentially compromised
  or malicious users. If confirmed malicious, this could lead to unauthorized access,
  configuration changes, or potential disruption of cloud services, posing a significant
  risk to the organization's cloud infrastructure.
severity: medium
enabled: false
tags:
  mitre:
  - T1078.004
  categories:
  - cloud
references: []
logsource:
  product: splunk
detection:
  splunk_spl: "| tstats `security_content_summariesonly` count earliest(_time) as\
    \ firstTime, latest(_time) as lastTime values(All_Changes.object_id) as object_id\
    \ values(All_Changes.command) as command FROM datamodel=Change\n  WHERE All_Changes.action=modified\
    \ All_Changes.change_type=EC2 All_Changes.status=success\n  BY All_Changes.user\n\
    | `drop_dm_object_name(\"All_Changes\")`\n| lookup previously_seen_cloud_instance_modifications_by_user\
    \ user as user OUTPUTNEW firstTimeSeen, enough_data\n| eventstats max(enough_data)\
    \ as enough_data\n| where enough_data=1\n| eval firstTimeSeenUser=min(firstTimeSeen)\n\
    | where isnull(firstTimeSeenUser) OR firstTimeSeenUser > relative_time(now(),\
    \ \"-24h@h\")\n| table firstTime user command object_id count\n| `security_content_ctime(firstTime)`\n\
    | `cloud_instance_modified_by_previously_unseen_user_filter`"
provenance:
  source: splunk/security_content
  source_id: 7fb15084-b14e-405a-bd61-a6de15a40722
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/cloud/cloud_instance_modified_by_previously_unseen_user.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
