id: splunk-security-content-fa4089e2-50e3-40f7-8469-d2cc1564ca59
name: Cloud Compute Instance Created In Previously Unused Region
description: The following analytic detects the creation of a cloud compute instance
  in a region that has not been previously used within the last hour. It leverages
  cloud infrastructure logs and compares the regions of newly created instances against
  a lookup file of historically used regions. This activity is significant because
  the creation of instances in new regions can indicate unauthorized or suspicious
  activity, such as an attacker attempting to evade detection or establish a foothold
  in a less monitored area. If confirmed malicious, this could lead to unauthorized
  resource usage, data exfiltration, or further compromise of the cloud environment.
severity: medium
enabled: false
tags:
  mitre:
  - T1535
  categories:
  - cloud
references: []
logsource:
  product: splunk
detection:
  splunk_spl: "| tstats earliest(_time) as firstTime latest(_time) as lastTime values(All_Changes.object_id)\
    \ as dest, count FROM datamodel=Change\n  WHERE All_Changes.action=created\n \
    \ BY All_Changes.vendor_region, All_Changes.user\n| `drop_dm_object_name(\"All_Changes\"\
    )`\n| lookup previously_seen_cloud_regions vendor_region as vendor_region OUTPUTNEW\
    \ firstTimeSeen, enough_data\n| eventstats max(enough_data) as enough_data\n|\
    \ where enough_data=1\n| eval firstTimeSeenRegion=min(firstTimeSeen)\n| where\
    \ isnull(firstTimeSeenRegion) OR firstTimeSeenRegion > relative_time(now(), \"\
    -24h@h\")\n| table firstTime, user, dest, count , vendor_region\n| `security_content_ctime(firstTime)`\n\
    | `cloud_compute_instance_created_in_previously_unused_region_filter`"
provenance:
  source: splunk/security_content
  source_id: fa4089e2-50e3-40f7-8469-d2cc1564ca59
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/cloud/cloud_compute_instance_created_in_previously_unused_region.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
