id: splunk-security-content-c6ddbf53-9715-49f3-bb4c-fb2e8a309cda
name: Cloud Compute Instance Created With Previously Unseen Instance Type
description: 'The following analytic detects the creation of EC2 instances with previously
  unseen instance types.

  It leverages Splunk''s tstats command to analyze data from the Change data model,
  identifying instance types that have not been previously recorded.

  This activity is significant for a SOC because it may indicate unauthorized or suspicious
  activity, such as an attacker attempting to create instances for malicious purposes.

  If confirmed malicious, this could lead to unauthorized access, data exfiltration,
  system compromise, or service disruption. Immediate investigation is required to
  determine the legitimacy of the instance creation.'
severity: medium
enabled: false
tags:
  mitre:
  - T1578.002
  categories:
  - cloud
references: []
logsource:
  product: splunk
detection:
  splunk_spl: "| tstats count earliest(_time) as firstTime\n               latest(_time)\
    \ as lastTime\n               values(All_Changes.object_id) as dest\nFROM datamodel=Change\
    \ WHERE\n\nAll_Changes.action=created\n\nBY All_Changes.Instance_Changes.instance_type\
    \ All_Changes.user\n\n| `drop_dm_object_name(\"All_Changes\")`\n| `drop_dm_object_name(\"\
    Instance_Changes\")`\n| where instance_type != \"unknown\"\n| lookup previously_seen_cloud_compute_instance_types\
    \ instance_type as instance_type OUTPUTNEW firstTimeSeen, enough_data\n| eventstats\
    \ max(enough_data) as enough_data\n| where enough_data=1\n| eval firstTimeSeenInstanceType=min(firstTimeSeen)\n\
    | where isnull(firstTimeSeenInstanceType) OR firstTimeSeenInstanceType > relative_time(now(),\
    \ \"-24h@h\")\n| table firstTime, user, dest, count, instance_type\n| `security_content_ctime(firstTime)`\n\
    | `cloud_compute_instance_created_with_previously_unseen_instance_type_filter`"
provenance:
  source: splunk/security_content
  source_id: c6ddbf53-9715-49f3-bb4c-fb2e8a309cda
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/cloud/cloud_compute_instance_created_with_previously_unseen_instance_type.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
