id: splunk-security-content-d3f7a803-e802-448b-8eb2-e796b223bfff
name: ConnectWise ScreenConnect Authentication Bypass
description: The following analytic detects attempts to exploit the ConnectWise ScreenConnect
  CVE-2024-1709 vulnerability, which allows attackers to bypass authentication via
  an alternate path or channel. It leverages web request logs to identify access to
  the SetupWizard.aspx page, indicating potential exploitation. This activity is significant
  as it can lead to unauthorized administrative access and remote code execution.
  If confirmed malicious, attackers could create administrative users and gain full
  control over the affected system, posing severe security risks. Immediate remediation
  by updating to version 23.9.8 or above is recommended.
severity: medium
enabled: false
tags:
  mitre:
  - T1190
  categories:
  - application
references:
- https://www.huntress.com/blog/a-catastrophe-for-control-understanding-the-screenconnect-authentication-bypass
- https://www.huntress.com/blog/detection-guidance-for-connectwise-cwe-288-2
- https://www.connectwise.com/company/trust/security-bulletins/connectwise-screenconnect-23.9.8
logsource:
  product: splunk
detection:
  splunk_spl: "| tstats count min(_time) as firstTime max(_time) as lastTime FROM\
    \ datamodel=Web\n  WHERE Web.url IN (\"*/SetupWizard.aspx/*\",\"*/SetupWizard/\"\
    ) Web.status=200 Web.http_method=POST\n  BY Web.src, Web.dest, Web.http_user_agent,\n\
    \     Web.url, Web.status, Web.http_method,\n     sourcetype, source\n| rex field=Web.url\
    \ \"/SetupWizard.aspx/(?<randomPath>.+)\"\n| `drop_dm_object_name(\"Web\")`\n\
    | `security_content_ctime(firstTime)`\n| `security_content_ctime(lastTime)`\n\
    | `connectwise_screenconnect_authentication_bypass_filter`"
provenance:
  source: splunk/security_content
  source_id: d3f7a803-e802-448b-8eb2-e796b223bfff
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/web/connectwise_screenconnect_authentication_bypass.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
