id: splunk-security-content-743a322c-9a68-4a0f-9c17-85d9cce2a27c
name: Create or delete windows shares using net exe
description: The following analytic detects the creation or deletion of Windows shares
  using the net.exe command. It leverages Endpoint Detection and Response (EDR) data
  to identify processes involving net.exe with actions related to share management.
  This activity is significant because it may indicate an attacker attempting to manipulate
  network shares for malicious purposes, such as data exfiltration, malware distribution,
  or establishing persistence. If confirmed malicious, this activity could lead to
  unauthorized access to sensitive information, service disruption, or malware introduction.
  Immediate investigation is required to determine the intent and mitigate potential
  threats.
severity: medium
enabled: false
tags:
  mitre:
  - T1070.005
  categories:
  - endpoint
references:
- https://attack.mitre.org/techniques/T1070/005/
logsource:
  product: splunk
detection:
  splunk_spl: "| tstats `security_content_summariesonly` count values(Processes.user)\
    \ as user values(Processes.parent_process) as parent_process min(_time) as firstTime\
    \ max(_time) as lastTime FROM datamodel=Endpoint.Processes\n  WHERE `process_net`\n\
    \  BY Processes.action Processes.dest Processes.original_file_name\n     Processes.parent_process\
    \ Processes.parent_process_exec Processes.parent_process_guid\n     Processes.parent_process_id\
    \ Processes.parent_process_name Processes.parent_process_path\n     Processes.process\
    \ Processes.process_exec Processes.process_guid\n     Processes.process_hash Processes.process_id\
    \ Processes.process_integrity_level\n     Processes.process_name Processes.process_path\
    \ Processes.user\n     Processes.user_id Processes.vendor_product\n| `drop_dm_object_name(Processes)`\n\
    | `security_content_ctime(firstTime)`\n| `security_content_ctime(lastTime)`\n\
    | search process IN (\"*share* /delete*\", \"*share* /REMARK:*\", \"*share* /CACHE:*\"\
    )\n| `create_or_delete_windows_shares_using_net_exe_filter`"
provenance:
  source: splunk/security_content
  source_id: 743a322c-9a68-4a0f-9c17-85d9cce2a27c
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/create_or_delete_windows_shares_using_net_exe.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
