id: splunk-security-content-a7539705-7183-4a12-9b6a-b6eef645a6d7
name: Detect Password Spray Attack Behavior On User
description: The following analytic identifies any user failing to authenticate from
  10 or more unique sources. This behavior could represent an adversary performing
  a Password Spraying attack to obtain initial access or elevate privileges. This
  logic can be used for real time security monitoring as well as threat hunting exercises.
  Environments can be very different depending on the organization. Test and customize
  this detections thresholds as needed
severity: medium
enabled: false
tags:
  mitre:
  - T1110.003
  categories:
  - endpoint
references:
- https://attack.mitre.org/techniques/T1110/003/
- https://www.microsoft.com/en-us/security/blog/2020/04/23/protecting-organization-password-spray-attacks/
- https://github.com/MarkoH17/Spray365
logsource:
  product: splunk
detection:
  splunk_spl: "| tstats `security_content_summariesonly` max(_time) as lastTime, min(_time)\
    \ as firstTime, values(Authentication.user_category) as user_category values(Authentication.src_category)\
    \ as src_category values(Authentication.app) as app count FROM datamodel=Authentication.Authentication\n\
    \  BY Authentication.action Authentication.app Authentication.authentication_method\n\
    \     Authentication.dest Authentication.signature Authentication.signature_id\n\
    \     Authentication.src Authentication.user\n| `drop_dm_object_name(\"Authentication\"\
    )`\n| eval user=case((match(upper(user),\"[a-zA-Z0-9]{3}\")),upper(user),true(),null),\
    \ success=if(action=\"success\",count,0), src=upper(src), success_src=if(action=\"\
    success\",src,null), failure=if(action=\"failure\",count,0), failed_src=if(action=\"\
    failure\",src,null)\n| stats count min(firstTime) as firstTime max(lastTime) as\
    \ lastTime values(app) as app values(src_category) as src_category values(success_src)\
    \ as src values(failed_src) as failed_src dc(success_src) as success_dc dc(failed_src)\
    \ as failed_dc dc(src) as src_dc, sum(failure) as failure, sum(success) as success\n\
    \  BY user\n| fields - _time\n| where src_dc >= 10 AND .25 > (success/failure)\
    \ AND failed_dc > success_dc\n| `security_content_ctime(firstTime)`\n| `security_content_ctime(lastTime)`\n\
    | `detect_password_spray_attack_behavior_on_user_filter`"
provenance:
  source: splunk/security_content
  source_id: a7539705-7183-4a12-9b6a-b6eef645a6d7
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/detect_password_spray_attack_behavior_on_user.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
