id: splunk-security-content-22ac27b4-7189-4a4f-9375-b9017c9620d7
name: Detect RTLO In Process
description: The following analytic identifies the abuse of the right-to-left override
  (RTLO) character (U+202E) in process names. It leverages data from Endpoint Detection
  and Response (EDR) agents, focusing on process execution logs and command-line data.
  This activity is significant because adversaries use the RTLO character to disguise
  malicious files or commands, making them appear benign. If confirmed malicious,
  this technique can allow attackers to execute harmful code undetected, potentially
  leading to unauthorized access, data exfiltration, or further system compromise.
severity: medium
enabled: false
tags:
  mitre:
  - T1036.002
  categories:
  - endpoint
references:
- https://attack.mitre.org/techniques/T1036/002/
- https://resources.infosecinstitute.com/topic/spoof-using-right-to-left-override-rtlo-technique-2/
- https://www.trendmicro.com/en_us/research/17/f/following-trail-blacktech-cyber-espionage-campaigns.html
logsource:
  product: splunk
detection:
  splunk_spl: '| tstats `security_content_summariesonly` count min(_time) as firstTime
    max(_time) as lastTime from datamodel=Endpoint.Processes where Processes.process!=unknown
    AND Processes.action=allowed by Processes.action Processes.dest Processes.original_file_name
    Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
    Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
    Processes.process Processes.process_exec Processes.process_guid Processes.process_hash
    Processes.process_id Processes.process_integrity_level Processes.process_name
    Processes.process_path Processes.user Processes.user_id Processes.vendor_product
    | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `drop_dm_object_name(Processes)`
    | regex process="\\x{202E}" | rex field=process "(?<RTLO_command_1>.+)(?<RTLO_exist_process>\\x{202E})(?<RTLO_command_2>.+)"
    | eval process_with_RTLO=process | eval process=RTLO_command_1.RTLO_command_2
    | fields - RTLO* | `detect_rtlo_in_process_filter`'
provenance:
  source: splunk/security_content
  source_id: 22ac27b4-7189-4a4f-9375-b9017c9620d7
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/detect_rtlo_in_process.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
