id: splunk-security-content-cc590c66-f65f-48f2-986a-4797244762f8
name: Detect Software Download To Network Device
description: The following analytic identifies unauthorized software downloads to
  network devices via TFTP, FTP, or SSH/SCP. It detects this activity by analyzing
  network traffic events on specific ports (69, 21, 22) from devices categorized as
  network, router, or switch. This activity is significant because adversaries may
  exploit netbooting to load unauthorized operating systems, potentially compromising
  network integrity. If confirmed malicious, this could lead to unauthorized control
  over network devices, enabling further attacks, data exfiltration, or persistent
  access within the network.
severity: medium
enabled: false
tags:
  mitre:
  - T1542.005
  categories:
  - network
references: []
logsource:
  product: splunk
detection:
  splunk_spl: "| tstats `security_content_summariesonly` count min(_time) as firstTime\
    \ max(_time) as lastTime FROM datamodel=Network_Traffic\n  WHERE (\n        All_Traffic.transport=udp\n\
    \        AND\n        All_Traffic.dest_port=69\n    )\n    OR (All_Traffic.transport=tcp\
    \ AND All_Traffic.dest_port=21) OR (All_Traffic.transport=tcp AND All_Traffic.dest_port=22)\
    \ AND All_Traffic.dest_category!=common_software_repo_destination AND All_Traffic.src_category=network\
    \ OR All_Traffic.src_category=router OR All_Traffic.src_category=switch\n  BY\
    \ All_Traffic.src All_Traffic.dest All_Traffic.dest_port\n| `drop_dm_object_name(\"\
    All_Traffic\")`\n| `security_content_ctime(firstTime)`\n| `security_content_ctime(lastTime)`\n\
    | `detect_software_download_to_network_device_filter`"
provenance:
  source: splunk/security_content
  source_id: cc590c66-f65f-48f2-986a-4797244762f8
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/network/detect_software_download_to_network_device.yml
notes:
  splunk_status: experimental
  splunk_data_source: []
  quarantine_reason: 'upstream status: experimental'
