id: splunk-security-content-cbef820c-e1ff-407f-887f-0a9240a2d477
name: Detect Path Interception By Creation Of program exe
description: The following analytic identifies the creation of a program executable
  in an unquoted service path, a common technique for privilege escalation. It leverages
  data from Endpoint Detection and Response (EDR) agents, focusing on process creation
  events where the parent process is 'services.exe'. This activity is significant
  because unquoted service paths can be exploited by attackers to execute arbitrary
  code with elevated privileges. If confirmed malicious, this could allow an attacker
  to gain higher-level access, potentially leading to full system compromise and persistent
  control over the affected endpoint.
severity: medium
enabled: false
tags:
  mitre:
  - T1574.009
  categories:
  - endpoint
references:
- https://medium.com/@SumitVerma101/windows-privilege-escalation-part-1-unquoted-service-path-c7a011a8d8ae
logsource:
  product: splunk
detection:
  splunk_spl: '| tstats `security_content_summariesonly` count min(_time) as firstTime
    max(_time) as lastTime from datamodel=Endpoint.Processes where Processes.parent_process_name=services.exe
    by Processes.action Processes.dest Processes.original_file_name Processes.parent_process
    Processes.parent_process_exec Processes.parent_process_guid Processes.parent_process_id
    Processes.parent_process_name Processes.parent_process_path Processes.process
    Processes.process_exec Processes.process_guid Processes.process_hash Processes.process_id
    Processes.process_integrity_level Processes.process_name Processes.process_path
    Processes.user Processes.user_id Processes.vendor_product | `drop_dm_object_name(Processes)`
    | rex field=process "^.*?\\\\(?<service_process>[^\\\\]*\.(?:exe|bat|com|ps1))"
    | eval process_name = lower(process_name) | eval service_process = lower(service_process)
    | where process_name != service_process | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)` | `detect_path_interception_by_creation_of_program_exe_filter`'
provenance:
  source: splunk/security_content
  source_id: cbef820c-e1ff-407f-887f-0a9240a2d477
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/detect_path_interception_by_creation_of_program_exe.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
