id: splunk-security-content-9296f515-073c-43a5-88ec-eda5a4626654
name: Detect Remote Access Software Usage URL
description: 'The following analytic detects the execution of known remote access
  software within the environment.

  It leverages network logs mapped to the Web data model, identifying specific URLs
  and user agents associated with remote access tools like AnyDesk, GoToMyPC, LogMeIn,
  and TeamViewer.

  This activity is significant as adversaries often use these utilities to maintain
  unauthorized remote access. If confirmed malicious, this could allow attackers to
  control systems remotely, exfiltrate data, or further compromise the network, posing
  a severe security risk.'
severity: medium
enabled: false
tags:
  mitre:
  - T1219
  categories:
  - application
references:
- https://attack.mitre.org/techniques/T1219/
- https://thedfirreport.com/2022/08/08/bumblebee-roasts-its-way-to-domain-admin/
- https://thedfirreport.com/2022/11/28/emotet-strikes-again-lnk-file-leads-to-domain-wide-ransomware/
logsource:
  product: splunk
detection:
  splunk_spl: "| tstats `security_content_summariesonly`\n         count min(_time)\
    \ as firstTime\n               max(_time) as lastTime\n               latest(Web.http_method)\
    \ as http_method\n               latest(Web.http_user_agent) as http_user_agent\n\
    \               latest(Web.url) as url\n               latest(Web.user) as user\n\
    \               latest(Web.dest) as dest\n\nfrom datamodel=Web where\n\nWeb.url_domain=*\n\
    NOT Web.url_domain IN (\n    \"-\",\n    \"unknown\"\n)\nby Web.action Web.src\
    \ Web.category\n   Web.url_domain Web.url_length\n\n| `security_content_ctime(firstTime)`\n\
    | `security_content_ctime(lastTime)`\n| `drop_dm_object_name(\"Web\")`\n| lookup\
    \ remote_access_software remote_domain AS url_domain OUTPUT isutility, description\
    \ as signature, comment_reference\nas desc, category\n| search isutility = True\n\
    | `remote_access_software_usage_exceptions`\n| `detect_remote_access_software_usage_url_filter`"
provenance:
  source: splunk/security_content
  source_id: 9296f515-073c-43a5-88ec-eda5a4626654
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/web/detect_remote_access_software_usage_url.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
