id: splunk-security-content-67bd3def-c41c-4bf6-837b-ae196b4257c6
name: Detect AWS Console Login by User from New Country
description: The following analytic identifies AWS console login events by users from
  a new country. It leverages AWS CloudTrail events and compares them against a lookup
  file of previously seen users and their login locations. This activity is significant
  because logins from new countries can indicate potential unauthorized access or
  compromised accounts. If confirmed malicious, this could lead to unauthorized access
  to AWS resources, data exfiltration, or further exploitation within the AWS environment.
severity: medium
enabled: false
tags:
  mitre:
  - T1535
  - T1586.003
  categories:
  - cloud
references: []
logsource:
  product: splunk
detection:
  splunk_spl: "| tstats earliest(_time) as firstTime latest(_time) as lastTime FROM\
    \ datamodel=Authentication\n  WHERE Authentication.signature=ConsoleLogin\n  BY\
    \ Authentication.user Authentication.src\n| iplocation Authentication.src\n| `drop_dm_object_name(Authentication)`\n\
    | rename Country as justSeenCountry\n| table firstTime lastTime user justSeenCountry\n\
    | join user type=outer [\n| inputlookup previously_seen_users_console_logins\n\
    | rename Country as previouslySeenCountry\n| stats min(firstTime) AS earliestseen\n\
    \  BY user previouslySeenCountry\n| fields earliestseen user previouslySeenCountry]\n\
    | eval userCountry=if(firstTime >= relative_time(now(), \"-24h@h\"), \"New Country\"\
    ,\"Previously Seen Country\")\n| where userCountry = \"New Country\"\n| `security_content_ctime(firstTime)`\n\
    | `security_content_ctime(lastTime)`\n| table firstTime lastTime user previouslySeenCountry\
    \ justSeenCountry userCountry\n| `detect_aws_console_login_by_user_from_new_country_filter`"
provenance:
  source: splunk/security_content
  source_id: 67bd3def-c41c-4bf6-837b-ae196b4257c6
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/cloud/detect_aws_console_login_by_user_from_new_country.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
