id: splunk-security-content-ccad96d7-a48c-4f13-8b9c-9f6a31cba454
name: Detect Remote Access Software Usage FileInfo
description: The following analytic detects the execution of processes with file or
  code signing attributes from known remote access software within the environment.
  It leverages Sysmon EventCode 1 data and cross-references a lookup table of remote
  access utilities such as AnyDesk, GoToMyPC, LogMeIn, and TeamViewer. This activity
  is significant as adversaries often use these tools to maintain unauthorized remote
  access. If confirmed malicious, this could allow attackers to persist in the environment,
  potentially leading to data exfiltration or further compromise of the network.
severity: medium
enabled: false
tags:
  mitre:
  - T1219
  categories:
  - endpoint
references:
- https://attack.mitre.org/techniques/T1219/
- https://thedfirreport.com/2022/08/08/bumblebee-roasts-its-way-to-domain-admin/
- https://thedfirreport.com/2022/11/28/emotet-strikes-again-lnk-file-leads-to-domain-wide-ransomware/
logsource:
  product: splunk
detection:
  splunk_spl: "`sysmon` EventCode=1\n  | stats count min(_time) as firstTime max(_time)\
    \ as lastTime, values(Company) as Company values(Product) as Product\n    BY action\
    \ dest original_file_name\n       parent_process parent_process_exec parent_process_guid\n\
    \       parent_process_id parent_process_name parent_process_path\n       process\
    \ process_exec process_guid\n       process_hash process_id process_integrity_level\n\
    \       process_name process_path user\n       user_id vendor_product\n  | lookup\
    \ remote_access_software remote_utility_fileinfo AS Product OUTPUT isutility,\
    \ description as signature, comment_reference as desc, category\n  | search isutility\
    \ = True\n  | `remote_access_software_usage_exceptions`\n  | `detect_remote_access_software_usage_fileinfo_filter`"
provenance:
  source: splunk/security_content
  source_id: ccad96d7-a48c-4f13-8b9c-9f6a31cba454
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/detect_remote_access_software_usage_fileinfo.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
