id: splunk-security-content-42b3b753-5925-49c5-9742-36fa40a73990
name: Detect Traffic Mirroring
description: The following analytic detects the initiation of traffic mirroring sessions
  on Cisco network devices. It leverages logs with specific mnemonics and facilities
  related to traffic mirroring, such as "ETH_SPAN_SESSION_UP" and "PKTCAP_START."
  This activity is significant because adversaries may use traffic mirroring to exfiltrate
  data by duplicating and forwarding network traffic to an external destination. If
  confirmed malicious, this could allow attackers to capture sensitive information,
  monitor network communications, and potentially compromise the integrity and confidentiality
  of the network.
severity: medium
enabled: false
tags:
  mitre:
  - T1020.001
  - T1200
  - T1498
  categories:
  - network
references: []
logsource:
  product: splunk
detection:
  splunk_spl: "`cisco_networks` (facility=\"MIRROR\" mnemonic=\"ETH_SPAN_SESSION_UP\"\
    ) OR (facility=\"SPAN\" mnemonic=\"SESSION_UP\") OR (facility=\"SPAN\" mnemonic=\"\
    PKTCAP_START\") OR (mnemonic=\"CFGLOG_LOGGEDCMD\" command=\"monitor session*\"\
    )\n  | stats min(_time) AS firstTime max(_time) AS lastTime count\n    BY host\
    \ facility mnemonic\n  | `security_content_ctime(firstTime)`\n  | `security_content_ctime(lastTime)`\n\
    \  | `detect_traffic_mirroring_filter`"
provenance:
  source: splunk/security_content
  source_id: 42b3b753-5925-49c5-9742-36fa40a73990
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/network/detect_traffic_mirroring.yml
notes:
  splunk_status: experimental
  splunk_data_source: []
  quarantine_reason: 'upstream status: experimental'
