id: splunk-security-content-2c365e57-4414-4540-8dc0-73ab10729996
name: Detect Credential Dumping through LSASS access
description: The following analytic detects attempts to read LSASS memory, indicative
  of credential dumping. It leverages Sysmon EventCode 10, filtering for specific
  access permissions (0x1010 and 0x1410) on the lsass.exe process. This activity is
  significant because it suggests an attacker is trying to extract credentials from
  LSASS memory, potentially leading to unauthorized access, data breaches, and compromise
  of sensitive information. If confirmed malicious, this could enable attackers to
  escalate privileges, move laterally within the network, or exfiltrate data. Extensive
  triage is necessary to differentiate between malicious and benign activities.
severity: medium
enabled: false
tags:
  mitre:
  - T1003.001
  categories:
  - endpoint
references: []
logsource:
  product: splunk
detection:
  splunk_spl: "`sysmon` EventCode=10 TargetImage=*lsass.exe (GrantedAccess=0x1010\
    \ OR GrantedAccess=0x1410)\n  | stats count min(_time) as firstTime max(_time)\
    \ as lastTime\n    BY CallTrace EventID GrantedAccess\n       Guid Opcode ProcessID\n\
    \       SecurityID SourceImage SourceProcessGUID\n       SourceProcessId TargetImage\
    \ TargetProcessGUID\n       TargetProcessId UserID dest\n       granted_access\
    \ parent_process_exec parent_process_guid\n       parent_process_id parent_process_name\
    \ parent_process_path\n       process_exec process_guid process_id\n       process_name\
    \ process_path signature\n       signature_id user_id vendor_product\n  | `security_content_ctime(firstTime)`\n\
    \  | `security_content_ctime(lastTime)`\n  | `detect_credential_dumping_through_lsass_access_filter`"
provenance:
  source: splunk/security_content
  source_id: 2c365e57-4414-4540-8dc0-73ab10729996
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/detect_credential_dumping_through_lsass_access.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
