id: splunk-security-content-1bed7774-304a-4e8f-9d72-d80e45ff492b
name: Detect Outbound SMB Traffic
description: The following analytic detects outbound SMB (Server Message Block) connections
  from internal hosts to external servers. It identifies this activity by monitoring
  network traffic for SMB requests directed towards the Internet, which are unusual
  for standard operations. This detection is significant for a SOC as it can indicate
  an attacker's attempt to retrieve credential hashes through compromised servers,
  a key step in lateral movement and privilege escalation. If confirmed malicious,
  this activity could lead to unauthorized access to sensitive data and potential
  full system compromise.
severity: medium
enabled: false
tags:
  mitre:
  - T1071.002
  categories:
  - network
references: []
logsource:
  product: splunk
detection:
  splunk_spl: "| tstats `security_content_summariesonly`\nearliest(_time) as start_time\n\
    latest(_time) as end_time\nvalues(All_Traffic.action) as action\nvalues(All_Traffic.app)\
    \ as app\nvalues(sourcetype) as sourcetype count\nfrom datamodel=Network_Traffic\
    \ where\n  All_Traffic.action IN (\"allowed\", \"allow\")\nAND (All_Traffic.dest_port=139\
    \ OR All_Traffic.dest_port=445 OR All_Traffic.app=\"smb\")\nAND (All_Traffic.src_ip\
    \ IN `non_public_ip_blocks` OR All_Traffic.src IN `non_public_ip_blocks`)\nAND\
    \ NOT (All_Traffic.dest_ip IN `non_public_ip_blocks` OR All_Traffic.dest IN `non_public_ip_blocks`)\n\
    by All_Traffic.action All_Traffic.app All_Traffic.bytes All_Traffic.bytes_in All_Traffic.bytes_out\n\
    All_Traffic.dest All_Traffic.dest_ip All_Traffic.dest_port All_Traffic.dvc All_Traffic.protocol\n\
    All_Traffic.protocol_version All_Traffic.src All_Traffic.src_ip All_Traffic.src_port\n\
    All_Traffic.transport All_Traffic.user All_Traffic.vendor_product All_Traffic.rule\n\
    | `drop_dm_object_name(\"All_Traffic\")`\n| `security_content_ctime(start_time)`\n\
    | `security_content_ctime(end_time)`\n| rename dest as dest_ip\n| rename src as\
    \ src_ip\n| iplocation dest_ip\n| `detect_outbound_smb_traffic_filter`"
provenance:
  source: splunk/security_content
  source_id: 1bed7774-304a-4e8f-9d72-d80e45ff492b
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/network/detect_outbound_smb_traffic.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
