id: splunk-security-content-3d8d201c-aa03-422d-b0ee-2e5ecf9718c0
name: Detection of tools built by NirSoft
description: The following analytic identifies the execution of tools built by NirSoft
  by detecting specific command-line arguments such as "/stext" and "/scomma". It
  leverages data from Endpoint Detection and Response (EDR) agents, focusing on process
  names, parent processes, and command-line executions. This activity is significant
  because NirSoft tools, while legitimate, can be exploited by attackers for malicious
  purposes such as credential theft or system reconnaissance. If confirmed malicious,
  this activity could lead to unauthorized access, data exfiltration, or further compromise
  of the affected system.
severity: medium
enabled: false
tags:
  mitre:
  - T1072
  categories:
  - endpoint
references: []
logsource:
  product: splunk
detection:
  splunk_spl: "| tstats `security_content_summariesonly` count min(_time) values(Processes.process)\
    \ as process max(_time) as lastTime FROM datamodel=Endpoint.Processes\n  WHERE\
    \ (\n        Processes.process=\"* /stext *\"\n        OR\n        Processes.process=\"\
    * /scomma *\"\n    )\n  BY Processes.action Processes.dest Processes.original_file_name\n\
    \     Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid\n\
    \     Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path\n\
    \     Processes.process Processes.process_exec Processes.process_guid\n     Processes.process_hash\
    \ Processes.process_id Processes.process_integrity_level\n     Processes.process_name\
    \ Processes.process_path Processes.user\n     Processes.user_id Processes.vendor_product\n\
    | `drop_dm_object_name(Processes)`\n| `security_content_ctime(firstTime)`\n| `security_content_ctime(lastTime)`\n\
    | `detection_of_tools_built_by_nirsoft_filter`"
provenance:
  source: splunk/security_content
  source_id: 3d8d201c-aa03-422d-b0ee-2e5ecf9718c0
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/detection_of_tools_built_by_nirsoft.yml
notes:
  splunk_status: experimental
  splunk_data_source: []
  quarantine_reason: 'upstream status: experimental'
