id: splunk-security-content-885ea672-07ee-475a-879e-60d28aa5dd42
name: Detect Remote Access Software Usage Traffic
description: 'The following analytic detects network traffic associated with known
  remote access software applications, such as AnyDesk, GoToMyPC, LogMeIn, and TeamViewer.

  It leverages Palo Alto traffic logs mapped to the Network_Traffic data model in
  Splunk. This activity is significant because adversaries often use remote access
  tools to maintain unauthorized access to compromised environments.

  If confirmed malicious, this activity could allow attackers to control systems remotely,
  exfiltrate data, or deploy additional malware, posing a severe threat to the organization''s
  security.'
severity: medium
enabled: false
tags:
  mitre:
  - T1219
  categories:
  - network
references:
- https://attack.mitre.org/techniques/T1219/
- https://thedfirreport.com/2022/08/08/bumblebee-roasts-its-way-to-domain-admin/
- https://thedfirreport.com/2022/11/28/emotet-strikes-again-lnk-file-leads-to-domain-wide-ransomware/
- https://applipedia.paloaltonetworks.com/
logsource:
  product: splunk
detection:
  splunk_spl: "| tstats `security_content_summariesonly`\n  count min(_time) as firstTime\n\
    \        max(_time) as lastTime\n        values(All_Traffic.dest_port) as dest_port\n\
    \        latest(All_Traffic.user) as user\nfrom datamodel=Network_Traffic where\n\
    All_Traffic.app=*\nNOT All_Traffic.app IN (\"-\", \"unknown\")\nby All_Traffic.action\
    \ All_Traffic.app All_Traffic.bytes All_Traffic.bytes_in\n   All_Traffic.bytes_out\
    \ All_Traffic.dest All_Traffic.dest_ip\n   All_Traffic.dest_port All_Traffic.dvc\
    \ All_Traffic.protocol\n   All_Traffic.protocol_version All_Traffic.src All_Traffic.src_ip\n\
    \   All_Traffic.src_port All_Traffic.transport All_Traffic.user\n   All_Traffic.vendor_product\n\
    | `drop_dm_object_name(\"All_Traffic\")`\n| `security_content_ctime(firstTime)`\n\
    | `security_content_ctime(lastTime)`\n| lookup remote_access_software remote_appid\
    \ AS app OUTPUT isutility, description as signature, comment_reference as desc,\
    \ category\n| search isutility = True\n| `remote_access_software_usage_exceptions`\n\
    | `detect_remote_access_software_usage_traffic_filter`"
provenance:
  source: splunk/security_content
  source_id: 885ea672-07ee-475a-879e-60d28aa5dd42
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/network/detect_remote_access_software_usage_traffic.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
