id: splunk-security-content-2dd719ac-3021-11ec-97b4-acde48001122
name: Disable Defender BlockAtFirstSeen Feature
description: The following analytic detects the modification of the Windows registry
  to disable the Windows Defender BlockAtFirstSeen feature. It leverages data from
  the Endpoint.Registry data model, specifically monitoring changes to the registry
  path associated with Windows Defender SpyNet and the DisableBlockAtFirstSeen value.
  This activity is significant because disabling this feature can allow malicious
  files to bypass initial detection by Windows Defender, increasing the risk of malware
  infection. If confirmed malicious, this action could enable attackers to execute
  malicious code undetected, leading to potential system compromise and data breaches.
severity: medium
enabled: false
tags:
  mitre:
  - T1562.001
  categories:
  - endpoint
references:
- https://thedfirreport.com/2021/10/18/icedid-to-xinglocker-ransomware-in-24-hours/
logsource:
  product: splunk
detection:
  splunk_spl: '| tstats `security_content_summariesonly` count min(_time) as firstTime
    max(_time) as lastTime FROM datamodel=Endpoint.Registry WHERE (Registry.registry_path
    = "*\\Microsoft\\Windows Defender\\SpyNet*" Registry.registry_value_name = DisableBlockAtFirstSeen
    Registry.registry_value_data = 0x00000001) by Registry.action Registry.dest Registry.process_guid
    Registry.process_id Registry.registry_hive Registry.registry_path Registry.registry_key_name
    Registry.registry_value_data Registry.registry_value_name Registry.registry_value_type
    Registry.status Registry.user Registry.vendor_product | `drop_dm_object_name(Registry)`
    | where isnotnull(registry_value_data) | `security_content_ctime(firstTime)` |
    `security_content_ctime(lastTime)` | `disable_defender_blockatfirstseen_feature_filter`'
provenance:
  source: splunk/security_content
  source_id: 2dd719ac-3021-11ec-97b4-acde48001122
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/disable_defender_blockatfirstseen_feature.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
