id: splunk-security-content-73922ff8-3022-11ec-bf5e-acde48001122
name: Disable Defender Submit Samples Consent Feature
description: The following analytic detects the modification of the Windows registry
  to disable the Windows Defender Submit Samples Consent feature. It leverages data
  from the Endpoint.Registry data model, specifically monitoring changes to the registry
  path associated with Windows Defender SpyNet and the SubmitSamplesConsent value
  set to 0x00000000. This activity is significant as it indicates an attempt to bypass
  or evade detection by preventing Windows Defender from submitting samples for further
  analysis. If confirmed malicious, this could allow an attacker to execute malicious
  code without being detected by Windows Defender, leading to potential system compromise.
severity: medium
enabled: false
tags:
  mitre:
  - T1562.001
  categories:
  - endpoint
references:
- https://thedfirreport.com/2021/10/18/icedid-to-xinglocker-ransomware-in-24-hours/
logsource:
  product: splunk
detection:
  splunk_spl: '| tstats `security_content_summariesonly` count min(_time) as firstTime
    max(_time) as lastTime FROM datamodel=Endpoint.Registry WHERE (Registry.registry_path
    = "*\\Microsoft\\Windows Defender\\SpyNet*" Registry.registry_value_name = SubmitSamplesConsent
    Registry.registry_value_data = 0x00000000) by Registry.action Registry.dest Registry.process_guid
    Registry.process_id Registry.registry_hive Registry.registry_path Registry.registry_key_name
    Registry.registry_value_data Registry.registry_value_name Registry.registry_value_type
    Registry.status Registry.user Registry.vendor_product | `drop_dm_object_name(Registry)`
    | where isnotnull(registry_value_data) | `security_content_ctime(firstTime)` |
    `security_content_ctime(lastTime)` | `disable_defender_submit_samples_consent_feature_filter`'
provenance:
  source: splunk/security_content
  source_id: 73922ff8-3022-11ec-bf5e-acde48001122
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/disable_defender_submit_samples_consent_feature.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
