id: splunk-security-content-898debf4-3021-11ec-ba7c-acde48001122
name: Disable Defender Spynet Reporting
description: The following analytic detects the modification of the registry to disable
  Windows Defender SpyNet reporting. It leverages data from the Endpoint.Registry
  data model, specifically monitoring changes to the registry path associated with
  Windows Defender SpyNet settings. This activity is significant because disabling
  SpyNet reporting can prevent Windows Defender from sending telemetry data, potentially
  allowing malicious activities to go undetected. If confirmed malicious, this action
  could enable an attacker to evade detection, maintain persistence, and carry out
  further attacks without being flagged by Windows Defender.
severity: medium
enabled: false
tags:
  mitre:
  - T1562.001
  categories:
  - endpoint
references:
- https://thedfirreport.com/2021/10/18/icedid-to-xinglocker-ransomware-in-24-hours/
logsource:
  product: splunk
detection:
  splunk_spl: '| tstats `security_content_summariesonly` count min(_time) as firstTime
    max(_time) as lastTime FROM datamodel=Endpoint.Registry WHERE (Registry.registry_path
    = "*\\Microsoft\\Windows Defender\\SpyNet*" Registry.registry_value_name = SpynetReporting
    Registry.registry_value_data = 0x00000000) by Registry.action Registry.dest Registry.process_guid
    Registry.process_id Registry.registry_hive Registry.registry_path Registry.registry_key_name
    Registry.registry_value_data Registry.registry_value_name Registry.registry_value_type
    Registry.status Registry.user Registry.vendor_product | `drop_dm_object_name(Registry)`
    | where isnotnull(registry_value_data) | `security_content_ctime(firstTime)` |
    `security_content_ctime(lastTime)` | `disable_defender_spynet_reporting_filter`'
provenance:
  source: splunk/security_content
  source_id: 898debf4-3021-11ec-ba7c-acde48001122
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/disable_defender_spynet_reporting.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
