id: splunk-security-content-83776de4-921a-11eb-868a-acde48001122
name: Disabling FolderOptions Windows Feature
description: The following analytic detects the modification of the Windows registry
  to disable the Folder Options feature, which prevents users from showing hidden
  files and file extensions. It leverages data from the Endpoint.Registry data model,
  specifically monitoring changes to the registry path "*\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Policies\\Explorer\\NoFolderOptions"
  with a value of "0x00000001". This activity is significant as it is commonly used
  by malware to conceal malicious files and deceive users with fake file extensions.
  If confirmed malicious, this could allow an attacker to hide their presence and
  malicious files, making detection and remediation more difficult.
severity: medium
enabled: false
tags:
  mitre:
  - T1562.001
  categories:
  - endpoint
references:
- https://any.run/report/ea4ea08407d4ee72e009103a3b77e5a09412b722fdef67315ea63f22011152af/a866d7b1-c236-4f26-a391-5ae32213dfc4#registry
logsource:
  product: splunk
detection:
  splunk_spl: '| tstats `security_content_summariesonly` count min(_time) as firstTime
    max(_time) as lastTime FROM datamodel=Endpoint.Registry WHERE (Registry.registry_path=
    "*\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Policies\\Explorer\\NoFolderOptions"
    Registry.registry_value_data = "0x00000001") by Registry.action Registry.dest
    Registry.process_guid Registry.process_id Registry.registry_hive Registry.registry_path
    Registry.registry_key_name Registry.registry_value_data Registry.registry_value_name
    Registry.registry_value_type Registry.status Registry.user Registry.vendor_product
    | `drop_dm_object_name(Registry)`| where isnotnull(registry_value_data) | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)` | `disabling_folderoptions_windows_feature_filter`'
provenance:
  source: splunk/security_content
  source_id: 83776de4-921a-11eb-868a-acde48001122
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/disabling_folderoptions_windows_feature.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
