id: splunk-security-content-7f5fb3e1-4209-4914-90db-0ec21b556378
name: Email servers sending high volume traffic to hosts
description: The following analytic identifies a significant increase in data transfers
  from your email server to client hosts. It leverages the Network_Traffic data model
  to monitor outbound traffic from email servers, using statistical analysis to detect
  anomalies based on average and standard deviation metrics. This activity is significant
  as it may indicate a malicious actor exfiltrating data via your email server. If
  confirmed malicious, this could lead to unauthorized data access and potential data
  breaches, compromising sensitive information and impacting organizational security.
severity: medium
enabled: false
tags:
  mitre:
  - T1114.002
  categories:
  - application
references: []
logsource:
  product: splunk
detection:
  splunk_spl: "| tstats `security_content_summariesonly` sum(All_Traffic.bytes_out)\
    \ as bytes_out FROM datamodel=Network_Traffic\n  WHERE All_Traffic.src_category=email_server\n\
    \  BY All_Traffic.dest_ip _time span=1d\n| `drop_dm_object_name(\"All_Traffic\"\
    )`\n| eventstats avg(bytes_out) as avg_bytes_out stdev(bytes_out) as stdev_bytes_out\n\
    | eventstats count as num_data_samples avg(eval(if(_time < relative_time(now(),\
    \ \"@d\"), bytes_out, null))) as per_source_avg_bytes_out stdev(eval(if(_time\
    \ < relative_time(now(), \"@d\"), bytes_out, null))) as per_source_stdev_bytes_out\n\
    \  BY dest_ip\n| eval minimum_data_samples = 4, deviation_threshold = 3\n| where\
    \ num_data_samples >= minimum_data_samples AND bytes_out > (avg_bytes_out + (deviation_threshold\
    \ * stdev_bytes_out)) AND bytes_out > (per_source_avg_bytes_out + (deviation_threshold\
    \ * per_source_stdev_bytes_out)) AND _time >= relative_time(now(), \"@d\")\n|\
    \ eval num_standard_deviations_away_from_server_average = round(abs(bytes_out\
    \ - avg_bytes_out) / stdev_bytes_out, 2), num_standard_deviations_away_from_client_average\
    \ = round(abs(bytes_out - per_source_avg_bytes_out) / per_source_stdev_bytes_out,\
    \ 2)\n| table dest_ip, _time, bytes_out, avg_bytes_out, per_source_avg_bytes_out,\
    \ num_standard_deviations_away_from_server_average, num_standard_deviations_away_from_client_average\n\
    | `email_servers_sending_high_volume_traffic_to_hosts_filter`"
provenance:
  source: splunk/security_content
  source_id: 7f5fb3e1-4209-4914-90db-0ec21b556378
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/application/email_servers_sending_high_volume_traffic_to_hosts.yml
notes:
  splunk_status: experimental
  splunk_data_source: []
  quarantine_reason: 'upstream status: experimental'
