id: splunk-security-content-0c7d8ffe-25b1-11ec-9f39-acde48001122
name: Enable WDigest UseLogonCredential Registry
description: The following analytic detects a suspicious registry modification that
  enables the plain text credential feature in Windows by setting the "UseLogonCredential"
  value to 1 in the WDigest registry path. This detection leverages data from the
  Endpoint.Registry data model, focusing on specific registry paths and values. This
  activity is significant because it is commonly used by malware and tools like Mimikatz
  to dump plain text credentials, indicating a potential credential dumping attempt.
  If confirmed malicious, this could allow an attacker to obtain sensitive credentials,
  leading to further compromise and lateral movement within the network.
severity: medium
enabled: false
tags:
  mitre:
  - T1112
  - T1003
  categories:
  - endpoint
references:
- https://www.csoonline.com/article/3438824/how-to-detect-and-halt-credential-theft-via-windows-wdigest.html
logsource:
  product: splunk
detection:
  splunk_spl: '| tstats `security_content_summariesonly` count min(_time) as firstTime
    max(_time) as lastTime FROM datamodel=Endpoint.Registry WHERE (Registry.registry_path="*\\System\\CurrentControlSet\\Control\\SecurityProviders\\WDigest\\*"
    Registry.registry_value_name = "UseLogonCredential" Registry.registry_value_data=0x00000001)
    by Registry.action Registry.dest Registry.process_guid Registry.process_id Registry.registry_hive
    Registry.registry_path Registry.registry_key_name Registry.registry_value_data
    Registry.registry_value_name Registry.registry_value_type Registry.status Registry.user
    Registry.vendor_product | `drop_dm_object_name(Registry)` | where isnotnull(registry_value_data)
    | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `enable_wdigest_uselogoncredential_registry_filter`'
provenance:
  source: splunk/security_content
  source_id: 0c7d8ffe-25b1-11ec-9f39-acde48001122
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/enable_wdigest_uselogoncredential_registry.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
