id: splunk-security-content-99495452-b899-11eb-96dc-acde48001122
name: Enable RDP In Other Port Number
description: The following analytic detects modifications to the registry that enable
  RDP on a machine using a non-default port number. It leverages data from the Endpoint.Registry
  data model, specifically monitoring changes to the registry path "HKLM\SYSTEM\CurrentControlSet\Control\Terminal
  Server\WinStations\RDP-Tcp" and the "PortNumber" value. This activity is significant
  as attackers often modify RDP settings to facilitate lateral movement and maintain
  remote access to compromised systems. If confirmed malicious, this could allow attackers
  to bypass network defenses, gain persistent access, and potentially control the
  compromised machine.
severity: medium
enabled: false
tags:
  mitre:
  - T1021
  categories:
  - endpoint
references:
- https://www.mvps.net/docs/how-to-secure-remote-desktop-rdp/
logsource:
  product: splunk
detection:
  splunk_spl: '| tstats `security_content_summariesonly` count min(_time) as firstTime
    max(_time) as lastTime FROM datamodel=Endpoint.Registry WHERE (Registry.registry_path="*\\CurrentControlSet\\Control\\Terminal
    Server\\WinStations\\RDP-Tcp*" Registry.registry_value_name = "PortNumber") by
    Registry.action Registry.dest Registry.process_guid Registry.process_id Registry.registry_hive
    Registry.registry_path Registry.registry_key_name Registry.registry_value_data
    Registry.registry_value_name Registry.registry_value_type Registry.status Registry.user
    Registry.vendor_product | `drop_dm_object_name(Registry)` | where isnotnull(registry_value_data)
    | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `enable_rdp_in_other_port_number_filter`'
provenance:
  source: splunk/security_content
  source_id: 99495452-b899-11eb-96dc-acde48001122
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/enable_rdp_in_other_port_number.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
