id: splunk-security-content-7eb9c3d5-c98c-4088-acc5-8240bad15379
name: GetCurrent User with PowerShell
description: The following analytic detects the execution of `powershell.exe` with
  command-line arguments invoking the `GetCurrent` method of the WindowsIdentity .NET
  class. This detection leverages data from Endpoint Detection and Response (EDR)
  agents, focusing on process names and command-line executions. This activity is
  significant as adversaries may use this method to identify the logged-in user on
  a compromised endpoint, aiding in situational awareness and Active Directory discovery.
  If confirmed malicious, this could allow attackers to gain insights into user context,
  potentially facilitating further exploitation and lateral movement within the network.
severity: medium
enabled: false
tags:
  mitre:
  - T1033
  categories:
  - endpoint
references:
- https://attack.mitre.org/techniques/T1033/
logsource:
  product: splunk
detection:
  splunk_spl: "| tstats `security_content_summariesonly` count min(_time) as firstTime\
    \ max(_time) as lastTime FROM datamodel=Endpoint.Processes\n  WHERE (\n      \
    \  Processes.process_name=\"powershell.exe\"\n    )\n    (Processes.process=*System.Security.Principal.WindowsIdentity*\
    \ OR Processes.process=*GetCurrent()*)\n  BY Processes.action Processes.dest Processes.original_file_name\n\
    \     Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid\n\
    \     Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path\n\
    \     Processes.process Processes.process_exec Processes.process_guid\n     Processes.process_hash\
    \ Processes.process_id Processes.process_integrity_level\n     Processes.process_name\
    \ Processes.process_path Processes.user\n     Processes.user_id Processes.vendor_product\n\
    | `drop_dm_object_name(Processes)`\n| `security_content_ctime(firstTime)`\n| `security_content_ctime(lastTime)`\n\
    | `getcurrent_user_with_powershell_filter`"
provenance:
  source: splunk/security_content
  source_id: 7eb9c3d5-c98c-4088-acc5-8240bad15379
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/getcurrent_user_with_powershell.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
