id: splunk-security-content-834ba832-ad89-11eb-937d-acde48001122
name: Hide User Account From Sign-In Screen
description: The following analytic detects a suspicious registry modification that
  hides a user account from the Windows Login screen. It leverages data from the Endpoint.Registry
  data model, specifically monitoring changes to the registry path "*\\Windows NT\\CurrentVersion\\Winlogon\\SpecialAccounts\\Userlist*"
  with a value of "0x00000000". This activity is significant as it may indicate an
  adversary attempting to create a hidden admin account to avoid detection and maintain
  persistence on the compromised machine. If confirmed malicious, this could allow
  the attacker to maintain undetected access and control over the system, posing a
  severe security risk.
severity: medium
enabled: false
tags:
  mitre:
  - T1562.001
  categories:
  - endpoint
references:
- https://thedfirreport.com/2020/04/20/sqlserver-or-the-miner-in-the-basement/
logsource:
  product: splunk
detection:
  splunk_spl: '| tstats `security_content_summariesonly` count min(_time) as firstTime
    max(_time) as lastTime FROM datamodel=Endpoint.Registry WHERE (Registry.registry_path="*\\Windows
    NT\\CurrentVersion\\Winlogon\\SpecialAccounts\\Userlist*" AND Registry.registry_value_data
    = "0x00000000") by Registry.action Registry.dest Registry.process_guid Registry.process_id
    Registry.registry_hive Registry.registry_path Registry.registry_key_name Registry.registry_value_data
    Registry.registry_value_name Registry.registry_value_type Registry.status Registry.user
    Registry.vendor_product | `drop_dm_object_name(Registry)` | where isnotnull(registry_value_data)
    | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `hide_user_account_from_sign_in_screen_filter`'
provenance:
  source: splunk/security_content
  source_id: 834ba832-ad89-11eb-937d-acde48001122
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/hide_user_account_from_sign_in_screen.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
