id: splunk-security-content-7d90f334-a482-11ec-908c-acde48001122
name: Kerberos Service Ticket Request Using RC4 Encryption
description: 'The following analytic detects Kerberos service ticket requests using
  RC4 encryption, leveraging Kerberos Event 4769. This method identifies potential
  Golden Ticket attacks, where adversaries forge Kerberos Granting Tickets (TGT) using
  the Krbtgt account NTLM password hash to gain unrestricted access to an Active Directory
  environment. Monitoring for RC4 encryption usage is significant as it is rare in
  modern networks, indicating possible malicious activity. If confirmed malicious,
  attackers could move laterally and execute code on remote systems, compromising
  the entire network. Note: This detection may be bypassed if attackers use the AES
  key instead of the NTLM hash.'
severity: medium
enabled: false
tags:
  mitre:
  - T1558.001
  categories:
  - endpoint
references:
- https://attack.mitre.org/techniques/T1558/001/
- https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4769
- https://adsecurity.org/?p=1515
- https://gist.github.com/TarlogicSecurity/2f221924fef8c14a1d8e29f3cb5c5c4a
- https://en.hackndo.com/kerberos-silver-golden-tickets/
logsource:
  product: splunk
detection:
  splunk_spl: "`wineventlog_security` EventCode=4769 ServiceName=\"*$\" (TicketOptions=0x40810000\
    \ OR TicketOptions=0x40800000 OR TicketOptions=0x40810010) TicketEncryptionType=0x17\n\
    \  | stats count min(_time) as firstTime max(_time) as lastTime\n    BY dest,\
    \ service, service_id,\n       TicketEncryptionType, TicketOptions\n  | `security_content_ctime(lastTime)`\n\
    \  | `security_content_ctime(firstTime)`\n  | `kerberos_service_ticket_request_using_rc4_encryption_filter`"
provenance:
  source: splunk/security_content
  source_id: 7d90f334-a482-11ec-908c-acde48001122
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/kerberos_service_ticket_request_using_rc4_encryption.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
