id: splunk-security-content-03b2b286-fa86-4ec9-b1a1-ec19d314bdf7
name: Linux Docker Shell Execution
description: 'This detection identifies shell execution activity associated with Docker
  containers on Linux systems.

  Specifically, it monitors for interactive or non-interactive shell processes (e.g.,
  `/bin/bash`, `/bin/sh`, `/bin/zsh`) launched via Docker commands such as `docker
  exec`,  or through container entrypoint overrides.

  Shell execution inside a container may indicate administrative troubleshooting activity.

  However, it can also represent post-exploitation behavior, where an attacker gains
  access to a container and spawns a shell to execute arbitrary commands, establish
  persistence, or pivot to the host.'
severity: medium
enabled: false
tags:
  mitre:
  - T1059.013
  categories:
  - endpoint
references:
- https://docs.docker.com/reference/cli/docker/container/exec/
- https://gtfobins.github.io/gtfobins/docker/
logsource:
  product: splunk
detection:
  splunk_spl: "| tstats `security_content_summariesonly`\n  count min(_time) as firstTime\n\
    \        max(_time) as lastTime\nfrom datamodel=Endpoint.Processes where\nProcesses.process_name=docker*\n\
    Processes.process=\"* exec *\"\nProcesses.process IN (\n  \"* /bin/bash *\",\n\
    \  \"* /bin/dash *\",\n  \"* /bin/sh *\",\n  \"* /bin/zsh *\",\n  \"* bash *\"\
    ,\n  \"* bash\",\n  \"* dash *\",\n  \"* dash\",\n  \"* sh *\",\n  \"* sh\",\n\
    \  \"* zsh *\",\n  \"* zsh\"\n)\nby Processes.action Processes.dest Processes.original_file_name\n\
    \   Processes.parent_process Processes.parent_process_exec\n   Processes.parent_process_guid\
    \ Processes.parent_process_id\n   Processes.parent_process_name Processes.parent_process_path\n\
    \   Processes.process Processes.process_exec Processes.process_guid\n   Processes.process_hash\
    \ Processes.process_id\n   Processes.process_integrity_level Processes.process_name\n\
    \   Processes.process_path Processes.user Processes.user_id Processes.vendor_product\n\
    | `drop_dm_object_name(Processes)`\n| `security_content_ctime(firstTime)`\n| `security_content_ctime(lastTime)`\n\
    | `linux_docker_shell_execution_filter`"
provenance:
  source: splunk/security_content
  source_id: 03b2b286-fa86-4ec9-b1a1-ec19d314bdf7
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/linux_docker_shell_execution.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
