id: splunk-security-content-97d9cfb2-61ad-11ec-bb2d-acde48001122
name: Linux File Creation In Init Boot Directory
description: 'The following analytic detects the creation of files in Linux init boot
  directories, which are used for automatic execution upon system startup.

  It leverages file system logs to identify new files in directories such as /etc/init.d/
  and /etc/rc.d/. This activity is significant as it is a common persistence technique
  used by adversaries, malware authors, and red teamers.

  If confirmed malicious, this could allow an attacker to maintain persistence on
  the compromised host, potentially leading to further exploitation and unauthorized
  control over the system.'
severity: medium
enabled: false
tags:
  mitre:
  - T1037.004
  categories:
  - endpoint
references:
- https://www.intezer.com/blog/research/kaiji-new-chinese-linux-malware-turning-to-golang/
logsource:
  product: splunk
detection:
  splunk_spl: "| tstats `security_content_summariesonly`\n  count min(_time) as firstTime\n\
    \        max(_time) as lastTime\n\nFROM datamodel=Endpoint.Filesystem WHERE\n\n\
    Filesystem.action = \"created\"\nFilesystem.file_path IN (\n    \"*/etc/init.d/*\"\
    ,\n    \"*/etc/rc.d/*\",\n    \"*/etc/rc.local*\",\n    \"*/sbin/init.d/*\"\n\
    )\nBY Filesystem.action Filesystem.dest Filesystem.file_access_time\n   Filesystem.file_create_time\
    \ Filesystem.file_hash Filesystem.file_modify_time\n   Filesystem.file_name Filesystem.file_path\
    \ Filesystem.file_acl\n   Filesystem.file_size Filesystem.process_guid Filesystem.process_id\n\
    \   Filesystem.user Filesystem.vendor_product\n\n| `drop_dm_object_name(Filesystem)`\n\
    | `security_content_ctime(lastTime)`\n| `security_content_ctime(firstTime)`\n\
    | `linux_file_creation_in_init_boot_directory_filter`"
provenance:
  source: splunk/security_content
  source_id: 97d9cfb2-61ad-11ec-bb2d-acde48001122
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/linux_file_creation_in_init_boot_directory.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
