id: splunk-security-content-637b603e-1799-40fd-bf87-47ecbd551b66
name: Linux Decode Base64 to Shell
description: The following analytic detects the behavior of decoding base64-encoded
  data and passing it to a Linux shell. Additionally, it mitigates the potential damage
  and protects the organization's systems and data.The detection is made by searching
  for specific commands in the Splunk query, namely "base64 -d" and "base64 --decode",
  within the Endpoint.Processes data model. The analytic also includes a filter for
  Linux shells. The detection is important because  it indicates the presence of malicious
  activity since Base64 encoding is commonly used to obfuscate malicious commands
  or payloads, and decoding it can be a step in running those commands. It suggests
  that an attacker is attempting to run malicious commands on a Linux system to gain
  unauthorized access, for data exfiltration, or perform other malicious actions.
severity: medium
enabled: false
tags:
  mitre:
  - T1027
  - T1059.004
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1027/T1027.md#atomic-test-1---decode-base64-data-into-script
- https://redcanary.com/blog/lateral-movement-with-secure-shell/
- https://linux.die.net/man/1/base64
logsource:
  product: splunk
detection:
  splunk_spl: "| tstats `security_content_summariesonly` count min(_time) as firstTime\
    \ max(_time) as lastTime\nfrom datamodel=Endpoint.Processes where\nProcesses.process=\"\
    *|*\"\n`linux_shells`\nby Processes.action Processes.dest Processes.original_file_name\
    \ Processes.parent_process\n   Processes.parent_process_exec Processes.parent_process_guid\
    \ Processes.parent_process_id\n   Processes.parent_process_name Processes.parent_process_path\
    \ Processes.process\n   Processes.process_exec Processes.process_guid Processes.process_hash\n\
    \   Processes.process_id Processes.process_integrity_level Processes.process_name\n\
    \   Processes.process_path Processes.user Processes.user_id Processes.vendor_product\n\
    | `drop_dm_object_name(Processes)`\n| rex field=process \"base64\\s+(?<decode_flag>-{1,2}d\\\
    w*)\"\n| where isnotnull(decode_flag)\n| `security_content_ctime(firstTime)`\n\
    | `security_content_ctime(lastTime)`\n| `linux_decode_base64_to_shell_filter`"
provenance:
  source: splunk/security_content
  source_id: 637b603e-1799-40fd-bf87-47ecbd551b66
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/linux_decode_base64_to_shell.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
