id: splunk-security-content-8c1de57d-abc1-4b41-a727-a7a8fc5e0857
name: Linux Ingress Tool Transfer with Curl
description: The following analytic detects the use of the curl command with specific
  switches (-O, -sO, -ksO, --output) commonly used to download remote scripts or binaries.
  This detection leverages data from Endpoint Detection and Response (EDR) agents,
  focusing on process names and command-line arguments. This activity is significant
  as it may indicate an attempt to download and execute potentially malicious files,
  often used in initial stages of an attack. If confirmed malicious, this could lead
  to unauthorized code execution, enabling attackers to compromise the system further.
severity: medium
enabled: false
tags:
  mitre:
  - T1105
  categories:
  - endpoint
references:
- https://gtfobins.github.io/gtfobins/curl/
- https://curl.se/docs/manpage.html#-I
- https://gtfobins.github.io/gtfobins/curl/
- https://github.com/rapid7/metasploit-framework/search?q=curl
logsource:
  product: splunk
detection:
  splunk_spl: "| tstats `security_content_summariesonly`\n  count min(_time) as firstTime\n\
    \        max(_time) as lastTime\n\nfrom datamodel=Endpoint.Processes where\n\n\
    Processes.process_name=curl\nProcesses.process IN (\"*-O*\",\"*-sO*\",\"*-ksO*\"\
    ,\"*--output*\")\nby Processes.action Processes.dest Processes.original_file_name\n\
    \   Processes.parent_process Processes.parent_process_exec\n   Processes.parent_process_guid\
    \ Processes.parent_process_id\n   Processes.parent_process_name Processes.parent_process_path\n\
    \   Processes.process Processes.process_exec Processes.process_guid\n   Processes.process_hash\
    \ Processes.process_id\n   Processes.process_integrity_level Processes.process_name\n\
    \   Processes.process_path Processes.user Processes.user_id\n   Processes.vendor_product\n\
    | `drop_dm_object_name(Processes)`\n| `security_content_ctime(firstTime)`\n| `security_content_ctime(lastTime)`\n\
    | where match(process, \"(?i)(-O|-sO|-ksO|--output)\")\n| `linux_ingress_tool_transfer_with_curl_filter`"
provenance:
  source: splunk/security_content
  source_id: 8c1de57d-abc1-4b41-a727-a7a8fc5e0857
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/linux_ingress_tool_transfer_with_curl.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
