id: splunk-security-content-40bb64f9-f619-4e3d-8732-328d40377c4b
name: MacOS - Re-opened Applications
description: The following analytic identifies processes referencing plist files that
  determine which applications are re-opened when a user reboots their MacOS machine.
  It leverages data from Endpoint Detection and Response (EDR) agents, focusing on
  process names and parent processes related to "com.apple.loginwindow." This activity
  is significant because it can indicate attempts to persist across reboots, a common
  tactic used by attackers to maintain access. If confirmed malicious, this could
  allow an attacker to execute code or maintain persistence on the affected system,
  potentially leading to further compromise.
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references: []
logsource:
  product: splunk
detection:
  splunk_spl: "| tstats `security_content_summariesonly` count values(Processes.process)\
    \ as process values(Processes.parent_process) as parent_process min(_time) as\
    \ firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes\n  WHERE\
    \ Processes.process=\"*com.apple.loginwindow*\"\n  BY Processes.user Processes.process_name\
    \ Processes.parent_process_name\n     Processes.dest\n| `drop_dm_object_name(Processes)`\n\
    | `security_content_ctime(firstTime)`\n| `security_content_ctime(lastTime)`\n\
    | `macos___re_opened_applications_filter`"
provenance:
  source: splunk/security_content
  source_id: 40bb64f9-f619-4e3d-8732-328d40377c4b
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/macos___re_opened_applications.yml
notes:
  splunk_status: experimental
  splunk_data_source: []
  quarantine_reason: 'upstream status: experimental'
