id: splunk-security-content-cde75cf6-3c7a-4dd6-af01-27cdb4511fd4
name: Malicious PowerShell Process With Obfuscation Techniques
description: The following analytic detects PowerShell processes launched with command-line
  arguments indicative of obfuscation techniques. It leverages data from Endpoint
  Detection and Response (EDR) agents, focusing on process names, parent processes,
  and complete command-line executions. This activity is significant because obfuscated
  PowerShell commands are often used by attackers to evade detection and execute malicious
  scripts. If confirmed malicious, this activity could lead to unauthorized code execution,
  privilege escalation, or persistent access within the environment, posing a significant
  security risk.
severity: medium
enabled: false
tags:
  mitre:
  - T1059.001
  categories:
  - endpoint
references: []
logsource:
  product: splunk
detection:
  splunk_spl: '| tstats `security_content_summariesonly` count values(Processes.process)
    as process values(Processes.parent_process) as parent_process min(_time) as firstTime
    max(_time) as lastTime from datamodel=Endpoint.Processes where `process_powershell`
    by Processes.action Processes.dest Processes.original_file_name Processes.parent_process
    Processes.parent_process_exec Processes.parent_process_guid Processes.parent_process_id
    Processes.parent_process_name Processes.parent_process_path Processes.process
    Processes.process_exec Processes.process_guid Processes.process_hash Processes.process_id
    Processes.process_integrity_level Processes.process_name Processes.process_path
    Processes.user Processes.user_id Processes.vendor_product | `drop_dm_object_name(Processes)`
    | `security_content_ctime(firstTime)`| `security_content_ctime(lastTime)`| eval
    num_obfuscation = (mvcount(split(process,"`"))-1) + (mvcount(split(process, "^"))-1)
    + (mvcount(split(process, "''"))-1) | search num_obfuscation > 10 | `malicious_powershell_process_with_obfuscation_techniques_filter`'
provenance:
  source: splunk/security_content
  source_id: cde75cf6-3c7a-4dd6-af01-27cdb4511fd4
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/malicious_powershell_process_with_obfuscation_techniques.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
