id: splunk-security-content-f5f6af30-7ba7-4295-bfe9-07de87c01bbc
name: Monitor Registry Keys for Print Monitors
description: The following analytic detects modifications to the registry key `HKLM\SYSTEM\CurrentControlSet\Control\Print\Monitors`.
  It leverages data from the Endpoint.Registry data model, focusing on events where
  the registry path is modified. This activity is significant because attackers can
  exploit this registry key to load arbitrary .dll files, which will execute with
  elevated SYSTEM permissions and persist after a reboot. If confirmed malicious,
  this could allow attackers to maintain persistence, execute code with high privileges,
  and potentially compromise the entire system.
severity: medium
enabled: false
tags:
  mitre:
  - T1547.010
  categories:
  - endpoint
references: []
logsource:
  product: splunk
detection:
  splunk_spl: '| tstats `security_content_summariesonly` count min(_time) as firstTime
    max(_time) as lastTime FROM datamodel=Endpoint.Registry WHERE (Registry.action=modified
    AND Registry.registry_path="*CurrentControlSet\\Control\\Print\\Monitors*") by
    Registry.action Registry.dest Registry.process_guid Registry.process_id Registry.registry_hive
    Registry.registry_path Registry.registry_key_name Registry.registry_value_data
    Registry.registry_value_name Registry.registry_value_type Registry.status Registry.user
    Registry.vendor_product | `drop_dm_object_name(Registry)` | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)` | `monitor_registry_keys_for_print_monitors_filter`'
provenance:
  source: splunk/security_content
  source_id: f5f6af30-7ba7-4295-bfe9-07de87c01bbc
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/monitor_registry_keys_for_print_monitors.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
