id: splunk-security-content-134da869-e264-4a8f-8d7e-fcd0ec88f301
name: Monitor Web Traffic For Brand Abuse
description: The following analytic identifies web requests to domains that closely
  resemble your monitored brand's domain, indicating potential brand abuse. It leverages
  data from web traffic sources, such as web proxies or network traffic analysis tools,
  and cross-references these with known domain permutations generated by the "ESCU
  - DNSTwist Domain Names" search. This activity is significant as it can indicate
  phishing attempts or other malicious activities targeting your brand. If confirmed
  malicious, attackers could deceive users, steal credentials, or distribute malware,
  leading to significant reputational and financial damage.
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - application
references: []
logsource:
  product: splunk
detection:
  splunk_spl: "| tstats `security_content_summariesonly`\n  values(Web.url) as urls\n\
    \  min(_time) as firstTime\n  from datamodel=Web\n  by Web.src\n| `drop_dm_object_name(\"\
    Web\")`\n| `security_content_ctime(firstTime)`\n| lookup update=true brandMonitoring_lookup\
    \ domain as urls OUTPUT domain_abuse\n| search domain_abuse=true\n| `monitor_web_traffic_for_brand_abuse_filter`"
provenance:
  source: splunk/security_content
  source_id: 134da869-e264-4a8f-8d7e-fcd0ec88f301
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/web/monitor_web_traffic_for_brand_abuse.yml
notes:
  splunk_status: experimental
  splunk_data_source: []
  quarantine_reason: 'upstream status: experimental'
