id: splunk-security-content-b2ea1f38-3a3e-4b8a-9cf1-82760d86a6b8
name: Monitor Email For Brand Abuse
description: The following analytic identifies emails claiming to be sent from a domain
  similar to one you are monitoring for potential abuse. It leverages email header
  data, specifically the sender's address, and cross-references it with a lookup table
  of known domain permutations generated by the "ESCU - DNSTwist Domain Names" search.
  This activity is significant as it can indicate phishing attempts or brand impersonation,
  which are common tactics used in social engineering attacks. If confirmed malicious,
  this could lead to unauthorized access, data theft, or reputational damage.
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - application
references: []
logsource:
  product: splunk
detection:
  splunk_spl: "| tstats `security_content_summariesonly` values(All_Email.recipient)\
    \ as recipients, min(_time) as firstTime, max(_time) as lastTime FROM datamodel=Email\n\
    \  BY All_Email.src_user, All_Email.message_id\n| `drop_dm_object_name(\"All_Email\"\
    )`\n| `security_content_ctime(firstTime)`\n| `security_content_ctime(lastTime)`\n\
    | eval temp=split(src_user, \"@\")\n| eval email_domain=mvindex(temp, 1)\n| lookup\
    \ update=true brandMonitoring_lookup domain as email_domain OUTPUT domain_abuse\n\
    | search domain_abuse=true\n| table message_id, src_user, email_domain, recipients,\
    \ firstTime, lastTime\n| `monitor_email_for_brand_abuse_filter`"
provenance:
  source: splunk/security_content
  source_id: b2ea1f38-3a3e-4b8a-9cf1-82760d86a6b8
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/application/monitor_email_for_brand_abuse.yml
notes:
  splunk_status: experimental
  splunk_data_source: []
  quarantine_reason: 'upstream status: experimental'
