id: splunk-security-content-5adbc5f1-9a2f-41c1-a810-f37e015f8179
name: Notepad with no Command Line Arguments
description: The following analytic identifies instances where Notepad.exe is launched
  without any command line arguments, a behavior commonly associated with the SliverC2
  framework. This detection leverages process creation events from Endpoint Detection
  and Response (EDR) agents, focusing on processes initiated by Notepad.exe within
  a short time frame. This activity is significant as it may indicate an attempt to
  inject malicious code into Notepad.exe, a known tactic for evading detection. If
  confirmed malicious, this could allow an attacker to execute arbitrary code, potentially
  leading to system compromise and unauthorized access.
severity: medium
enabled: false
tags:
  mitre:
  - T1055
  categories:
  - endpoint
references:
- https://www.microsoft.com/en-us/security/blog/2022/08/24/looking-for-the-sliver-lining-hunting-for-emerging-command-and-control-frameworks/
- https://www.cybereason.com/blog/sliver-c2-leveraged-by-many-threat-actors#Purple-Team-Section
logsource:
  product: splunk
detection:
  splunk_spl: "| tstats `security_content_summariesonly` count min(_time) as firstTime\
    \ max(_time) as lastTime FROM datamodel=Endpoint.Processes\n  WHERE Processes.process_name=notepad.exe\n\
    \    AND\n    Processes.action!=\"blocked\"\n  BY Processes.action Processes.dest\
    \ Processes.original_file_name\n     Processes.parent_process Processes.parent_process_exec\
    \ Processes.parent_process_guid\n     Processes.parent_process_id Processes.parent_process_name\
    \ Processes.parent_process_path\n     Processes.process Processes.process_exec\
    \ Processes.process_guid\n     Processes.process_hash Processes.process_id Processes.process_integrity_level\n\
    \     Processes.process_name Processes.process_path Processes.user\n     Processes.user_id\
    \ Processes.vendor_product\n| `drop_dm_object_name(Processes)`\n| `security_content_ctime(firstTime)`\n\
    | `security_content_ctime(lastTime)`\n| regex process=\"(?i)(notepad\\.exe.{0,4}$)\"\
    \n| `notepad_with_no_command_line_arguments_filter`"
provenance:
  source: splunk/security_content
  source_id: 5adbc5f1-9a2f-41c1-a810-f37e015f8179
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/notepad_with_no_command_line_arguments.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
