id: splunk-security-content-bb27cbce-d4de-432c-932f-2e206e9130fb
name: Okta New Device Enrolled on Account
description: The following analytic identifies when a new device is enrolled on an
  Okta account. It uses OktaIm2 logs ingested via the Splunk Add-on for Okta Identity
  Cloud to detect the creation of new device enrollments. This activity is significant
  as it may indicate a legitimate user setting up a new device or an adversary adding
  a device to maintain unauthorized access. If confirmed malicious, this could lead
  to potential account takeover, unauthorized access, and persistent control over
  the compromised Okta account. Monitoring this behavior is crucial for detecting
  and mitigating unauthorized access attempts.
severity: medium
enabled: false
tags:
  mitre:
  - T1098.005
  categories:
  - application
references:
- https://attack.mitre.org/techniques/T1098/005/
- https://developer.okta.com/docs/reference/api/event-types/?q=device.enrollment.create
logsource:
  product: splunk
detection:
  splunk_spl: "| tstats `security_content_summariesonly` count max(_time) as lastTime,\
    \ min(_time) as firstTime FROM datamodel=Change\n  WHERE All_Changes.action=created\
    \ All_Changes.command=device.enrollment.create\n  BY _time span=5m All_Changes.user\n\
    \     All_Changes.result All_Changes.command sourcetype\n     All_Changes.src\
    \ All_Changes.action All_Changes.object_category\n     All_Changes.dest\n| `drop_dm_object_name(\"\
    All_Changes\")`\n| `security_content_ctime(firstTime)`\n| `security_content_ctime(lastTime)`\n\
    | `okta_new_device_enrolled_on_account_filter`"
provenance:
  source: splunk/security_content
  source_id: bb27cbce-d4de-432c-932f-2e206e9130fb
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/application/okta_new_device_enrolled_on_account.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
