id: splunk-security-content-71ad47d1-d6bd-4e0a-b35c-020ad9a6959e
name: Okta Suspicious Use of a Session Cookie
description: The following analytic identifies suspicious use of a session cookie
  by detecting multiple client values (IP, User Agent, etc.) changing for the same
  Device Token associated with a specific user. It leverages policy evaluation events
  from successful authentication logs in Okta. This activity is significant as it
  may indicate an adversary attempting to reuse a stolen web session cookie, potentially
  bypassing authentication mechanisms. If confirmed malicious, this could allow unauthorized
  access to user accounts, leading to data breaches or further exploitation within
  the environment.
severity: medium
enabled: false
tags:
  mitre:
  - T1539
  categories:
  - application
references:
- https://attack.mitre.org/techniques/T1539/
logsource:
  product: splunk
detection:
  splunk_spl: "`okta` eventType IN (policy.evaluate_sign_on) outcome.result IN (ALLOW,\
    \ SUCCESS)\n  | stats earliest(_time) as _time, values(client.ipAddress) as src_ip,\
    \ values(client.userAgent.rawUserAgent) as user_agent, values(client.userAgent.os)\
    \ as userAgentOS_list, values(client.geographicalContext.city) as city, values(client.userAgent.browser)\
    \ as userAgentBrowser_list, values(device.os_platform) as okta_device_os, dc(client.userAgent.browser)\
    \ as dc_userAgentBrowser, dc(client.userAgent.os) as dc_userAgentOS, dc(client.ipAddress)\
    \ as dc_src_ip, values(outcome.reason) as reason values(dest) as dest\n    BY\
    \ debugContext.debugData.dtHash, user\n  | where dc_src_ip>1 AND (dc_userAgentOS>1\
    \ OR dc_userAgentBrowser>1)\n  | `okta_suspicious_use_of_a_session_cookie_filter`"
provenance:
  source: splunk/security_content
  source_id: 71ad47d1-d6bd-4e0a-b35c-020ad9a6959e
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/application/okta_suspicious_use_of_a_session_cookie.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
