id: splunk-security-content-e2b99e7d-d956-411a-a120-2b14adfdde93
name: Okta Authentication Failed During MFA Challenge
description: The following analytic identifies failed authentication attempts during
  the Multi-Factor Authentication (MFA) challenge in an Okta tenant. It uses the Authentication
  datamodel to detect specific failed events where the authentication signature is
  `user.authentication.auth_via_mfa`. This activity is significant as it may indicate
  an adversary attempting to authenticate with compromised credentials on an account
  with MFA enabled. If confirmed malicious, this could suggest an ongoing attempt
  to bypass MFA protections, potentially leading to unauthorized access and further
  compromise of the affected account.
severity: medium
enabled: false
tags:
  mitre:
  - T1078.004
  - T1586.003
  - T1621
  categories:
  - application
references:
- https://sec.okta.com/everythingisyes
- https://splunkbase.splunk.com/app/6553
logsource:
  product: splunk
detection:
  splunk_spl: "| tstats `security_content_summariesonly` count min(_time) as firstTime\
    \ max(_time) as lastTime  values(Authentication.app) as app values(Authentication.reason)\
    \ as reason values(Authentication.signature) as signature  values(Authentication.method)\
    \ as method FROM datamodel=Authentication\n  WHERE Authentication.signature=user.authentication.auth_via_mfa\
    \ Authentication.action = failure\n  BY _time Authentication.src Authentication.user\n\
    \     Authentication.dest Authentication.action\n| `drop_dm_object_name(\"Authentication\"\
    )`\n| `security_content_ctime(firstTime)`\n| `security_content_ctime(lastTime)`\n\
    | iplocation src\n| `okta_authentication_failed_during_mfa_challenge_filter`"
provenance:
  source: splunk/security_content
  source_id: e2b99e7d-d956-411a-a120-2b14adfdde93
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/application/okta_authentication_failed_during_mfa_challenge.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
