id: splunk-security-content-5ced34b4-ab32-4bb0-8f22-3b8f186f0a38
name: Potential password in username
description: The following analytic identifies instances where users may have mistakenly
  entered their passwords in the username field during authentication attempts. It
  detects this by analyzing failed authentication events with usernames longer than
  7 characters and high Shannon entropy, followed by a successful authentication from
  the same source to the same destination. This activity is significant as it can
  indicate potential security risks, such as password exposure. If confirmed malicious,
  attackers could exploit this to gain unauthorized access, leading to potential data
  breaches or further compromise of the system.
severity: medium
enabled: false
tags:
  mitre:
  - T1078.003
  - T1552.001
  categories:
  - endpoint
references:
- https://medium.com/@markmotig/search-for-passwords-accidentally-typed-into-the-username-field-975f1a389928
logsource:
  product: splunk
detection:
  splunk_spl: "| tstats `security_content_summariesonly` earliest(_time) AS starttime\
    \ latest(_time) AS endtime latest(sourcetype) AS sourcetype values(Authentication.src)\
    \ AS src values(Authentication.dest) AS dest count FROM datamodel=Authentication\n\
    \  WHERE nodename=Authentication.Failed_Authentication\n  BY \"Authentication.user\"\
    \n| `drop_dm_object_name(Authentication)`\n| lookup ut_shannon_lookup word AS\
    \ user\n| where ut_shannon>3 AND len(user)>=8 AND mvcount(src) == 1\n| sort count,\
    \ - ut_shannon\n| eval incorrect_cred=user\n| eval endtime=endtime+1000\n| map\
    \ maxsearches=70 search=\"\n| tstats `security_content_summariesonly` earliest(_time)\
    \ AS starttime latest(_time) AS endtime latest(sourcetype) AS sourcetype values(Authentication.src)\
    \ AS src values(Authentication.dest) AS dest count FROM datamodel=Authentication\n\
    \  WHERE nodename=Authentication.Successful_Authentication Authentication.src=\\\
    \"$src$\\\" Authentication.dest=\\\"$dest$\\\" sourcetype IN (\\\"$sourcetype$\\\
    \") earliest=\\\"$starttime$\\\" latest=\\\"$endtime$\\\" BY \\\"Authentication.user\\\
    \"\n| `drop_dm_object_name(\\\"Authentication\\\")`\n| `potential_password_in_username_false_positive_reduction`\n\
    | eval incorrect_cred=\\\"$incorrect_cred$\\\"\n| eval ut_shannon=\\\"$ut_shannon$\\\
    \"\n| sort count\"\n| where user!=incorrect_cred\n| outlier action=RM count\n\
    | `potential_password_in_username_filter`"
provenance:
  source: splunk/security_content
  source_id: 5ced34b4-ab32-4bb0-8f22-3b8f186f0a38
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/potential_password_in_username.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
