id: splunk-security-content-ee18ed37-0802-4268-9435-b3b91aaa18db
name: PowerShell - Connect To Internet With Hidden Window
description: The following analytic detects PowerShell commands using the WindowStyle
  parameter to hide the window while connecting to the Internet. This behavior is
  identified through Endpoint Detection and Response (EDR) telemetry, focusing on
  command-line executions that include variations of the WindowStyle parameter. This
  activity is significant because it attempts to bypass default PowerShell execution
  policies and conceal its actions, which is often indicative of malicious intent.
  If confirmed malicious, this could allow an attacker to execute commands stealthily,
  potentially leading to unauthorized data exfiltration or further compromise of the
  endpoint.
severity: medium
enabled: false
tags:
  mitre:
  - T1059.001
  categories:
  - endpoint
references:
- https://regexr.com/663rr
- https://github.com/redcanaryco/AtomicTestHarnesses/blob/master/Windows/TestHarnesses/T1059.001_PowerShell/OutPowerShellCommandLineParameter.ps1
- https://ss64.com/ps/powershell.html
- https://twitter.com/M_haggis/status/1440758396534214658?s=20
- https://blog.netlab.360.com/ten-families-of-malicious-samples-are-spreading-using-the-log4j2-vulnerability-now/
logsource:
  product: splunk
detection:
  splunk_spl: "| tstats `security_content_summariesonly` count min(_time) as firstTime\
    \ max(_time) as lastTime FROM datamodel=Endpoint.Processes\n  WHERE `process_powershell`\n\
    \  BY Processes.action Processes.dest Processes.original_file_name\n     Processes.parent_process\
    \ Processes.parent_process_exec Processes.parent_process_guid\n     Processes.parent_process_id\
    \ Processes.parent_process_name Processes.parent_process_path\n     Processes.process\
    \ Processes.process_exec Processes.process_guid\n     Processes.process_hash Processes.process_id\
    \ Processes.process_integrity_level\n     Processes.process_name Processes.process_path\
    \ Processes.user\n     Processes.user_id Processes.vendor_product\n| `drop_dm_object_name(Processes)`\n\
    | `security_content_ctime(firstTime)`\n| `security_content_ctime(lastTime)`\n\
    | where match(process,\"(?i)[\\-\n| \\/\n| –\n| —\n| ―]w(in*d*o*w*s*t*y*l*e*)*\\\
    s+[^-]\")\n| `powershell___connect_to_internet_with_hidden_window_filter`"
provenance:
  source: splunk/security_content
  source_id: ee18ed37-0802-4268-9435-b3b91aaa18db
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/powershell___connect_to_internet_with_hidden_window.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
