id: splunk-security-content-24869767-8579-485d-9a4f-d9ddfd8f0cac
name: Process Execution via WMI
description: The following analytic detects the execution of a process by `WmiPrvSE.exe`,
  indicating potential use of WMI (Windows Management Instrumentation) for process
  creation. This detection leverages data from Endpoint Detection and Response (EDR)
  agents, focusing on process and parent process relationships. This activity is significant
  as WMI can be used for lateral movement, remote code execution, or persistence by
  attackers. If confirmed malicious, this could allow an attacker to execute arbitrary
  commands or scripts, potentially leading to further compromise of the affected system
  or network.
severity: medium
enabled: false
tags:
  mitre:
  - T1047
  categories:
  - endpoint
references: []
logsource:
  product: splunk
detection:
  splunk_spl: '| tstats `security_content_summariesonly` count min(_time) as firstTime
    max(_time) as lastTime from datamodel=Endpoint.Processes where Processes.parent_process_name=WmiPrvSE.exe
    NOT (Processes.process IN ("*\\dismhost.exe*")) by Processes.action Processes.dest
    Processes.original_file_name Processes.parent_process Processes.parent_process_exec
    Processes.parent_process_guid Processes.parent_process_id Processes.parent_process_name
    Processes.parent_process_path Processes.process Processes.process_exec Processes.process_guid
    Processes.process_hash Processes.process_id Processes.process_integrity_level
    Processes.process_name Processes.process_path Processes.user Processes.user_id
    Processes.vendor_product | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)` | `process_execution_via_wmi_filter`'
provenance:
  source: splunk/security_content
  source_id: 24869767-8579-485d-9a4f-d9ddfd8f0cac
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/process_execution_via_wmi.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
