id: splunk-security-content-ce5a0962-849f-4720-a678-753fe6674479
name: Prohibited Network Traffic Allowed
description: The following analytic detects instances where network traffic, identified
  by port and transport layer protocol as prohibited in the "lookup_interesting_ports"
  table, is allowed. It uses the Network_Traffic data model to cross-reference traffic
  data against predefined security policies. This activity is significant for a SOC
  as it highlights potential misconfigurations or policy violations that could lead
  to unauthorized access or data exfiltration. If confirmed malicious, this could
  allow attackers to bypass network defenses, leading to potential data breaches and
  compromising the organization's security posture.
severity: medium
enabled: false
tags:
  mitre:
  - T1048
  categories:
  - network
references: []
logsource:
  product: splunk
detection:
  splunk_spl: "| tstats `security_content_summariesonly` count min(_time) as firstTime\
    \ max(_time) as lastTime FROM datamodel=Network_Traffic\n  WHERE All_Traffic.action\
    \ IN (\"allowed\", \"allow\") [\n| inputlookup interesting_ports_lookup where\
    \ is_prohibited=\"true\"\n| table dest_port transport\n| dedup dest_port transport\n\
    | rename dest_port as All_Traffic.dest_port\n| rename transport as All_Traffic.transport]\
    \ by All_Traffic.src_ip All_Traffic.dest_ip All_Traffic.dest_port All_Traffic.action\
    \ All_Traffic.dvc All_Traffic.src_port All_Traffic.vendor_product All_Traffic.rule\n\
    | lookup update=true interesting_ports_lookup dest_port as All_Traffic.dest_port\
    \ transport as All_Traffic.transport OUTPUT app is_prohibited note\n| `security_content_ctime(firstTime)`\n\
    | `security_content_ctime(lastTime)`\n| `drop_dm_object_name(\"All_Traffic\")`\n\
    | `prohibited_network_traffic_allowed_filter`"
provenance:
  source: splunk/security_content
  source_id: ce5a0962-849f-4720-a678-753fe6674479
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/network/prohibited_network_traffic_allowed.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
