id: splunk-security-content-f5f6af30-7aa7-4295-bfe9-07fe87c01bbb
name: Registry Keys for Creating SHIM Databases
description: The following analytic detects registry activity related to the creation
  of application compatibility shims. It leverages data from the Endpoint.Registry
  data model, specifically monitoring registry paths associated with AppCompatFlags.
  This activity is significant because attackers can use shims to bypass security
  controls, achieve persistence, or escalate privileges. If confirmed malicious, this
  could allow an attacker to maintain long-term access, execute arbitrary code, or
  manipulate application behavior, posing a severe risk to the integrity and security
  of the affected systems.
severity: medium
enabled: false
tags:
  mitre:
  - T1546.011
  categories:
  - endpoint
references: []
logsource:
  product: splunk
detection:
  splunk_spl: '| tstats `security_content_summariesonly` count min(_time) as firstTime
    max(_time) as lastTime FROM datamodel=Endpoint.Registry WHERE (Registry.registry_path=*CurrentVersion\\AppCompatFlags\\Custom*
    OR Registry.registry_path=*CurrentVersion\\AppCompatFlags\\InstalledSDB*) by Registry.action
    Registry.dest Registry.process_guid Registry.process_id Registry.registry_hive
    Registry.registry_path Registry.registry_key_name Registry.registry_value_data
    Registry.registry_value_name Registry.registry_value_type Registry.status Registry.user
    Registry.vendor_product | `drop_dm_object_name(Registry)` | where isnotnull(registry_value_data)
    | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `registry_keys_for_creating_shim_databases_filter`'
provenance:
  source: splunk/security_content
  source_id: f5f6af30-7aa7-4295-bfe9-07fe87c01bbb
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/registry_keys_for_creating_shim_databases.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
