id: splunk-security-content-f5939373-8054-40ad-8c64-cec478a22a4a
name: Remote Desktop Process Running On System
description: The following analytic detects the execution of the remote desktop process
  (mstsc.exe) on systems where it is not typically run. This detection leverages data
  from Endpoint Detection and Response (EDR) agents, filtering out systems categorized
  as common RDP sources. This activity is significant because unauthorized use of
  mstsc.exe can indicate lateral movement or unauthorized remote access attempts.
  If confirmed malicious, this could allow an attacker to gain remote control of a
  system, potentially leading to data exfiltration, privilege escalation, or further
  network compromise.
severity: medium
enabled: false
tags:
  mitre:
  - T1021.001
  categories:
  - endpoint
references: []
logsource:
  product: splunk
detection:
  splunk_spl: "| tstats `security_content_summariesonly` count min(_time) as firstTime\
    \ max(_time) as lastTime FROM datamodel=Endpoint.Processes\n  WHERE Processes.process=*mstsc.exe\n\
    \    AND\n    Processes.dest_category!=common_rdp_source\n  BY Processes.action\
    \ Processes.dest Processes.original_file_name\n     Processes.parent_process Processes.parent_process_exec\
    \ Processes.parent_process_guid\n     Processes.parent_process_id Processes.parent_process_name\
    \ Processes.parent_process_path\n     Processes.process Processes.process_exec\
    \ Processes.process_guid\n     Processes.process_hash Processes.process_id Processes.process_integrity_level\n\
    \     Processes.process_name Processes.process_path Processes.user\n     Processes.user_id\
    \ Processes.vendor_product\n| `security_content_ctime(firstTime)`\n| `security_content_ctime(lastTime)`\n\
    | `drop_dm_object_name(Processes)`\n| `remote_desktop_process_running_on_system_filter`"
provenance:
  source: splunk/security_content
  source_id: f5939373-8054-40ad-8c64-cec478a22a4a
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/remote_desktop_process_running_on_system.yml
notes:
  splunk_status: experimental
  splunk_data_source: []
  quarantine_reason: 'upstream status: experimental'
