id: splunk-security-content-6c135f8d-5e60-454e-80b7-c56eed739833
name: RunDLL Loading DLL By Ordinal
description: The following analytic detects rundll32.exe loading a DLL export function
  by ordinal value. It leverages data from Endpoint Detection and Response (EDR) agents,
  focusing on process command-line executions. This behavior is significant because
  adversaries may use rundll32.exe to execute malicious code while evading security
  tools that do not monitor this process. If confirmed malicious, this activity could
  allow attackers to execute arbitrary code, potentially leading to system compromise,
  privilege escalation, or persistent access within the environment.
severity: medium
enabled: false
tags:
  mitre:
  - T1218.011
  categories:
  - endpoint
references:
- https://thedfirreport.com/2022/02/07/qbot-likes-to-move-it-move-it/
- https://twitter.com/M_haggis/status/1491109262428635136
- https://twitter.com/pr0xylife/status/1590394227758104576
logsource:
  product: splunk
detection:
  splunk_spl: "| tstats `security_content_summariesonly` values(Processes.process)\
    \ as process min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes\n\
    \  WHERE `process_rundll32`\n  BY Processes.action Processes.dest Processes.original_file_name\n\
    \     Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid\n\
    \     Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path\n\
    \     Processes.process Processes.process_exec Processes.process_guid\n     Processes.process_hash\
    \ Processes.process_id Processes.process_integrity_level\n     Processes.process_name\
    \ Processes.process_path Processes.user\n     Processes.user_id Processes.vendor_product\n\
    | `drop_dm_object_name(Processes)`\n| `security_content_ctime(firstTime)`\n| `security_content_ctime(lastTime)`\n\
    | where match(process,\"rundll32.+\\#\\d+\")\n| `rundll_loading_dll_by_ordinal_filter`"
provenance:
  source: splunk/security_content
  source_id: 6c135f8d-5e60-454e-80b7-c56eed739833
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/rundll_loading_dll_by_ordinal.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
