id: splunk-security-content-57d44d70-28d9-4ed1-acf5-1c80ae2bbce3
name: Ryuk Test Files Detected
description: The following analytic identifies the presence of files containing the
  keyword "Ryuk" in any folder on the C drive, indicative of Ryuk ransomware activity.
  It leverages the Endpoint Filesystem data model to detect file paths matching this
  pattern. This activity is significant as Ryuk ransomware is known for its destructive
  impact, encrypting critical files and demanding ransom. If confirmed malicious,
  this could lead to significant data loss, operational disruption, and financial
  damage due to ransom payments and recovery efforts. Immediate investigation and
  response are crucial to mitigate potential damage.
severity: medium
enabled: false
tags:
  mitre:
  - T1486
  categories:
  - endpoint
references: []
logsource:
  product: splunk
detection:
  splunk_spl: '| tstats `security_content_summariesonly` count min(_time) as firstTime
    max(_time) as lastTime FROM datamodel=Endpoint.Filesystem WHERE "Filesystem.file_path"=C:\\*Ryuk*
    by Filesystem.action Filesystem.dest Filesystem.file_access_time Filesystem.file_create_time
    Filesystem.file_hash Filesystem.file_modify_time Filesystem.file_name Filesystem.file_path
    Filesystem.file_acl Filesystem.file_size Filesystem.process_guid Filesystem.process_id
    Filesystem.user Filesystem.vendor_product | `drop_dm_object_name(Filesystem)`
    | `security_content_ctime(lastTime)` | `security_content_ctime(firstTime)` | `ryuk_test_files_detected_filter`'
provenance:
  source: splunk/security_content
  source_id: 57d44d70-28d9-4ed1-acf5-1c80ae2bbce3
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/ryuk_test_files_detected.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
