id: splunk-security-content-c2590137-0b08-4985-9ec5-6ae23d92f63d
name: Set Default PowerShell Execution Policy To Unrestricted or Bypass
description: The following analytic detects changes to the PowerShell ExecutionPolicy
  in the registry to "Unrestricted" or "Bypass." It leverages data from Endpoint Detection
  and Response (EDR) agents, focusing on registry modifications under the path *Software\Microsoft\Powershell\1\ShellIds\Microsoft.PowerShell*.
  This activity is significant because setting the ExecutionPolicy to these values
  can allow the execution of potentially malicious scripts without restriction. If
  confirmed malicious, this could enable an attacker to execute arbitrary code, leading
  to further compromise of the system and potential escalation of privileges.
severity: medium
enabled: false
tags:
  mitre:
  - T1059.001
  categories:
  - endpoint
references: []
logsource:
  product: splunk
detection:
  splunk_spl: '| tstats `security_content_summariesonly` count min(_time) as firstTime
    max(_time) as lastTime FROM datamodel=Endpoint.Registry WHERE (Registry.registry_path=*Software\\Microsoft\\Powershell\\1\\ShellIds\\Microsoft.PowerShell*
    Registry.registry_value_name=ExecutionPolicy (Registry.registry_value_data=Unrestricted
    OR Registry.registry_value_data=Bypass)) by Registry.action Registry.dest Registry.process_guid
    Registry.process_id Registry.registry_hive Registry.registry_path Registry.registry_key_name
    Registry.registry_value_data Registry.registry_value_name Registry.registry_value_type
    Registry.status Registry.user Registry.vendor_product | `drop_dm_object_name(Registry)`
    | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `set_default_powershell_execution_policy_to_unrestricted_or_bypass_filter`'
provenance:
  source: splunk/security_content
  source_id: c2590137-0b08-4985-9ec5-6ae23d92f63d
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/set_default_powershell_execution_policy_to_unrestricted_or_bypass.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
