id: splunk-security-content-6e4c4588-ba2f-42fa-97e6-9f6f548eaa33
name: Shim Database File Creation
description: The following analytic detects the creation of shim database files (.sdb)
  in default directories using the sdbinst.exe application. It leverages filesystem
  activity data from the Endpoint.Filesystem data model to identify file writes to
  the Windows\AppPatch\Custom directory. This activity is significant because shims
  can intercept and alter API calls, potentially allowing attackers to bypass security
  controls or execute malicious code. If confirmed malicious, this could lead to unauthorized
  code execution, privilege escalation, or persistent access within the environment.
severity: medium
enabled: false
tags:
  mitre:
  - T1546.011
  categories:
  - endpoint
references: []
logsource:
  product: splunk
detection:
  splunk_spl: '| tstats `security_content_summariesonly` count values(Filesystem.action)
    values(Filesystem.file_hash) as file_hash values(Filesystem.file_path) as file_path  min(_time)
    as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Filesystem where Filesystem.file_path=*Windows\\AppPatch\\Custom*
    by Filesystem.action Filesystem.dest Filesystem.file_access_time Filesystem.file_create_time
    Filesystem.file_hash Filesystem.file_modify_time Filesystem.file_name Filesystem.file_path
    Filesystem.file_acl Filesystem.file_size Filesystem.process_guid Filesystem.process_id
    Filesystem.user Filesystem.vendor_product | `security_content_ctime(lastTime)`
    | `security_content_ctime(firstTime)` |`drop_dm_object_name(Filesystem)` | `shim_database_file_creation_filter`'
provenance:
  source: splunk/security_content
  source_id: 6e4c4588-ba2f-42fa-97e6-9f6f548eaa33
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/shim_database_file_creation.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
