id: splunk-security-content-404620de-46d8-48b6-90cc-8a8d7b0876a3
name: Shim Database Installation With Suspicious Parameters
description: The following analytic detects the execution of sdbinst.exe with parameters
  indicative of silently creating a shim database. It leverages data from Endpoint
  Detection and Response (EDR) agents, focusing on process names, parent processes,
  and command-line arguments. This activity is significant because shim databases
  can be used to intercept and manipulate API calls, potentially allowing attackers
  to bypass security controls or achieve persistence. If confirmed malicious, this
  could enable unauthorized code execution, privilege escalation, or persistent access
  to the compromised system.
severity: medium
enabled: false
tags:
  mitre:
  - T1546.011
  categories:
  - endpoint
references: []
logsource:
  product: splunk
detection:
  splunk_spl: '| tstats `security_content_summariesonly` values(Processes.process)
    as process min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes
    where Processes.process_name = sdbinst.exe NOT Processes.process IN ("\"C:\\Windows\\System32\\sdbinst.exe\"",
    "C:\\Windows\\System32\\sdbinst.exe", "*-mm", "*-?", "*-m -bg") by Processes.action
    Processes.dest Processes.original_file_name Processes.parent_process Processes.parent_process_exec
    Processes.parent_process_guid Processes.parent_process_id Processes.parent_process_name
    Processes.parent_process_path Processes.process Processes.process_exec Processes.process_guid
    Processes.process_hash Processes.process_id Processes.process_integrity_level
    Processes.process_name Processes.process_path Processes.user Processes.user_id
    Processes.vendor_product | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)` | `shim_database_installation_with_suspicious_parameters_filter`'
provenance:
  source: splunk/security_content
  source_id: 404620de-46d8-48b6-90cc-8a8d7b0876a3
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/shim_database_installation_with_suspicious_parameters.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
