id: splunk-security-content-fdb0f805-74e4-4539-8c00-618927333aae
name: Spike in File Writes
description: The following analytic detects a sharp increase in the number of files
  written to a specific host. It leverages the Endpoint.Filesystem data model, focusing
  on 'created' actions and comparing current file write counts against historical
  averages and standard deviations. This activity is significant as a sudden spike
  in file writes can indicate malicious activities such as ransomware encryption or
  data exfiltration. If confirmed malicious, this behavior could lead to significant
  data loss, system compromise, or further propagation of malware within the network.
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references: []
logsource:
  product: splunk
detection:
  splunk_spl: "| tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Filesystem\n\
    \  WHERE Filesystem.action=created\n  BY _time span=1h, Filesystem.dest\n| `drop_dm_object_name(Filesystem)`\n\
    | eventstats max(_time) as maxtime\n| stats count as num_data_samples max(eval(if(_time\
    \ >= relative_time(maxtime, \"-1d@d\"), count, null))) as \"count\" avg(eval(if(_time<relative_time(maxtime,\
    \ \"-1d@d\"), count,null))) as avg stdev(eval(if(_time<relative_time(maxtime,\
    \ \"-1d@d\"), count, null))) as stdev\n  BY \"dest\"\n| eval upperBound=(avg+stdev*4),\
    \ isOutlier=if((count > upperBound) AND num_data_samples >=20, 1, 0)\n| search\
    \ isOutlier=1\n| `spike_in_file_writes_filter`"
provenance:
  source: splunk/security_content
  source_id: fdb0f805-74e4-4539-8c00-618927333aae
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/spike_in_file_writes.yml
notes:
  splunk_status: experimental
  splunk_data_source: []
  quarantine_reason: 'upstream status: experimental'
