id: splunk-security-content-347fd388-da87-11eb-836d-acde48001122
name: Spoolsv Writing a DLL - Sysmon
description: The following analytic detects `spoolsv.exe` writing a `.dll` file, which
  is unusual behavior and may indicate exploitation of vulnerabilities like CVE-2021-34527
  (PrintNightmare). This detection leverages Sysmon EventID 11 to monitor file creation
  events in the `\spool\drivers\x64\` directory. This activity is significant because
  `spoolsv.exe` typically does not write DLL files, and such behavior could signify
  an ongoing attack. If confirmed malicious, this could allow an attacker to execute
  arbitrary code, escalate privileges, or maintain persistence on the compromised
  system.
severity: medium
enabled: false
tags:
  mitre:
  - T1547.012
  categories:
  - endpoint
references:
- https://github.com/cube0x0/impacket/commit/73b9466c17761384ece11e1028ec6689abad6818
- https://www.truesec.com/hub/blog/fix-for-printnightmare-cve-2021-1675-exploit-to-keep-your-print-servers-running-while-a-patch-is-not-available
- https://www.truesec.com/hub/blog/exploitable-critical-rce-vulnerability-allows-regular-users-to-fully-compromise-active-directory-printnightmare-cve-2021-1675
- https://www.reddit.com/r/msp/comments/ob6y02/critical_vulnerability_printnightmare_exposes
logsource:
  product: splunk
detection:
  splunk_spl: '`sysmon` EventID=11 process_name=spoolsv.exe file_path="*\\spool\\drivers\\x64\\*"
    file_name=*.dll | stats count min(_time) as firstTime max(_time) as lastTime by
    action dest file_name file_path  process_guid process_id user_id vendor_product
    | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `spoolsv_writing_a_dll___sysmon_filter`'
provenance:
  source: splunk/security_content
  source_id: 347fd388-da87-11eb-836d-acde48001122
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/spoolsv_writing_a_dll___sysmon.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
