id: splunk-security-content-473bd65f-06ca-4dfe-a2b8-ba04ab4a0084
name: Suspicious Email Attachment Extensions
description: The following analytic detects emails containing attachments with suspicious
  file extensions. It leverages the Email data model in Splunk, using the tstats command
  to identify emails where the attachment filename is not empty. This detection is
  significant for SOC analysts as it highlights potential phishing or malware delivery
  attempts, which are common vectors for data breaches and malware infections. If
  confirmed malicious, this activity could lead to unauthorized access to sensitive
  information, system compromise, or data exfiltration. Immediate review and analysis
  of the identified emails and attachments are crucial to mitigate these risks.
severity: medium
enabled: false
tags:
  mitre:
  - T1566.001
  categories:
  - application
references: []
logsource:
  product: splunk
detection:
  splunk_spl: "| tstats `security_content_summariesonly` count min(_time) as firstTime\
    \ max(_time)\nas lastTime from datamodel=Email.All_Email where All_Email.file_name=\"\
    *\"\n\nby All_Email.src_user All_Email.file_name All_Email.file_size All_Email.message_id\n\
    \   All_Email.message_info All_Email.process All_Email.process_id All_Email.orig_dest\n\
    \   All_Email.orig_recipient\n\n| `drop_dm_object_name(All_Email)`\n| `security_content_ctime(firstTime)`\n\
    | `security_content_ctime(lastTime)`\n| lookup update=true is_suspicious_file_extension_lookup\
    \ file_name OUTPUT suspicious\n| search suspicious=true\n| `suspicious_email_attachment_extensions_filter`"
provenance:
  source: splunk/security_content
  source_id: 473bd65f-06ca-4dfe-a2b8-ba04ab4a0084
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/application/suspicious_email_attachment_extensions.yml
notes:
  splunk_status: experimental
  splunk_data_source: []
  quarantine_reason: 'upstream status: experimental'
