id: splunk-security-content-a6b3ab4e-dd77-4213-95fa-fc94701995e0
name: Suspicious Reg exe Process
description: The following analytic identifies instances of reg.exe being launched
  from a command prompt (cmd.exe) that was not initiated by the user, as indicated
  by a parent process other than explorer.exe. This detection leverages data from
  Endpoint Detection and Response (EDR) agents, focusing on process and parent process
  names. This activity is significant because reg.exe is often used in registry manipulation,
  which can be indicative of malicious behavior such as persistence mechanisms or
  system configuration changes. If confirmed malicious, this could allow an attacker
  to modify critical system settings, potentially leading to privilege escalation
  or persistent access.
severity: medium
enabled: false
tags:
  mitre:
  - T1112
  categories:
  - endpoint
references:
- https://car.mitre.org/wiki/CAR-2013-03-001/
logsource:
  product: splunk
detection:
  splunk_spl: "| tstats `security_content_summariesonly` count min(_time) as firstTime\
    \ max(_time) as lastTime FROM datamodel=Endpoint.Processes\n  WHERE Processes.parent_process_name\
    \ != explorer.exe Processes.process_name =cmd.exe\n  BY Processes.action Processes.dest\
    \ Processes.original_file_name\n     Processes.parent_process Processes.parent_process_exec\
    \ Processes.parent_process_guid\n     Processes.parent_process_id Processes.parent_process_name\
    \ Processes.parent_process_path\n     Processes.process Processes.process_exec\
    \ Processes.process_guid\n     Processes.process_hash Processes.process_id Processes.process_integrity_level\n\
    \     Processes.process_name Processes.process_path Processes.user\n     Processes.user_id\
    \ Processes.vendor_product\n| `drop_dm_object_name(\"Processes\")`\n| `security_content_ctime(firstTime)`\n\
    | `security_content_ctime(lastTime)`\n| search [\n| tstats `security_content_summariesonly`\
    \ count FROM datamodel=Endpoint.Processes\n  WHERE Processes.parent_process_name=cmd.exe\
    \ Processes.process_name= reg.exe\n  BY Processes.parent_process_id Processes.dest\
    \ Processes.process_name\n| `drop_dm_object_name(\"Processes\")`\n| `security_content_ctime(firstTime)`\n\
    | `security_content_ctime(lastTime)`\n| rename parent_process_id as process_id\n\
    | dedup process_id\n| table process_id dest]\n| `suspicious_reg_exe_process_filter`"
provenance:
  source: splunk/security_content
  source_id: a6b3ab4e-dd77-4213-95fa-fc94701995e0
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/suspicious_reg_exe_process.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
