id: splunk-security-content-5be109e6-1ac5-11ec-b421-acde48001122
name: Suspicious WAV file in Appdata Folder
description: The following analytic detects the creation of .wav files in the AppData
  folder, a behavior associated with Remcos RAT malware, which stores audio recordings
  in this location for data exfiltration. The detection leverages endpoint process
  and filesystem data to identify .wav file creation within the AppData\Roaming directory.
  This activity is significant as it indicates potential unauthorized data collection
  and exfiltration by malware. If confirmed malicious, this could lead to sensitive
  information being sent to an attacker's command and control server, compromising
  the affected system's confidentiality.
severity: medium
enabled: false
tags:
  mitre:
  - T1113
  categories:
  - endpoint
references:
- https://success.trendmicro.com/dcx/s/solution/1123281-remcos-malware-information?language=en_US
- https://blog.malwarebytes.com/threat-intelligence/2021/07/remcos-rat-delivered-via-visual-basic/
logsource:
  product: splunk
detection:
  splunk_spl: '| tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Processes
    where Processes.process_name=*.exe Processes.process_path="*\\appdata\\Roaming\\*"
    by _time span=1h Processes.action Processes.dest Processes.original_file_name
    Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
    Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
    Processes.process Processes.process_exec Processes.process_guid Processes.process_hash
    Processes.process_id Processes.process_integrity_level Processes.process_name
    Processes.process_path Processes.user Processes.user_id Processes.vendor_product
    | `drop_dm_object_name(Processes)` |rename process_guid as proc_guid | join proc_guid,
    _time [ | tstats `security_content_summariesonly` count min(_time) as firstTime
    max(_time) as lastTime FROM datamodel=Endpoint.Filesystem where Filesystem.file_name
    IN ("*.wav") Filesystem.file_path = "*\\appdata\\Roaming\\*" by _time span=1h
    Filesystem.dest Filesystem.file_create_time Filesystem.file_name Filesystem.file_path
    Filesystem.process_guid | `drop_dm_object_name(Filesystem)` |rename process_guid
    as proc_guid | fields file_name file_path process_name process_path process dest
    file_create_time _time proc_guid] | `suspicious_wav_file_in_appdata_folder_filter`'
provenance:
  source: splunk/security_content
  source_id: 5be109e6-1ac5-11ec-b421-acde48001122
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/suspicious_wav_file_in_appdata_folder.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
