id: splunk-security-content-e5928ff3-23eb-4d8b-b8a4-dcbc844fdfbe
name: Unload Sysmon Filter Driver
description: The following analytic detects the use of `fltMC.exe` to unload the Sysmon
  driver, which stops Sysmon from collecting data. It leverages Endpoint Detection
  and Response (EDR) logs, focusing on process names and command-line executions.
  This activity is significant because disabling Sysmon can blind security monitoring,
  allowing malicious actions to go undetected. If confirmed malicious, this could
  enable attackers to execute further attacks without being logged, leading to potential
  data breaches, privilege escalation, or persistent access within the environment.
severity: medium
enabled: false
tags:
  mitre:
  - T1562.001
  categories:
  - endpoint
references:
- https://www.ired.team/offensive-security/defense-evasion/unloading-sysmon-driver
logsource:
  product: splunk
detection:
  splunk_spl: "| tstats `security_content_summariesonly` count min(_time) as firstTime\
    \ values(Processes.process) as process max(_time) as lastTime FROM datamodel=Endpoint.Processes\n\
    \  WHERE Processes.process_name=fltMC.exe\n    AND\n    Processes.process=*unload*\n\
    \    AND\n    Processes.process=*SysmonDrv*\n  BY Processes.action Processes.dest\
    \ Processes.original_file_name\n     Processes.parent_process Processes.parent_process_exec\
    \ Processes.parent_process_guid\n     Processes.parent_process_id Processes.parent_process_name\
    \ Processes.parent_process_path\n     Processes.process Processes.process_exec\
    \ Processes.process_guid\n     Processes.process_hash Processes.process_id Processes.process_integrity_level\n\
    \     Processes.process_name Processes.process_path Processes.user\n     Processes.user_id\
    \ Processes.vendor_product\n| `drop_dm_object_name(\"Processes\")`\n| `security_content_ctime(firstTime)`\n\
    | `security_content_ctime(lastTime)`\n| table firstTime lastTime dest user count\
    \ process_name process_id parent_process_name process\n| `unload_sysmon_filter_driver_filter`"
provenance:
  source: splunk/security_content
  source_id: e5928ff3-23eb-4d8b-b8a4-dcbc844fdfbe
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/unload_sysmon_filter_driver.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
