id: splunk-security-content-c77162d3-f93c-45cc-80c8-22f6a4264e7f
name: Unusually Long Command Line
description: The following analytic detects unusually long command lines, which may
  indicate malicious activity. It leverages data from Endpoint Detection and Response
  (EDR) agents, focusing on the length of command lines executed on hosts. This behavior
  is significant because attackers often use obfuscated or complex command lines to
  evade detection and execute malicious payloads. If confirmed malicious, this activity
  could lead to data theft, ransomware deployment, or further system compromise. Analysts
  should investigate the source and content of the command line, inspect relevant
  artifacts, and review concurrent processes to identify potential threats.
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references: []
logsource:
  product: splunk
detection:
  splunk_spl: "| tstats `security_content_summariesonly` count min(_time) as firstTime\
    \ max(_time) as lastTime FROM datamodel=Endpoint.Processes\n  BY Processes.action\
    \ Processes.dest Processes.original_file_name\n     Processes.parent_process Processes.parent_process_exec\
    \ Processes.parent_process_guid\n     Processes.parent_process_id Processes.parent_process_name\
    \ Processes.parent_process_path\n     Processes.process Processes.process_exec\
    \ Processes.process_guid\n     Processes.process_hash Processes.process_id Processes.process_integrity_level\n\
    \     Processes.process_name Processes.process_path Processes.user\n     Processes.user_id\
    \ Processes.vendor_product\n| `drop_dm_object_name(\"Processes\")`\n| `security_content_ctime(firstTime)`\n\
    | `security_content_ctime(lastTime)`\n| eval processlen=len(process)\n| eventstats\
    \ stdev(processlen) as stdev, avg(processlen) as avg\n  BY dest\n| stats max(processlen)\
    \ as maxlen, values(stdev) as stdevperhost, values(avg) as avgperhost\n  BY dest,\
    \ user, process_name,\n     process\n| eval threshold = 3\n| where maxlen > ((threshold*stdevperhost)\
    \ + avgperhost)\n| `unusually_long_command_line_filter`"
provenance:
  source: splunk/security_content
  source_id: c77162d3-f93c-45cc-80c8-22f6a4264e7f
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/unusually_long_command_line.yml
notes:
  splunk_status: experimental
  splunk_data_source: []
  quarantine_reason: 'upstream status: experimental'
