id: splunk-security-content-b6e0ff70-b122-4227-9368-4cf322ab43c3
name: USN Journal Deletion
description: The following analytic detects the deletion of the USN Journal using
  the fsutil.exe utility. It leverages data from Endpoint Detection and Response (EDR)
  agents, focusing on process execution logs that include command-line details. This
  activity is significant because the USN Journal maintains a log of all changes made
  to files on the disk, and its deletion can be an indicator of an attempt to cover
  tracks or hinder forensic investigations. If confirmed malicious, this action could
  allow an attacker to obscure their activities, making it difficult to trace file
  modifications and potentially compromising incident response efforts.
severity: medium
enabled: false
tags:
  mitre:
  - T1070
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/fsutil-usn
logsource:
  product: splunk
detection:
  splunk_spl: "| tstats `security_content_summariesonly`\n  count values(Processes.process)\
    \ as process\n        values(Processes.parent_process) as parent_process\n   \
    \     min(_time) as firstTime\n        max(_time) as lastTime\n\nfrom datamodel=Endpoint.Processes\
    \ where\n\nProcesses.process_name=fsutil.exe\nProcesses.process = \"*usn*\"\n\
    Processes.process = \"*deletejournal*\"\n\nby Processes.action Processes.dest\
    \ Processes.original_file_name Processes.parent_process\n   Processes.parent_process_exec\
    \ Processes.parent_process_guid Processes.parent_process_id\n   Processes.parent_process_name\
    \ Processes.parent_process_path Processes.process Processes.process_exec\n   Processes.process_guid\
    \ Processes.process_hash Processes.process_id Processes.process_integrity_level\n\
    \   Processes.process_name Processes.process_path Processes.user Processes.user_id\
    \ Processes.vendor_product\n\n| `drop_dm_object_name(Processes)`\n| `security_content_ctime(firstTime)`\n\
    | `security_content_ctime(lastTime)`\n| `usn_journal_deletion_filter`"
provenance:
  source: splunk/security_content
  source_id: b6e0ff70-b122-4227-9368-4cf322ab43c3
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/usn_journal_deletion.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
