id: splunk-security-content-ec3b7601-689a-4463-94e0-c9f45638efb9
name: Web Servers Executing Suspicious Processes
description: The following analytic detects the execution of suspicious processes
  on systems identified as web servers. It leverages the Splunk data model "Endpoint.Processes"
  to search for specific process names such as "whoami", "ping", "iptables", "wget",
  "service", and "curl". This activity is significant because these processes are
  often used by attackers for reconnaissance, persistence, or data exfiltration. If
  confirmed malicious, this could lead to data theft, deployment of additional malware,
  or even ransomware attacks. Immediate investigation is required to determine the
  legitimacy of the activity and mitigate potential threats.
severity: medium
enabled: false
tags:
  mitre:
  - T1082
  categories:
  - endpoint
references: []
logsource:
  product: splunk
detection:
  splunk_spl: "| tstats `security_content_summariesonly` count min(_time) as firstTime\
    \ max(_time) as lastTime FROM datamodel=Endpoint.Processes\n  WHERE Processes.dest_category=\"\
    web_server\"\n    AND\n    (Processes.process=\"*whoami*\"\n    OR\n    Processes.process=\"\
    *ping*\"\n    OR\n    Processes.process=\"*iptables*\"\n    OR\n    Processes.process=\"\
    *wget*\"\n    OR\n    Processes.process=\"*service*\"\n    OR\n    Processes.process=\"\
    *curl*\")\n  BY Processes.action Processes.dest Processes.original_file_name\n\
    \     Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid\n\
    \     Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path\n\
    \     Processes.process Processes.process_exec Processes.process_guid\n     Processes.process_hash\
    \ Processes.process_id Processes.process_integrity_level\n     Processes.process_name\
    \ Processes.process_path Processes.user\n     Processes.user_id Processes.vendor_product\n\
    | `drop_dm_object_name(Processes)`\n| `security_content_ctime(firstTime)`\n| `security_content_ctime(lastTime)`\n\
    | `web_servers_executing_suspicious_processes_filter`"
provenance:
  source: splunk/security_content
  source_id: ec3b7601-689a-4463-94e0-c9f45638efb9
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/web_servers_executing_suspicious_processes.yml
notes:
  splunk_status: experimental
  splunk_data_source: []
  quarantine_reason: 'upstream status: experimental'
