id: splunk-security-content-8467d8cd-b0f9-46fa-ac84-a30ad138983e
name: Windows Impair Defense Disable Defender Firewall And Network
description: The following analytic detects modifications in the Windows registry
  to disable firewall and network protection settings within Windows Defender Security
  Center. It leverages data from the Endpoint.Registry data model, specifically monitoring
  changes to the UILockdown registry value. This activity is significant as it may
  indicate an attempt to impair system defenses, potentially restricting users from
  modifying firewall or network protection settings. If confirmed malicious, this
  could allow an attacker to weaken the system's security posture, making it more
  vulnerable to further attacks and unauthorized access.
severity: medium
enabled: false
tags:
  mitre:
  - T1562.001
  categories:
  - endpoint
references:
- https://x.com/malmoeb/status/1742604217989415386?s=20
- https://github.com/undergroundwires/privacy.sexy
logsource:
  product: splunk
detection:
  splunk_spl: '| tstats `security_content_summariesonly` count min(_time) as firstTime
    max(_time) as lastTime FROM datamodel=Endpoint.Registry where Registry.registry_path=
    "*\\Windows Defender Security Center\\Firewall and network protection\\UILockdown"
    Registry.registry_value_data="0x00000001" by Registry.action Registry.dest Registry.process_guid
    Registry.process_id Registry.registry_hive Registry.registry_path Registry.registry_key_name
    Registry.registry_value_data Registry.registry_value_name Registry.registry_value_type
    Registry.status Registry.user Registry.vendor_product | `drop_dm_object_name(Registry)`
    | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `windows_impair_defense_disable_defender_firewall_and_network_filter`'
provenance:
  source: splunk/security_content
  source_id: 8467d8cd-b0f9-46fa-ac84-a30ad138983e
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/windows_impair_defense_disable_defender_firewall_and_network.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
