id: splunk-security-content-b061dfcc-f0aa-42cc-a6d4-a87f172acb79
name: Windows Impair Defenses Disable HVCI
description: The following analytic detects the disabling of Hypervisor-protected
  Code Integrity (HVCI) by monitoring changes in the Windows registry. It leverages
  data from the Endpoint datamodel, specifically focusing on registry paths and values
  related to HVCI settings. This activity is significant because HVCI helps protect
  the kernel and system processes from tampering by malicious code. If confirmed malicious,
  disabling HVCI could allow attackers to execute unsigned kernel-mode code, potentially
  leading to kernel-level rootkits or other severe security breaches.
severity: medium
enabled: false
tags:
  mitre:
  - T1562.001
  categories:
  - endpoint
references:
- https://www.microsoft.com/en-us/security/blog/2023/04/11/guidance-for-investigating-attacks-using-cve-2022-21894-the-blacklotus-campaign/
logsource:
  product: splunk
detection:
  splunk_spl: '| tstats `security_content_summariesonly` count min(_time) as firstTime
    max(_time) as lastTime from datamodel=Endpoint.Registry where Registry.registry_path
    = "*\\CurrentControlSet\\Control\\DeviceGuard\\Scenarios\\HypervisorEnforcedCodeIntegrity\\Enabled"
    Registry.registry_value_data="0x00000000" by Registry.action Registry.dest Registry.process_guid
    Registry.process_id Registry.registry_hive Registry.registry_path Registry.registry_key_name
    Registry.registry_value_data Registry.registry_value_name Registry.registry_value_type
    Registry.status Registry.user Registry.vendor_product | `drop_dm_object_name(Registry)`
    | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `windows_impair_defenses_disable_hvci_filter`'
provenance:
  source: splunk/security_content
  source_id: b061dfcc-f0aa-42cc-a6d4-a87f172acb79
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/windows_impair_defenses_disable_hvci.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
