id: splunk-security-content-326fdf44-b90c-4d2e-adca-1fd140b10536
name: Windows LOLBAS Executed Outside Expected Path
description: 'The following analytic identifies a LOLBAS process being executed outside
  of it''s expected location.

  Processes being executed outside of expected locations may be an indicator that
  an adversary is attempting to evade defenses or execute malicious code.

  The LOLBAS project documents Windows native binaries that can be abused by threat
  actors to perform tasks like executing malicious code.'
severity: medium
enabled: false
tags:
  mitre:
  - T1036.005
  - T1218.011
  categories:
  - endpoint
references:
- https://attack.mitre.org/techniques/T1036/
- https://attack.mitre.org/techniques/T1036/005/
logsource:
  product: splunk
detection:
  splunk_spl: "| tstats `security_content_summariesonly`\n  count min(_time) as firstTime\n\
    \        max(_time) as lastTime\n  FROM datamodel=Endpoint.Processes where\n\n\
    \  NOT Processes.process_path IN (\n    \"*\\\\PROGRA~*\",\n    \"*\\\\Program\
    \ Files \\(x86\\)\\\\\",\n    \"*\\\\Program Files\\\\\",\n    \"*:\\\\Windows\\\
    \\System32\\\\*\",\n    \"*:\\\\Windows\\\\SysWOW64\\\\*\",\n    \"*:\\\\Windows\\\
    \\WinSxS\\\\*\"\n  )\n\nby Processes.action Processes.dest Processes.original_file_name\
    \ Processes.parent_process\n   Processes.parent_process_exec Processes.parent_process_guid\
    \ Processes.parent_process_id\n   Processes.parent_process_name Processes.parent_process_path\
    \ Processes.process\n   Processes.process_exec Processes.process_guid Processes.process_hash\n\
    \   Processes.process_id Processes.process_integrity_level Processes.process_name\n\
    \   Processes.process_path Processes.user Processes.user_id Processes.vendor_product\n\
    \n|`drop_dm_object_name(Processes)`\n| lookup lolbas_file_path lolbas_file_name\
    \ as process_name OUTPUT description as desc\n| lookup lolbas_file_path lolbas_file_name\
    \ as process_name lolbas_file_path as process_path OUTPUT description as is_lolbas_path\n\
    | search desc!=\"false\" AND is_lolbas_path=\"false\"\n| `security_content_ctime(firstTime)`\n\
    | `security_content_ctime(lastTime)`\n| `windows_lolbas_executed_outside_expected_path_filter`"
provenance:
  source: splunk/security_content
  source_id: 326fdf44-b90c-4d2e-adca-1fd140b10536
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/windows_lolbas_executed_outside_expected_path.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
