id: splunk-security-content-cfa7b9ac-43f0-11ec-9b48-acde48001122
name: Windows InstallUtil Uninstall Option
description: The following analytic detects the use of the Windows InstallUtil.exe
  binary with the `/u` (uninstall) switch, which can execute code while bypassing
  application control. This detection leverages data from Endpoint Detection and Response
  (EDR) agents, focusing on process names, parent processes, and command-line executions.
  This activity is significant because it can indicate an attempt to execute malicious
  code without administrative privileges. If confirmed malicious, an attacker could
  achieve code execution, potentially leading to further system compromise or persistence
  within the environment.
severity: medium
enabled: false
tags:
  mitre:
  - T1218.004
  categories:
  - endpoint
references:
- https://evi1cg.me/archives/AppLocker_Bypass_Techniques.html#menu_index_12
- https://github.com/api0cradle/UltimateAppLockerByPassList/blob/master/md/Installutil.exe.md
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1218.004/T1218.004.md
logsource:
  product: splunk
detection:
  splunk_spl: '| tstats `security_content_summariesonly` count min(_time) as firstTime
    max(_time) as lastTime from datamodel=Endpoint.Processes where `process_installutil`
    Processes.process IN ("*/u*", "*uninstall*") NOT (Processes.process IN ("*C:\\WINDOWS\\CCM\\*"))
    NOT (Processes.parent_process_name IN ("Microsoft.SharePoint.Migration.ClientInstaller.exe"))
    by Processes.action Processes.dest Processes.original_file_name Processes.parent_process
    Processes.parent_process_exec Processes.parent_process_guid Processes.parent_process_id
    Processes.parent_process_name Processes.parent_process_path Processes.process
    Processes.process_exec Processes.process_guid Processes.process_hash Processes.process_id
    Processes.process_integrity_level Processes.process_name Processes.process_path
    Processes.user Processes.user_id Processes.vendor_product | `drop_dm_object_name(Processes)`
    | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`| `windows_installutil_uninstall_option_filter`'
provenance:
  source: splunk/security_content
  source_id: cfa7b9ac-43f0-11ec-9b48-acde48001122
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/windows_installutil_uninstall_option.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
