id: splunk-security-content-12c80db8-ef62-4456-92df-b23e1b3219f6
name: Windows Enable Win32 ScheduledJob via Registry
description: The following analytic detects the creation of a new DWORD value named
  "EnableAt" in the registry path "HKLM:\SOFTWARE\Microsoft\Windows NT\CurrentVersion\Schedule\Configuration".
  This modification enables the use of the at.exe or wmi Win32_ScheduledJob commands
  to add scheduled tasks on a Windows endpoint. The detection leverages registry event
  data from the Endpoint datamodel. This activity is significant because it may indicate
  that an attacker is enabling the ability to schedule tasks, potentially to execute
  malicious code at specific times or intervals. If confirmed malicious, this could
  allow persistent code execution on the system.
severity: medium
enabled: false
tags:
  mitre:
  - T1053.005
  categories:
  - endpoint
references:
- https://securityonline.info/wmiexec-regout-get-outputdata-response-from-registry/
- https://learn.microsoft.com/en-us/windows/win32/cimwin32prov/win32-scheduledjob
logsource:
  product: splunk
detection:
  splunk_spl: '| tstats `security_content_summariesonly` count values(Registry.registry_key_name)
    as registry_key_name values(Registry.registry_path) as registry_path min(_time)
    as firstTime max(_time) as lastTime from datamodel=Endpoint.Registry where Registry.registry_path="*\\CurrentVersion\\Schedule\\Configuration*"
    Registry.registry_value_name=EnableAt by Registry.action Registry.dest Registry.process_guid
    Registry.process_id Registry.registry_hive Registry.registry_path Registry.registry_key_name
    Registry.registry_value_data Registry.registry_value_name Registry.registry_value_type
    Registry.status Registry.user Registry.vendor_product | `security_content_ctime(lastTime)`
    | `security_content_ctime(firstTime)` | `drop_dm_object_name(Registry)` | `windows_enable_win32_scheduledjob_via_registry_filter`'
provenance:
  source: splunk/security_content
  source_id: 12c80db8-ef62-4456-92df-b23e1b3219f6
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/windows_enable_win32_scheduledjob_via_registry.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
