id: splunk-security-content-4bc788d3-c83a-48c5-a4e2-e0c6dba57889
name: Windows Modify Registry DisAllow Windows App
description: The following analytic detects modifications to the Windows registry
  aimed at preventing the execution of specific computer programs. It leverages data
  from the Endpoint.Registry datamodel, focusing on changes to the registry path "*\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Policies\\Explorer\\DisallowRun*"
  with a value of "0x00000001". This activity is significant as it can indicate an
  attempt to disable security tools, a tactic used by malware like Azorult. If confirmed
  malicious, this could allow an attacker to evade detection and maintain persistence
  on the compromised host.
severity: medium
enabled: false
tags:
  mitre:
  - T1112
  categories:
  - endpoint
references:
- https://app.any.run/tasks/a6f2ffe2-e6e2-4396-ae2e-04ea0143f2d8/
logsource:
  product: splunk
detection:
  splunk_spl: '| tstats `security_content_summariesonly` count min(_time) as firstTime
    max(_time) as lastTime FROM datamodel=Endpoint.Registry where Registry.registry_path=
    "*\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Policies\\Explorer\\DisallowRun*"
    Registry.registry_value_data="0x00000001" by Registry.action Registry.dest Registry.process_guid
    Registry.process_id Registry.registry_hive Registry.registry_path Registry.registry_key_name
    Registry.registry_value_data Registry.registry_value_name Registry.registry_value_type
    Registry.status Registry.user Registry.vendor_product | `drop_dm_object_name(Registry)`
    | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `windows_modify_registry_disallow_windows_app_filter`'
provenance:
  source: splunk/security_content
  source_id: 4bc788d3-c83a-48c5-a4e2-e0c6dba57889
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/windows_modify_registry_disallow_windows_app.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
