id: splunk-security-content-93048164-3358-4af0-8680-aa5f38440516
name: Windows Modify Registry EnableLinkedConnections
description: The following analytic detects a suspicious modification to the Windows
  registry setting for EnableLinkedConnections. It leverages data from the Endpoint.Registry
  datamodel to identify changes where the registry path is "*\\Microsoft\\Windows\\CurrentVersion\\Policies\\System\\EnableLinkedConnections"
  and the value is set to "0x00000001". This activity is significant because enabling
  linked connections can allow network shares to be accessed with both standard and
  administrator-level privileges, a technique often abused by malware like BlackByte
  ransomware. If confirmed malicious, this could lead to unauthorized access to sensitive
  network resources, escalating the attacker's privileges.
severity: medium
enabled: false
tags:
  mitre:
  - T1112
  categories:
  - endpoint
references:
- https://www.microsoft.com/en-us/security/blog/2023/07/06/the-five-day-job-a-blackbyte-ransomware-intrusion-case-study/
logsource:
  product: splunk
detection:
  splunk_spl: '| tstats `security_content_summariesonly` count min(_time) as firstTime
    max(_time) as lastTime FROM datamodel=Endpoint.Registry WHERE (Registry.registry_path=
    "*\\Microsoft\\Windows\\CurrentVersion\\Policies\\System\\EnableLinkedConnections"
    Registry.registry_value_data = "0x00000001") by Registry.action Registry.dest
    Registry.process_guid Registry.process_id Registry.registry_hive Registry.registry_path
    Registry.registry_key_name Registry.registry_value_data Registry.registry_value_name
    Registry.registry_value_type Registry.status Registry.user Registry.vendor_product
    | `drop_dm_object_name(Registry)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
    | `windows_modify_registry_enablelinkedconnections_filter`'
provenance:
  source: splunk/security_content
  source_id: 93048164-3358-4af0-8680-aa5f38440516
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/windows_modify_registry_enablelinkedconnections.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
