id: splunk-security-content-8a1259cb-0ea7-409c-8bfe-74bad89259f9
name: Windows AD ServicePrincipalName Added To Domain Account
description: The following analytic detects the addition of a Service Principal Name
  (SPN) to a domain account. It leverages Windows Event Code 5136 and monitors changes
  to the servicePrincipalName attribute. This activity is significant because it may
  indicate an attempt to perform Kerberoasting, a technique where attackers extract
  and crack service account passwords offline. If confirmed malicious, this could
  allow an attacker to obtain cleartext passwords, leading to unauthorized access
  and potential lateral movement within the domain environment.
severity: medium
enabled: false
tags:
  mitre:
  - T1098
  categories:
  - endpoint
references:
- https://adsecurity.org/?p=3466
- https://www.thehacker.recipes/ad/movement/dacl/targeted-kerberoasting
- https://learn.microsoft.com/en-us/windows/security/threat-protection/auditing/event-5136
- https://www.ired.team/offensive-security-experiments/active-directory-kerberos-abuse/t1208-kerberoasting
logsource:
  product: splunk
detection:
  splunk_spl: '`wineventlog_security` EventCode=5136 AttributeLDAPDisplayName=servicePrincipalName
    OperationType="%%14674" ObjectClass=user | stats values(ObjectDN) as ObjectDN
    by _time, Computer, SubjectUserName, AttributeValue | rex field=ObjectDN "^CN=(?P<user>[a-zA-Z0-9!#$%&''@^_{}~.-]+),"
    | rename Computer as dest, SubjectUserName as src_user  | `windows_ad_serviceprincipalname_added_to_domain_account_filter`'
provenance:
  source: splunk/security_content
  source_id: 8a1259cb-0ea7-409c-8bfe-74bad89259f9
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/windows_ad_serviceprincipalname_added_to_domain_account.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
