id: splunk-security-content-25212358-948e-11ec-ad47-acde48001122
name: Windows Service Creation Using Registry Entry
description: The following analytic detects the modification of registry keys that
  define Windows services using reg.exe. This detection leverages Splunk to search
  for specific keywords in the registry path, value name, and value data fields. This
  activity is significant because it indicates potential unauthorized changes to service
  configurations, a common persistence technique used by attackers. If confirmed malicious,
  this could allow an attacker to maintain access, escalate privileges, or move laterally
  within the network, leading to data theft, ransomware, or other damaging outcomes.
severity: medium
enabled: false
tags:
  mitre:
  - T1574.011
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/36d49de4c8b00bf36054294b4a1fcbab3917d7c5/atomics/T1574.011/T1574.011.md
logsource:
  product: splunk
detection:
  splunk_spl: '| tstats `security_content_summariesonly` count min(_time) as firstTime
    max(_time) as lastTime FROM datamodel=Endpoint.Registry WHERE (Registry.registry_path="*\\SYSTEM\\CurrentControlSet\\Services*"
    Registry.registry_value_name = ImagePath) by Registry.action Registry.dest Registry.process_guid
    Registry.process_id Registry.registry_hive Registry.registry_path Registry.registry_key_name
    Registry.registry_value_data Registry.registry_value_name Registry.registry_value_type
    Registry.status Registry.user Registry.vendor_product | `drop_dm_object_name(Registry)`
    | where isnotnull(registry_value_data) | `security_content_ctime(firstTime)` |
    `security_content_ctime(lastTime)` | `windows_service_creation_using_registry_entry_filter`'
provenance:
  source: splunk/security_content
  source_id: 25212358-948e-11ec-ad47-acde48001122
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/windows_service_creation_using_registry_entry.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
