id: splunk-security-content-2e65afe0-9a75-4487-bd87-ada9a9f1b9af
name: Windows Credentials from Password Stores Chrome Extension Access
description: The following analytic detects non-Chrome processes attempting to access
  the Chrome extensions file. It leverages Windows Security Event logs, specifically
  event code 4663, to identify this behavior. This activity is significant because
  adversaries may exploit this file to extract sensitive information from the Chrome
  browser, posing a security risk. If confirmed malicious, this could lead to unauthorized
  access to stored credentials and other sensitive data, potentially compromising
  the security of the affected system and broader network.
severity: medium
enabled: false
tags:
  mitre:
  - T1012
  categories:
  - endpoint
references:
- https://malpedia.caad.fkie.fraunhofer.de/details/win.redline_stealer
logsource:
  product: splunk
detection:
  splunk_spl: '`wineventlog_security` EventCode=4663 object_file_path="*\\AppData\\Local\\Google\\Chrome\\User
    Data\\Default\\Local Extension Settings\\*" AND NOT (process_path IN ("*:\\Windows\\explorer.exe",
    "*\\chrome.exe")) | stats count min(_time) as firstTime max(_time) as lastTime
    by object_file_name object_file_path process_name process_path  process_id EventCode
    dest | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
    | `windows_credentials_from_password_stores_chrome_extension_access_filter`'
provenance:
  source: splunk/security_content
  source_id: 2e65afe0-9a75-4487-bd87-ada9a9f1b9af
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/windows_credentials_from_password_stores_chrome_extension_access.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
