id: splunk-security-content-34502357-deb1-499a-8261-ffe144abf561
name: Windows Time Based Evasion
description: 'The following analytic detects potentially malicious processes that
  initiate a ping delay using an invalid IP address.

  It leverages data from Endpoint Detection and Response (EDR) agents, focusing on
  command-line executions involving "ping 0 -n".

  Malware like NJRAT was observed using this technique to introduce time delays for
  evasion tactics, such as delaying self-deletion.

  If confirmed malicious, this activity could indicate an active infection attempting
  to evade detection, potentially leading to further compromise and persistence within
  the environment.'
severity: medium
enabled: false
tags:
  mitre:
  - T1497.003
  categories:
  - endpoint
references:
- https://malpedia.caad.fkie.fraunhofer.de/details/win.njrat
logsource:
  product: splunk
detection:
  splunk_spl: "| tstats `security_content_summariesonly`\n  count min(_time) as firstTime\n\
    \        max(_time) as lastTime\n\nFROM datamodel=Endpoint.Processes WHERE\n\n\
    Processes.process_name = \"ping.exe\"\n(\n    Processes.parent_process IN (\n\
    \        \"*ping  0 -n *\",\n        \"*ping 0 -n *\",\n        \"*ping.exe  0\
    \ -n *\",\n        \"*ping.exe 0 -n *\"\n    )\n    OR\n    Processes.process\
    \ IN (\n        \"*ping  0 -n *\",\n        \"*ping 0 -n *\",\n        \"*ping.exe\
    \  0 -n *\",\n        \"*ping.exe 0 -n *\"\n    )\n)\n\nBY Processes.action Processes.dest\
    \ Processes.original_file_name\n   Processes.parent_process Processes.parent_process_exec\n\
    \   Processes.parent_process_guid Processes.parent_process_id\n   Processes.parent_process_name\
    \ Processes.parent_process_path\n   Processes.process Processes.process_exec Processes.process_guid\n\
    \   Processes.process_hash Processes.process_id Processes.process_integrity_level\n\
    \   Processes.process_name Processes.process_path Processes.user\n   Processes.user_id\
    \ Processes.vendor_product\n\n| `drop_dm_object_name(\"Processes\")`\n| `security_content_ctime(firstTime)`\n\
    | `security_content_ctime(lastTime)`\n| `windows_time_based_evasion_filter`"
provenance:
  source: splunk/security_content
  source_id: 34502357-deb1-499a-8261-ffe144abf561
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/windows_time_based_evasion.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
