id: splunk-security-content-bb4f3090-7ae4-11ec-897f-acde48001122
name: Windows NirSoft AdvancedRun
description: The following analytic detects the execution of AdvancedRun.exe, a tool
  with capabilities similar to remote administration programs like PsExec. It identifies
  the process by its name or original file name and flags common command-line arguments.
  This detection leverages data from Endpoint Detection and Response (EDR) agents,
  focusing on process and command-line telemetry. Monitoring this activity is crucial
  as AdvancedRun can be used for remote code execution and configuration-based automation.
  If malicious, this could allow attackers to execute arbitrary commands, escalate
  privileges, or maintain persistence within the environment.
severity: medium
enabled: false
tags:
  mitre:
  - T1588.002
  categories:
  - endpoint
references:
- http://www.nirsoft.net/utils/advanced_run.html
- https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/
logsource:
  product: splunk
detection:
  splunk_spl: "| tstats `security_content_summariesonly` count min(_time) as firstTime\
    \ max(_time) as lastTime FROM datamodel=Endpoint.Processes\n  WHERE (\n      \
    \  Processes.process_name=advancedrun.exe\n        OR\n        Processes.original_file_name=advancedrun.exe\n\
    \    )\n    Processes.process IN (\"*EXEFilename*\",\"*/cfg*\",\"*RunAs*\", \"\
    *WindowState*\")\n  BY Processes.action Processes.dest Processes.original_file_name\n\
    \     Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid\n\
    \     Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path\n\
    \     Processes.process Processes.process_exec Processes.process_guid\n     Processes.process_hash\
    \ Processes.process_id Processes.process_integrity_level\n     Processes.process_name\
    \ Processes.process_path Processes.user\n     Processes.user_id Processes.vendor_product\n\
    | `drop_dm_object_name(Processes)`\n| `security_content_ctime(firstTime)`\n| `security_content_ctime(lastTime)`\n\
    | `windows_nirsoft_advancedrun_filter`"
provenance:
  source: splunk/security_content
  source_id: bb4f3090-7ae4-11ec-897f-acde48001122
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/windows_nirsoft_advancedrun.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
