id: splunk-security-content-12bdaa0b-3c59-4489-aae1-bff6d67746ef
name: Windows Modify Registry ProxyServer
description: The following analytic detects modifications to the Windows registry
  key for setting up a proxy server. It leverages data from the Endpoint.Registry
  datamodel, focusing on changes to the "Internet Settings\\ProxyServer" registry
  path. This activity is significant as it can indicate malware or adversaries configuring
  a proxy to facilitate unauthorized communication with Command and Control (C2) servers.
  If confirmed malicious, this could allow attackers to establish persistent, covert
  channels for data exfiltration or further exploitation of the compromised host.
severity: medium
enabled: false
tags:
  mitre:
  - T1112
  categories:
  - endpoint
references:
- https://malpedia.caad.fkie.fraunhofer.de/details/win.darkgate
logsource:
  product: splunk
detection:
  splunk_spl: '| tstats `security_content_summariesonly` count min(_time) as firstTime
    max(_time) as lastTime from datamodel=Endpoint.Registry where Registry.registry_path
    = "*\\Internet Settings\\ProxyServer" by Registry.action Registry.dest Registry.process_guid
    Registry.process_id Registry.registry_hive Registry.registry_path Registry.registry_key_name
    Registry.registry_value_data Registry.registry_value_name Registry.registry_value_type
    Registry.status Registry.user Registry.vendor_product | `drop_dm_object_name(Registry)`
    | where isnotnull(registry_value_data) | `security_content_ctime(firstTime)` |
    `security_content_ctime(lastTime)` | `windows_modify_registry_proxyserver_filter`'
provenance:
  source: splunk/security_content
  source_id: 12bdaa0b-3c59-4489-aae1-bff6d67746ef
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/windows_modify_registry_proxyserver.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
