id: splunk-security-content-ed4eeacb-8d5a-488e-bc97-1ce6ded63b84
name: Windows Modify Registry Disable Toast Notifications
description: The following analytic detects modifications to the Windows registry
  that disable toast notifications. It leverages data from the Endpoint.Registry datamodel,
  specifically monitoring changes to the registry path "*\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\PushNotifications\\ToastEnabled*"
  with a value set to "0x00000000". This activity is significant because disabling
  toast notifications can prevent users from receiving critical system and application
  updates, which adversaries like Azorult exploit for defense evasion. If confirmed
  malicious, this action could allow attackers to operate undetected, leading to prolonged
  persistence and potential further compromise of the system.
severity: medium
enabled: false
tags:
  mitre:
  - T1112
  categories:
  - endpoint
references:
- https://docs.microsoft.com/en-us/windows-hardware/customize/desktop/unattend/microsoft-windows-remoteassistance-exe-fallowtogethelp
- https://app.any.run/tasks/a6f2ffe2-e6e2-4396-ae2e-04ea0143f2d8/
logsource:
  product: splunk
detection:
  splunk_spl: '| tstats `security_content_summariesonly` count min(_time) as firstTime
    max(_time) as lastTime FROM datamodel=Endpoint.Registry where Registry.registry_path=
    "*\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\PushNotifications\\ToastEnabled*"
    Registry.registry_value_data="0x00000000" by Registry.action Registry.dest Registry.process_guid
    Registry.process_id Registry.registry_hive Registry.registry_path Registry.registry_key_name
    Registry.registry_value_data Registry.registry_value_name Registry.registry_value_type
    Registry.status Registry.user Registry.vendor_product | `drop_dm_object_name(Registry)`
    | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `windows_modify_registry_disable_toast_notifications_filter`'
provenance:
  source: splunk/security_content
  source_id: ed4eeacb-8d5a-488e-bc97-1ce6ded63b84
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/windows_modify_registry_disable_toast_notifications.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
