id: splunk-security-content-68cbc9e9-2882-46f2-b636-3b5080589d58
name: Windows BitLockerToGo Process Execution
description: The following analytic detects BitLockerToGo.exe execution, which has
  been observed being abused by Lumma stealer malware. The malware leverages this
  legitimate Windows utility to manipulate registry keys, search for cryptocurrency
  wallets and credentials, and exfiltrate sensitive data. This activity is significant
  because BitLockerToGo.exe provides functionality for viewing, copying, and writing
  files as well as modifying registry branches - capabilities that the Lumma stealer
  exploits. However, note that if legitimate use of BitLockerToGo.exe is in the organization,
  this detection will
severity: medium
enabled: false
tags:
  mitre:
  - T1218
  categories:
  - endpoint
references:
- https://securelist.com/fake-captcha-delivers-lumma-amadey/114312/
logsource:
  product: splunk
detection:
  splunk_spl: "| tstats `security_content_summariesonly` count min(_time) as firstTime\
    \ max(_time) as lastTime FROM datamodel=Endpoint.Processes\n  WHERE Processes.process_name=bitlockertogo.exe\n\
    \  BY Processes.action Processes.dest Processes.original_file_name\n     Processes.parent_process\
    \ Processes.parent_process_exec Processes.parent_process_guid\n     Processes.parent_process_id\
    \ Processes.parent_process_name Processes.parent_process_path\n     Processes.process\
    \ Processes.process_exec Processes.process_guid\n     Processes.process_hash Processes.process_id\
    \ Processes.process_integrity_level\n     Processes.process_name Processes.process_path\
    \ Processes.user\n     Processes.user_id Processes.vendor_product\n| `drop_dm_object_name(Processes)`\n\
    | `security_content_ctime(firstTime)`\n| `security_content_ctime(lastTime)`\n\
    | `windows_bitlockertogo_process_execution_filter`"
provenance:
  source: splunk/security_content
  source_id: 68cbc9e9-2882-46f2-b636-3b5080589d58
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/windows_bitlockertogo_process_execution.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
