id: splunk-security-content-0f09cedd-10f1-4b9f-bdea-7a8b06ea575d
name: Windows PowerShell Script Block With Malicious String
description: The following analytic detects the execution of multiple offensive toolkits
  and commands by leveraging PowerShell Script Block Logging (EventCode=4104). This
  method captures and logs the full command sent to PowerShell, allowing for the identification
  of suspicious activities including several well-known tools used for credential
  theft, lateral movement, and persistence. If confirmed malicious, this could lead
  to unauthorized access, privilege escalation, and potential compromise of sensitive
  information within the environment.
severity: medium
enabled: false
tags:
  mitre:
  - T1059.001
  categories:
  - endpoint
references:
- https://attack.mitre.org/techniques/T1059/001/
- https://github.com/PowerShellMafia/PowerSploit
- https://github.com/PowerShellEmpire/
- https://github.com/S3cur3Th1sSh1t/PowerSharpPack
logsource:
  product: splunk
detection:
  splunk_spl: '`powershell` ScriptBlockText=* EventCode=4104 | stats count min(_time)
    as firstTime max(_time) as lastTime list(ScriptBlockText) as command values(Guid)
    as Guid values(Opcode) as Opcode values(Name) as Name values(Path) as Path values(ProcessID)
    as ProcessID values(ScriptBlockId) as ScriptBlockId values(ScriptBlockText) as
    ScriptBlockText by dest signature signature_id user_id vendor_product | eval command
    = mvjoin(command,"\n") | lookup malicious_powershell_strings command | where isnotnull(match)
    | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `windows_powershell_script_block_with_malicious_string_filter`'
provenance:
  source: splunk/security_content
  source_id: 0f09cedd-10f1-4b9f-bdea-7a8b06ea575d
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/windows_powershell_script_block_with_malicious_string.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
