id: splunk-security-content-eabbac3a-45aa-4659-920f-6b8cff383fb8
name: Windows Registry BootExecute Modification
description: The following analytic detects modifications to the BootExecute registry
  key, which manages applications and services executed during system boot. It leverages
  data from the Endpoint.Registry data model, focusing on changes to the registry
  path "HKLM\\System\\CurrentControlSet\\Control\\Session Manager\\BootExecute". This
  activity is significant because unauthorized changes to this key can indicate attempts
  to achieve persistence, load malicious code, or tamper with the boot process. If
  confirmed malicious, this could allow an attacker to maintain persistence, execute
  arbitrary code at boot, or disrupt system operations.
severity: medium
enabled: false
tags:
  mitre:
  - T1542
  - T1547.001
  categories:
  - endpoint
references:
- https://www.microsoft.com/en-us/security/blog/2023/04/11/guidance-for-investigating-attacks-using-cve-2022-21894-the-blacklotus-campaign/
logsource:
  product: splunk
detection:
  splunk_spl: '| tstats `security_content_summariesonly` count min(_time) as firstTime
    max(_time) as lastTime FROM datamodel=Endpoint.Registry WHERE Registry.registry_path="*\\System\\CurrentControlSet\\Control\\Session
    Manager\\BootExecute" by Registry.action Registry.dest Registry.process_guid Registry.process_id
    Registry.registry_hive Registry.registry_path Registry.registry_key_name Registry.registry_value_data
    Registry.registry_value_name Registry.registry_value_type Registry.status Registry.user
    Registry.vendor_product | `drop_dm_object_name(Registry)` | where isnotnull(registry_value_data)
    | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`| `windows_registry_bootexecute_modification_filter`'
provenance:
  source: splunk/security_content
  source_id: eabbac3a-45aa-4659-920f-6b8cff383fb8
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/windows_registry_bootexecute_modification.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
