id: splunk-security-content-0dc25c24-6fcf-456f-b08b-dd55a183e4de
name: Windows Service Stop Win Updates
description: The following analytic detects the disabling of Windows Update services,
  such as "Update Orchestrator Service for Windows Update," "WaaSMedicSvc," and "Windows
  Update." It leverages Windows System Event ID 7040 logs to identify changes in service
  start modes to 'disabled.' This activity is significant as it can indicate an adversary's
  attempt to evade defenses by preventing critical updates, leaving the system vulnerable
  to exploits. If confirmed malicious, this could allow attackers to maintain persistence
  and exploit unpatched vulnerabilities, compromising the integrity and security of
  the affected host.
severity: medium
enabled: false
tags:
  mitre:
  - T1489
  categories:
  - endpoint
references:
- https://malpedia.caad.fkie.fraunhofer.de/details/win.redline_stealer
logsource:
  product: splunk
detection:
  splunk_spl: "`wineventlog_system` EventCode=7040 (service_name IN (\"Update Orchestrator\
    \ Service for Windows Update\", \"WaaSMedicSvc\", \"Windows Update\") OR param1\
    \ IN (\"UsoSvc\", \"WaaSMedicSvc\", \"wuauserv\")) AND (param3=disabled OR start_mode\
    \ = disabled)\n  | stats count min(_time) as firstTime max(_time) as lastTime\n\
    \    BY Computer Error_Code service_name\n       start_mode param1 param2\n  \
    \     param3 param4\n  | rename Computer as dest\n  | `security_content_ctime(firstTime)`\n\
    \  | `security_content_ctime(lastTime)`\n  | `windows_service_stop_win_updates_filter`"
provenance:
  source: splunk/security_content
  source_id: 0dc25c24-6fcf-456f-b08b-dd55a183e4de
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/windows_service_stop_win_updates.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
