id: splunk-security-content-d5f54b38-10bf-4b3a-b6fc-85949862ed50
name: Windows Time Based Evasion via Choice Exec
description: The following analytic detects the use of choice.exe in batch files as
  a delay tactic, a technique observed in SnakeKeylogger malware. It leverages data
  from Endpoint Detection and Response (EDR) agents, focusing on process names and
  command-line executions. This activity is significant as it indicates potential
  time-based evasion techniques used by malware to avoid detection. If confirmed malicious,
  this behavior could allow attackers to execute code stealthily, delete malicious
  files, and persist on compromised hosts, making it crucial for SOC analysts to investigate
  promptly.
severity: medium
enabled: false
tags:
  mitre:
  - T1497.003
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/choice
- https://malpedia.caad.fkie.fraunhofer.de/details/win.404keylogger
logsource:
  product: splunk
detection:
  splunk_spl: "| tstats `security_content_summariesonly` count min(_time) as firstTime\
    \ max(_time) as lastTime FROM datamodel=Endpoint.Processes\n  WHERE Processes.process_name\
    \ =choice.exe  Processes.process = \"*/T*\"  Processes.process = \"*/N*\"\n  BY\
    \ Processes.action Processes.dest Processes.original_file_name\n     Processes.parent_process\
    \ Processes.parent_process_exec Processes.parent_process_guid\n     Processes.parent_process_id\
    \ Processes.parent_process_name Processes.parent_process_path\n     Processes.process\
    \ Processes.process_exec Processes.process_guid\n     Processes.process_hash Processes.process_id\
    \ Processes.process_integrity_level\n     Processes.process_name Processes.process_path\
    \ Processes.user\n     Processes.user_id Processes.vendor_product\n| `drop_dm_object_name(Processes)`\n\
    | `security_content_ctime(firstTime)`\n| `security_content_ctime(lastTime)`\n\
    | `windows_time_based_evasion_via_choice_exec_filter`"
provenance:
  source: splunk/security_content
  source_id: d5f54b38-10bf-4b3a-b6fc-85949862ed50
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/windows_time_based_evasion_via_choice_exec.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
