id: splunk-security-content-9a7a490c-5581-4c95-bab5-a21e351293ef
name: Windows Cisco Secure Endpoint Unblock File Via Sfc
description: The following analytic detects the use of the sfc.exe utility with the
  "-unblock" parameter, a feature within Cisco Secure Endpoint. The "-unblock" flag
  is used to remove system blocks imposed by the endpoint protection. This detection
  focuses on command-line activity that includes the "-unblock" parameter, as it may
  indicate an attempt to restore access to files or processes previously blocked by
  the security software. While this action could be legitimate in troubleshooting
  scenarios, malicious actors might use it to override protective measures, enabling
  execution of blocked malicious payloads or bypassing other security mechanisms.
severity: medium
enabled: false
tags:
  mitre:
  - T1562.001
  categories:
  - endpoint
references:
- https://www.cisco.com/c/en/us/support/docs/security/amp-endpoints/213690-amp-for-endpoint-command-line-switches.html
logsource:
  product: splunk
detection:
  splunk_spl: '| tstats `security_content_summariesonly` count min(_time) as firstTime
    max(_time) as lastTime from datamodel=Endpoint.Processes where Processes.process_name="sfc.exe"
    Processes.process="* -unblock *" AND NOT Processes.process_path IN ("*:\\Windows\\System32\\*",
    "*:\\Windows\\SysWOW64\\*", ":\\Windows\\WinSxS\\*") by Processes.action Processes.dest
    Processes.original_file_name Processes.parent_process Processes.parent_process_exec
    Processes.parent_process_guid Processes.parent_process_id Processes.parent_process_name
    Processes.parent_process_path Processes.process Processes.process_exec Processes.process_guid
    Processes.process_hash Processes.process_id Processes.process_integrity_level
    Processes.process_name Processes.process_path Processes.user Processes.user_id
    Processes.vendor_product | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)` | `windows_cisco_secure_endpoint_unblock_file_via_sfc_filter`'
provenance:
  source: splunk/security_content
  source_id: 9a7a490c-5581-4c95-bab5-a21e351293ef
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/windows_cisco_secure_endpoint_unblock_file_via_sfc.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
