id: splunk-security-content-3032741c-d6fc-4c69-8988-be8043d6478c
name: Windows Impair Defense Disable Controlled Folder Access
description: The following analytic detects a modification in the Windows registry
  that disables the Windows Defender Controlled Folder Access feature. It leverages
  data from the Endpoint.Registry data model, specifically monitoring changes to the
  EnableControlledFolderAccess registry setting. This activity is significant because
  Controlled Folder Access is designed to protect critical folders from unauthorized
  access, including ransomware attacks. If this activity is confirmed malicious, it
  could allow attackers to bypass a key security feature, potentially leading to unauthorized
  access or modification of sensitive files.
severity: medium
enabled: false
tags:
  mitre:
  - T1562.001
  categories:
  - endpoint
references:
- https://x.com/malmoeb/status/1742604217989415386?s=20
- https://github.com/undergroundwires/privacy.sexy
logsource:
  product: splunk
detection:
  splunk_spl: '| tstats `security_content_summariesonly` count min(_time) as firstTime
    max(_time) as lastTime FROM datamodel=Endpoint.Registry where Registry.registry_path=
    "*\\Windows Defender\\Windows Defender Exploit Guard\\Controlled Folder Access\\EnableControlledFolderAccess"
    Registry.registry_value_data="0x00000000" by Registry.action Registry.dest Registry.process_guid
    Registry.process_id Registry.registry_hive Registry.registry_path Registry.registry_key_name
    Registry.registry_value_data Registry.registry_value_name Registry.registry_value_type
    Registry.status Registry.user Registry.vendor_product | `drop_dm_object_name(Registry)`
    | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `windows_impair_defense_disable_controlled_folder_access_filter`'
provenance:
  source: splunk/security_content
  source_id: 3032741c-d6fc-4c69-8988-be8043d6478c
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/windows_impair_defense_disable_controlled_folder_access.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
