id: splunk-security-content-93c91139-01f8-4905-802b-0d106f026b13
name: Windows Outlook LoadMacroProviderOnBoot Persistence
description: The following analytic detects the modification of the Windows Registry
  key "LoadMacroProviderOnBoot" under Outlook. This enables automatic loading of macros,
  which could allow malicious scripts to run without notice. This detection leverages
  data from the Endpoint.Registry datamodel to search for this key being enabled.
  This activity is significant as it is commonly associated with some malware infections,
  indicating potential malicious intent to harvest email information.
severity: medium
enabled: false
tags:
  mitre:
  - T1112
  - T1137
  categories:
  - endpoint
references:
- https://lab52.io/blog/analyzing-notdoor-inside-apt28s-expanding-arsenal/
- https://hackread.com/russian-apt28-notdoor-backdoor-microsoft-outlook/
logsource:
  product: splunk
detection:
  splunk_spl: '| tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Registry
    WHERE Registry.registry_path="*\\Outlook\\*" Registry.registry_value_name="LoadMacroProviderOnBoot"
    Registry.registry_value_data="0x00000001" by Registry.action Registry.dest Registry.process_guid
    Registry.process_id Registry.registry_hive Registry.registry_path Registry.registry_key_name
    Registry.registry_value_data Registry.registry_value_name Registry.registry_value_type
    Registry.status Registry.user Registry.vendor_product | `drop_dm_object_name(Registry)`
    | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `windows_outlook_loadmacroprovideronboot_persistence_filter`'
provenance:
  source: splunk/security_content
  source_id: 93c91139-01f8-4905-802b-0d106f026b13
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/windows_outlook_loadmacroprovideronboot_persistence.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
