id: splunk-security-content-e633a0ef-2a6e-4ed7-b925-5ff999e5d1f0
name: Windows AD Domain Controller Promotion
description: The following analytic identifies a genuine Domain Controller (DC) promotion
  event by detecting when a computer assigns itself the necessary Service Principal
  Names (SPNs) to function as a domain controller. It leverages Windows Security Event
  Code 4742 to monitor existing domain controllers for these changes. This activity
  is significant as it can help identify rogue DCs added to the network, which could
  indicate a DCShadow attack. If confirmed malicious, this could allow an attacker
  to manipulate Active Directory, leading to potential privilege escalation and persistent
  access within the environment.
severity: medium
enabled: false
tags:
  mitre:
  - T1207
  categories:
  - endpoint
references:
- https://attack.mitre.org/techniques/T1207/
logsource:
  product: splunk
detection:
  splunk_spl: "`wineventlog_security` EventCode=4742 ServicePrincipalNames IN (\"\
    *E3514235-4B06-11D1-AB04-00C04FC2DCD2/*\",\"*GC/*\")\n  | stats min(_time) as\
    \ _time latest(ServicePrincipalNames) as ServicePrincipalNames,values(signature)\
    \ as signature, values(src_user) as src_user, values(user) as user\n    BY Logon_ID,\
    \ dvc\n  | where src_user=user\n  | rename Logon_ID as TargetLogonId, user as\
    \ dest\n  | appendpipe [\n  | map search=\"search `wineventlog_security` EventCode=4624\
    \ TargetLogonId=$TargetLogonId$\"\n  | fields - dest, dvc, signature]\n  | stats\
    \ min(_time) as _time, values(TargetUserSid) as TargetUserSid, values(Target_Domain)\
    \ as Target_Domain, values(user) as user, values(status) as status, values(src_category)\
    \ as src_category, values(src_ip) as src_ip values(ServicePrincipalNames) as ServicePrincipalNames\
    \ values(signature) as signature values(dest) as dest values(dvc) as dvc\n   \
    \ BY TargetLogonId\n  | eval dest=trim(dest,\"$\")\n  | `windows_ad_domain_controller_promotion_filter`"
provenance:
  source: splunk/security_content
  source_id: e633a0ef-2a6e-4ed7-b925-5ff999e5d1f0
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/windows_ad_domain_controller_promotion.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
