id: splunk-security-content-8e207707-ad40-4eb3-b865-3a52aec91f26
name: Windows Modify Registry Disable WinDefender Notifications
description: The following analytic detects a suspicious registry modification aimed
  at disabling Windows Defender notifications. It leverages data from the Endpoint.Registry
  data model, specifically looking for changes to the registry path "*\\SOFTWARE\\Policies\\Microsoft\\Windows
  Defender Security Center\\Notifications\\DisableNotifications" with a value of "0x00000001".
  This activity is significant as it indicates an attempt to evade detection by disabling
  security alerts, a technique used by adversaries and malware like RedLine Stealer.
  If confirmed malicious, this could allow attackers to operate undetected, increasing
  the risk of further compromise and data exfiltration.
severity: medium
enabled: false
tags:
  mitre:
  - T1112
  categories:
  - endpoint
references:
- https://malpedia.caad.fkie.fraunhofer.de/details/win.redline_stealer
logsource:
  product: splunk
detection:
  splunk_spl: '| tstats `security_content_summariesonly` count min(_time) as firstTime
    max(_time) as lastTime from datamodel=Endpoint.Registry where Registry.registry_path="*\\SOFTWARE\\Policies\\Microsoft\\Windows
    Defender Security Center\\Notifications\\DisableNotifications" AND Registry.registry_value_data="0x00000001"
    by Registry.action Registry.dest Registry.process_guid Registry.process_id Registry.registry_hive
    Registry.registry_path Registry.registry_key_name Registry.registry_value_data
    Registry.registry_value_name Registry.registry_value_type Registry.status Registry.user
    Registry.vendor_product | `drop_dm_object_name(Registry)` | `security_content_ctime(lastTime)`
    | `security_content_ctime(firstTime)` | `windows_modify_registry_disable_windefender_notifications_filter`'
provenance:
  source: splunk/security_content
  source_id: 8e207707-ad40-4eb3-b865-3a52aec91f26
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/windows_modify_registry_disable_windefender_notifications.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
