id: splunk-security-content-d0026380-b3c4-4da0-ac8e-02790063ff6b
name: Windows Command and Scripting Interpreter Hunting Path Traversal
description: 'The following analytic identifies path traversal command-line executions,

  leveraging data from Endpoint Detection and Response (EDR) agents. It detects patterns

  in command-line arguments indicative of path traversal techniques, such as multiple

  instances of "/..", "\..", or "\\..". This activity is significant as it often indicates

  attempts to evade defenses by executing malicious code, such as through msdt.exe.

  If confirmed malicious, this behavior could allow attackers to execute arbitrary

  code, potentially leading to system compromise, data exfiltration, or further lateral

  movement within the network.'
severity: medium
enabled: false
tags:
  mitre:
  - T1059
  categories:
  - endpoint
references:
- https://app.any.run/tasks/713f05d2-fe78-4b9d-a744-f7c133e3fafb/
logsource:
  product: splunk
detection:
  splunk_spl: "| tstats `security_content_summariesonly` count min(_time) as firstTime\
    \ max(_time)\nas lastTime FROM datamodel=Endpoint.Processes where\nProcesses.process\
    \ IN (\"*\\\\..*\", \"*//..*\", \"*\\..*\", \"*/..*\")\nby Processes.action Processes.dest\
    \ Processes.original_file_name Processes.parent_process\n   Processes.parent_process_exec\
    \ Processes.parent_process_guid Processes.parent_process_id\n   Processes.parent_process_name\
    \ Processes.parent_process_path Processes.process\n   Processes.process_exec Processes.process_guid\
    \ Processes.process_hash Processes.process_id\n   Processes.process_integrity_level\
    \ Processes.process_name Processes.process_path\n   Processes.user Processes.user_id\
    \ Processes.vendor_product\n\n| `drop_dm_object_name(\"Processes\")`\n| `security_content_ctime(firstTime)`\n\
    | `security_content_ctime(lastTime)`\n| eval count_of_pattern1 = (mvcount(split(process,\"\
    /..\"))-1)\n| eval count_of_pattern2 = (mvcount(split(process,\"\\..\"))-1)\n\
    | eval count_of_pattern3 = (mvcount(split(process,\"\\\\..\"))-1)\n| eval count_of_pattern4\
    \ = (mvcount(split(process,\"//..\"))-1)\n\n| search count_of_pattern1 > 1\n \
    \        OR\n         count_of_pattern2 > 1\n         OR\n         count_of_pattern3\
    \ > 1\n         OR\n         count_of_pattern4 > 1\n| `windows_command_and_scripting_interpreter_hunting_path_traversal_filter`"
provenance:
  source: splunk/security_content
  source_id: d0026380-b3c4-4da0-ac8e-02790063ff6b
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/windows_command_and_scripting_interpreter_hunting_path_traversal.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
