id: splunk-security-content-e14d94a3-07fb-4b47-8406-f5e37180d422
name: Windows Debugger Tool Execution
description: This analysis detects the use of debugger tools within a production environment.
  While these tools are legitimate for file analysis and debugging, they are abused
  by malware like PlugX and DarkGate for malicious DLL side-loading. The hunting query
  aids Security Operations Centers (SOCs) in identifying potentially suspicious tool
  executions, particularly for non-technical users in the production network.
severity: medium
enabled: false
tags:
  mitre:
  - T1036
  categories:
  - endpoint
references:
- https://www.splunk.com/en_us/blog/security/enter-the-gates-an-analysis-of-the-darkgate-autoit-loader.html
- https://www.trendmicro.com/en_us/research/23/b/investigating-the-plugx-trojan-disguised-as-a-legitimate-windows.html
logsource:
  product: splunk
detection:
  splunk_spl: "| tstats `security_content_summariesonly` min(_time) as firstTime max(_time)\
    \ as lastTime FROM datamodel=Endpoint.Processes\n  WHERE Processes.process_name\
    \ = \"x32dbg.exe\"\n    OR\n    Processes.process_name = \"x64dbg.exe\"\n    OR\n\
    \    Processes.process_name = \"windbg.exe\"\n  BY Processes.action Processes.dest\
    \ Processes.original_file_name\n     Processes.parent_process Processes.parent_process_exec\
    \ Processes.parent_process_guid\n     Processes.parent_process_id Processes.parent_process_name\
    \ Processes.parent_process_path\n     Processes.process Processes.process_exec\
    \ Processes.process_guid\n     Processes.process_hash Processes.process_id Processes.process_integrity_level\n\
    \     Processes.process_name Processes.process_path Processes.user\n     Processes.user_id\
    \ Processes.vendor_product\n| `drop_dm_object_name(Processes)`\n| `security_content_ctime(firstTime)`\n\
    | `security_content_ctime(lastTime)`\n| `windows_debugger_tool_execution_filter`"
provenance:
  source: splunk/security_content
  source_id: e14d94a3-07fb-4b47-8406-f5e37180d422
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/windows_debugger_tool_execution.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
