id: splunk-security-content-cde00c31-042a-4307-bf70-25e471da56e9
name: Windows New Service Security Descriptor Set Via Sc.EXE
description: 'The following analytic detects changes in a service security descriptor.

  It leverages data from Endpoint Detection and Response (EDR) agents, specifically
  searching for any process execution involving the "sc.exe" binary with the "sdset"
  flag targeting any service.

  This behavior can be legitimate, such as when a user or administrator is configuring
  a service''s security settings.

  Investigate appropariate services to determine if the behavior is malicious.

  If confirmed malicious, this could allow an attacker to escalate their privileges,
  blind defenses and more.'
severity: medium
enabled: false
tags:
  mitre:
  - T1564
  categories:
  - endpoint
references:
- https://www.sans.org/blog/red-team-tactics-hiding-windows-services/
- https://news.sophos.com/wp-content/uploads/2020/06/glupteba_final-1.pdf
- https://attack.mitre.org/techniques/T1564/
logsource:
  product: splunk
detection:
  splunk_spl: "| tstats `security_content_summariesonly`\n  count min(_time) as firstTime\n\
    \        max(_time) as lastTime\n        values(Processes.process) as process\n\
    \nFROM datamodel=Endpoint.Processes WHERE\n(\n    Processes.process_name=sc.exe\n\
    \    OR\n    Processes.original_file_name=sc.exe\n)\nProcesses.process=\"*sdset\
    \ *\"\nBY Processes.action Processes.dest Processes.original_file_name\n   Processes.parent_process\
    \ Processes.parent_process_exec\n   Processes.parent_process_guid Processes.parent_process_id\n\
    \   Processes.parent_process_name Processes.parent_process_path\n   Processes.process\
    \ Processes.process_exec Processes.process_guid\n   Processes.process_hash Processes.process_id\
    \ Processes.process_integrity_level\n   Processes.process_name Processes.process_path\
    \ Processes.user\n   Processes.user_id Processes.vendor_product\n| `drop_dm_object_name(Processes)`\n\
    | `security_content_ctime(firstTime)`\n| `security_content_ctime(lastTime)`\n\
    | `windows_new_service_security_descriptor_set_via_sc_exe_filter`"
provenance:
  source: splunk/security_content
  source_id: cde00c31-042a-4307-bf70-25e471da56e9
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/windows_new_service_security_descriptor_set_via_sc_exe.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
