id: splunk-security-content-7aec015b-cd69-46c3-85ed-dac152056aa4
name: Windows WinDBG Spawning AutoIt3
description: The following analytic identifies instances of the WinDBG process spawning
  AutoIt3. This behavior is detected by monitoring endpoint telemetry for processes
  where 'windbg.exe' is the parent process and 'autoit3.exe' or similar is the child
  process. This activity is significant because AutoIt3 is frequently used by threat
  actors for scripting malicious automation, potentially indicating an ongoing attack.
  If confirmed malicious, this could allow attackers to automate tasks, execute arbitrary
  code, and further compromise the system, leading to data exfiltration or additional
  malware deployment.
severity: medium
enabled: false
tags:
  mitre:
  - T1059
  categories:
  - endpoint
references:
- https://github.com/PaloAltoNetworks/Unit42-timely-threat-intel/blob/main/2023-10-25-IOCs-from-DarkGate-activity.txt
logsource:
  product: splunk
detection:
  splunk_spl: '| tstats `security_content_summariesonly` count min(_time) as firstTime
    max(_time) as lastTime from datamodel=Endpoint.Processes  where Processes.parent_process_name=windbg.exe  AND
    (Processes.process_name IN ("autoit3.exe", "autoit*.exe") OR Processes.original_file_name
    IN ("autoit3.exe", "autoit*.exe")) by Processes.action Processes.dest Processes.original_file_name
    Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
    Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
    Processes.process Processes.process_exec Processes.process_guid Processes.process_hash
    Processes.process_id Processes.process_integrity_level Processes.process_name
    Processes.process_path Processes.user Processes.user_id Processes.vendor_product
    | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
    | eval matches_extension=if(match(process, "\\.(au3|a3x|exe|aut|aup)$"), "Yes",
    "No") | search matches_extension="Yes" | `windows_windbg_spawning_autoit3_filter`'
provenance:
  source: splunk/security_content
  source_id: 7aec015b-cd69-46c3-85ed-dac152056aa4
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/windows_windbg_spawning_autoit3.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
