id: splunk-security-content-8b6c15c7-5556-463d-83c7-986326c21f12
name: Windows Impair Defense Disable Win Defender Network Protection
description: The following analytic detects modifications to the Windows registry
  that disable Windows Defender Network Protection. It leverages data from the Endpoint.Registry
  data model, specifically monitoring changes to the EnableNetworkProtection registry
  entry. This activity is significant because disabling Network Protection can leave
  the system vulnerable to network-based threats by preventing Windows Defender from
  analyzing and blocking malicious network activity. If confirmed malicious, this
  action could allow attackers to bypass security measures, potentially leading to
  unauthorized access, data exfiltration, or further compromise of the network.
severity: medium
enabled: false
tags:
  mitre:
  - T1562.001
  categories:
  - endpoint
references:
- https://x.com/malmoeb/status/1742604217989415386?s=20
- https://github.com/undergroundwires/privacy.sexy
logsource:
  product: splunk
detection:
  splunk_spl: '| tstats `security_content_summariesonly` count min(_time) as firstTime
    max(_time) as lastTime FROM datamodel=Endpoint.Registry where Registry.registry_path=
    "*\\Windows Defender\\Windows Defender Exploit Guard\\Network Protection\\EnableNetworkProtection"
    Registry.registry_value_data="0x00000000" by Registry.action Registry.dest Registry.process_guid
    Registry.process_id Registry.registry_hive Registry.registry_path Registry.registry_key_name
    Registry.registry_value_data Registry.registry_value_name Registry.registry_value_type
    Registry.status Registry.user Registry.vendor_product | `drop_dm_object_name(Registry)`
    | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `windows_impair_defense_disable_win_defender_network_protection_filter`'
provenance:
  source: splunk/security_content
  source_id: 8b6c15c7-5556-463d-83c7-986326c21f12
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/windows_impair_defense_disable_win_defender_network_protection.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
