id: splunk-security-content-7215831c-8252-4ae3-8d43-db588e82f952
name: Windows Impair Defense Define Win Defender Threat Action
description: The following analytic detects modifications to the Windows Defender
  ThreatSeverityDefaultAction registry setting. It leverages data from the Endpoint.Registry
  datamodel to identify changes in registry values that define how Windows Defender
  responds to threats. This activity is significant because altering these settings
  can impair the system's defense mechanisms, potentially allowing threats to go unaddressed.
  If confirmed malicious, this could enable attackers to bypass antivirus protections,
  leading to persistent threats and increased risk of data compromise or further system
  exploitation.
severity: medium
enabled: false
tags:
  mitre:
  - T1562.001
  categories:
  - endpoint
references:
- https://x.com/malmoeb/status/1742604217989415386?s=20
- https://github.com/undergroundwires/privacy.sexy
logsource:
  product: splunk
detection:
  splunk_spl: '| tstats `security_content_summariesonly` count min(_time) as firstTime
    max(_time) as lastTime FROM datamodel=Endpoint.Registry where Registry.registry_path=
    "*\\Windows Defender\\Threats\\ThreatSeverityDefaultAction*" Registry.registry_value_data
    IN ("0x00000001", "9") by Registry.action Registry.dest Registry.process_guid
    Registry.process_id Registry.registry_hive Registry.registry_path Registry.registry_key_name
    Registry.registry_value_data Registry.registry_value_name Registry.registry_value_type
    Registry.status Registry.user Registry.vendor_product | `drop_dm_object_name(Registry)`
    | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `windows_impair_defense_define_win_defender_threat_action_filter`'
provenance:
  source: splunk/security_content
  source_id: 7215831c-8252-4ae3-8d43-db588e82f952
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/windows_impair_defense_define_win_defender_threat_action.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
