id: splunk-security-content-fca01769-5163-4b3a-ae44-de874adfc9bc
name: Windows Phishing Outlook Drop Dll In FORM Dir
description: The following analytic detects the creation of a DLL file by an outlook.exe
  process in the AppData\Local\Microsoft\FORMS directory. This detection leverages
  data from the Endpoint.Processes and Endpoint.Filesystem datamodels, focusing on
  process and file creation events. This activity is significant as it may indicate
  an attempt to exploit CVE-2024-21378, where a custom MAPI form loads a potentially
  malicious DLL. If confirmed malicious, this could allow an attacker to execute arbitrary
  code, leading to further system compromise or data exfiltration.
severity: medium
enabled: false
tags:
  mitre:
  - T1566
  categories:
  - endpoint
references:
- https://www.netspi.com/blog/technical/red-team-operations/microsoft-outlook-remote-code-execution-cve-2024-21378/
logsource:
  product: splunk
detection:
  splunk_spl: '| tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Processes
    where Processes.process_name=outlook.exe by _time span=1h Processes.action Processes.dest
    Processes.original_file_name Processes.parent_process Processes.parent_process_exec
    Processes.parent_process_guid Processes.parent_process_id Processes.parent_process_name
    Processes.parent_process_path Processes.process Processes.process_exec Processes.process_guid
    Processes.process_hash Processes.process_id Processes.process_integrity_level
    Processes.process_name Processes.process_path Processes.user Processes.user_id
    Processes.vendor_product | `drop_dm_object_name(Processes)` | join process_guid,
    _time [ | tstats `security_content_summariesonly` count min(_time) as firstTime
    max(_time) as lastTime FROM datamodel=Endpoint.Filesystem where Filesystem.file_name
    ="*.dll" Filesystem.file_path = "*\\AppData\\Local\\Microsoft\\FORMS\\IPM*" by
    _time span=1h Filesystem.dest Filesystem.file_create_time Filesystem.file_name
    Filesystem.file_path Filesystem.process_guid | `drop_dm_object_name(Filesystem)`
    | fields file_name file_path process_name process_path process dest file_create_time
    _time process_guid] | `windows_phishing_outlook_drop_dll_in_form_dir_filter`'
provenance:
  source: splunk/security_content
  source_id: fca01769-5163-4b3a-ae44-de874adfc9bc
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/windows_phishing_outlook_drop_dll_in_form_dir.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
