id: splunk-security-content-e0b6ca60-9e29-4450-b51a-bba0abae2313
name: Windows Impair Defense Deny Security Software With Applocker
description: The following analytic detects modifications in the Windows registry
  by the Applocker utility that deny the execution of various security products. This
  detection leverages data from the Endpoint.Registry datamodel, focusing on specific
  registry paths and values indicating a "Deny" action against known antivirus and
  security software. This activity is significant as it may indicate an attempt to
  disable security defenses, a tactic observed in malware like Azorult. If confirmed
  malicious, this could allow attackers to bypass security measures, facilitating
  further malicious activities and persistence within the environment.
severity: medium
enabled: false
tags:
  mitre:
  - T1562.001
  categories:
  - endpoint
references:
- https://app.any.run/tasks/a6f2ffe2-e6e2-4396-ae2e-04ea0143f2d8/
- https://www.microsoftpressstore.com/articles/article.aspx?p=2228450&seqNum=11
logsource:
  product: splunk
detection:
  splunk_spl: '| tstats `security_content_summariesonly` count min(_time) as firstTime
    max(_time) as lastTime FROM datamodel=Endpoint.Registry where (Registry.registry_path=
    "*\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Group Policy Objects\\*" AND
    Registry.registry_path= "*}Machine\\Software\\Policies\\Microsoft\\Windows\\SrpV2*")
    OR Registry.registry_path="*\\Software\\Policies\\Microsoft\\Windows\\SrpV2*"
    AND Registry.registry_value_data = "*Action\=\"Deny\"*" AND Registry.registry_value_data
    IN("*O=SYMANTEC*","*O=MCAFEE*","*O=KASPERSKY*","*O=BLEEPING COMPUTER*", "*O=PANDA
    SECURITY*","*O=SYSTWEAK SOFTWARE*", "*O=TREND MICRO*", "*O=AVAST*", "*O=GRIDINSOFT*",
    "*O=MICROSOFT*", "*O=NANO SECURITY*", "*O=SUPERANTISPYWARE.COM*", "*O=DOCTOR WEB*",
    "*O=MALWAREBYTES*", "*O=ESET*", "*O=AVIRA*", "*O=WEBROOT*") by Registry.action
    Registry.dest Registry.process_guid Registry.process_id Registry.registry_hive
    Registry.registry_path Registry.registry_key_name Registry.registry_value_data
    Registry.registry_value_name Registry.registry_value_type Registry.status Registry.user
    Registry.vendor_product | `drop_dm_object_name(Registry)` | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)` | `windows_impair_defense_deny_security_software_with_applocker_filter`'
provenance:
  source: splunk/security_content
  source_id: e0b6ca60-9e29-4450-b51a-bba0abae2313
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/windows_impair_defense_deny_security_software_with_applocker.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
