id: splunk-security-content-99d69078-7dae-4ffe-9f3d-063242772f5a
name: Windows Unusual Intelliform Storage Registry Access
description: The following analytic identifies processes accessing Intelliform Storage
  Registry keys used by Internet Explorer. It leverages Windows Security Event logs,
  specifically monitoring EventCode 4663, which tracks object access events. This
  activity is significant because it can indicate unauthorized access or manipulation
  of sensitive registry keys used for storing form data in Internet Explorer. If confirmed
  malicious, this could lead to data exfiltration, credential theft, or further compromise
  of the system.
severity: medium
enabled: false
tags:
  mitre:
  - T1552.001
  categories:
  - endpoint
references:
- https://stackoverflow.com/questions/1276700/where-does-internet-explorer-stores-its-form-data-history-that-is-uses-for-auto
logsource:
  product: splunk
detection:
  splunk_spl: '`wineventlog_security` EventCode=4663  NOT (ProcessName IN("C:\\Program
    Files\\Internet Explorer\\iexplore.exe", "C:\\Windows\\System32\\dllhost.exe",
    "C:\\Windows\\SysWow64\\dllhost.exe")) ObjectName IN ("*Software\\microsoft\\Internet
    Explorer\\Intelliforms\\storage2*") | stats count min(_time) as firstTime max(_time)
    as lastTime by  ObjectName ObjectType ProcessName AccessMask process_id EventCode
    Computer Caller_User_Name | rename Computer as dest Caller_User_Name as user ProcessName
    as process_name |  `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
    | `windows_unusual_intelliform_storage_registry_access_filter`'
provenance:
  source: splunk/security_content
  source_id: 99d69078-7dae-4ffe-9f3d-063242772f5a
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/windows_unusual_intelliform_storage_registry_access.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
