id: splunk-security-content-b7548c2e-9a10-11ec-99e3-acde48001122
name: Windows Modify Show Compress Color And Info Tip Registry
description: The following analytic detects suspicious modifications to the Windows
  registry keys related to file compression color and information tips. It leverages
  data from the Endpoint.Registry data model, specifically monitoring changes to the
  "ShowCompColor" and "ShowInfoTip" values under the "Microsoft\\Windows\\CurrentVersion\\Explorer\\Advanced"
  path. This activity is significant as it was observed in the Hermetic Wiper malware,
  indicating potential malicious intent to alter file attributes and user interface
  elements. If confirmed malicious, this could signify an attempt to manipulate file
  visibility and deceive users, potentially aiding in further malicious activities.
severity: medium
enabled: false
tags:
  mitre:
  - T1112
  categories:
  - endpoint
references:
- https://blog.talosintelligence.com/2022/02/threat-advisory-hermeticwiper.html
logsource:
  product: splunk
detection:
  splunk_spl: '| tstats `security_content_summariesonly` count min(_time) as firstTime
    max(_time) as lastTime FROM datamodel=Endpoint.Registry WHERE (Registry.registry_path
    = "*\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Advanced*" AND Registry.registry_value_name  IN("ShowCompColor",
    "ShowInfoTip")) by Registry.action Registry.dest Registry.process_guid Registry.process_id
    Registry.registry_hive Registry.registry_path Registry.registry_key_name Registry.registry_value_data
    Registry.registry_value_name Registry.registry_value_type Registry.status Registry.user
    Registry.vendor_product | `drop_dm_object_name(Registry)` | where isnotnull(registry_value_data)
    | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `windows_modify_show_compress_color_and_info_tip_registry_filter`'
provenance:
  source: splunk/security_content
  source_id: b7548c2e-9a10-11ec-99e3-acde48001122
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/windows_modify_show_compress_color_and_info_tip_registry.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
