id: splunk-security-content-72013a8e-5cea-408a-9d51-5585386b4d69
name: Windows Credential Access From Browser Password Store
description: The following analytic identifies a possible non-common browser process
  accessing its browser user data profile. This tactic/technique has been observed
  in various Trojan Stealers, such as SnakeKeylogger, which attempt to gather sensitive
  browser information and credentials as part of their exfiltration strategy. Detecting
  this anomaly can serve as a valuable pivot for identifying processes that access
  lists of browser user data profiles unexpectedly. This detection uses a lookup file
  `browser_app_list` that maintains a list of well known browser applications and
  the browser paths that are allowed to access the browser user data profiles.
severity: medium
enabled: false
tags:
  mitre:
  - T1012
  categories:
  - endpoint
references:
- https://malpedia.caad.fkie.fraunhofer.de/details/win.404keylogger
- https://www.checkpoint.com/cyber-hub/threat-prevention/what-is-malware/snake-keylogger-malware/
logsource:
  product: splunk
detection:
  splunk_spl: '`wineventlog_security` EventCode=4663 | stats count by _time object_file_path
    object_file_name dest process_name process_path process_id EventCode | lookup
    browser_app_list browser_object_path as object_file_path OUTPUT browser_process_name
    isAllowed | stats count min(_time) as firstTime max(_time) as lastTime values(object_file_name)
    values(object_file_path)  values(browser_process_name) as browser_process_name
    by dest process_name process_path process_id EventCode isAllowed | rex field=process_name
    "(?<extracted_process_name>[^\\\\]+)$" | eval isMalicious=if(match(browser_process_name,
    extracted_process_name), "0", "1") | where isMalicious=1 and isAllowed="false"
    | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `windows_credential_access_from_browser_password_store_filter`'
provenance:
  source: splunk/security_content
  source_id: 72013a8e-5cea-408a-9d51-5585386b4d69
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/windows_credential_access_from_browser_password_store.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
