id: splunk-security-content-b1ce9a72-73cf-11ec-981b-acde48001122
name: Windows Non-System Account Targeting Lsass
description: The following analytic identifies non-SYSTEM accounts requesting access
  to lsass.exe. This detection leverages Sysmon EventCode 10 logs to monitor access
  attempts to the Local Security Authority Subsystem Service (lsass.exe) by non-SYSTEM
  users. This activity is significant as it may indicate credential dumping attempts
  or unauthorized access to sensitive credentials. If confirmed malicious, an attacker
  could potentially extract credentials from memory, leading to privilege escalation
  or lateral movement within the network. Immediate investigation is required to determine
  the legitimacy of the access request and to mitigate any potential threats.
severity: medium
enabled: false
tags:
  mitre:
  - T1003.001
  categories:
  - endpoint
references:
- https://en.wikipedia.org/wiki/Local_Security_Authority_Subsystem_Service
- https://docs.microsoft.com/en-us/windows/win32/api/minidumpapiset/nf-minidumpapiset-minidumpwritedump
- https://cyberwardog.blogspot.com/2017/03/chronicles-of-threat-hunter-hunting-for_22.html
- https://raw.githubusercontent.com/PowerShellMafia/PowerSploit/master/Exfiltration/Invoke-Mimikatz.ps1
- https://docs.microsoft.com/en-us/windows/win32/procthread/process-security-and-access-rights?redirectedfrom=MSDN
logsource:
  product: splunk
detection:
  splunk_spl: '`sysmon` EventCode=10 TargetImage=*lsass.exe NOT (SourceUser="NT AUTHORITY\\*")
    | stats count min(_time) as firstTime max(_time) as lastTime by CallTrace EventID
    GrantedAccess Guid Opcode ProcessID SecurityID SourceImage SourceProcessGUID SourceProcessId
    TargetImage TargetProcessGUID TargetProcessId UserID dest granted_access parent_process_exec
    parent_process_guid parent_process_id parent_process_name parent_process_path
    process_exec process_guid process_id process_name process_path signature signature_id
    user_id vendor_product | `security_content_ctime(firstTime)`| `security_content_ctime(lastTime)`
    | `windows_non_system_account_targeting_lsass_filter`'
provenance:
  source: splunk/security_content
  source_id: b1ce9a72-73cf-11ec-981b-acde48001122
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/windows_non_system_account_targeting_lsass.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
