id: splunk-security-content-c427bafb-0b2c-4b18-ad85-c03c6fed9e75
name: Windows Modify Registry USeWuServer
description: The following analytic detects a suspicious modification to the Windows
  Update configuration registry key "UseWUServer." It leverages data from the Endpoint.Registry
  data model to identify changes where the registry value is set to "0x00000001."
  This activity is significant because it is commonly used by adversaries, including
  malware like RedLine Stealer, to bypass detection mechanisms and potentially exploit
  zero-day vulnerabilities. If confirmed malicious, this modification could allow
  attackers to evade defenses, persist on the target host, and deploy additional malicious
  payloads.
severity: medium
enabled: false
tags:
  mitre:
  - T1112
  categories:
  - endpoint
references:
- https://learn.microsoft.com/de-de/security-updates/windowsupdateservices/18127499
logsource:
  product: splunk
detection:
  splunk_spl: '| tstats `security_content_summariesonly` count min(_time) as firstTime
    max(_time) as lastTime from datamodel=Endpoint.Registry where Registry.registry_path="*\\SOFTWARE\\Policies\\Microsoft\\Windows\\WindowsUpdate\\AU\\UseWUServer"
    AND Registry.registry_value_data="0x00000001" by Registry.action Registry.dest
    Registry.process_guid Registry.process_id Registry.registry_hive Registry.registry_path
    Registry.registry_key_name Registry.registry_value_data Registry.registry_value_name
    Registry.registry_value_type Registry.status Registry.user Registry.vendor_product
    | `drop_dm_object_name(Registry)` | `security_content_ctime(lastTime)` | `security_content_ctime(firstTime)`
    | `windows_modify_registry_usewuserver_filter`'
provenance:
  source: splunk/security_content
  source_id: c427bafb-0b2c-4b18-ad85-c03c6fed9e75
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/windows_modify_registry_usewuserver.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
