id: splunk-security-content-a8b3124e-2278-4b73-ae9c-585117079fb2
name: Windows Credentials in Registry Reg Query
description: The following analytic identifies processes querying the registry for
  potential passwords or credentials. It leverages data from Endpoint Detection and
  Response (EDR) agents, focusing on command-line executions that access specific
  registry paths known to store sensitive information. This activity is significant
  as it may indicate credential theft attempts, often used by adversaries or post-exploitation
  tools like winPEAS. If confirmed malicious, this behavior could lead to privilege
  escalation, persistence, or lateral movement within the network, posing a severe
  security risk.
severity: medium
enabled: false
tags:
  mitre:
  - T1552.002
  categories:
  - endpoint
references:
- https://attack.mitre.org/techniques/T1552/002/
- https://github.com/carlospolop/PEASS-ng/tree/master/winPEAS
- https://www.microsoft.com/en-us/security/blog/2022/10/14/new-prestige-ransomware-impacts-organizations-in-ukraine-and-poland/
logsource:
  product: splunk
detection:
  splunk_spl: '| tstats `security_content_summariesonly` count min(_time) as firstTime
    max(_time) as lastTime from datamodel=Endpoint.Processes where `process_reg` AND
    Processes.process = "* query *" AND Processes.process IN ("*\\Software\\ORL\\WinVNC3\\Password*",
    "*\\SOFTWARE\\RealVNC\\WinVNC4 /v password*", "*\\CurrentControlSet\\Services\\SNMP*",
    "*\\Software\\TightVNC\\Server*", "*\\Software\\SimonTatham\\PuTTY\\Sessions*",
    "*\\Software\\OpenSSH\\Agent\\Keys*", "*password*") by Processes.action Processes.dest
    Processes.original_file_name Processes.parent_process Processes.parent_process_exec
    Processes.parent_process_guid Processes.parent_process_id Processes.parent_process_name
    Processes.parent_process_path Processes.process Processes.process_exec Processes.process_guid
    Processes.process_hash Processes.process_id Processes.process_integrity_level
    Processes.process_name Processes.process_path Processes.user Processes.user_id
    Processes.vendor_product | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)` | `windows_credentials_in_registry_reg_query_filter`'
provenance:
  source: splunk/security_content
  source_id: a8b3124e-2278-4b73-ae9c-585117079fb2
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/windows_credentials_in_registry_reg_query.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
