id: splunk-security-content-a2b1f1ef-221f-4187-b2a4-d4b08ec745f4
name: Windows Vulnerable Driver Loaded
description: The following analytic detects the loading of known vulnerable Windows
  drivers, which may indicate potential persistence or privilege escalation attempts.
  It leverages Sysmon EventCode 6 to identify driver loading events and cross-references
  them with a list of vulnerable drivers. This activity is significant as attackers
  often exploit vulnerable drivers to gain elevated privileges or maintain persistence
  on a system. If confirmed malicious, this could allow attackers to execute arbitrary
  code with high privileges, leading to further system compromise and potential data
  exfiltration.
severity: medium
enabled: false
tags:
  mitre:
  - T1543.003
  categories:
  - endpoint
references:
- https://github.com/SigmaHQ/sigma/blob/master/rules/windows/driver_load/driver_load_vuln_drivers_names.yml
- https://github.com/eclypsium/Screwed-Drivers/blob/master/DRIVERS.md
- https://docs.microsoft.com/en-us/windows/security/threat-protection/windows-defender-application-control/microsoft-recommended-driver-block-rules
- https://www.rapid7.com/blog/post/2021/12/13/driver-based-attacks-past-and-present/
- https://github.com/jbaines-r7/dellicious
- https://github.com/MicrosoftDocs/windows-itpro-docs/blob/public/windows/security/threat-protection/windows-defender-application-control/microsoft-recommended-driver-block-rules.md
- https://github.com/namazso/physmem_drivers
- https://github.com/stong/CVE-2020-15368
- https://github.com/CaledoniaProject/drivers-binaries
- https://github.com/Chigusa0w0/AsusDriversPrivEscala
- https://www.welivesecurity.com/2022/01/11/signed-kernel-drivers-unguarded-gateway-windows-core/
- https://eclypsium.com/2019/11/12/mother-of-all-drivers/
- https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-37969
logsource:
  product: splunk
detection:
  splunk_spl: "`sysmon` EventCode=6\n  | stats  min(_time) as firstTime max(_time)\
    \ as lastTime count\n    BY ImageLoaded dest dvc\n       process_hash process_path\
    \ signature\n       signature_id user_id vendor_product\n  | lookup loldrivers\
    \ driver_name AS ImageLoaded OUTPUT is_driver driver_description\n  | search is_driver\
    \ = TRUE\n  | `security_content_ctime(firstTime)`\n  | `security_content_ctime(lastTime)`\n\
    \  | `windows_vulnerable_driver_loaded_filter`"
provenance:
  source: splunk/security_content
  source_id: a2b1f1ef-221f-4187-b2a4-d4b08ec745f4
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/windows_vulnerable_driver_loaded.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
