id: splunk-security-content-1ae407b0-a042-4eb0-834a-590da055575e
name: Windows File and Directory Enable ReadOnly Permissions
description: The following analytic detects instances where file or folder permissions
  are modified to grant read-only access. Such changes are characterized by the presence
  of read-related permissions (e.g., R, REA, RA, RD) and the absence of write (W)
  or execute (E) permissions. Monitoring these events is crucial for tracking access
  control changes that could be intentional for restricting access or indicative of
  malicious behavior. Alerts generated by this detection help ensure that legitimate
  security measures are enforced while unauthorized changes are promptly investigated.
severity: medium
enabled: false
tags:
  mitre:
  - T1222.001
  categories:
  - endpoint
references:
- https://www.splunk.com/en_us/blog/security/-applocker-rules-as-defense-evasion-complete-analysis.html
logsource:
  product: splunk
detection:
  splunk_spl: '| tstats `security_content_summariesonly` min(_time) as firstTime max(_time)
    as lastTime from datamodel=Endpoint.Processes where Processes.process_name IN(
    "icacls.exe", "cacls.exe", "xcacls.exe") AND Processes.process IN ("*/grant*",
    "*/G*") AND Processes.process IN ("*SYSTEM*", "*admin*", "*S-1-1-0*", "*EVERYONE*")
    by Processes.action Processes.dest Processes.original_file_name Processes.parent_process
    Processes.parent_process_exec Processes.parent_process_guid Processes.parent_process_id
    Processes.parent_process_name Processes.parent_process_path Processes.process
    Processes.process_exec Processes.process_guid Processes.process_hash Processes.process_id
    Processes.process_integrity_level Processes.process_name Processes.process_path
    Processes.user Processes.user_id Processes.vendor_product | `drop_dm_object_name(Processes)`
    | rex field=process ":\\((?<permission>[^)]+)\\)" | eval has_read_attribute=if(match(permission,
    "R"), "true", "false") | eval has_write_execute=if(match(permission, "(W|GA|X|M|F|AD|DC|DE)"),
    "true", "false") | where has_write_execute="false" and has_read_attribute = "true"
    | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `windows_file_and_directory_enable_readonly_permissions_filter`'
provenance:
  source: splunk/security_content
  source_id: 1ae407b0-a042-4eb0-834a-590da055575e
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/windows_file_and_directory_enable_readonly_permissions.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
