id: splunk-security-content-c54b7439-cfb1-44c3-bb35-b0409553077c
name: Windows Impair Defense Configure App Install Control
description: The following analytic detects modifications to the Windows registry
  that disable the Windows Defender SmartScreen App Install Control feature. It leverages
  data from the Endpoint.Registry data model to identify changes to specific registry
  values. This activity is significant because disabling App Install Control can allow
  users to install potentially malicious web-based applications without restrictions,
  increasing the risk of security vulnerabilities. If confirmed malicious, this action
  could lead to the installation of harmful applications, potentially compromising
  the system and exposing sensitive information.
severity: medium
enabled: false
tags:
  mitre:
  - T1562.001
  categories:
  - endpoint
references:
- https://x.com/malmoeb/status/1742604217989415386?s=20
- https://github.com/undergroundwires/privacy.sexy
logsource:
  product: splunk
detection:
  splunk_spl: '| tstats `security_content_summariesonly` count min(_time) as firstTime
    max(_time) as lastTime FROM datamodel=Endpoint.Registry WHERE (Registry.registry_path=
    "*\\Microsoft\\Windows Defender\\SmartScreen\\ConfigureAppInstallControl" Registry.registry_value_data=
    "Anywhere") OR (Registry.registry_path= "*\\Microsoft\\Windows Defender\\SmartScreen\\ConfigureAppInstallControlEnabled"
    Registry.registry_value_data= "0x00000000") by Registry.action Registry.dest Registry.process_guid
    Registry.process_id Registry.registry_hive Registry.registry_path Registry.registry_key_name
    Registry.registry_value_data Registry.registry_value_name Registry.registry_value_type
    Registry.status Registry.user Registry.vendor_product | `drop_dm_object_name(Registry)`
    | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `windows_impair_defense_configure_app_install_control_filter`'
provenance:
  source: splunk/security_content
  source_id: c54b7439-cfb1-44c3-bb35-b0409553077c
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/windows_impair_defense_configure_app_install_control.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
