id: splunk-security-content-141e7fca-a9f0-40fd-a539-9aac8be41f1b
name: Windows Odbcconf Load DLL
description: The following analytic detects the execution of odbcconf.exe with the
  regsvr action to load a DLL. This is identified by monitoring command-line arguments
  in process creation logs from Endpoint Detection and Response (EDR) agents. This
  activity is significant as it may indicate an attempt to execute arbitrary code
  via DLL loading, a common technique used in various attack vectors. If confirmed
  malicious, this could allow an attacker to execute code with the privileges of the
  odbcconf.exe process, potentially leading to system compromise or further lateral
  movement.
severity: medium
enabled: false
tags:
  mitre:
  - T1218.008
  categories:
  - endpoint
references:
- https://strontic.github.io/xcyclopedia/library/odbcconf.exe-07FBA12552331355C103999806627314.html
- https://twitter.com/redcanary/status/1541838407894171650?s=20&t=kp3WBPtfnyA3xW7D7wx0uw
logsource:
  product: splunk
detection:
  splunk_spl: "| tstats `security_content_summariesonly` count min(_time) as firstTime\
    \ max(_time) as lastTime FROM datamodel=Endpoint.Processes\n  WHERE Processes.process_name=odbcconf.exe\
    \ Processes.process IN (\"*/a *\",  \"*-a*\") Processes.process=\"*regsvr*\"\n\
    \  BY Processes.action Processes.dest Processes.original_file_name\n     Processes.parent_process\
    \ Processes.parent_process_exec Processes.parent_process_guid\n     Processes.parent_process_id\
    \ Processes.parent_process_name Processes.parent_process_path\n     Processes.process\
    \ Processes.process_exec Processes.process_guid\n     Processes.process_hash Processes.process_id\
    \ Processes.process_integrity_level\n     Processes.process_name Processes.process_path\
    \ Processes.user\n     Processes.user_id Processes.vendor_product\n| `drop_dm_object_name(Processes)`\n\
    | `security_content_ctime(firstTime)`\n| `security_content_ctime(lastTime)`\n\
    | `windows_odbcconf_load_dll_filter`"
provenance:
  source: splunk/security_content
  source_id: 141e7fca-a9f0-40fd-a539-9aac8be41f1b
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/windows_odbcconf_load_dll.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
