id: splunk-security-content-1cb40e15-cffa-45cc-abbd-e35884a49766
name: Windows Spearphishing Attachment Connect To None MS Office Domain
description: The following analytic identifies suspicious Office documents that connect
  to non-Microsoft Office domains. It leverages Sysmon EventCode 22 to detect processes
  like winword.exe or excel.exe making DNS queries to domains outside of *.office.com
  or *.office.net. This activity is significant as it may indicate a spearphishing
  attempt using malicious documents to download or connect to harmful content. If
  confirmed malicious, this could lead to unauthorized data access, malware infection,
  or further network compromise.
severity: medium
enabled: false
tags:
  mitre:
  - T1566.001
  categories:
  - network
references:
- https://www.netskope.com/blog/asyncrat-using-fully-undetected-downloader
- https://malpedia.caad.fkie.fraunhofer.de/details/win.asyncrat
logsource:
  product: splunk
detection:
  splunk_spl: '`sysmon` EventCode=22 Image IN ("*\\winword.exe","*\\excel.exe","*\\powerpnt.exe","*\\mspub.exe","*\\visio.exe","*\\wordpad.exe","*\\wordview.exe","*\\onenote.exe",
    "*\\onenotem.exe","*\\onenoteviewer.exe","*\\onenoteim.exe", "*\\msaccess.exe")
    AND NOT(QueryName IN ("*.office.com", "*.office.net")) | stats count min(_time)
    as firstTime max(_time) as lastTime by answer answer_count dvc process_exec process_guid
    process_name query query_count reply_code_id signature signature_id src user_id
    vendor_product QueryName QueryResults QueryStatus | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)` | `windows_spearphishing_attachment_connect_to_none_ms_office_domain_filter`'
provenance:
  source: splunk/security_content
  source_id: 1cb40e15-cffa-45cc-abbd-e35884a49766
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/network/windows_spearphishing_attachment_connect_to_none_ms_office_domain.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
