id: splunk-security-content-203ef0ea-9bd8-11eb-8201-acde48001122
name: WinEvent Scheduled Task Created to Spawn Shell
description: The following analytic detects the creation of scheduled tasks designed
  to execute commands using native Windows shells like PowerShell, Cmd, Wscript, or
  Cscript. It leverages Windows Security EventCode 4698 to identify when such tasks
  are registered. This activity is significant as it may indicate an attempt to establish
  persistence or execute malicious commands on a system. If confirmed malicious, this
  could allow an attacker to maintain access, execute arbitrary code, or escalate
  privileges, posing a severe threat to the environment.
severity: medium
enabled: false
tags:
  mitre:
  - T1053.005
  categories:
  - endpoint
references:
- https://research.checkpoint.com/2021/irans-apt34-returns-with-an-updated-arsenal/
- https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventID=4698
- https://redcanary.com/threat-detection-report/techniques/scheduled-task-job/
- https://docs.microsoft.com/en-us/windows/win32/taskschd/time-trigger-example--scripting-?redirectedfrom=MSDN
logsource:
  product: splunk
detection:
  splunk_spl: "`wineventlog_security` EventCode=4698 TaskContent IN (\"*powershell.exe*\"\
    , \"*wscript.exe*\", \"*cscript.exe*\", \"*cmd.exe*\", \"*sh.exe*\", \"*ksh.exe*\"\
    , \"*zsh.exe*\", \"*bash.exe*\", \"*scrcons.exe*\", \"*pwsh.exe*\")\n  | stats\
    \ count min(_time) as firstTime max(_time) as lastTime\n    BY Computer, TaskName,\
    \ TaskContent\n  | rename Computer as dest\n  | `security_content_ctime(firstTime)`\n\
    \  | `security_content_ctime(lastTime)`\n  | `winevent_scheduled_task_created_to_spawn_shell_filter`"
provenance:
  source: splunk/security_content
  source_id: 203ef0ea-9bd8-11eb-8201-acde48001122
  source_commit: 4d4c7ee
  license: Apache-2.0
  license_url: https://github.com/splunk/security_content/blob/develop/LICENSE
  imported_at: '2026-05-04'
  imported_by: splunk_importer
  upstream_path: detections/endpoint/winevent_scheduled_task_created_to_spawn_shell.yml
notes:
  splunk_status: production
  splunk_data_source: []
  quarantine_reason: raw SPL — needs translation to AiSOC detection schema
