id: mitre-car-car-2021-05-008
name: Certutil exe certificate extraction
description: This search looks for arguments to certutil.exe indicating the manipulation
  or extraction of Certificate. This certificate can then be used to sign new authentication
  tokens specially inside Federated environments such as Windows ADFS.
severity: medium
enabled: false
tags:
  mitre:
  - T1606
  categories:
  - endpoint
references: []
logsource:
  category: Process
detection:
  implementations:
  - name: Pseudocode – CertUtil certificate extraction
    type: Pseudocode
    code: "processes = search Process:Create\ncertutil_downloads = filter processes\
      \ where (\n  exe =”C:\\Windows\\System32\\certutil.exe” AND command_line = *\
      \ -exportPFX * )\noutput certutil_downloads\n"
  - name: Splunk code
    type: Splunk
    code: '| tstats count min(_time) as firstTime values(Processes.process) as process
      max(_time) as lastTime from datamodel=Endpoint.Processes where Processes.process_name=certutil.exe
      Processes.process = "* -exportPFX *" by Processes.parent_process Processes.process_name
      Processes.process Processes.user'
provenance:
  source: mitre-attack/car
  source_id: CAR-2021-05-008
  source_commit: 1b922fe
  license: Apache-2.0
  license_url: https://github.com/mitre-attack/car/blob/master/LICENSE.txt
  imported_at: '2026-05-04'
  imported_by: car_importer
  upstream_path: analytics/CAR-2021-05-008.yaml
notes:
  car_status: needs_implementation
