id: mitre-car-car-2021-05-003
name: BCDEdit Failure Recovery Modification
description: This search looks for flags passed to bcdedit.exe modifications to the
  built-in Windows error recovery boot configurations. This is typically used by ransomware
  to prevent recovery.
severity: medium
enabled: false
tags:
  mitre:
  - T1490
  categories:
  - endpoint
references: []
logsource:
  category: Process
detection:
  implementations:
  - name: Pseudocode – detect attempts to add a certificate to a certificate store
    type: Pseudocode
    code: "processes = search Process:Create\nbcdedit_commands = filter processes\
      \ where (\n  exe = \"C:\\Windows\\System32\\bcdedit.exe\" AND command_line=\"\
      *recoveryenabled*\" )\noutput bcedit_commands\n"
  - name: Splunk code
    type: Splunk
    code: '| tstats count min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes
      where Processes.process_name = bcdedit.exe Processes.process="*recoveryenabled*"
      (Processes.process="* no*") by Processes.process_name Processes.process Processes.parent_process_name
      Processes.dest Processes.user'
provenance:
  source: mitre-attack/car
  source_id: CAR-2021-05-003
  source_commit: 1b922fe
  license: Apache-2.0
  license_url: https://github.com/mitre-attack/car/blob/master/LICENSE.txt
  imported_at: '2026-05-04'
  imported_by: car_importer
  upstream_path: analytics/CAR-2021-05-003.yaml
notes:
  car_status: needs_implementation
