id: mitre-car-car-2021-05-010
name: Create local admin accounts using net exe
description: This search looks for the creation of local administrator accounts using
  net.exe.
severity: medium
enabled: false
tags:
  mitre:
  - T1136
  categories:
  - endpoint
references: []
logsource:
  category: Process
detection:
  implementations:
  - name: Pseudocode – CertUtil certificate extraction
    type: Pseudocode
    code: "processes = search Process:Create\ncertutil_downloads = filter processes\
      \ where (\n  (exe = C:\\Windows\\System32\\net.exe OR exe = C:\\Windows\\System32\\\
      net1.exe ) AND (command_line = *localgroup* OR command_line = */add* OR command_line\
      \ = *user* ))\noutput certutil_downloads\n"
  - name: Splunk code
    type: Splunk
    code: '| tstats count values(Processes.user) as user values(Processes.parent_process)
      as parent_process min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes
      where (Processes.process_name=net.exe OR Processes.process_name=net1.exe) AND
      (Processes.process=*localgroup* OR Processes.process=*/add* OR Processes.process=*user*)
      by Processes.process Processes.process_name Processes.dest   |`create_local_admin_accounts_using_net_exe_filter`'
provenance:
  source: mitre-attack/car
  source_id: CAR-2021-05-010
  source_commit: 1b922fe
  license: Apache-2.0
  license_url: https://github.com/mitre-attack/car/blob/master/LICENSE.txt
  imported_at: '2026-05-04'
  imported_by: car_importer
  upstream_path: analytics/CAR-2021-05-010.yaml
notes:
  car_status: needs_implementation
