id: mitre-car-car-2020-05-001
name: MiniDump of LSASS
description: 'This analytic detects the minidump variant of credential dumping where
  a process opens lsass.exe in order to extract credentials using the Win32 API call
  [MiniDumpWriteDump](https://docs.microsoft.com/en-us/windows/win32/api/minidumpapiset/nf-minidumpapiset-minidumpwritedump).
  Tools like [SafetyKatz](https://github.com/GhostPack/SafetyKatz), [SafetyDump](https://github.com/m0rv4i/SafetyDump),
  and [Outflank-Dumpert](https://github.com/outflanknl/Dumpert) default to this variant
  and may be detected by this analytic, though keep in mind that not all options for
  using those tools will result in this specific behavior.


  The analytic is based on a [Sigma analytic](https://github.com/NVISO-BE/sigma-public/blob/master/rules/windows/sysmon/sysmon_lsass_memdump.yml)
  contributed by Samir Bousseaden and written up in a [blog on MENASEC](https://blog.menasec.net/2019/02/threat-hunting-21-procdump-or-taskmgr.html).
  It looks for a call trace that includes either dbghelp.dll or dbgcore.dll, which
  export the relevant functions/permissions to perform the dump. It also detects using
  the Windows Task Manager (taskmgr.exe) to dump lsass, which is described in [CAR-2019-08-001](/analytics/CAR-2019-08-001/).
  In this iteration of the Sigma analytic, the `GrantedAccess` filter isn''t included
  because it didn''t seem to filter out any false positives and introduces the potential
  for evasion.


  This analytic was tested both in a lab and in a production environment with a very
  low false-positive rate. werfault.exe and tasklist.exe, both standard Windows processes,
  showed up multiple times as false positives.


  NOTE - this analytic has no corresponding pseudocode implementation because the
  CAR data model doesn''t currently support process access events.'
severity: medium
enabled: false
tags:
  mitre:
  - T1003
  categories:
  - endpoint
references: []
logsource:
  category: Process
detection:
  implementations:
  - name: Lsass Process Access
    type: Splunk
    code: index=__your_sysmon_index__ EventCode=10 TargetImage="C:\\windows\\system32\\lsass.exe"
      (CallTrace="*dbghelp.dll*" OR CallTrace="*dbgcore.dll*")| table _time host SourceProcessId
      SourceImage
  - name: ''
    type: LogPoint
    code: 'norm_id=WindowsSysmon event_id=10 image="C:\Windows\system32\lsass.exe"
      call_trace IN ["*dbghelp.dll*", "*dbgcore.dll*"]

      | fields log_ts host source_process_id source_image'
provenance:
  source: mitre-attack/car
  source_id: CAR-2020-05-001
  source_commit: 1b922fe
  license: Apache-2.0
  license_url: https://github.com/mitre-attack/car/blob/master/LICENSE.txt
  imported_at: '2026-05-04'
  imported_by: car_importer
  upstream_path: analytics/CAR-2020-05-001.yaml
notes:
  car_status: needs_implementation
