id: mitre-car-car-2021-05-009
name: CertUtil With Decode Argument
description: CertUtil.exe may be used to `encode` and `decode` a file, including PE
  and script code. Encoding will convert a file to base64 with `-----BEGIN CERTIFICATE-----`
  and `-----END CERTIFICATE-----` tags. Malicious usage will include decoding a encoded
  file that was downloaded. Once decoded, it will be loaded by a parallel process.
  Note that there are two additional command switches that may be used - `encodehex`
  and `decodehex`. Similarly, the file will be encoded in HEX and later decoded for
  further execution. During triage, identify the source of the file being decoded.
  Review its contents or execution behavior for further analysis.
severity: medium
enabled: false
tags:
  mitre:
  - T1140
  categories:
  - endpoint
references: []
logsource:
  category: Process
detection:
  implementations:
  - name: Pseudocode – CertUtil with Decode Argument
    type: Pseudocode
    code: "processes = search Process:Create\ncertutil_downloads = filter processes\
      \ where (\n  exe =”C:\\Windows\\System32\\certutil.exe” AND command_line = *decode*\
      \ )\noutput certutil_downloads\n"
  - name: Splunk code
    type: Splunk
    code: '| tstats count min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes
      where Processes.process_name=certutil.exe Processes.process=*decode* by Processes.dest
      Processes.user Processes.parent_process Processes.process_name Processes.process
      Processes.process_id Processes.parent_process_id'
provenance:
  source: mitre-attack/car
  source_id: CAR-2021-05-009
  source_commit: 1b922fe
  license: Apache-2.0
  license_url: https://github.com/mitre-attack/car/blob/master/LICENSE.txt
  imported_at: '2026-05-04'
  imported_by: car_importer
  upstream_path: analytics/CAR-2021-05-009.yaml
notes:
  car_status: needs_implementation
