id: mitre-car-car-2021-05-005
name: BITSAdmin Download File
description: The following query identifies Microsoft Background Intelligent Transfer
  Service utility `bitsadmin.exe` using the `transfer` parameter to download a remote
  object. In addition, look for `download` or `upload` on the command-line, the switches
  are not required to perform a transfer. Capture any files downloaded. Review the
  reputation of the IP or domain used. Typically once executed, a follow on command
  will be used to execute the dropped file. Note that the network connection or file
  modification events related will not spawn or create from `bitsadmin.exe`, but the
  artifacts will appear in a parallel process of `svchost.exe` with a command-line
  similar to `svchost.exe -k netsvcs -s BITS`. It's important to review all parallel
  and child processes to capture any behaviors and artifacts. In some suspicious and
  malicious instances, BITS jobs will be created. You can use `bitsadmin /list /verbose`
  to list out the jobs during investigation.
severity: medium
enabled: false
tags:
  mitre:
  - T1197
  - T1105
  categories:
  - endpoint
references: []
logsource:
  category: Process
detection:
  implementations:
  - name: Pseudocode – detect BITS transfer jobs
    type: Pseudocode
    code: "processes = search Process:Create\nbitsadmin_commands = filter processes\
      \ where (\n  exe =\"C:\\Windows\\System32\\bitsadmin.exe\" AND command_line\
      \ = *transfer*)\noutput bitsadmin_commands\n"
  - name: Splunk code
    type: Splunk
    code: '| tstats count min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes
      where Processes.process_name=bitsadmin.exe Processes.process=*transfer* by Processes.dest
      Processes.user Processes.parent_process Processes.process_name Processes.process
      Processes.process_id Processes.parent_process_id'
provenance:
  source: mitre-attack/car
  source_id: CAR-2021-05-005
  source_commit: 1b922fe
  license: Apache-2.0
  license_url: https://github.com/mitre-attack/car/blob/master/LICENSE.txt
  imported_at: '2026-05-04'
  imported_by: car_importer
  upstream_path: analytics/CAR-2021-05-005.yaml
notes:
  car_status: needs_implementation
