id: sigmahq-sigma-16124c2d-e40b-4fcc-8f2c-5ab7870a2223
name: AWS EC2 Disable EBS Encryption
description: 'Identifies disabling of default Amazon Elastic Block Store (EBS) encryption
  in the current region.

  Disabling default encryption does not change the encryption status of your existing
  volumes.'
severity: medium
enabled: true
tags:
  mitre:
  - T1486
  - T1565
  categories:
  - cloud
references:
- https://docs.aws.amazon.com/AWSEC2/latest/APIReference/API_DisableEbsEncryptionByDefault.html
logsource:
  product: aws
  service: cloudtrail
detection:
  selection:
    eventSource: ec2.amazonaws.com
    eventName: DisableEbsEncryptionByDefault
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 16124c2d-e40b-4fcc-8f2c-5ab7870a2223
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/aws/cloudtrail/aws_ec2_disable_encryption.yml
falsepositives:
- System Administrator Activities
- DEV, UAT, SAT environment. You should apply this rule with PROD account only.
