id: chronicle-detection-rules-acer-quick-access-dll-searchorder-hijacking-and-potential-abuses
name: acer_quick_access__dll_searchorder_hijacking_and_potential_abuses
description: acer_quick_access__dll_searchorder_hijacking_and_potential_abuses
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references: []
logsource:
  product: chronicle
detection:
  chronicle_yaral: "rule acer_quick_access__dll_searchorder_hijacking_and_potential_abuses\
    \ {\n meta:\n    author = \"Osman Demir\"\n    description = \"Detects (CVE-2019-18670)\
    \ exploitation attempt  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.\"\
    \n    reference = \"https://tdm.socprime.com/tdm/info/1FHzWnzis8it\"\n    version\
    \ = \"0.01\"\n    created = \"2021-03-09\"\n    product = \"windows\"\n    service\
    \ = \"sysmon\"\n    mitre = \"persistence, privilege_escalation, defense_evasion,\
    \ T1038\"\n\n  events:\n(($selection1.metadata.product_event_type = \"7\" and\
    \ re.regex($selection1.target.process.file.full_path, `.*/QAAdminAgent\\.exe`)\
    \ and ($selection1.target.process.file.full_path = \"C:\\\\python27\\\\atiadlxx.dll\"\
    \ or $selection1.target.process.file.full_path = \"C:\\\\python27\\\\atiadlxy.dll\"\
    \ or $selection1.target.process.file.full_path = \"C:\\\\python27\\\\nvapi.dll\"\
    )) or ($selection1.metadata.product_event_type = \"11\" and ($selection1.target.file.full_path\
    \ = \"C:\\\\python27\\\\atiadlxx.dll\" or $selection1.target.file.full_path =\
    \ \"C:\\\\python27\\\\atiadlxy.dll\" or $selection1.target.file.full_path = \"\
    C:\\\\python27\\\\nvapi.dll\")))\n\n  condition:\n    $selection1\n}"
  chronicle_rule_name: acer_quick_access__dll_searchorder_hijacking_and_potential_abuses
provenance:
  source: chronicle/detection-rules
  source_id: acer_quick_access__dll_searchorder_hijacking_and_potential_abuses
  source_commit: 74dd490
  license: Apache-2.0
  license_url: https://github.com/chronicle/detection-rules/blob/main/LICENSE
  imported_at: '2026-05-04'
  imported_by: chronicle_importer
  upstream_path: rules/_deprecated/soc_prime_rules/proactive_exploit_detection/sysmon/acer_quick_access___dll_search_order_hijacking_and_potential_abuses.yaral
notes:
  chronicle_meta: {}
  quarantine_reason: raw YARA-L — needs translation to AiSOC schema
