id: chronicle-detection-rules-adfs-db-suspicious-named-pipe-connection
name: adfs_db_suspicious_named_pipe_connection
description: adfs_db_suspicious_named_pipe_connection
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references: []
logsource:
  product: chronicle
detection:
  chronicle_yaral: "/*\n * Copyright 2023 Google LLC\n *\n * Licensed under the Apache\
    \ License, Version 2.0 (the \"License\");\n * you may not use this file except\
    \ in compliance with the License.\n * You may obtain a copy of the License at\n\
    \ *\n *     https://www.apache.org/licenses/LICENSE-2.0\n *\n * Unless required\
    \ by applicable law or agreed to in writing, software\n * distributed under the\
    \ License is distributed on an \"AS IS\" BASIS,\n * WITHOUT WARRANTIES OR CONDITIONS\
    \ OF ANY KIND, either express or implied.\n * See the License for the specific\
    \ language governing permissions and\n * limitations under the License.\n */\n\
    \nrule adfs_db_suspicious_named_pipe_connection {\n\n  meta:\n    author = \"\
    Google Cloud Security\"\n    description = \"Connection to ADFS via named pipes\
    \ that are not using specific Windows ADFS processes may be indicative of user\
    \ attempting to access ADFS for suspicious purposes\"\n    rule_id = \"mr_a25913a1-65be-4cb5-b0de-6858dd04ac99\"\
    \n    rule_name = \"ADFS DB Suspicious Named Pipe Connection\"\n    reference\
    \ = \"https://github.com/Azure/Azure-Sentinel/blob/master/Solutions/Windows%20Security%20Events/Analytic%20Rules/ADFSDBNamedPipeConnection.yaml\"\
    \n    type = \"alert\"\n    platform = \"Windows\"\n    data_source = \"sysmon\"\
    \n    severity = \"Medium\"\n    priority = \"Medium\"\n\n events:\n   $process.metadata.event_type\
    \ = \"PROCESS_UNCATEGORIZED\"\n   $process.metadata.product_event_type = \"18\"\
    \n   $process.metadata.product_name = \"Microsoft-Windows-Sysmon\"\n   not re.regex($process.target.process.file.full_path,\
    \ `Microsoft.Identity.Health.Adfs.PshSurrogate.exe|Microsoft.IdentityServer.ServiceHost.exe|AzureADConnect.exe|Microsoft.Tri.Sensor.exe|wsmprovhost.exe|mmc.exe|sqlservr.exe|sqlwriter.exe`)\
    \ nocase\n   $process.target.resource.name = \"\\\\MICROSOFT##WID\\\\tsql\\\\\
    query\" nocase\n   /*\n   If you have a listing of ADFS servers, you can use a\
    \ reference list or enumerate them in the field below.\n   Alternatively, if ADFS\
    \ servers are grouped in an asset attribute, that attribute could be used instead.\n\
    \   */\n   $process.principal.hostname = /adfs/ nocase\n   $process.principal.hostname\
    \ = $hostname\n\n match:\n   $hostname over 5m\n\n outcome:\n    $risk_score =\
    \ 65\n    $event_count = count_distinct($process.metadata.id)\n    $security_summary\
    \ = array_distinct($process.security_result.summary)\n    $target_process_parent_process_command_line\
    \ = array_distinct($process.target.process.parent_process.command_line)\n    //added\
    \ to populate alert graph with additional context\n    //Commented out because\
    \ it is the same as the match variable, if match variable changes, uncomment to\
    \ use\n    //$principal_hostname = array_distinct($process.principal.hostname)\n\
    \    $principal_user_userid = array_distinct($process.principal.user.userid)\n\
    \    $target_process_pid = array_distinct($process.target.process.pid)\n    $target_process_command_line\
    \ = array_distinct($process.target.process.command_line)\n    $target_process_file_sha256\
    \ = array_distinct($process.target.process.file.sha256)\n    $target_process_file_full_path\
    \ = array_distinct($process.target.process.file.full_path)\n    $target_process_product_specific_process_id\
    \ = array_distinct($process.target.process.product_specific_process_id)\n    $target_process_parent_product_specific_process_id\
    \ = array_distinct($process.target.process.parent_process.product_specific_process_id)\n\
    \    $target_resource_name = array_distinct($process.target.resource.name)\n\n\
    \ condition:\n   $process\n}"
  chronicle_rule_name: adfs_db_suspicious_named_pipe_connection
provenance:
  source: chronicle/detection-rules
  source_id: adfs_db_suspicious_named_pipe_connection
  source_commit: 74dd490
  license: Apache-2.0
  license_url: https://github.com/chronicle/detection-rules/blob/main/LICENSE
  imported_at: '2026-05-04'
  imported_by: chronicle_importer
  upstream_path: rules/community/microsoft/adfs/adfs_db_suspicious_named_pipe_connection.yaral
notes:
  chronicle_meta: {}
  quarantine_reason: raw YARA-L — needs translation to AiSOC schema
