id: chronicle-detection-rules-adwind-rat-jrat
name: adwind_rat__jrat
description: adwind_rat__jrat
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references: []
logsource:
  product: chronicle
detection:
  chronicle_yaral: "rule adwind_rat__jrat {\n meta:\n    author = \"Florian Roth,\
    \ Tom Ueltschi\"\n    description = \"Detects javaw.exe in AppData folder as used\
    \ by Adwind / JRAT  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.\"\
    \n    reference = \"https://tdm.socprime.com/tdm/info/4VPNvKK4SGiZ\"\n    version\
    \ = \"0.01\"\n    created = \"2017/11/10\"\n    category = \"process_creation\"\
    \n    product = \"windows\"\n    mitre = \"execution, t1064\"\n\n  events:\n((re.regex($selection.target.process.command_line,\
    \ `.*\\\\AppData\\\\Roaming\\\\Oracle.*\\\\java.*\\.exe .*`) or re.regex($selection.target.process.command_line,\
    \ `.*cscript\\.exe .*Retrive.*\\.vbs .*`)) and ($selection.metadata.product_event_type\
    \ = \"4688\" or $selection.metadata.product_event_type = \"1\"))\n\n  condition:\n\
    \    $selection\n}"
  chronicle_rule_name: adwind_rat__jrat
provenance:
  source: chronicle/detection-rules
  source_id: adwind_rat__jrat
  source_commit: 74dd490
  license: Apache-2.0
  license_url: https://github.com/chronicle/detection-rules/blob/main/LICENSE
  imported_at: '2026-05-04'
  imported_by: chronicle_importer
  upstream_path: rules/_deprecated/soc_prime_rules/threat_hunting/process_creation/adwind_rat___jrat_part_1.yaral
notes:
  chronicle_meta: {}
  quarantine_reason: raw YARA-L — needs translation to AiSOC schema
