id: chronicle-detection-rules-apt10-behavior
name: apt10_behavior
description: apt10_behavior
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references: []
logsource:
  product: chronicle
detection:
  chronicle_yaral: "rule apt10_behavior {\n meta:\n    author = \"Ariel Millahuel\"\
    \n    description = \"Detects an ATP10's technique that uses Windows \\\"certutil.exe\\\
    \" functionality for payload decoding  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.\"\
    \n    reference = \"https://tdm.socprime.com/tdm/info/eG23WH8AEKB0\"\n    version\
    \ = \"0.01\"\n    created = \"2021-03-09\"\n    category = \"process_creation\"\
    \n    product = \"windows\"\n    mitre = \"execution, T1059\"\n\n  events:\n(($selection1.metadata.product_event_type\
    \ = \"4688\" or $selection1.metadata.product_event_type = \"1\") and (($selection1.target.process.file.full_path\
    \ = \"cmd.exe\" and (re.regex($selection1.target.process.command_line, `.*/c certutil\
    \ -decode C:\\\\ProgramData\\\\padre1\\.txt C:\\\\ProgramData.*\\\\GUP\\.txt.*`)\
    \ or re.regex($selection1.target.process.command_line, `.*/c certutil -decode\
    \ C:\\\\ProgramData\\\\padre2\\.txt C:\\\\ProgramData.*\\\\libcurl\\.txt.*`) or\
    \ re.regex($selection1.target.process.command_line, `.* /c certutil -decode C:\\\
    \\ProgramData\\\\padre3\\.txt C:\\\\ProgramData.*\\\\3F2E3AB9 .*`))) or ($selection1.target.process.file.full_path\
    \ = \"esentutl.exe\" and (re.regex($selection1.target.process.command_line, `.*\
    \ /y C:\\\\ProgramData.*\\\\GUP\\.txt /d C:\\\\ProgramData\\\\GUP\\.exe /o .*`)\
    \ or re.regex($selection1.target.process.command_line, `.* /y C:\\\\ProgramData.*\\\
    \\libcurl\\.txt /d C:\\\\ProgramData\\\\libcurl\\.dll /o .*`)))))\n\n  condition:\n\
    \    $selection1\n}"
  chronicle_rule_name: apt10_behavior
provenance:
  source: chronicle/detection-rules
  source_id: apt10_behavior
  source_commit: 74dd490
  license: Apache-2.0
  license_url: https://github.com/chronicle/detection-rules/blob/main/LICENSE
  imported_at: '2026-05-04'
  imported_by: chronicle_importer
  upstream_path: rules/_deprecated/soc_prime_rules/ioc_sigma/process_creation/apt10_behavior.yaral
notes:
  chronicle_meta: {}
  quarantine_reason: raw YARA-L — needs translation to AiSOC schema
