id: chronicle-detection-rules-aws-guardduty-trusted-or-threat-ip-lists-tampered
name: aws_guardduty_trusted_or_threat_ip_lists_tampered
description: aws_guardduty_trusted_or_threat_ip_lists_tampered
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references: []
logsource:
  product: chronicle
detection:
  chronicle_yaral: "/*\n * Copyright 2023 Google LLC\n *\n * Licensed under the Apache\
    \ License, Version 2.0 (the \"License\");\n * you may not use this file except\
    \ in compliance with the License.\n * You may obtain a copy of the License at\n\
    \ *\n *     https://www.apache.org/licenses/LICENSE-2.0\n *\n * Unless required\
    \ by applicable law or agreed to in writing, software\n * distributed under the\
    \ License is distributed on an \"AS IS\" BASIS,\n * WITHOUT WARRANTIES OR CONDITIONS\
    \ OF ANY KIND, either express or implied.\n * See the License for the specific\
    \ language governing permissions and\n * limitations under the License.\n */\n\
    \nrule aws_guardduty_trusted_or_threat_ip_lists_tampered {\n\n  meta:\n    author\
    \ = \"Google Cloud Security\"\n    description = \"Detects when a GuardDuty Detector's\
    \ trusted or threat intel IP lists are deleted or disabled.\"\n    rule_id = \"\
    mr_bdf03398-6341-4f2a-a8ce-9056c82fda2e\"\n    rule_name = \"AWS GuardDuty Trusted\
    \ Or Threat IP Lists Tampered\"\n    mitre_attack_tactic = \"Defense Evasion\"\
    \n    mitre_attack_technique = \"Impair Defenses\"\n    mitre_attack_url = \"\
    https://attack.mitre.org/techniques/T1562/\"\n    mitre_attack_version = \"v13.1\"\
    \n    type = \"Alert\"\n    data_source = \"AWS CloudTrail\"\n    platform = \"\
    AWS\"\n    severity = \"High\"\n    priority = \"High\"\n\n  events:\n    $cloudtrail.metadata.vendor_name\
    \ = \"AMAZON\"\n    $cloudtrail.metadata.product_name = \"AWS CloudTrail\"\n \
    \   $cloudtrail.metadata.product_event_type = \"DeleteIPSet\" or $cloudtrail.metadata.product_event_type\
    \ = \"DeleteThreatIntelSet\" or\n    (\n      (\n          $cloudtrail.metadata.product_event_type\
    \ = \"UpdateIPSet\" or\n          $cloudtrail.metadata.product_event_type = \"\
    UpdateThreatIntelSet\"\n      )\n      and $cloudtrail.target.resource.attribute.labels[\"\
    activate\"] = \"false\"\n    )\n    $cloudtrail.security_result.action = \"ALLOW\"\
    \n\n  outcome:\n    $risk_score = max(\n        // Unauthorized geographies\n\
    \        if($cloudtrail.principal.ip_geo_artifact.location.country_or_region =\
    \ \"Cuba\", 40) +\n        if($cloudtrail.principal.ip_geo_artifact.location.country_or_region\
    \ = \"Iran\", 40) +\n        if($cloudtrail.principal.ip_geo_artifact.location.country_or_region\
    \ = \"North Korea\" , 40) +\n        if($cloudtrail.principal.ip_geo_artifact.location.country_or_region\
    \ = \"Russia\", 40) +\n        if($cloudtrail.principal.ip_geo_artifact.location.country_or_region\
    \ = \"Syria\", 40)\n    )\n    $mitre_attack_tactic = \"Defense Evasion\"\n  \
    \  $mitre_attack_technique = \"Impair Defenses\"\n    $mitre_attack_technique_id\
    \ = \"T1562\"\n    $event_count = count_distinct($cloudtrail.metadata.id)\n  \
    \  $network_http_user_agent = $cloudtrail.network.http.user_agent\n    $principal_ip\
    \ = array_distinct($cloudtrail.principal.ip)\n    $principal_ip_country = array_distinct($cloudtrail.principal.ip_geo_artifact.location.country_or_region)\n\
    \    $principal_ip_state = array_distinct($cloudtrail.principal.ip_geo_artifact.location.state)\n\
    \    $principal_user_display_name = $cloudtrail.principal.user.user_display_name\n\
    \    $recipient_aws_account_id = $cloudtrail.additional.fields[\"recipientAccountId\"\
    ]\n    $aws_region = $cloudtrail.principal.location.name\n    $target_resource_name\
    \ = $cloudtrail.target.resource.name\n    $target_resource_product_object_id =\
    \ $cloudtrail.target.resource.product_object_id\n\n  condition:\n    $cloudtrail\n\
    }"
  chronicle_rule_name: aws_guardduty_trusted_or_threat_ip_lists_tampered
provenance:
  source: chronicle/detection-rules
  source_id: aws_guardduty_trusted_or_threat_ip_lists_tampered
  source_commit: 74dd490
  license: Apache-2.0
  license_url: https://github.com/chronicle/detection-rules/blob/main/LICENSE
  imported_at: '2026-05-04'
  imported_by: chronicle_importer
  upstream_path: rules/community/aws/cloudtrail/aws_guardduty_trusted_or_threat_ip_lists_tampered.yaral
notes:
  chronicle_meta: {}
  quarantine_reason: raw YARA-L — needs translation to AiSOC schema
