id: chronicle-detection-rules-lsass-process-memory-dump-file-creation
name: lsass_process_memory_dump_file_creation
description: lsass_process_memory_dump_file_creation
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references: []
logsource:
  product: chronicle
detection:
  chronicle_yaral: "/*\n * Copyright 2025 Google LLC\n *\n * Licensed under the Apache\
    \ License, Version 2.0 (the \"License\");\n * you may not use this file except\
    \ in compliance with the License.\n * You may obtain a copy of the License at\n\
    \ *\n *     https://www.apache.org/licenses/LICENSE-2.0\n *\n * Unless required\
    \ by applicable law or agreed to in writing, software\n * distributed under the\
    \ License is distributed on an \"AS IS\" BASIS,\n * WITHOUT WARRANTIES OR CONDITIONS\
    \ OF ANY KIND, either express or implied.\n * See the License for the specific\
    \ language governing permissions and\n * limitations under the License.\n */\n\
    \nrule lsass_process_memory_dump_file_creation {\n\n  meta:\n    author = \"Florian\
    \ Roth (Nextron Systems)\"\n    description = \"Detects creation of files with\
    \ names used by different memory dumping tools to create a memory dump of the\
    \ LSASS process memory, which contains user credentials\"\n    reference = \"\
    https://github.com/SigmaHQ/sigma/blob/master/rules/windows/file/file_event/file_event_win_lsass_default_dump_file_names.yml\"\
    \n    license = \"https://github.com/SigmaHQ/Detection-Rule-License/blob/main/LICENSE.Detection.Rules.md\"\
    \n    rule_name = \"LSASS Process Memory Dump Files\"\n    sigma_uuid = \"a5a2d357-1ab8-4675-a967-ef9990a59391\"\
    \n    sigma_status = \"test\"\n    rule_id = \"mr_8fd8cb2b-18dc-468d-acdf-899da9f6de43\"\
    \n    tactic = \"TA0006\"\n    technique = \"T1003.001\"\n    type = \"Detection\"\
    \n    data_source = \"Sysmon\"\n    platform = \"Windows\"\n    severity = \"\
    High\"\n    priority = \"High\"\n    false_positives = \"Unknown\"\n\n  events:\n\
    \    $file.metadata.event_type = \"FILE_CREATION\"\n    (\n      re.regex($file.target.file.full_path,\
    \ `\\\\(Andrew\\.dmp|Coredump\\.dmp|lsass\\.dmp|lsass\\.rar|lsass\\.zip|NotLSASS\\\
    .zip|PPLBlade\\.dmp|rustive\\.dmp)\\$`) nocase or\n      strings.contains($file.target.file.full_path,\
    \ \"\\\\lsass_2\") or\n      strings.contains($file.target.file.full_path, \"\\\
    \\lsassdmp\") or\n      strings.contains($file.target.file.full_path, \"\\\\lsassdump\"\
    ) or\n      (\n        strings.contains(strings.to_lower($file.target.file.full_path),\
    \ \"\\\\lsass\") and\n        re.regex($file.target.file.full_path, `\\.dmp$`)\
    \ nocase\n      )\n      or\n      (\n        strings.contains(strings.to_lower($file.target.file.full_path),\
    \ \"sqldmpr\") and\n        re.regex($file.target.file.full_path, `\\.mdmp$`)\
    \ nocase\n      )\n      or\n      (\n        (\n          strings.contains(strings.to_lower($file.target.file.full_path),\
    \ \"\\\\nanodump\") or\n          strings.contains(strings.to_lower($file.target.file.full_path),\
    \ \"\\\\proc_\")\n        )\n        and\n        re.regex($file.target.file.full_path,\
    \ `\\.dmp$`) nocase\n      )\n    )\n    $file.principal.hostname = $hostname\n\
    \n  match:\n    $hostname over 5m\n\n  outcome:\n    //example usage of specifying\
    \ test user and hostname to adjust risk score\n    $risk_score = max(if($file.principal.user.userid\
    \ = \"user\" and $file.principal.hostname = \"hostname\", 0, 15))\n    $principal_hostname\
    \ = array_distinct($file.principal.hostname)\n    $principal_process_pid = array_distinct($file.principal.process.pid)\n\
    \    $principal_process_command_line = array_distinct($file.principal.process.command_line)\n\
    \    $principal_process_file_sha256 = array_distinct($file.principal.process.file.sha256)\n\
    \    $principal_process_file_full_path = array_distinct($file.principal.process.file.full_path)\n\
    \    $principal_process_product_specific_process_id = array_distinct($file.principal.process.product_specific_process_id)\n\
    \    $principal_process_parent_process_product_specific_process_id = array_distinct($file.principal.process.parent_process.product_specific_process_id)\n\
    \    $principal_user_userid = array_distinct($file.principal.user.userid)\n  \
    \  $target_file_sha256 = array_distinct($file.target.file.sha256)\n    $target_file_full_path\
    \ = array_distinct($file.target.file.full_path)\n\n  condition:\n    $file\n}"
  chronicle_rule_name: lsass_process_memory_dump_file_creation
provenance:
  source: chronicle/detection-rules
  source_id: lsass_process_memory_dump_file_creation
  source_commit: 74dd490
  license: Apache-2.0
  license_url: https://github.com/chronicle/detection-rules/blob/main/LICENSE
  imported_at: '2026-05-04'
  imported_by: chronicle_importer
  upstream_path: rules/community/microsoft/windows/lsass_process_memory_dump_file_creation.yaral
notes:
  chronicle_meta: {}
  quarantine_reason: raw YARA-L — needs translation to AiSOC schema
