id: chronicle-detection-rules-lsass-memory-dump-comsvcs-dll
name: lsass_memory_dump_comsvcs_dll
description: lsass_memory_dump_comsvcs_dll
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references: []
logsource:
  product: chronicle
detection:
  chronicle_yaral: "/*\n * Copyright 2025 Google LLC\n *\n * Licensed under the Apache\
    \ License, Version 2.0 (the \"License\");\n * you may not use this file except\
    \ in compliance with the License.\n * You may obtain a copy of the License at\n\
    \ *\n *     https://www.apache.org/licenses/LICENSE-2.0\n *\n * Unless required\
    \ by applicable law or agreed to in writing, software\n * distributed under the\
    \ License is distributed on an \"AS IS\" BASIS,\n * WITHOUT WARRANTIES OR CONDITIONS\
    \ OF ANY KIND, either express or implied.\n * See the License for the specific\
    \ language governing permissions and\n * limitations under the License.\n */\n\
    \nrule lsass_memory_dump_comsvcs_dll {\n\n  meta:\n    author = \"Roberto Rodriguez\
    \ (Cyb3rWard0g), OTR (Open Threat Research)\"\n    description = \"Detects adversaries\
    \ leveraging the MiniDump export function from comsvcs.dll via rundll32 to perform\
    \ a memory dump from lsass\"\n    reference = \"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_access/proc_access_win_lsass_dump_comsvcs_dll.yml\"\
    \n    license = \"https://github.com/SigmaHQ/Detection-Rule-License/blob/main/LICENSE.Detection.Rules.md\"\
    \n    rule_name = \"Lsass Memory Dump via Comsvcs DLL\"\n    sigma_uuid = \"a49fa4d5-11db-418c-8473-1e014a8dd462\"\
    \n    sigma_status = \"test\"\n    rule_id = \"mr_4efe14fb-53fb-49ba-b137-f5d70cb6adb9\"\
    \n    tactic = \"TA0006\"\n    technique = \"T1003.001\"\n    type = \"Detection\"\
    \n    data_source = \"Sysmon\"\n    platform = \"Windows\"\n    severity = \"\
    High\"\n    priority = \"High\"\n    false_positives = \"Unknown\"\n\n  events:\n\
    \    $process.metadata.event_type = \"PROCESS_OPEN\"\n    re.regex($process.target.process.file.full_path,\
    \ `\\\\lsass\\.exe$`) nocase\n    re.regex($process.principal.process.file.full_path,\
    \ `\\\\rundll32\\.exe$`) nocase\n    strings.contains(strings.to_lower($process.additional.fields[\"\
    CallTrace\"]), \"comsvcs.dll\")\n\n    $process.principal.hostname = $hostname\n\
    \n  match:\n    $hostname over 5m\n\n  outcome:\n    //example usage of specifying\
    \ test hostname to adjust risk score\n    $risk_score = max(if($process.principal.hostname\
    \ = \"hostname\", 0, 15))\n    $principal_process_pid = array_distinct($process.principal.process.pid)\n\
    \    $principal_process_command_line = array_distinct($process.principal.process.command_line)\n\
    \    $principal_process_file_sha256 = array_distinct($process.principal.process.file.sha256)\n\
    \    $principal_process_file_full_path = array_distinct($process.principal.process.file.full_path)\n\
    \    $principal_process_product_specfic_process_id = array_distinct($process.principal.process.product_specific_process_id)\n\
    \    $principal_process_parent_process_product_specfic_process_id = array_distinct($process.principal.process.parent_process.product_specific_process_id)\n\
    \    $target_process_pid = array_distinct($process.target.process.pid)\n    $target_process_command_line\
    \ = array_distinct($process.target.process.command_line)\n    $target_process_file_sha256\
    \ = array_distinct($process.target.process.file.sha256)\n    $target_process_file_full_path\
    \ = array_distinct($process.target.process.file.full_path)\n    $target_process_product_specfic_process_id\
    \ = array_distinct($process.target.process.product_specific_process_id)\n    $log_type\
    \ = array_distinct(strings.concat($process.metadata.log_type,\"/\",$process.metadata.product_event_type))\n\
    \n  condition:\n    $process\n}"
  chronicle_rule_name: lsass_memory_dump_comsvcs_dll
provenance:
  source: chronicle/detection-rules
  source_id: lsass_memory_dump_comsvcs_dll
  source_commit: 74dd490
  license: Apache-2.0
  license_url: https://github.com/chronicle/detection-rules/blob/main/LICENSE
  imported_at: '2026-05-04'
  imported_by: chronicle_importer
  upstream_path: rules/community/microsoft/windows/lsass_memory_dump_comsvcs_dll.yaral
notes:
  chronicle_meta: {}
  quarantine_reason: raw YARA-L — needs translation to AiSOC schema
