id: chronicle-detection-rules-oilrig-helminth-sysmon-behavior-historic-indicators
name: oilrig_helminth_sysmon_behavior_historic_indicators
description: oilrig_helminth_sysmon_behavior_historic_indicators
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references: []
logsource:
  product: chronicle
detection:
  chronicle_yaral: "rule oilrig_helminth_sysmon_behavior_historic_indicators {\n meta:\n\
    \    author = \"Lee Archinal\"\n    description = \"This content detects characteristics\
    \ of an OilRig executable Helminth as seen in a malware lab.  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.\"\
    \n    reference = \"https://tdm.socprime.com/tdm/info/vjAgSnsMvaap\"\n    version\
    \ = \"0.01\"\n    created = \"2019/01/11\"\n    product = \"windows\"\n    service\
    \ = \"sysmon\"\n    mitre = \"persistence, t1053, execution, t1059\"\n\n  events:\n\
    ($selection1.metadata.product_event_type = \"11\" and ($selection1.target.file.full_path\
    \ = \"C:\\\\ProgramData\\\\mia4354.tmp\" or $selection1.target.file.full_path\
    \ = \"C:\\\\ProgramData\\\\mia4354.tmp\\\\JuniperSetupClientInstaller.msi\" or\
    \ $selection1.target.file.full_path = \"C:\\\\ProgramData\\\\mia4354.tmp\\\\OFFLINE\\\
    \\9A189DFE\\\\C7B7C186\" or $selection1.target.file.full_path = \"C:\\\\ProgramData\\\
    \\mia4354.tmp\\\\OFFLINE\\\\9A189DFE\" or $selection1.target.file.full_path =\
    \ \"C:\\\\ProgramData\\\\mia4354.tmp\\\\OFFLINE\" or $selection1.target.file.full_path\
    \ = \"C:\\\\ProgramData\\\\mia4354.tmp\\\\OFFLINE\\\\9A189DFE\\\\C7B7C186\\\\\
    main.vbs\" or $selection1.target.file.full_path = \"C:\\\\ProgramData\\\\mia4354.tmp\\\
    \\OFFLINE\\\\6908B9F2\\\\6A98A6DF\" or $selection1.target.file.full_path = \"\
    C:\\\\ProgramData\\\\mia4354.tmp\\\\OFFLINE\\\\6908B9F2\" or $selection1.target.file.full_path\
    \ = \"C:\\\\ProgramData\\\\mia4354.tmp\\\\OFFLINE\\\\6908B9F2\\\\6A98A6DF\\\\\
    JuniperSetupClientInstaller.exe\" or $selection1.target.file.full_path = \"C:\\\
    \\ProgramData\\\\mia4354.tmp\\\\JuniperSetupClientInstaller.exe\" or $selection1.target.file.full_path\
    \ = \"C:\\\\ProgramData\\\\mia4354.tmp\\\\OFFLINE\\\\mMSI.dll\" or $selection1.target.file.full_path\
    \ = \"C:\\\\ProgramData\\\\mia4354.tmp\\\\OFFLINE\\\\mMSI.dll\\\\mMSIExec.dll\"\
    \ or $selection1.target.file.full_path = \"C:\\\\ProgramData\\\\mia4354.tmp\\\\\
    mia.lib\" or $selection1.target.file.full_path = \"C:\\\\ProgramData\\\\mia4354.tmp\\\
    \\JuniperSetupClientInstaller.res\" or $selection1.target.file.full_path = \"\
    AppData\\\\Roaming\\\\Microsoft Temperary\" or $selection1.target.file.full_path\
    \ = \"AppData\\\\Roaming\\\\Microsoft Temperary\\\\adbmanager.exe\" or $selection1.target.file.full_path\
    \ = \"AppData\\\\Local\\\\Temp\\\\acro\" or $selection1.target.file.full_path\
    \ = \"AppData\\\\Roaming\\\\Microsoft Temperary\\\\adbtray.exe\" or $selection1.target.file.full_path\
    \ = \"AppData\\\\Local\\\\Temp\\\\acro\\\\Users\" or $selection1.target.file.full_path\
    \ = \"AppData\\\\Local\\\\Temp\\\\acro\\\\Users\\\\in\" or $selection1.target.file.full_path\
    \ = \"C:\\\\Users\\\\Public\\\\Libraries\\\\~Windows\\\\wintrust.hlm\" or $selection1.target.file.full_path\
    \ = \"C:\\\\Users\\\\Public\\\\Libraries\\\\~Windows\" or $selection1.target.file.full_path\
    \ = \"AppData\\\\Local\\\\Temp\\\\acro\\\\Users\\\\config.txt\" or $selection1.target.file.full_path\
    \ = \"AppData\\\\Roaming\\\\Microsoft\\\\Windows\\\\Start Menu\\\\Programs\\\\\
    Certificate.ico\" or $selection1.target.file.full_path = \"AppData\\\\Roaming\\\
    \\Microsoft Temperary\\\\Certificate Managment.lnk\" or $selection1.target.file.full_path\
    \ = \"\"))\n\n  condition:\n    $selection1\n}"
  chronicle_rule_name: oilrig_helminth_sysmon_behavior_historic_indicators
provenance:
  source: chronicle/detection-rules
  source_id: oilrig_helminth_sysmon_behavior_historic_indicators
  source_commit: 74dd490
  license: Apache-2.0
  license_url: https://github.com/chronicle/detection-rules/blob/main/LICENSE
  imported_at: '2026-05-04'
  imported_by: chronicle_importer
  upstream_path: rules/_deprecated/soc_prime_rules/threat_hunting/sysmon/oilrig_helminth__sysmon_behavior___historic_indicators.yaral
notes:
  chronicle_meta: {}
  quarantine_reason: raw YARA-L — needs translation to AiSOC schema
