id: chronicle-detection-rules-port-proxy-forwarding-t1090-cisa-report
name: port_proxy_forwarding_T1090_cisa_report
description: port_proxy_forwarding_T1090_cisa_report
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references: []
logsource:
  product: chronicle
detection:
  chronicle_yaral: "/*\n * Copyright 2023 Google LLC\n *\n * Licensed under the Apache\
    \ License, Version 2.0 (the \"License\");\n * you may not use this file except\
    \ in compliance with the License.\n * You may obtain a copy of the License at\n\
    \ *\n *     https://www.apache.org/licenses/LICENSE-2.0\n *\n * Unless required\
    \ by applicable law or agreed to in writing, software\n * distributed under the\
    \ License is distributed on an \"AS IS\" BASIS,\n * WITHOUT WARRANTIES OR CONDITIONS\
    \ OF ANY KIND, either express or implied.\n * See the License for the specific\
    \ language governing permissions and\n * limitations under the License.\n */\n\
    \nrule port_proxy_forwarding_T1090_cisa_report {\n\n  meta:\n    author = \"Google\
    \ Cloud Security\"\n    description = \"Detects port forwarding being enabled\
    \ using netsh command and registry settings created or modified in support of\
    \ portproxy v4tov4\"\n    rule_id = \"mr_4c6f2d66-ed6f-4dda-bd2f-7c545898468b\"\
    \n    rule_name = \"MITRE ATT&CK T1090 Port Proxy Forwarding CISA Report\"\n \
    \   type = \"hunt\"\n    platform = \"Windows\"\n    data_source = \"microsoft\
    \ sysmon, windows event log\"\n    tactic = \"TA0011\"\n    technique = \"T1090\"\
    \n    reference = \"https://media.defense.gov/2023/May/24/2003229517/-1/-1/0/CSA_Living_off_the_Land.PDF\"\
    \n    severity = \"Low\"\n    priority = \"Low\"\n\n  events:\n    (\n       \
    \ $process.metadata.event_type = \"PROCESS_LAUNCH\" and\n\n        // cisa report\
    \ referenced cmd /c in their report throughout, can filter this in/out for tuning\
    \ as needed\n        re.regex($process.target.process.command_line, `(|cmd.*/c).*netsh.*interface.*portproxy.*add.*v4tov4`)\
    \ nocase\n        // For greater precision to align with the report, comment out\
    \ the above line and uncomment the below line to incorporate exact ports referenced\n\
    \        //re.regex($process.target.process.command_line, `(|cmd.*/c).*netsh.*interface.*portproxy.*add.*v4tov4.*port\\\
    =(9999|50100).*port\\=(8443|1433)`) nocase\n    )\n    or\n    (\n        // Looks\
    \ for the actual registry creation or modification that would accompany portproxy\
    \ command executing\n        (\n        $process.metadata.event_type = \"REGISTRY_CREATION\"\
    \ or\n        $process.metadata.event_type = \"REGISTRY_MODIFICATION\"\n     \
    \   ) and\n        $process.target.registry.registry_key = \"HKLM\\\\System\\\\\
    CurrentControlSet\\\\Services\\\\PortProxy\\\\v4tov4\"\n    )\n\n    $process.principal.hostname\
    \ = $hostname\n\n  match:\n    $hostname over 5m\n\n  outcome:\n    $risk_score\
    \ = 35\n    $event_count = count_distinct($process.metadata.id)\n    // added\
    \ to populate alert graph with additional context\n    // Commented out principal.hostname\
    \ because it is already represented in graph as match variable. If match changes,\
    \ can uncomment to add to results\n    //$principal_hostname = array_distinct($process.principal.hostname)\n\
    \    $principal_process_pid = array_distinct($process.principal.process.pid)\n\
    \    $principal_process_command_line = array_distinct($process.principal.process.command_line)\n\
    \    $principal_process_file_sha256 = array_distinct($process.principal.process.file.sha256)\n\
    \    $principal_process_file_full_path = array_distinct($process.principal.process.file.full_path)\n\
    \    $principal_process_product_specific_process_id = array_distinct($process.principal.process.product_specific_process_id)\n\
    \    $principal_process_parent_process_product_specific_process_id = array_distinct($process.principal.process.parent_process.product_specific_process_id)\n\
    \    $target_process_pid = array_distinct($process.target.process.pid)\n    $target_process_command_line\
    \ = array_distinct($process.target.process.command_line)\n    $target_process_file_sha256\
    \ = array_distinct($process.target.process.file.sha256)\n    $target_process_file_full_path\
    \ = array_distinct($process.target.process.file.full_path)\n    $target_process_product_specific_process_id\
    \ = array_distinct($process.target.process.product_specific_process_id)\n    $principal_user_userid\
    \ = array_distinct($process.principal.user.userid)\n\n  condition:\n    $process\n\
    }"
  chronicle_rule_name: port_proxy_forwarding_T1090_cisa_report
provenance:
  source: chronicle/detection-rules
  source_id: port_proxy_forwarding_T1090_cisa_report
  source_commit: 74dd490
  license: Apache-2.0
  license_url: https://github.com/chronicle/detection-rules/blob/main/LICENSE
  imported_at: '2026-05-04'
  imported_by: chronicle_importer
  upstream_path: rules/community/microsoft/windows/port_proxy_forwarding_T1090_cisa_report.yaral
notes:
  chronicle_meta: {}
  quarantine_reason: raw YARA-L — needs translation to AiSOC schema
