id: chronicle-detection-rules-psexec-process-has-terminated
name: psexec_process_has_terminated
description: psexec_process_has_terminated
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references: []
logsource:
  product: chronicle
detection:
  chronicle_yaral: "rule psexec_process_has_terminated {\n meta:\n    author = \"\
    Lee Archinal\"\n    description = \"This detects when PsExec's process ends. \
    \ License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.\"\
    \n    reference = \"https://tdm.socprime.com/tdm/info/ciE6swnMJ5Xh\"\n    version\
    \ = \"0.01\"\n    created = \"2019/04/29\"\n    product = \"windows\"\n    service\
    \ = \"sysmon\"\n    mitre = \"Defense_evasion, t1112, Execution, t1059\"\n\n \
    \ events:\n($selection.metadata.product_event_type = \"5\" and re.regex($selection.target.process.file.full_path,\
    \ `.*\\\\psexec\\.exe`))\n\n  condition:\n    $selection\n}"
  chronicle_rule_name: psexec_process_has_terminated
provenance:
  source: chronicle/detection-rules
  source_id: psexec_process_has_terminated
  source_commit: 74dd490
  license: Apache-2.0
  license_url: https://github.com/chronicle/detection-rules/blob/main/LICENSE
  imported_at: '2026-05-04'
  imported_by: chronicle_importer
  upstream_path: rules/_deprecated/soc_prime_rules/ioc_sigma/sysmon/psexec_process_has_terminated.yaral
notes:
  chronicle_meta: {}
  quarantine_reason: raw YARA-L — needs translation to AiSOC schema
