id: chronicle-detection-rules-recon-environment-enumeration-system-cisa-report
name: recon_environment_enumeration_system_cisa_report
description: recon_environment_enumeration_system_cisa_report
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references: []
logsource:
  product: chronicle
detection:
  chronicle_yaral: "/*\n * Copyright 2023 Google LLC\n *\n * Licensed under the Apache\
    \ License, Version 2.0 (the \"License\");\n * you may not use this file except\
    \ in compliance with the License.\n * You may obtain a copy of the License at\n\
    \ *\n *     https://www.apache.org/licenses/LICENSE-2.0\n *\n * Unless required\
    \ by applicable law or agreed to in writing, software\n * distributed under the\
    \ License is distributed on an \"AS IS\" BASIS,\n * WITHOUT WARRANTIES OR CONDITIONS\
    \ OF ANY KIND, either express or implied.\n * See the License for the specific\
    \ language governing permissions and\n * limitations under the License.\n */\n\
    \nrule recon_environment_enumeration_system_cisa_report {\n\n  meta:\n    author\
    \ = \"Google Cloud Security\"\n    description = \"Detects system enumeration\
    \ events as identified in CISA Living off the Land pdf. Alone they may be normal\
    \ but in concert, they may be worth looking into\"\n    rule_id = \"mr_086dede6-33ba-42df-b001-5595ceb0d589\"\
    \n    rule_name = \"Recon Environment Enumeration System CISA Report\"\n    type\
    \ = \"hunt\"\n    platform = \"Windows\"\n    data_source = \"microsoft sysmon,\
    \ windows event logs\"\n    tactic = \"TA0007\"\n    technique = \"T1082\"\n \
    \   reference = \"https://media.defense.gov/2023/May/24/2003229517/-1/-1/0/CSA_Living_off_the_Land.PDF\"\
    \n    severity = \"Low\"\n    priority = \"Low\"\n\n  events:\n    $process.metadata.event_type\
    \ = \"PROCESS_LAUNCH\"\n    $process.principal.hostname = $hostname\n    $process.target.process.command_line\
    \ = $command_line\n\n    re.regex($process.target.process.command_line, `wevtutil.*qe.*security.*\\\
    /rd:true.*\\/f:text.*\\/q:.*\\[System\\[\\(EventID`) nocase\n    // below is the\
    \ more specific command down to the event id, could comment out the about and\
    \ use this instead if desired\n    //re.regex($process.target.process.command_line,\
    \ `wevtutil.*qe.*security.*\\/rd:true.*\\/f:text.*\\/q:\\*\\[System\\[\\(EventID=4624\\\
    ).*TimeCreated\\[@SystemTime.*\\]\\].*EventData\\[Data.*\\]\\]`) nocase\n\n  \
    \  or\n\n    // cisa report referenced cmd /c in their report throughout, can\
    \ filter this in/out for tuning as desired\n    // other wmic switches like /user\
    \ and /password, these have been excluded to focus on the commands being issued\
    \ since local access does not require these\n    (\n        re.regex($process.target.process.command_line,\
    \ `(|cmd.*/c).*ldifde.exe.*-f.*-p.*subtree`) nocase or\n        re.regex($process.target.process.command_line,\
    \ `(|cmd.*/c).*reg.*query.*hklm\\\\software\\\\`) nocase or\n        re.regex($process.target.process.command_line,\
    \ `(|cmd.*/c).*systeminfo`) nocase or\n        re.regex($process.target.process.command_line,\
    \ `(|cmd.*/c).*tasklist.*\\/v`) nocase or\n        re.regex($process.target.process.command_line,\
    \ `(|cmd.*/c).*whoami`) nocase or\n        re.regex($process.target.process.command_line,\
    \ `(|cmd.*/c).*wmic.*volume.*list.*brief`) nocase or\n        // cisa report called\
    \ out wmic volume list brief, below is alternate that removed brief to widen criteria\n\
    \        //re.regex($process.target.process.command_line, `(|cmd.*/c).*wmic.*volume.*list`)\
    \ nocase or\n        re.regex($process.target.process.command_line, `(|cmd.*/c).*wmic.*service.*brief`)\
    \ nocase or\n        re.regex($process.target.process.command_line, `(|cmd.*/c).*wmic.*product.*list.*brief`)\
    \ nocase or\n        re.regex($process.target.process.command_line, `(|cmd.*/c).*wmic.*baseboard.*list.*full`)\
    \ nocase or\n        re.regex($process.target.process.command_line, `(|cmd.*/c).*wmic.*path.*win32_logicaldisk.*get.*(caption|filesystem|freespace|size|volumename)`)\
    \ nocase\n    )\n\n  match:\n    $hostname over 15m\n\n  outcome:\n    $risk_score\
    \ = 35\n    $event_count = count_distinct($process.metadata.id)\n    $unique_command_line_threshold\
    \ = max(5)\n    // added to populate alert graph with additional context\n   \
    \ // Commented out principal.hostname because it is already represented in graph\
    \ as match variable. If match changes, can uncomment to add to results\n    //$principal_hostname\
    \ = array_distinct($process.principal.hostname)\n    $principal_process_pid =\
    \ array_distinct($process.principal.process.pid)\n    $principal_process_command_line\
    \ = array_distinct($process.principal.process.command_line)\n    $principal_process_file_sha256\
    \ = array_distinct($process.principal.process.file.sha256)\n    $principal_process_file_full_path\
    \ = array_distinct($process.principal.process.file.full_path)\n    $principal_process_product_specific_process_id\
    \ = array_distinct($process.principal.process.product_specific_process_id)\n \
    \   $principal_process_parent_process_product_specific_process_id = array_distinct($process.principal.process.parent_process.product_specific_process_id)\n\
    \    $target_process_pid = array_distinct($process.target.process.pid)\n    $target_process_command_line\
    \ = array_distinct($process.target.process.command_line)\n    $target_process_file_sha256\
    \ = array_distinct($process.target.process.file.sha256)\n    $target_process_file_full_path\
    \ = array_distinct($process.target.process.file.full_path)\n    $target_process_product_specific_process_id\
    \ = array_distinct($process.target.process.product_specific_process_id)\n    $principal_user_userid\
    \ = array_distinct($process.principal.user.userid)\n\n  condition:\n    // modify\
    \ the condition value for command line to throttle how many of these commands\
    \ can be issued until the rule is triggered\n    $process and #command_line >\
    \ 5\n}"
  chronicle_rule_name: recon_environment_enumeration_system_cisa_report
provenance:
  source: chronicle/detection-rules
  source_id: recon_environment_enumeration_system_cisa_report
  source_commit: 74dd490
  license: Apache-2.0
  license_url: https://github.com/chronicle/detection-rules/blob/main/LICENSE
  imported_at: '2026-05-04'
  imported_by: chronicle_importer
  upstream_path: rules/community/microsoft/windows/recon_environment_enumeration_system_cisa_report.yaral
notes:
  chronicle_meta: {}
  quarantine_reason: raw YARA-L — needs translation to AiSOC schema
