id: chronicle-detection-rules-remote-system-discovery-ping-sweep
name: remote_system_discovery__ping_sweep
description: remote_system_discovery__ping_sweep
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references: []
logsource:
  product: chronicle
detection:
  chronicle_yaral: "rule remote_system_discovery__ping_sweep {\n meta:\n    author\
    \ = \"Ariel Millahuel\"\n    description = \"This rule detects an attempt to identify\
    \ remote systems via ping sweep  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.\"\
    \n    reference = \"https://tdm.socprime.com/tdm/info/fctdvCuWhicV\"\n    version\
    \ = \"0.01\"\n    created = \"2021-03-09\"\n    category = \"process_creation\"\
    \n    product = \"windows\"\n    mitre = \"discovery, T1018\"\n\n  events:\n($selection1.target.process.file.full_path\
    \ = \"ping.exe\" and (re.regex($selection1.target.process.command_line, `.* for\
    \ /l %i in \\(1,1,254\\) do ping -n 1 -w 100 192\\.168\\.1\\.%i .*`) or re.regex($selection1.target.process.command_line,\
    \ `.*for /l %i in \\(1,1,254\\) do ping -n 1 -w 100 .*\\..*\\..*\\.%i.*`)) and\
    \ ($selection1.metadata.product_event_type = \"4688\" or $selection1.metadata.product_event_type\
    \ = \"1\"))\n\n  condition:\n    $selection1\n}"
  chronicle_rule_name: remote_system_discovery__ping_sweep
provenance:
  source: chronicle/detection-rules
  source_id: remote_system_discovery__ping_sweep
  source_commit: 74dd490
  license: Apache-2.0
  license_url: https://github.com/chronicle/detection-rules/blob/main/LICENSE
  imported_at: '2026-05-04'
  imported_by: chronicle_importer
  upstream_path: rules/_deprecated/soc_prime_rules/ioc_sigma/process_creation/remote_system_discovery___ping_sweep.yaral
notes:
  chronicle_meta: {}
  quarantine_reason: raw YARA-L — needs translation to AiSOC schema
