id: chronicle-detection-rules-rottenpotato-like-attack-pattern
name: rottenpotato_like_attack_pattern
description: rottenpotato_like_attack_pattern
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references: []
logsource:
  product: chronicle
detection:
  chronicle_yaral: "rule rottenpotato_like_attack_pattern {\n meta:\n    author =\
    \ \"@SBousseaden, Florian Roth\"\n    description = \"Detects logon events that\
    \ have characteristics of events generated during an attack with RottenPotato\
    \ and the like  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.\"\
    \n    reference = \"https://tdm.socprime.com/tdm/info/T4UNTURyJXHP\"\n    version\
    \ = \"0.01\"\n    created = \"2019/11/15\"\n    product = \"windows\"\n    service\
    \ = \"security\"\n    mitre = \"privilege_escalation, credential_access, t1171\"\
    \n\n  events:\n($selection.metadata.product_event_type = \"4624\" and $selection.extensions.auth.mechanism\
    \ = \"3\" and $selection.target.user.user_display_name = \"ANONYMOUS_LOGON\" and\
    \ $selection.principal.hostname = \"-\" and $selection.principal.ip = \"127.0.0.1\"\
    )\n\n  condition:\n    $selection\n}"
  chronicle_rule_name: rottenpotato_like_attack_pattern
provenance:
  source: chronicle/detection-rules
  source_id: rottenpotato_like_attack_pattern
  source_commit: 74dd490
  license: Apache-2.0
  license_url: https://github.com/chronicle/detection-rules/blob/main/LICENSE
  imported_at: '2026-05-04'
  imported_by: chronicle_importer
  upstream_path: rules/_deprecated/soc_prime_rules/threat_hunting/windows/rottenpotato_like_attack_pattern.yaral
notes:
  chronicle_meta: {}
  quarantine_reason: raw YARA-L — needs translation to AiSOC schema
