id: chronicle-detection-rules-suspicious-curl-exe-download
name: suspicious_curl_exe_download
description: suspicious_curl_exe_download
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references: []
logsource:
  product: chronicle
detection:
  chronicle_yaral: "/*\n * Copyright 2025 Google LLC\n *\n * Licensed under the Apache\
    \ License, Version 2.0 (the \"License\");\n * you may not use this file except\
    \ in compliance with the License.\n * You may obtain a copy of the License at\n\
    \ *\n *     https://www.apache.org/licenses/LICENSE-2.0\n *\n * Unless required\
    \ by applicable law or agreed to in writing, software\n * distributed under the\
    \ License is distributed on an \"AS IS\" BASIS,\n * WITHOUT WARRANTIES OR CONDITIONS\
    \ OF ANY KIND, either express or implied.\n * See the License for the specific\
    \ language governing permissions and\n * limitations under the License.\n */\n\
    \nrule suspicious_curl_exe_download {\n\n  meta:\n    author = \"Florian Roth\
    \ (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)\"\n    description\
    \ = \"Detects a suspicious curl process start on Windows and outputs the requested\
    \ document to a local file\"\n    reference = \"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_curl_susp_download.yml\"\
    \n    license = \"https://github.com/SigmaHQ/Detection-Rule-License/blob/main/LICENSE.Detection.Rules.md\"\
    \n    rule_name = \"Suspicious Curl.EXE Download\"\n    sigma_uuid = \"e218595b-bbe7-4ee5-8a96-f32a24ad3468\"\
    \n    sigma_status = \"test\"\n    rule_id = \"mr_51da61c3-b1c7-4dd1-ad4c-ab5dfc96e075\"\
    \n    tactic = \"TA0011\"\n    technique = \"T1105\"\n    type = \"Detection\"\
    \n    data_source = \"Sysmon\"\n    platform = \"Windows\"\n    severity = \"\
    High\"\n    priority = \"High\"\n    false_positives = \"Unknown\"\n\n  events:\n\
    \    $process.metadata.event_type = \"PROCESS_LAUNCH\"\n    (\n      re.regex($process.target.process.file.full_path,\
    \ `\\\\curl\\.exe$`) nocase or\n      $process.target.asset.software.description\
    \ = \"The curl executable\" nocase\n    )\n    (\n      strings.contains(strings.to_lower($process.target.process.command_line),\
    \ \"%appdata%\") or\n      strings.contains(strings.to_lower($process.target.process.command_line),\
    \ \"%public%\") or\n      strings.contains(strings.to_lower($process.target.process.command_line),\
    \ \"%temp%\") or\n      strings.contains(strings.to_lower($process.target.process.command_line),\
    \ \"%tmp%\") or\n      strings.contains(strings.to_lower($process.target.process.command_line),\
    \ \"\\\\appdata\\\\\") or\n      strings.contains(strings.to_lower($process.target.process.command_line),\
    \ \"\\\\desktop\\\\\") or\n      strings.contains(strings.to_lower($process.target.process.command_line),\
    \ \"\\\\temp\\\\\") or\n      strings.contains(strings.to_lower($process.target.process.command_line),\
    \ \"\\\\users\\\\public\\\\\") or\n      strings.contains(strings.to_lower($process.target.process.command_line),\
    \ \"c:\\\\perflogs\\\\\") or\n      strings.contains(strings.to_lower($process.target.process.command_line),\
    \ \"c:\\\\programdata\\\\\") or\n      strings.contains(strings.to_lower($process.target.process.command_line),\
    \ \"c:\\\\windows\\\\temp\\\\\") or\n      re.regex($process.target.process.command_line,\
    \ `\\.(dll|gif|jpeg|jpg|png|temp|tmp|txt|vbe|vbs)$`) NOCASE\n    )\n\n    not\
    \ (\n        $process.principal.process.file.full_path = \"C:\\\\Program Files\\\
    \\Git\\\\usr\\\\bin\\\\sh.exe\" and\n        $process.target.process.file.full_path\
    \ = \"C:\\\\Program Files\\\\Git\\\\mingw64\\\\bin\\\\curl.exe\" and\n       \
    \ strings.contains(strings.to_lower($process.target.process.command_line), \"\
    --silent --show-error --output \") and\n        strings.contains(strings.to_lower($process.target.process.command_line),\
    \ \"gfw-httpget-\") and\n        strings.contains(strings.to_lower($process.target.process.command_line),\
    \ \"appdata\")\n    )\n\n    $process.principal.hostname = $hostname\n\n  match:\n\
    \    $hostname over 5m\n\n  outcome:\n    //example usage of specifying test user\
    \ and hostname to adjust risk score\n    $risk_score = max(if($process.principal.user.userid\
    \ = \"user\" and $process.principal.hostname = \"hostname\", 0, 15))\n    $principal_process_pid\
    \ = array_distinct($process.principal.process.pid)\n    $principal_process_command_line\
    \ = array_distinct($process.principal.process.command_line)\n    $principal_process_file_sha256\
    \ = array_distinct($process.principal.process.file.sha256)\n    $principal_process_file_full_path\
    \ = array_distinct($process.principal.process.file.full_path)\n    $principal_process_product_specfic_process_id\
    \ = array_distinct($process.principal.process.product_specific_process_id)\n \
    \   $principal_process_parent_process_product_specfic_process_id = array_distinct($process.principal.process.parent_process.product_specific_process_id)\n\
    \    $target_process_pid = array_distinct($process.target.process.pid)\n    $target_process_command_line\
    \ = array_distinct($process.target.process.command_line)\n    $target_process_file_sha256\
    \ = array_distinct($process.target.process.file.sha256)\n    $target_process_file_full_path\
    \ = array_distinct($process.target.process.file.full_path)\n    $target_process_product_specfic_process_id\
    \ = array_distinct($process.target.process.product_specific_process_id)\n    $principal_user_userid\
    \ = array_distinct($process.principal.user.userid)\n    $log_type = array_distinct(strings.concat($process.metadata.log_type,\"\
    /\",$process.metadata.product_event_type))\n\n  condition:\n    $process\n}"
  chronicle_rule_name: suspicious_curl_exe_download
provenance:
  source: chronicle/detection-rules
  source_id: suspicious_curl_exe_download
  source_commit: 74dd490
  license: Apache-2.0
  license_url: https://github.com/chronicle/detection-rules/blob/main/LICENSE
  imported_at: '2026-05-04'
  imported_by: chronicle_importer
  upstream_path: rules/community/microsoft/windows/suspicious_curl_exe_download.yaral
notes:
  chronicle_meta: {}
  quarantine_reason: raw YARA-L — needs translation to AiSOC schema
