id: sigmahq-sigma-ec570e53-4c76-45a9-804d-dc3f355ff7a7
name: 7Zip Compressing Dump Files
description: Detects execution of 7z in order to compress a file with a ".dmp"/".dump"
  extension, which could be a step in a process of dump file exfiltration.
severity: medium
enabled: false
tags:
  mitre:
  - T1560.001
  categories:
  - endpoint
references:
- https://thedfirreport.com/2022/09/26/bumblebee-round-two/
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Description|contains: 7-Zip
  - Image|endswith:
    - \7z.exe
    - \7zr.exe
    - \7za.exe
  - OriginalFileName:
    - 7z.exe
    - 7za.exe
  selection_extension:
    CommandLine|contains:
    - .dmp
    - .dump
    - .hdmp
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: ec570e53-4c76-45a9-804d-dc3f355ff7a7
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_7zip_exfil_dmp_files.yml
falsepositives:
- Legitimate use of 7z with a command line in which ".dmp" or ".dump" appears accidentally
- Legitimate use of 7z to compress WER ".dmp" files for troubleshooting
notes:
  quarantine_reason: 'upstream status: test'
