id: sigmahq-sigma-bafac3d6-7de9-4dd9-8874-4a1194b493ed
name: Abusing Print Executable
description: Attackers can use print.exe for remote file copy
severity: medium
enabled: false
tags:
  mitre:
  - T1218
  categories:
  - endpoint
references:
- https://lolbas-project.github.io/lolbas/Binaries/Print/
- https://twitter.com/Oddvarmoe/status/985518877076541440
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: \print.exe
    CommandLine|startswith: print
    CommandLine|contains|all:
    - /D
    - .exe
  filter_print:
    CommandLine|contains: print.exe
  condition: selection and not filter_print
provenance:
  source: SigmaHQ/sigma
  source_id: bafac3d6-7de9-4dd9-8874-4a1194b493ed
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_print_remote_file_copy.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
