id: sigmahq-sigma-799a5f48-0ac1-4e0f-9152-71d137d48c2a
name: Abusable DLL Potential Sideloading From Suspicious Location
description: Detects potential DLL sideloading of DLLs that are known to be abused
  from suspicious locations
severity: high
enabled: false
tags:
  mitre:
  - T1059
  categories:
  - endpoint
references:
- https://www.trendmicro.com/en_us/research/23/f/behind-the-scenes-unveiling-the-hidden-workings-of-earth-preta.html
- https://research.checkpoint.com/2023/beyond-the-horizon-traveling-the-world-on-camaro-dragons-usb-flash-drives/
logsource:
  category: image_load
  product: windows
detection:
  selection_dll:
    ImageLoaded|endswith:
    - \coreclr.dll
    - \facesdk.dll
    - \HPCustPartUI.dll
    - \libcef.dll
    - \ZIPDLL.dll
  selection_folders_1:
    ImageLoaded|contains:
    - :\Perflogs\
    - :\Users\Public\
    - \Temporary Internet
    - \Windows\Temp\
  selection_folders_2:
  - ImageLoaded|contains|all:
    - :\Users\
    - \Favorites\
  - ImageLoaded|contains|all:
    - :\Users\
    - \Favourites\
  - ImageLoaded|contains|all:
    - :\Users\
    - \Contacts\
  - ImageLoaded|contains|all:
    - :\Users\
    - \Pictures\
  condition: selection_dll and 1 of selection_folders_*
provenance:
  source: SigmaHQ/sigma
  source_id: 799a5f48-0ac1-4e0f-9152-71d137d48c2a
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/image_load/image_load_side_load_abused_dlls_susp_paths.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
