id: sigmahq-sigma-514e4c3a-c77d-4cde-a00f-046425e2301e
name: Abuse of Service Permissions to Hide Services Via Set-Service
description: Detects usage of the "Set-Service" powershell cmdlet to configure a new
  SecurityDescriptor that allows a service to be hidden from other utilities such
  as "sc.exe", "Get-Service"...etc. (Works only in powershell 7)
severity: high
enabled: false
tags:
  mitre:
  - T1574.011
  categories:
  - endpoint
references:
- https://twitter.com/Alh4zr3d/status/1580925761996828672
- https://learn.microsoft.com/en-us/powershell/module/microsoft.powershell.management/set-service?view=powershell-7.2
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \pwsh.exe
  - OriginalFileName: pwsh.dll
  selection_sddl:
    CommandLine|contains|all:
    - 'Set-Service '
    - DCLCWPDTSD
  selection_cmdlet:
    CommandLine|contains:
    - '-SecurityDescriptorSddl '
    - '-sd '
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 514e4c3a-c77d-4cde-a00f-046425e2301e
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_powershell_hide_services_via_set_service.yml
falsepositives:
- Rare intended use of hidden services
notes:
  quarantine_reason: 'upstream status: test'
