id: sigmahq-sigma-f41b0311-44f9-44f0-816d-dd45e39d4bc8
name: Access To Crypto Currency Wallets By Uncommon Applications
description: 'Detects file access requests to crypto currency files by uncommon processes.

  Could indicate potential attempt of crypto currency wallet stealing.'
severity: medium
enabled: false
tags:
  mitre:
  - T1003
  categories:
  - endpoint
references:
- Internal Research
logsource:
  category: file_access
  product: windows
  definition: 'Requirements: Microsoft-Windows-Kernel-File ETW provider'
detection:
  selection:
  - FileName|contains:
    - \AppData\Roaming\Ethereum\keystore\
    - \AppData\Roaming\EthereumClassic\keystore\
    - \AppData\Roaming\monero\wallets\
  - FileName|endswith:
    - \AppData\Roaming\Bitcoin\wallet.dat
    - \AppData\Roaming\BitcoinABC\wallet.dat
    - \AppData\Roaming\BitcoinSV\wallet.dat
    - \AppData\Roaming\DashCore\wallet.dat
    - \AppData\Roaming\DogeCoin\wallet.dat
    - \AppData\Roaming\Litecoin\wallet.dat
    - \AppData\Roaming\Ripple\wallet.dat
    - \AppData\Roaming\Zcash\wallet.dat
  filter_main_system:
    Image: System
  filter_main_generic:
    Image|startswith:
    - C:\Program Files (x86)\
    - C:\Program Files\
    - C:\Windows\system32\
    - C:\Windows\SysWOW64\
  filter_optional_defender:
    Image|startswith: C:\ProgramData\Microsoft\Windows Defender\
    Image|endswith:
    - \MpCopyAccelerator.exe
    - \MsMpEng.exe
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
provenance:
  source: SigmaHQ/sigma
  source_id: f41b0311-44f9-44f0-816d-dd45e39d4bc8
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_access/file_access_win_susp_crypto_currency_wallets.yml
falsepositives:
- Antivirus, Anti-Spyware, Anti-Malware Software
- Backup software
- Legitimate software installed on partitions other than "C:\"
- Searching software such as "everything.exe"
notes:
  quarantine_reason: 'upstream status: test'
