id: sigmahq-sigma-7a2a22ea-a203-4cd3-9abf-20eb1c5c6cd2
name: Access To Windows Credential History File By Uncommon Applications
description: 'Detects file access requests to the Windows Credential History File
  by an uncommon application.

  This can be a sign of credential stealing. Example case would be usage of mimikatz
  "dpapi::credhist" function'
severity: medium
enabled: false
tags:
  mitre:
  - T1555.004
  categories:
  - endpoint
references:
- https://tools.thehacker.recipes/mimikatz/modules/dpapi/credhist
- https://www.passcape.com/windows_password_recovery_dpapi_credhist
logsource:
  category: file_access
  product: windows
  definition: 'Requirements: Microsoft-Windows-Kernel-File ETW provider'
detection:
  selection:
    FileName|endswith: \Microsoft\Protect\CREDHIST
  filter_main_system_folders:
    Image|startswith:
    - C:\Program Files\
    - C:\Program Files (x86)\
    - C:\Windows\system32\
    - C:\Windows\SysWOW64\
  filter_main_explorer:
    Image: C:\Windows\explorer.exe
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 7a2a22ea-a203-4cd3-9abf-20eb1c5c6cd2
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_access/file_access_win_susp_credhist.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
