id: sigmahq-sigma-fc028194-969d-4122-8abe-0470d5b8f12f
name: Access to Browser Login Data
description: 'Adversaries may acquire credentials from web browsers by reading files
  specific to the target browser.

  Web browsers commonly save credentials such as website usernames and passwords so
  that they do not need to be entered manually in the future.

  Web browsers typically store the credentials in an encrypted format within a credential
  store.'
severity: medium
enabled: false
tags:
  mitre:
  - T1555.003
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1555.003/T1555.003.md
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection_cmd:
    ScriptBlockText|contains|all:
    - Copy-Item
    - -Destination
  selection_path:
    ScriptBlockText|contains:
    - \Opera Software\Opera Stable\Login Data
    - \Mozilla\Firefox\Profiles
    - \Microsoft\Edge\User Data\Default
    - \Google\Chrome\User Data\Default\Login Data
    - \Google\Chrome\User Data\Default\Login Data For Account
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: fc028194-969d-4122-8abe-0470d5b8f12f
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_access_to_browser_login_data.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
