id: sigmahq-sigma-d51694fe-484a-46ac-92d6-969e76d60d10
name: Access To Potentially Sensitive Sysvol Files By Uncommon Applications
description: Detects file access requests to potentially sensitive files hosted on
  the Windows Sysvol share.
severity: medium
enabled: false
tags:
  mitre:
  - T1552.006
  categories:
  - endpoint
references:
- https://github.com/vletoux/pingcastle
logsource:
  category: file_access
  product: windows
  definition: 'Requirements: Microsoft-Windows-Kernel-File ETW provider'
detection:
  selection:
    FileName|startswith: \\
    FileName|contains|all:
    - \sysvol\
    - \Policies\
    FileName|endswith:
    - audit.csv
    - Files.xml
    - GptTmpl.inf
    - groups.xml
    - Registry.pol
    - Registry.xml
    - scheduledtasks.xml
    - scripts.ini
    - services.xml
  filter_main_generic:
    Image|startswith:
    - C:\Program Files (x86)\
    - C:\Program Files\
    - C:\Windows\system32\
    - C:\Windows\SysWOW64\
  filter_main_explorer:
    Image: C:\Windows\explorer.exe
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: d51694fe-484a-46ac-92d6-969e76d60d10
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_access/file_access_win_susp_gpo_files.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
