id: sigmahq-sigma-2b7d6fc0-71ac-4cf7-8ed1-b5788ee5257a
name: Account Lockout
description: Identifies user account which has been locked because the user tried
  to sign in too many times with an incorrect user ID or password.
severity: medium
enabled: false
tags:
  mitre:
  - T1110
  categories:
  - cloud
references:
- https://learn.microsoft.com/en-us/entra/architecture/security-operations-privileged-accounts
logsource:
  product: azure
  service: signinlogs
detection:
  selection:
    ResultType: 50053
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 2b7d6fc0-71ac-4cf7-8ed1-b5788ee5257a
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/azure/signin_logs/azure_account_lockout.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
