id: sigmahq-sigma-4afac85c-224a-4dd7-b1af-8da40e1c60bd
name: Account Disabled or Blocked for Sign in Attempts
description: Detects when an account is disabled or blocked for sign in but tried
  to log in
severity: medium
enabled: false
tags:
  mitre:
  - T1078.004
  categories:
  - cloud
references:
- https://learn.microsoft.com/en-gb/entra/architecture/security-operations-privileged-accounts
logsource:
  product: azure
  service: signinlogs
detection:
  selection:
    ResultType: 50057
    ResultDescription: Failure
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 4afac85c-224a-4dd7-b1af-8da40e1c60bd
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/azure/signin_logs/azure_blocked_account_attempt.yml
falsepositives:
- Account disabled or blocked in error
- Automation account has been blocked or disabled
notes:
  quarantine_reason: 'upstream status: test'
