id: sigmahq-sigma-0c93308a-3f1b-40a9-b649-57ea1a1c1d63
name: Activate Suppression of Windows Security Center Notifications
description: Detect set Notification_Suppress to 1 to disable the Windows security
  center notification
severity: medium
enabled: false
tags:
  mitre:
  - T1112
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1112/T1112.md
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|endswith: SOFTWARE\Policies\Microsoft\Windows Defender\UX Configuration\Notification_Suppress
    Details: DWORD (0x00000001)
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 0c93308a-3f1b-40a9-b649-57ea1a1c1d63
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_suppress_defender_notifications.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
