id: sigmahq-sigma-4f7a6757-ff79-46db-9687-66501a02d9ec
name: Active Directory Structure Export Via Ldifde.EXE
description: Detects the execution of "ldifde.exe" in order to export organizational
  Active Directory structure.
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://businessinsights.bitdefender.com/deep-dive-into-a-backdoordiplomacy-attack-a-study-of-an-attackers-toolkit
- https://www.documentcloud.org/documents/5743766-Global-Threat-Report-2019.html
- https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/cc731033(v=ws.11)
logsource:
  category: process_creation
  product: windows
detection:
  selection_ldif:
  - Image|endswith: \ldifde.exe
  - OriginalFileName: ldifde.exe
  selection_cmd:
    CommandLine|contains: -f
  filter_import:
    CommandLine|contains: ' -i'
  condition: all of selection_* and not 1 of filter_*
provenance:
  source: SigmaHQ/sigma
  source_id: 4f7a6757-ff79-46db-9687-66501a02d9ec
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_ldifde_export.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
