id: sigmahq-sigma-d8b0a4fe-07a8-41be-bd39-b14afa025d95
name: Activity from Anonymous IP Addresses
description: Detects when a Microsoft Cloud App Security reported when users were
  active from an IP address that has been identified as an anonymous proxy IP address.
severity: medium
enabled: false
tags:
  mitre:
  - T1573
  categories:
  - cloud
references:
- https://learn.microsoft.com/en-us/defender-cloud-apps/anomaly-detection-policy
- https://learn.microsoft.com/en-us/defender-cloud-apps/policy-template-reference
logsource:
  service: threat_management
  product: m365
detection:
  selection:
    eventSource: SecurityComplianceCenter
    eventName: Activity from anonymous IP addresses
    status: success
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: d8b0a4fe-07a8-41be-bd39-b14afa025d95
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/m365/threat_management/microsoft365_activity_from_anonymous_ip_addresses.yml
falsepositives:
- User using a VPN or Proxy
notes:
  quarantine_reason: 'upstream status: test'
