id: sigmahq-sigma-e5d36acd-acb4-4c6f-a13f-9eb203d50099
name: Active Directory Structure Export Via Csvde.EXE
description: Detects the execution of "csvde.exe" in order to export organizational
  Active Directory structure.
severity: medium
enabled: false
tags:
  mitre:
  - T1087.002
  categories:
  - endpoint
references:
- https://www.cybereason.com/blog/research/operation-ghostshell-novel-rat-targets-global-aerospace-and-telecoms-firms
- https://web.archive.org/web/20180725233601/https://www.pwc.co.uk/cyber-security/pdf/cloud-hopper-annex-b-final.pdf
- https://businessinsights.bitdefender.com/deep-dive-into-a-backdoordiplomacy-attack-a-study-of-an-attackers-toolkit
- https://redcanary.com/blog/msix-installers/
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \csvde.exe
  - OriginalFileName: csvde.exe
  selection_remote:
    CommandLine|contains: ' -f'
  filter_import:
    CommandLine|contains: ' -i'
  condition: all of selection_* and not 1 of filter_*
provenance:
  source: SigmaHQ/sigma
  source_id: e5d36acd-acb4-4c6f-a13f-9eb203d50099
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_csvde_export.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
