id: sigmahq-sigma-815bfc17-7fc6-4908-a55e-2f37b98cedb4
name: AD Groups Or Users Enumeration Using PowerShell - PoshModule
description: 'Adversaries may attempt to find domain-level groups and permission settings.

  The knowledge of domain-level permission groups can help adversaries determine which
  groups exist and which users belong to a particular group.

  Adversaries may use this information to determine which users have elevated permissions,
  such as domain administrators.'
severity: low
enabled: false
tags:
  mitre:
  - T1069.001
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1069.002/T1069.002.md
logsource:
  product: windows
  category: ps_module
  definition: 0ad03ef1-f21b-4a79-8ce8-e6900c54b65b
detection:
  selection_ad_principal:
  - Payload|contains: get-ADPrincipalGroupMembership
  - ContextInfo|contains: get-ADPrincipalGroupMembership
  selection_get_aduser:
  - Payload|contains|all:
    - get-aduser
    - '-f '
    - '-pr '
    - DoesNotRequirePreAuth
  - ContextInfo|contains|all:
    - get-aduser
    - '-f '
    - '-pr '
    - DoesNotRequirePreAuth
  condition: 1 of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 815bfc17-7fc6-4908-a55e-2f37b98cedb4
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_module/posh_pm_susp_ad_group_reco.yml
falsepositives:
- Administrator script
notes:
  quarantine_reason: 'upstream status: test'
