id: sigmahq-sigma-092af964-4233-4373-b4ba-d86ea2890288
name: Add Debugger Entry To AeDebug For Persistence
description: Detects when an attacker adds a new "Debugger" value to the "AeDebug"
  key in order to achieve persistence which will get invoked when an application crashes
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://persistence-info.github.io/Data/aedebug.html
- https://learn.microsoft.com/en-us/windows/win32/debug/configuring-automatic-debugging
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains: \SOFTWARE\Microsoft\Windows NT\CurrentVersion\AeDebug\Debugger
    Details|endswith: .dll
  filter:
    Details: '"C:\WINDOWS\system32\vsjitdebugger.exe" -p %ld -e %ld -j 0x%p'
  condition: selection and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: 092af964-4233-4373-b4ba-d86ea2890288
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_aedebug_persistence.yml
falsepositives:
- Legitimate use of the key to setup a debugger. Which is often the case on developers
  machines
notes:
  quarantine_reason: 'upstream status: test'
