id: sigmahq-sigma-833ef470-fa01-4631-a79b-6f291c9ac498
name: Add Debugger Entry To Hangs Key For Persistence
description: Detects when an attacker adds a new "Debugger" value to the "Hangs" key
  in order to achieve persistence which will get invoked when an application crashes
severity: high
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://persistence-info.github.io/Data/wer_debugger.html
- https://www.hexacorn.com/blog/2019/09/20/beyond-good-ol-run-key-part-116/
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains: \SOFTWARE\Microsoft\Windows\Windows Error Reporting\Hangs\Debugger
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 833ef470-fa01-4631-a79b-6f291c9ac498
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_hangs_debugger_persistence.yml
falsepositives:
- This value is not set by default but could be rarly used by administrators
notes:
  quarantine_reason: 'upstream status: test'
