id: sigmahq-sigma-275641a5-a492-45e2-a817-7c81e9d9d3e9
name: Add DisallowRun Execution to Registry
description: Detect set DisallowRun to 1 to prevent user running specific computer
  program
severity: medium
enabled: false
tags:
  mitre:
  - T1112
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1112/T1112.md
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|endswith: Software\Microsoft\Windows\CurrentVersion\Policies\Explorer\DisallowRun
    Details: DWORD (0x00000001)
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 275641a5-a492-45e2-a817-7c81e9d9d3e9
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_disallowrun_execution.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
