id: sigmahq-sigma-155c7fd5-47b4-49b2-bbeb-eb4fab335429
name: Add Windows Capability Via PowerShell Script
description: Detects usage of the "Add-WindowsCapability" cmdlet to add Windows capabilities.
  Notable capabilities could be "OpenSSH" and others.
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/windows-server/administration/openssh/openssh_install_firstuse?tabs=powershell
- https://www.virustotal.com/gui/file/af1c82237b6e5a3a7cdbad82cc498d298c67845d92971bada450023d1335e267/content
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection_cmdlet:
    ScriptBlockText|contains: 'Add-WindowsCapability '
  selection_capa:
    ScriptBlockText|contains: -Name OpenSSH.
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 155c7fd5-47b4-49b2-bbeb-eb4fab335429
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_add_windows_capability.yml
falsepositives:
- Legitimate usage of the capabilities by administrators or users. Add additional
  filters accordingly.
notes:
  quarantine_reason: 'upstream status: test'
