id: sigmahq-sigma-cbb67ecc-fb70-4467-9350-c910bdf7c628
name: Added Credentials to Existing Application
description: Detects when a new credential is added to an existing application. Any
  additional credentials added outside of expected processes could be a malicious
  actor using those credentials.
severity: high
enabled: false
tags:
  mitre:
  - T1098.001
  categories:
  - cloud
references:
- https://learn.microsoft.com/en-us/entra/architecture/security-operations-applications#application-credentials
logsource:
  product: azure
  service: auditlogs
detection:
  selection:
    properties.message:
    - Update application – Certificates and secrets management
    - Update Service principal/Update Application
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: cbb67ecc-fb70-4467-9350-c910bdf7c628
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/azure/audit_logs/azure_app_credential_added.yml
falsepositives:
- When credentials are added/removed as part of the normal working hours/workflows
notes:
  quarantine_reason: 'upstream status: test'
