id: sigmahq-sigma-6120ac2a-a34b-42c0-a9bd-1fb9f459f348
name: AddinUtil.EXE Execution From Uncommon Directory
description: Detects execution of the Add-In deployment cache updating utility (AddInutil.exe)
  from a non-standard directory.
severity: medium
enabled: false
tags:
  mitre:
  - T1218
  categories:
  - endpoint
references:
- https://www.blue-prints.blog/content/blog/posts/lolbin/addinutil-lolbas.html
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Image|endswith: \addinutil.exe
  - OriginalFileName: AddInUtil.exe
  filter_main_legit_location:
    Image|contains:
    - :\Windows\Microsoft.NET\Framework\
    - :\Windows\Microsoft.NET\Framework64\
    - :\Windows\Microsoft.NET\FrameworkArm\
    - :\Windows\Microsoft.NET\FrameworkArm64\
    - :\Windows\WinSxS\
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 6120ac2a-a34b-42c0-a9bd-1fb9f459f348
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_addinutil_uncommon_dir_exec.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
