id: sigmahq-sigma-0a1255c5-d732-4b62-ac02-b5152d34fb83
name: ADExplorer Writing Complete AD Snapshot Into .dat File
description: Detects the dual use tool ADExplorer writing a complete AD snapshot into
  a .dat file. This can be used by attackers to extract data for Bloodhound, usernames
  for password spraying or use the meta data for social engineering. The snapshot
  doesn't contain password hashes but there have been cases, where administrators
  put passwords in the comment field.
severity: medium
enabled: false
tags:
  mitre:
  - T1087.002
  - T1069.002
  - T1482
  categories:
  - endpoint
references:
- https://learn.microsoft.com/de-de/sysinternals/downloads/adexplorer
- https://github.com/c3c/ADExplorerSnapshot.py/tree/f700904defac330802bbfedd1d8ffd9248f4ee24
- https://www.packetlabs.net/posts/scattered-spider-is-a-young-ransomware-gang-exploiting-large-corporations/
- https://www.nccgroup.com/us/research-blog/lapsus-recent-techniques-tactics-and-procedures/
- https://trustedsec.com/blog/adexplorer-on-engagements
logsource:
  category: file_event
  product: windows
detection:
  selection:
    Image|endswith:
    - \ADExp.exe
    - \ADExplorer.exe
    - \ADExplorer64.exe
    - \ADExplorer64a.exe
    TargetFilename|endswith: .dat
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 0a1255c5-d732-4b62-ac02-b5152d34fb83
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_sysinternals_adexplorer_dump_written.yml
falsepositives:
- Legitimate use of ADExplorer by administrators creating .dat snapshots
notes:
  quarantine_reason: 'upstream status: experimental'
