id: sigmahq-sigma-1ea13e8c-03ea-409b-877d-ce5c3d2c1cb3
name: ADFS Database Named Pipe Connection By Uncommon Tool
description: 'Detects suspicious local connections via a named pipe to the AD FS configuration
  database (Windows Internal Database).

  Used to access information such as the AD FS configuration settings which contains
  sensitive information used to sign SAML tokens.'
severity: medium
enabled: false
tags:
  mitre:
  - T1005
  categories:
  - endpoint
references:
- https://github.com/Azure/Azure-Sentinel/blob/f99542b94afe0ad2f19a82cc08262e7ac8e1428e/Detections/SecurityEvent/ADFSDBNamedPipeConnection.yaml
- https://o365blog.com/post/adfs/
- https://github.com/Azure/SimuLand
logsource:
  product: windows
  category: pipe_created
  definition: Note that you have to configure logging for Named Pipe Events in Sysmon
    config (Event ID 17 and Event ID 18). The basic configuration is in popular sysmon
    configuration (https://github.com/SwiftOnSecurity/sysmon-config), but it is worth
    verifying. You can also use other repo, e.g. https://github.com/Neo23x0/sysmon-config,
    https://github.com/olafhartong/sysmon-modular. How to test detection? You can
    check powershell script from this site https://svch0st.medium.com/guide-to-named-pipes-and-hunting-for-cobalt-strike-pipes-dc46b2c5f575
detection:
  selection:
    PipeName: \MICROSOFT##WID\tsql\query
  filter_main_generic:
    Image|endswith:
    - :\Windows\System32\mmc.exe
    - :\Windows\system32\svchost.exe
    - :\Windows\System32\wsmprovhost.exe
    - :\Windows\SysWOW64\mmc.exe
    - :\Windows\SysWOW64\wsmprovhost.exe
    - :\Windows\WID\Binn\sqlwriter.exe
    - \AzureADConnect.exe
    - \Microsoft.Identity.Health.Adfs.PshSurrogate.exe
    - \Microsoft.IdentityServer.ServiceHost.exe
    - \Microsoft.Tri.Sensor.exe
    - \sqlservr.exe
    - \tssdis.exe
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 1ea13e8c-03ea-409b-877d-ce5c3d2c1cb3
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/pipe_created/pipe_created_adfs_namedpipe_connection_uncommon_tool.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
