id: sigmahq-sigma-fed85bf9-e075-4280-9159-fbe8a023d6fa
name: Advanced IP Scanner - File Event
description: Detects the use of Advanced IP Scanner. Seems to be a popular tool for
  ransomware groups.
severity: medium
enabled: false
tags:
  mitre:
  - T1046
  categories:
  - endpoint
references:
- https://news.sophos.com/en-us/2019/12/09/snatch-ransomware-reboots-pcs-into-safe-mode-to-bypass-protection/
- https://www.fireeye.com/blog/threat-research/2020/05/tactics-techniques-procedures-associated-with-maze-ransomware-incidents.html
- https://labs.f-secure.com/blog/prelude-to-ransomware-systembc
- https://assets.documentcloud.org/documents/20444693/fbi-pin-egregor-ransomware-bc-01062021.pdf
- https://thedfirreport.com/2021/01/18/all-that-for-a-coinminer
logsource:
  category: file_event
  product: windows
detection:
  selection:
    TargetFilename|contains: \AppData\Local\Temp\Advanced IP Scanner 2
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: fed85bf9-e075-4280-9159-fbe8a023d6fa
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_advanced_ip_scanner.yml
falsepositives:
- Legitimate administrative use
notes:
  quarantine_reason: 'upstream status: test'
