id: sigmahq-sigma-0bcfabcb-7929-47f4-93d6-b33fb67d34d1
name: Adwind RAT / JRAT File Artifact
description: Detects javaw.exe in AppData folder as used by Adwind / JRAT
severity: high
enabled: false
tags:
  mitre:
  - T1059.005
  - T1059.007
  categories:
  - endpoint
references:
- https://www.hybrid-analysis.com/sample/ba86fa0d4b6af2db0656a88b1dd29f36fe362473ae8ad04255c4e52f214a541c?environmentId=100
- https://www.first.org/resources/papers/conf2017/Advanced-Incident-Detection-and-Threat-Hunting-using-Sysmon-and-Splunk.pdf
logsource:
  category: file_event
  product: windows
detection:
  selection:
  - TargetFilename|contains|all:
    - \AppData\Roaming\Oracle\bin\java
    - .exe
  - TargetFilename|contains|all:
    - \Retrive
    - .vbs
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 0bcfabcb-7929-47f4-93d6-b33fb67d34d1
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_mal_adwind.yml
notes:
  quarantine_reason: 'upstream status: test'
