id: sigmahq-sigma-7efd2c8d-8b18-45b7-947d-adfe9ed04f61
name: AgentExecutor PowerShell Execution
description: Detects execution of the AgentExecutor.exe binary. Which can be abused
  as a LOLBIN to execute powershell scripts with the ExecutionPolicy "Bypass" or any
  binary named "powershell.exe" located in the path provided by 6th positional argument
severity: medium
enabled: false
tags:
  mitre:
  - T1218
  categories:
  - endpoint
references:
- https://twitter.com/lefterispan/status/1286259016436514816
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Agentexecutor/
- https://learn.microsoft.com/en-us/mem/intune/apps/intune-management-extension
- https://twitter.com/jseerden/status/1247985304667066373/photo/1
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image: \AgentExecutor.exe
  - OriginalFileName: AgentExecutor.exe
  selection_cli:
    CommandLine|contains:
    - ' -powershell'
    - ' -remediationScript'
  filter_main_intune:
    ParentImage|endswith: \Microsoft.Management.Services.IntuneWindowsAgent.exe
  condition: all of selection_* and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 7efd2c8d-8b18-45b7-947d-adfe9ed04f61
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_agentexecutor_potential_abuse.yml
falsepositives:
- Legitimate use via Intune management. You exclude script paths and names to reduce
  FP rate
notes:
  quarantine_reason: 'upstream status: test'
