id: sigmahq-sigma-37b437cf-3fc5-4c8e-9c94-1d7c9aff842b
name: Allow RDP Remote Assistance Feature
description: Detect enable rdp feature to allow specific user to rdp connect on the
  targeted machine
severity: medium
enabled: false
tags:
  mitre:
  - T1112
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1112/T1112.md
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|endswith: System\CurrentControlSet\Control\Terminal Server\fAllowToGetHelp
    Details: DWORD (0x00000001)
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 37b437cf-3fc5-4c8e-9c94-1d7c9aff842b
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_allow_rdp_remote_assistance_feature.yml
falsepositives:
- Legitimate use of the feature (alerts should be investigated either way)
notes:
  quarantine_reason: 'upstream status: test'
