id: sigmahq-sigma-6c8fbee5-dee8-49bc-851d-c3142d02aa47
name: Allow Service Access Using Security Descriptor Tampering Via Sc.EXE
description: Detects suspicious DACL modifications to allow access to a service from
  a suspicious trustee. This can be used to override access restrictions set by previous
  ACLs.
severity: high
enabled: false
tags:
  mitre:
  - T1543.003
  categories:
  - endpoint
references:
- https://twitter.com/0gtweet/status/1628720819537936386
- https://itconnect.uw.edu/tools-services-support/it-systems-infrastructure/msinf/other-help/understanding-sddl-syntax/
- https://learn.microsoft.com/en-us/windows/win32/secauthz/sid-strings
logsource:
  category: process_creation
  product: windows
detection:
  selection_sc:
  - Image|endswith: \sc.exe
  - OriginalFileName: sc.exe
  selection_sdset:
    CommandLine|contains|all:
    - sdset
    - A;
  selection_trustee:
    CommandLine|contains:
    - ;IU
    - ;SU
    - ;BA
    - ;SY
    - ;WD
  filter_optional_hexnode:
    ParentImage: C:\Hexnode\Hexnode Agent\Current\HexnodeAgent.exe
  condition: all of selection_* and not 1 of filter_optional_*
provenance:
  source: SigmaHQ/sigma
  source_id: 6c8fbee5-dee8-49bc-851d-c3142d02aa47
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_sc_sdset_allow_service_changes.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
