id: sigmahq-sigma-64e8e417-c19a-475a-8d19-98ea705394cc
name: Alternate PowerShell Hosts - PowerShell Module
description: Detects alternate PowerShell hosts potentially bypassing detections looking
  for powershell.exe
severity: medium
enabled: false
tags:
  mitre:
  - T1059.001
  categories:
  - endpoint
references:
- https://threathunterplaybook.com/hunts/windows/190610-PwshAlternateHosts/notebook.html
logsource:
  product: windows
  category: ps_module
  definition: 0ad03ef1-f21b-4a79-8ce8-e6900c54b65b
detection:
  selection:
    ContextInfo|contains: '*'
  filter_powershell:
    ContextInfo|contains:
    - = powershell
    - = C:\Windows\System32\WindowsPowerShell\v1.0\powershell
    - = C:\Windows\SysWOW64\WindowsPowerShell\v1.0\powershell
    - = C:/Windows/System32/WindowsPowerShell/v1.0/powershell
    - = C:/Windows/SysWOW64/WindowsPowerShell/v1.0/powershell
    - = \\\?\?\C:Windows\System32\WindowsPowerShell\v1.0\powershell
    - = \\\?\?\C:Windows\SysWOW64\WindowsPowerShell\v1.0\powershell
  filter_sdiagnhost:
    ContextInfo|contains: = C:\WINDOWS\System32\sdiagnhost.exe -Embedding
  filter_citrix:
    ContextInfo|contains: ConfigSyncRun.exe
  filter_adace:
    ContextInfo|contains: C:\Windows\system32\dsac.exe
  filter_winrm:
    ContextInfo|contains: C:\Windows\system32\wsmprovhost.exe -Embedding
  filter_help_update:
    Payload|contains:
    - Update-Help
    - Failed to update Help for the module
  condition: selection and not 1 of filter_*
provenance:
  source: SigmaHQ/sigma
  source_id: 64e8e417-c19a-475a-8d19-98ea705394cc
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_module/posh_pm_alternate_powershell_hosts.yml
falsepositives:
- Programs using PowerShell directly without invocation of a dedicated interpreter
- MSP Detection Searcher
- Citrix ConfigSync.ps1
notes:
  quarantine_reason: 'upstream status: test'
