id: sigmahq-sigma-1e53dd56-8d83-4eb4-a43e-b790a05510aa
name: Always Install Elevated MSI Spawned Cmd And Powershell
description: Detects Windows Installer service (msiexec.exe) spawning "cmd" or "powershell"
severity: medium
enabled: false
tags:
  mitre:
  - T1548.002
  categories:
  - endpoint
references:
- https://image.slidesharecdn.com/kheirkhabarovoffzonefinal-181117201458/95/hunting-for-privilege-escalation-in-windows-environment-50-638.jpg
logsource:
  product: windows
  category: process_creation
detection:
  selection_img:
  - Image|endswith:
    - \cmd.exe
    - \powershell.exe
    - \pwsh.exe
  - OriginalFileName:
    - Cmd.Exe
    - PowerShell.EXE
    - pwsh.dll
  selection_parent:
    ParentImage|contains|all:
    - \Windows\Installer\
    - msi
    ParentImage|endswith: tmp
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 1e53dd56-8d83-4eb4-a43e-b790a05510aa
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_susp_elavated_msi_spawned_shell.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
