id: sigmahq-sigma-aa37cbb0-da36-42cb-a90f-fdf216fc7467
name: AMSI Disabled via Registry Modification
description: 'Detects attempts to disable AMSI (Anti-Malware Scan Interface) by modifying
  the AmsiEnable registry value.

  Anti-Malware Scan Interface (AMSI) is a security feature in Windows that allows
  applications and services to integrate with anti-malware products for enhanced protection
  against malicious content.

  Adversaries may attempt to disable AMSI to evade detection by security software,
  allowing them to execute malicious scripts or code without being scanned.'
severity: high
enabled: false
tags:
  mitre:
  - T1685
  categories:
  - endpoint
references:
- https://mostafayahiax.medium.com/hunting-for-amsi-bypassing-methods-9886dda0bf9d
- https://docs.microsoft.com/en-us/windows/win32/amsi/antimalware-scan-interface-portal
- https://www.mdsec.co.uk/2019/02/macros-and-more-with-sharpshooter-v2-0/
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|endswith: \Software\Microsoft\Windows Script\Settings\AmsiEnable
    Details: DWORD (0x00000000)
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: aa37cbb0-da36-42cb-a90f-fdf216fc7467
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_amsi_disable.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: experimental'
