id: sigmahq-sigma-e0d6c087-2d1c-47fd-8799-3904103c5a98
name: AMSI Bypass Pattern Assembly GetType
description: Detects code fragments found in small and obfuscated AMSI bypass PowerShell
  scripts
severity: high
enabled: false
tags:
  mitre:
  - T1685
  categories:
  - endpoint
references:
- https://www.mdsec.co.uk/2018/06/exploring-powershell-amsi-and-logging-evasion/
- https://twitter.com/cyb3rops/status/1588574518057979905?s=20&t=A7hh93ONM7ni1Rj1jO5OaA
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection:
    ScriptBlockText|contains|all:
    - '[Ref].Assembly.GetType'
    - SetValue($null,$true)
    - NonPublic,Static
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: e0d6c087-2d1c-47fd-8799-3904103c5a98
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_amsi_bypass_pattern_nov22.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
