id: sigmahq-sigma-6555754e-5e7f-4a67-ad1c-4041c413a007
name: Anomalous Token
description: Indicates that there are abnormal characteristics in the token such as
  an unusual token lifetime or a token that is played from an unfamiliar location.
severity: high
enabled: false
tags:
  mitre:
  - T1528
  categories:
  - cloud
references:
- https://learn.microsoft.com/en-us/entra/id-protection/concept-identity-protection-risks#anomalous-token
- https://learn.microsoft.com/en-us/entra/architecture/security-operations-user-accounts#unusual-sign-ins
logsource:
  product: azure
  service: riskdetection
detection:
  selection:
    riskEventType: anomalousToken
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 6555754e-5e7f-4a67-ad1c-4041c413a007
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/azure/identity_protection/azure_identity_protection_anomalous_token.yml
falsepositives:
- We recommend investigating the sessions flagged by this detection in the context
  of other sign-ins from the user.
notes:
  quarantine_reason: 'upstream status: test'
