id: sigmahq-sigma-31e124fb-5dc4-42a0-83b3-44a69c77b271
name: Antivirus Filter Driver Disallowed On Dev Drive - Registry
description: Detects activity that indicates a user disabling the ability for Antivirus
  mini filter to inspect a "Dev Drive".
severity: high
enabled: false
tags:
  mitre:
  - T1685
  categories:
  - endpoint
references:
- https://twitter.com/0gtweet/status/1720419490519752955
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|endswith: \FilterManager\FltmgrDevDriveAllowAntivirusFilter
    Details: DWORD (0x00000000)
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 31e124fb-5dc4-42a0-83b3-44a69c77b271
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_devdrv_disallow_antivirus_filter.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
