id: sigmahq-sigma-0b9ad457-2554-44c1-82c2-d56a99c42377
name: Anydesk Temporary Artefact
description: 'An adversary may use legitimate desktop support and remote access software,
  such as Team Viewer, Go2Assist, LogMein, AmmyyAdmin, etc, to establish an interactive
  command and control channel to target systems within networks.

  These services are commonly used as legitimate technical support software, and may
  be allowed by application control within a target environment.

  Remote access tools like VNC, Ammyy, and Teamviewer are used frequently when compared
  with other legitimate software commonly used by adversaries. (Citation: Symantec
  Living off the Land)'
severity: medium
enabled: false
tags:
  mitre:
  - T1219.002
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1219/T1219.md#atomic-test-2---anydesk-files-detected-test-on-windows
logsource:
  category: file_event
  product: windows
detection:
  selection:
    TargetFilename|contains:
    - \AppData\Roaming\AnyDesk\user.conf
    - \AppData\Roaming\AnyDesk\system.conf
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 0b9ad457-2554-44c1-82c2-d56a99c42377
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_anydesk_artefact.yml
falsepositives:
- Legitimate use
notes:
  quarantine_reason: 'upstream status: test'
