id: sigmahq-sigma-5aecf3d5-f8a0-48e7-99be-3a759df7358f
name: App Granted Privileged Delegated Or App Permissions
description: Detects when administrator grants either application permissions (app
  roles) or highly privileged delegated permissions
severity: high
enabled: false
tags:
  mitre:
  - T1098.003
  categories:
  - cloud
references:
- https://learn.microsoft.com/en-us/entra/architecture/security-operations-applications#application-granted-highly-privileged-permissions
logsource:
  product: azure
  service: auditlogs
detection:
  selection:
    properties.message: Add app role assignment to service principal
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 5aecf3d5-f8a0-48e7-99be-3a759df7358f
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/azure/audit_logs/azure_app_privileged_permissions.yml
falsepositives:
- When the permission is legitimately needed for the app
notes:
  quarantine_reason: 'upstream status: test'
