id: sigmahq-sigma-248649b7-d64f-46f0-9fb2-a52774166fb5
name: Application Using Device Code Authentication Flow
description: 'Device code flow is an OAuth 2.0 protocol flow specifically for input
  constrained devices and is not used in all environments.

  If this type of flow is seen in the environment and not being used in an input constrained
  device scenario, further investigation is warranted.

  This can be a misconfigured application or potentially something malicious.'
severity: medium
enabled: false
tags:
  mitre:
  - T1078
  categories:
  - cloud
references:
- https://learn.microsoft.com/en-us/entra/architecture/security-operations-applications#application-authentication-flows
logsource:
  product: azure
  service: signinlogs
detection:
  selection:
    properties.message: Device Code
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 248649b7-d64f-46f0-9fb2-a52774166fb5
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/azure/signin_logs/azure_app_device_code_authentication.yml
falsepositives:
- Applications that are input constrained will need to use device code flow and are
  valid authentications.
notes:
  quarantine_reason: 'upstream status: test'
