id: sigmahq-sigma-55695bc0-c8cf-461f-a379-2535f563c854
name: Applications That Are Using ROPC Authentication Flow
description: 'Resource owner password credentials (ROPC) should be avoided if at all
  possible as this requires the user to expose their current password credentials
  to the application directly.

  The application then uses those credentials to authenticate the user against the
  identity provider.'
severity: medium
enabled: false
tags:
  mitre:
  - T1078
  categories:
  - cloud
references:
- https://learn.microsoft.com/en-us/entra/architecture/security-operations-applications#application-authentication-flows
logsource:
  product: azure
  service: signinlogs
detection:
  selection:
    properties.message: ROPC
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 55695bc0-c8cf-461f-a379-2535f563c854
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/azure/signin_logs/azure_app_ropc_authentication.yml
falsepositives:
- Applications that are being used as part of automated testing or a legacy application
  that cannot use any other modern authentication flow
notes:
  quarantine_reason: 'upstream status: test'
