id: sigmahq-sigma-1b45b0d1-773f-4f23-aedc-814b759563b1
name: Application AppID Uri Configuration Changes
description: Detects when a configuration change is made to an applications AppID
  URI.
severity: high
enabled: false
tags:
  mitre:
  - T1552
  - T1078.004
  categories:
  - cloud
references:
- https://learn.microsoft.com/en-us/entra/architecture/security-operations-applications#appid-uri-added-modified-or-removed
logsource:
  product: azure
  service: auditlogs
detection:
  selection:
    properties.message:
    - Update Application
    - Update Service principal
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 1b45b0d1-773f-4f23-aedc-814b759563b1
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/azure/audit_logs/azure_app_appid_uri_changes.yml
falsepositives:
- When and administrator is making legitimate AppID URI configuration changes to an
  application. This should be a planned event.
notes:
  quarantine_reason: 'upstream status: test'
