id: sigmahq-sigma-b53317a0-8acf-4fd1-8de8-a5401e776b96
name: Application Removed Via Wmic.EXE
description: Detects the removal or uninstallation of an application via "Wmic.EXE".
severity: medium
enabled: false
tags:
  mitre:
  - T1047
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1047/T1047.md#atomic-test-10---application-uninstall-using-wmic
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \WMIC.exe
  - OriginalFileName: wmic.exe
  selection_cli:
    CommandLine|contains|all:
    - call
    - uninstall
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: b53317a0-8acf-4fd1-8de8-a5401e776b96
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_wmic_uninstall_application.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
