id: sigmahq-sigma-c977cb50-3dff-4a9f-b873-9290f56132f1
name: AppX Located in Uncommon Directory Added to Deployment Pipeline
description: Detects an appx package that was added to the pipeline of the "to be
  processed" packages that is located in uncommon locations.
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- Internal Research
- https://www.sentinelone.com/labs/inside-malicious-windows-apps-for-malware-deployment/
- https://learn.microsoft.com/en-us/windows/win32/appxpkg/troubleshooting
- https://news.sophos.com/en-us/2021/11/11/bazarloader-call-me-back-attack-abuses-windows-10-apps-mechanism/
logsource:
  product: windows
  service: appxdeployment-server
detection:
  selection:
    EventID: 854
  filter_main_generic:
    Path|contains:
    - :/Program%20Files
    - :/Windows/System32/
    - :\Program Files (x86)\
    - :\Program Files\
    - :\Windows\ImmersiveControlPanel\
    - :\Windows\PrintDialog\
    - :\Windows\SystemApps\
    - AppData/Local/Temp/WinGet/Microsoft.Winget.Source
    - x-windowsupdate://
  filter_main_specific:
    Path|contains:
    - https://installer.teams.static.microsoft/
    - https://res.cdn.office.net
    - https://statics.teams.cdn.live.net/
    - https://statics.teams.cdn.office.net/
    - microsoft.com
  filter_optional_onedrive:
    Path|contains: AppData\Local\Microsoft\OneDrive\
  filter_optional_winget:
    Path|contains:
    - AppData/Local/Temp/WinGet/Microsoft.Winget.Source
    - AppData\Local\Temp\WinGet\Microsoft.Winget.Source
  filter_optional_x_windowsupdate:
    Path|contains: x-windowsupdate://
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
provenance:
  source: SigmaHQ/sigma
  source_id: c977cb50-3dff-4a9f-b873-9290f56132f1
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/appxdeployment_server/win_appxdeployment_server_uncommon_package_locations.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
