id: sigmahq-sigma-eee00933-a761-4cd0-be70-c42fe91731e7
name: Arbitrary File Download Via GfxDownloadWrapper.EXE
description: Detects execution of GfxDownloadWrapper.exe with a URL as an argument
  to download file.
severity: medium
enabled: false
tags:
  mitre:
  - T1105
  categories:
  - endpoint
references:
- https://lolbas-project.github.io/lolbas/HonorableMentions/GfxDownloadWrapper/
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: \GfxDownloadWrapper.exe
    CommandLine|contains:
    - http://
    - https://
  filter_main_known_urls:
    CommandLine|contains: https://gameplayapi.intel.com/
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: eee00933-a761-4cd0-be70-c42fe91731e7
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_gfxdownloadwrapper_arbitrary_file_download.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
