id: sigmahq-sigma-863218bd-c7d0-4c52-80cd-0a96c09f54af
name: Arbitrary File Download Via IMEWDBLD.EXE
description: Detects usage of "IMEWDBLD.exe" to download arbitrary files
severity: high
enabled: false
tags:
  mitre:
  - T1218
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1105/T1105.md#atomic-test-10---windows---powershell-download
- https://lolbas-project.github.io/lolbas/Binaries/IMEWDBLD/
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \IMEWDBLD.exe
  - OriginalFileName: imewdbld.exe
  selection_cli:
    CommandLine|contains:
    - http://
    - https://
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 863218bd-c7d0-4c52-80cd-0a96c09f54af
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_imewbdld_download.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
