id: sigmahq-sigma-e84d89c4-f544-41ca-a6af-4b92fd38b023
name: Arbitrary File Download Via MSEDGE_PROXY.EXE
description: Detects usage of "msedge_proxy.exe" to download arbitrary files
severity: medium
enabled: false
tags:
  mitre:
  - T1218
  categories:
  - endpoint
references:
- https://lolbas-project.github.io/lolbas/Binaries/msedge_proxy/
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \msedge_proxy.exe
  - OriginalFileName: msedge_proxy.exe
  selection_cli:
    CommandLine|contains:
    - http://
    - https://
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: e84d89c4-f544-41ca-a6af-4b92fd38b023
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_msedge_proxy_download.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
