id: sigmahq-sigma-1f0f6176-6482-4027-b151-00071af39d7e
name: Arbitrary File Download Via ConfigSecurityPolicy.EXE
description: 'Detects the execution of "ConfigSecurityPolicy.EXE", a binary part of
  Windows Defender used to manage settings in Windows Defender.

  Users can configure different pilot collections for each of the co-management workloads.

  It can be abused by attackers in order to upload or download files.'
severity: medium
enabled: false
tags:
  mitre:
  - T1567
  categories:
  - endpoint
references:
- https://lolbas-project.github.io/lolbas/Binaries/ConfigSecurityPolicy/
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - CommandLine|contains: ConfigSecurityPolicy.exe
  - Image|endswith: \ConfigSecurityPolicy.exe
  - OriginalFileName: ConfigSecurityPolicy.exe
  selection_url:
    CommandLine|contains:
    - ftp://
    - http://
    - https://
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 1f0f6176-6482-4027-b151-00071af39d7e
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_configsecuritypolicy_download_file.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
