id: sigmahq-sigma-d65aee4d-2292-4cea-b832-83accd6cfa43
name: Arbitrary Binary Execution Using GUP Utility
description: Detects execution of the Notepad++ updater (gup) to launch other commands
  or executables
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://twitter.com/nas_bench/status/1535322445439180803
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage|endswith: \gup.exe
    Image|endswith: \explorer.exe
  filter:
    Image|endswith: \explorer.exe
    CommandLine|contains: \Notepad++\notepad++.exe
  filter_parent:
    ParentImage|contains: \Notepad++\updater\
  filter_null:
    CommandLine: null
  condition: selection and not 1 of filter*
provenance:
  source: SigmaHQ/sigma
  source_id: d65aee4d-2292-4cea-b832-83accd6cfa43
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_gup_arbitrary_binary_execution.yml
falsepositives:
- Other parent binaries using GUP not currently identified
notes:
  quarantine_reason: 'upstream status: test'
