id: sigmahq-sigma-1e75c1cc-c5d4-42aa-ac3d-91b0b68b3b4c
name: Arbitrary File Download Via Squirrel.EXE
description: Detects the usage of the "Squirrel.exe" to download arbitrary files.
  This binary is part of multiple Electron based software installations (Slack, Teams,
  Discord, etc.)
severity: medium
enabled: false
tags:
  mitre:
  - T1218
  categories:
  - endpoint
references:
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Squirrel/
- http://www.hexacorn.com/blog/2019/03/30/sqirrel-packages-manager-as-a-lolbin-a-k-a-many-electron-apps-are-lolbins-by-default/
- http://www.hexacorn.com/blog/2018/08/16/squirrel-as-a-lolbin/
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
    Image|endswith:
    - \squirrel.exe
    - \update.exe
  selection_download_cli:
    CommandLine|contains:
    - ' --download '
    - ' --update '
    - ' --updateRollback='
  selection_download_http_keyword:
    CommandLine|contains: http
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 1e75c1cc-c5d4-42aa-ac3d-91b0b68b3b4c
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_squirrel_download.yml
falsepositives:
- Expected FP with some Electron based applications such as (1Clipboard, Beaker Browser,
  Caret, Discord, GitHub Desktop, etc.)
notes:
  quarantine_reason: 'upstream status: test'
