id: sigmahq-sigma-3b3c7f55-f771-4dd6-8a6e-08d057a17caf
name: Arbitrary File Download Via MSPUB.EXE
description: Detects usage of "MSPUB" (Microsoft Publisher) to download arbitrary
  files
severity: medium
enabled: false
tags:
  mitre:
  - T1218
  categories:
  - endpoint
references:
- https://github.com/LOLBAS-Project/LOLBAS/pull/238/files
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \MSPUB.exe
  - OriginalFileName: MSPUB.exe
  selection_cli:
    CommandLine|contains:
    - ftp://
    - http://
    - https://
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 3b3c7f55-f771-4dd6-8a6e-08d057a17caf
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_mspub_download.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
