id: sigmahq-sigma-b124ddf4-778d-418e-907f-6dd3fc0d31cd
name: Arbitrary File Download Via PresentationHost.EXE
description: Detects usage of "PresentationHost" which is a utility that runs ".xbap"
  (Browser Applications) files to download arbitrary files
severity: medium
enabled: false
tags:
  mitre:
  - T1218
  categories:
  - endpoint
references:
- https://github.com/LOLBAS-Project/LOLBAS/pull/239/files
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \presentationhost.exe
  - OriginalFileName: PresentationHost.exe
  selection_cli:
    CommandLine|contains:
    - http://
    - https://
    - ftp://
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: b124ddf4-778d-418e-907f-6dd3fc0d31cd
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_presentationhost_download.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
