id: sigmahq-sigma-90ae0469-0cee-4509-b67f-e5efcef040f7
name: Aruba Network Service Potential DLL Sideloading
description: Detects potential DLL sideloading activity via the Aruba Networks Virtual
  Intranet Access "arubanetsvc.exe" process using DLL Search Order Hijacking
severity: high
enabled: false
tags:
  mitre:
  - T1574.001
  categories:
  - endpoint
references:
- https://twitter.com/wdormann/status/1616581559892545537?t=XLCBO9BziGzD7Bmbt8oMEQ&s=09
logsource:
  category: image_load
  product: windows
detection:
  selection:
    Image|endswith: \arubanetsvc.exe
    ImageLoaded|endswith:
    - \wtsapi32.dll
    - \msvcr100.dll
    - \msvcp100.dll
    - \dbghelp.dll
    - \dbgcore.dll
    - \wininet.dll
    - \iphlpapi.dll
    - \version.dll
    - \cryptsp.dll
    - \cryptbase.dll
    - \wldp.dll
    - \profapi.dll
    - \sspicli.dll
    - \winsta.dll
    - \dpapi.dll
  filter:
    ImageLoaded|startswith:
    - C:\Windows\System32\
    - C:\Windows\SysWOW64\
    - C:\Windows\WinSxS\
  condition: selection and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: 90ae0469-0cee-4509-b67f-e5efcef040f7
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/image_load/image_load_side_load_aruba_networks_virtual_intranet_access.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
