id: sigmahq-sigma-e497a24e-9345-4a62-9803-b06d7d7cb132
name: ASLR Disabled Via Sysctl or Direct Syscall - Linux
description: "Detects actions that disable Address Space Layout Randomization (ASLR)\
  \ in Linux, including:\n  - Use of the `personality` syscall with the ADDR_NO_RANDOMIZE\
  \ flag (0x0040000)\n  - Modification of the /proc/sys/kernel/randomize_va_space\
  \ file\n  - Execution of the `sysctl` command to set `kernel.randomize_va_space=0`\n\
  Disabling ASLR is often used by attackers during exploit development or to bypass\
  \ memory protection mechanisms.\nA successful use of these methods can reduce the\
  \ effectiveness of ASLR and make memory corruption attacks more reliable."
severity: high
enabled: false
tags:
  mitre:
  - T1685
  - T1055.009
  categories:
  - endpoint
references:
- https://github.com/CheraghiMilad/bypass-Neo23x0-auditd-config/blob/f1c478a37911a5447d5ffcd580f22b167bf3df14/personality-syscall/README.md
- https://man7.org/linux/man-pages/man2/personality.2.html
- https://manual.cs50.io/2/personality
- https://linux-audit.com/linux-aslr-and-kernelrandomize_va_space-setting/
logsource:
  product: linux
  service: auditd
detection:
  selection_syscall:
    type: SYSCALL
    SYSCALL: personality
    a0: 40000
  selection_sysctl:
    type: EXECVE
    a0: sysctl
    a1: -w
    a2: kernel.randomize_va_space=0
  condition: 1 of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: e497a24e-9345-4a62-9803-b06d7d7cb132
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/auditd/lnx_auditd_disable_aslr_protection.yml
falsepositives:
- Debugging or legitimate software testing
notes:
  quarantine_reason: 'upstream status: experimental'
