id: sigmahq-sigma-a01b8329-5953-4f73-ae2d-aa01e1f35f00
name: AspNetCompiler Execution
description: Detects execution of "aspnet_compiler.exe" which can be abused to compile
  and execute C# code.
severity: medium
enabled: false
tags:
  mitre:
  - T1127
  categories:
  - endpoint
references:
- https://lolbas-project.github.io/lolbas/Binaries/Aspnet_Compiler/
- https://ijustwannared.team/2020/08/01/the-curious-case-of-aspnet_compiler-exe/
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|contains:
    - :\Windows\Microsoft.NET\Framework\
    - :\Windows\Microsoft.NET\Framework64\
    - :\Windows\Microsoft.NET\FrameworkArm\
    - :\Windows\Microsoft.NET\FrameworkArm64\
    Image|endswith: \aspnet_compiler.exe
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: a01b8329-5953-4f73-ae2d-aa01e1f35f00
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_aspnet_compiler_exectuion.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
