id: sigmahq-sigma-0ed99dda-6a35-11ef-8c99-0242ac120002
name: Attempts of Kerberos Coercion Via DNS SPN Spoofing
description: 'Detects the presence of "UWhRC....AAYBAAAA" pattern in command line.

  The pattern "1UWhRCAAAAA..BAAAA" is a base64-encoded signature that corresponds
  to a marshaled CREDENTIAL_TARGET_INFORMATION structure.

  Attackers can use this technique to coerce authentication from victim systems to
  attacker-controlled hosts.

  It is one of the strong indicators of a Kerberos coercion attack, where adversaries
  manipulate DNS records

  to spoof Service Principal Names (SPNs) and redirect authentication requests like
  in CVE-2025-33073.

  If you see this pattern in the command line, it is likely an attempt to add spoofed
  Service Principal Names (SPNs) to DNS records,

  or checking for the presence of such records through the `nslookup` command.'
severity: high
enabled: false
tags:
  mitre:
  - T1557.001
  - T1187
  categories:
  - endpoint
references:
- https://www.synacktiv.com/publications/ntlm-reflection-is-dead-long-live-ntlm-reflection-an-in-depth-analysis-of-cve-2025
- https://googleprojectzero.blogspot.com/2021/10/using-kerberos-for-authentication-relay.html
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains|all:
    - UWhRCA
    - BAAAA
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 0ed99dda-6a35-11ef-8c99-0242ac120002
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_kerberos_coercion_via_dns_spn_spoofing.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: experimental'
