id: sigmahq-sigma-bed26dea-4525-47f4-b24a-76e30e44ffb0
name: Audit Rules Deleted Via Auditctl
description: 'Detects the execution of ''auditctl'' with the ''-D'' command line parameter,
  which deletes all configured audit rules and watches on Linux systems.

  This technique is commonly used by attackers to disable audit logging and cover
  their tracks by removing monitoring capabilities.

  Removal of audit rules can significantly impair detection of malicious activities
  on the affected system.'
severity: high
enabled: false
tags:
  mitre:
  - T1685.004
  categories:
  - endpoint
references:
- https://www.atomicredteam.io/atomic-red-team/atomics/T1562.012
- https://linux.die.net/man/8/auditct
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    Image|endswith: /auditctl
    CommandLine|re: -D
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: bed26dea-4525-47f4-b24a-76e30e44ffb0
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/process_creation/proc_creation_lnx_auditctl_clear_rules.yml
falsepositives:
- An administrator troubleshooting. Investigate all attempts.
notes:
  quarantine_reason: 'upstream status: experimental'
