id: sigmahq-sigma-0a13e132-651d-11eb-ae93-0242ac130002
name: Audit Policy Tampering Via Auditpol
description: 'Threat actors can use auditpol binary to change audit policy configuration
  to impair detection capability.

  This can be carried out by selectively disabling/removing certain audit policies
  as well as restoring a custom policy owned by the threat actor.'
severity: high
enabled: false
tags:
  mitre:
  - T1685.001
  categories:
  - endpoint
references:
- https://www.microsoft.com/security/blog/2021/01/20/deep-dive-into-the-solorigate-second-stage-activation-from-sunburst-to-teardrop-and-raindrop/
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \auditpol.exe
  - OriginalFileName: AUDITPOL.EXE
  selection_cli:
    CommandLine|contains:
    - disable
    - clear
    - remove
    - restore
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 0a13e132-651d-11eb-ae93-0242ac130002
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_auditpol_susp_execution.yml
falsepositives:
- Administrator or administrator scripts might leverage the flags mentioned in the
  detection section. Either way, it should always be monitored
notes:
  quarantine_reason: 'upstream status: test'
