id: sigmahq-sigma-a7af2487-9c2f-42e4-9bb9-ff961f0561d5
name: Audio Capture
description: Detects attempts to record audio using the arecord and ecasound utilities.
severity: low
enabled: false
tags:
  mitre:
  - T1123
  categories:
  - endpoint
references:
- https://linux.die.net/man/1/arecord
- https://linuxconfig.org/how-to-test-microphone-with-audio-linux-sound-architecture-alsa
- https://manpages.debian.org/unstable/ecasound/ecasound.1.en.html
- https://ecasound.seul.org/ecasound/Documentation/examples.html#fconversions
logsource:
  product: linux
  service: auditd
detection:
  selection_execve:
    type: EXECVE
    a0: arecord
    a1: -vv
    a2: -fdat
  selection_syscall_memfd_create:
    type: SYSCALL
    exe|endswith: /ecasound
    SYSCALL: memfd_create
  condition: 1 of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: a7af2487-9c2f-42e4-9bb9-ff961f0561d5
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/auditd/lnx_auditd_audio_capture.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
