id: sigmahq-sigma-e0565f5d-d420-4e02-8a68-ac00d864f9cf
name: Automated Collection Bookmarks Using Get-ChildItem PowerShell
description: 'Adversaries may enumerate browser bookmarks to learn more about compromised
  hosts.

  Browser bookmarks may reveal personal information about users (ex: banking sites,
  interests, social media, etc.) as well as details about

  internal network resources such as servers, tools/dashboards, or other related infrastructure.'
severity: low
enabled: false
tags:
  mitre:
  - T1217
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1217/T1217.md
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection:
    ScriptBlockText|contains|all:
    - Get-ChildItem
    - ' -Recurse '
    - ' -Path '
    - ' -Filter Bookmarks'
    - ' -ErrorAction SilentlyContinue'
    - ' -Force'
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: e0565f5d-d420-4e02-8a68-ac00d864f9cf
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_get_childitem_bookmarks.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
