id: sigmahq-sigma-f576a613-2392-4067-9d1a-9345fb58d8d1
name: Automated Collection Command Prompt
description: Once established within a system or network, an adversary may use automated
  techniques for collecting internal data.
severity: medium
enabled: false
tags:
  mitre:
  - T1119
  - T1552.001
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1119/T1119.md
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1552.001/T1552.001.md
logsource:
  category: process_creation
  product: windows
detection:
  selection_ext:
    CommandLine|contains:
    - .doc
    - .docx
    - .xls
    - .xlsx
    - .ppt
    - .pptx
    - .rtf
    - .pdf
    - .txt
  selection_other_dir:
    CommandLine|contains|all:
    - 'dir '
    - ' /b '
    - ' /s '
  selection_other_findstr:
    OriginalFileName: FINDSTR.EXE
    CommandLine|contains:
    - ' /e '
    - ' /si '
  condition: selection_ext and 1 of selection_other_*
provenance:
  source: SigmaHQ/sigma
  source_id: f576a613-2392-4067-9d1a-9345fb58d8d1
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_susp_automated_collection.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
