id: sigmahq-sigma-055fb148-60f8-462d-ad16-26926ce050f1
name: AWS User Login Profile Was Modified
description: 'Detects activity when someone is changing passwords on behalf of other
  users.

  An attacker with the "iam:UpdateLoginProfile" permission on other users can change
  the password used to login to the AWS console on any user that already has a login
  profile setup.'
severity: high
enabled: false
tags:
  mitre:
  - T1098
  categories:
  - cloud
references:
- https://github.com/RhinoSecurityLabs/AWS-IAM-Privilege-Escalation
logsource:
  product: aws
  service: cloudtrail
detection:
  selection:
    eventSource: iam.amazonaws.com
    eventName: UpdateLoginProfile
  filter_main_user_identity:
    userIdentity.arn|fieldref: requestParameters.userName
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 055fb148-60f8-462d-ad16-26926ce050f1
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/aws/cloudtrail/aws_update_login_profile.yml
falsepositives:
- Legitimate user account administration
notes:
  quarantine_reason: 'upstream status: test'
