id: sigmahq-sigma-3940b5f1-3f46-44aa-b746-ebe615b879e0
name: AWS Route 53 Domain Transfer Lock Disabled
description: Detects when a transfer lock was removed from a Route 53 domain. It is
  recommended to refrain from performing this action unless intending to transfer
  the domain to a different registrar.
severity: low
enabled: false
tags:
  mitre:
  - T1098
  categories:
  - cloud
references:
- https://github.com/elastic/detection-rules/blob/c76a39796972ecde44cb1da6df47f1b6562c9770/rules/integrations/aws/persistence_route_53_domain_transfer_lock_disabled.toml
- https://docs.aws.amazon.com/Route53/latest/APIReference/API_Operations_Amazon_Route_53.html
- https://docs.aws.amazon.com/Route53/latest/APIReference/API_domains_DisableDomainTransferLock.html
logsource:
  product: aws
  service: cloudtrail
detection:
  selection:
    eventSource: route53.amazonaws.com
    eventName: DisableDomainTransferLock
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 3940b5f1-3f46-44aa-b746-ebe615b879e0
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/aws/cloudtrail/aws_route_53_domain_transferred_lock_disabled.yml
falsepositives:
- A domain transfer lock may be disabled by a system or network administrator. Verify
  whether the user identity, user agent, and/or hostname should be making changes
  in your environment. Activity from unfamiliar users or hosts should be investigated.
  If known behavior is causing false positives, it can be exempted from the rule.
notes:
  quarantine_reason: 'upstream status: test'
