id: sigmahq-sigma-4ae68615-866f-4304-b24b-ba048dfa5ca7
name: AWS ElastiCache Security Group Created
description: Detects when an ElastiCache security group has been created.
severity: low
enabled: false
tags:
  mitre:
  - T1136
  - T1136.003
  categories:
  - cloud
references:
- https://github.com/elastic/detection-rules/blob/598f3d7e0a63221c0703ad9a0ea7e22e7bc5961e/rules/integrations/aws/persistence_elasticache_security_group_creation.toml
logsource:
  product: aws
  service: cloudtrail
detection:
  selection:
    eventSource: elasticache.amazonaws.com
    eventName: CreateCacheSecurityGroup
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 4ae68615-866f-4304-b24b-ba048dfa5ca7
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/aws/cloudtrail/aws_elasticache_security_group_created.yml
falsepositives:
- A ElastiCache security group may be created by a system or network administrator.
  Verify whether the user identity, user agent, and/or hostname should be making changes
  in your environment. Security group creations from unfamiliar users or hosts should
  be investigated. If known behavior is causing false positives, it can be exempted
  from the rule.
notes:
  quarantine_reason: 'upstream status: test'
