id: sigmahq-sigma-8ad1600d-e9dc-4251-b0ee-a65268f29add
name: AWS Root Credentials
description: Detects AWS root account usage
severity: medium
enabled: false
tags:
  mitre:
  - T1078.004
  categories:
  - cloud
references:
- https://docs.aws.amazon.com/IAM/latest/UserGuide/id_root-user.html
logsource:
  product: aws
  service: cloudtrail
detection:
  selection_usertype:
    userIdentity.type: Root
  selection_eventtype:
    eventType: AwsServiceEvent
  condition: selection_usertype and not selection_eventtype
provenance:
  source: SigmaHQ/sigma
  source_id: 8ad1600d-e9dc-4251-b0ee-a65268f29add
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/aws/cloudtrail/aws_root_account_usage.yml
falsepositives:
- AWS Tasks That Require AWS Account Root User Credentials https://docs.aws.amazon.com/general/latest/gr/aws_tasks-that-require-root.html
notes:
  quarantine_reason: 'upstream status: test'
