id: sigmahq-sigma-6a7ba45c-63d8-473e-9736-2eaabff79964
name: AWS EFS Fileshare Mount Modified or Deleted
description: Detects when a EFS Fileshare Mount is modified or deleted. An adversary
  breaking any file system using the mount target that is being deleted, which might
  disrupt instances or applications using those mounts.
severity: medium
enabled: false
tags:
  mitre:
  - T1485
  categories:
  - cloud
references:
- https://docs.aws.amazon.com/efs/latest/ug/API_DeleteMountTarget.html
logsource:
  product: aws
  service: cloudtrail
detection:
  selection:
    eventSource: elasticfilesystem.amazonaws.com
    eventName: DeleteMountTarget
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 6a7ba45c-63d8-473e-9736-2eaabff79964
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/aws/cloudtrail/aws_efs_fileshare_mount_modified_or_deleted.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
