id: sigmahq-sigma-b45ab1d2-712f-4f01-a751-df3826969807
name: AWS STS GetSessionToken Misuse
description: Identifies the suspicious use of GetSessionToken. Tokens could be created
  and used by attackers to move laterally and escalate privileges.
severity: low
enabled: false
tags:
  mitre:
  - T1548
  - T1550
  - T1550.001
  categories:
  - cloud
references:
- https://github.com/elastic/detection-rules/pull/1213
- https://docs.aws.amazon.com/STS/latest/APIReference/API_GetSessionToken.html
logsource:
  product: aws
  service: cloudtrail
detection:
  selection:
    eventSource: sts.amazonaws.com
    eventName: GetSessionToken
    userIdentity.type: IAMUser
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: b45ab1d2-712f-4f01-a751-df3826969807
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/aws/cloudtrail/aws_sts_getsessiontoken_misuse.yml
falsepositives:
- GetSessionToken may be done by a system or network administrator. Verify whether
  the user identity, user agent, and/or hostname should be making changes in your
  environment. GetSessionToken from unfamiliar users or hosts should be investigated.
  If known behavior is causing false positives, it can be exempted from the rule.
notes:
  quarantine_reason: 'upstream status: test'
