id: sigmahq-sigma-a5ffb6ea-c784-4e01-b30a-deb6e58ca2ab
name: AWS EnableRegion Command Monitoring
description: 'Detects the use of the EnableRegion command in AWS CloudTrail logs.

  While AWS has 30+ regions, some of them are enabled by default, others must be explicitly
  enabled in each account separately.

  There may be situations where security monitoring does not cover some new AWS regions.

  Monitoring the EnableRegion command is important for identifying potential persistence
  mechanisms employed by adversaries, as enabling additional regions can facilitate
  continued access and operations within an AWS environment.'
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - cloud
references:
- https://docs.aws.amazon.com/accounts/latest/reference/API_EnableRegion.html
- https://awscli.amazonaws.com/v2/documentation/api/2.14.0/reference/account/enable-region.html
logsource:
  product: aws
  service: cloudtrail
detection:
  selection:
    eventName: EnableRegion
    eventSource: account.amazonaws.com
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: a5ffb6ea-c784-4e01-b30a-deb6e58ca2ab
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/aws/cloudtrail/aws_cloudtrail_region_enabled.yml
falsepositives:
- Legitimate use of the EnableRegion command by authorized administrators.
notes:
  quarantine_reason: 'upstream status: experimental'
