id: sigmahq-sigma-abae8fec-57bd-4f87-aff6-6e3db989843d
name: AWS Snapshot Backup Exfiltration
description: Detects the modification of an EC2 snapshot's permissions to enable access
  from another account
severity: medium
enabled: false
tags:
  mitre:
  - T1537
  categories:
  - cloud
references:
- https://www.justice.gov/file/1080281/download
logsource:
  product: aws
  service: cloudtrail
detection:
  selection_source:
    eventSource: ec2.amazonaws.com
    eventName: ModifySnapshotAttribute
  condition: selection_source
provenance:
  source: SigmaHQ/sigma
  source_id: abae8fec-57bd-4f87-aff6-6e3db989843d
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/aws/cloudtrail/aws_snapshot_backup_exfiltration.yml
falsepositives:
- Valid change to a snapshot's permissions
notes:
  quarantine_reason: 'upstream status: test'
