id: sigmahq-sigma-54b9a76a-3c71-4673-b4b3-2edb4566ea7b
name: AWS EC2 VM Export Failure
description: An attempt to export an AWS EC2 instance has been detected. A VM Export
  might indicate an attempt to extract information from an instance.
severity: low
enabled: false
tags:
  mitre:
  - T1005
  - T1537
  categories:
  - cloud
references:
- https://docs.aws.amazon.com/vm-import/latest/userguide/vmexport.html#export-instance
logsource:
  product: aws
  service: cloudtrail
detection:
  selection:
    eventName: CreateInstanceExportTask
    eventSource: ec2.amazonaws.com
  filter1:
    errorMessage|contains: '*'
  filter2:
    errorCode|contains: '*'
  filter3:
    responseElements|contains: Failure
  condition: selection and not 1 of filter*
provenance:
  source: SigmaHQ/sigma
  source_id: 54b9a76a-3c71-4673-b4b3-2edb4566ea7b
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/aws/cloudtrail/aws_ec2_vm_export_failure.yml
notes:
  quarantine_reason: 'upstream status: test'
