id: sigmahq-sigma-f8103686-e3e8-46f3-be72-65f7fcb4aa53
name: AWS Console GetSigninToken Potential Abuse
description: 'Detects potentially suspicious events involving "GetSigninToken".

  An adversary using the "aws_consoler" tool can leverage this console API to create
  temporary federated credential that help obfuscate which AWS credential is compromised
  (the original access key) and enables the adversary to pivot from the AWS CLI to
  console sessions without the need for MFA using the new access key issued in this
  request.'
severity: medium
enabled: false
tags:
  mitre:
  - T1021.007
  - T1550.001
  categories:
  - cloud
references:
- https://github.com/NetSPI/aws_consoler
- https://www.crowdstrike.com/blog/analysis-of-intrusion-campaign-targeting-telecom-and-bpo-companies/
logsource:
  product: aws
  service: cloudtrail
detection:
  selection:
    eventSource: signin.amazonaws.com
    eventName: GetSigninToken
  filter_main_console_ua:
    userAgent|contains: Jersey/${project.version}
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: f8103686-e3e8-46f3-be72-65f7fcb4aa53
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/aws/cloudtrail/aws_console_getsignintoken.yml
falsepositives:
- GetSigninToken events will occur when using AWS SSO portal to login and will generate
  false positives if you do not filter for the expected user agent(s), see filter.
  Non-SSO configured roles would be abnormal and should be investigated.
notes:
  quarantine_reason: 'upstream status: test'
