id: sigmahq-sigma-33d50d03-20ec-4b74-a74e-1e65a38af1c0
name: AWS EKS Cluster Created or Deleted
description: Identifies when an EKS cluster is created or deleted.
severity: low
enabled: false
tags:
  mitre:
  - T1485
  categories:
  - cloud
references:
- https://any-api.com/amazonaws_com/eks/docs/API_Description
logsource:
  product: aws
  service: cloudtrail
detection:
  selection:
    eventSource: eks.amazonaws.com
    eventName:
    - CreateCluster
    - DeleteCluster
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 33d50d03-20ec-4b74-a74e-1e65a38af1c0
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/aws/cloudtrail/aws_eks_cluster_created_or_deleted.yml
falsepositives:
- EKS Cluster being created or deleted may be performed by a system administrator.
- Verify whether the user identity, user agent, and/or hostname should be making changes
  in your environment.
- EKS Cluster created or deleted from unfamiliar users should be investigated. If
  known behavior is causing false positives, it can be exempted from the rule.
notes:
  quarantine_reason: 'upstream status: test'
