id: sigmahq-sigma-b94bf91e-c2bf-4047-9c43-c6810f43baad
name: AWS ECS Task Definition That Queries The Credential Endpoint
description: 'Detects when an Elastic Container Service (ECS) Task Definition includes
  a command to query the credential endpoint.

  This can indicate a potential adversary adding a backdoor to establish persistence
  or escalate privileges.'
severity: medium
enabled: false
tags:
  mitre:
  - T1525
  categories:
  - cloud
references:
- https://github.com/RhinoSecurityLabs/pacu/blob/866376cd711666c775bbfcde0524c817f2c5b181/pacu/modules/ecs__backdoor_task_def/main.py
- https://docs.aws.amazon.com/AmazonECS/latest/APIReference/API_RegisterTaskDefinition.html
- https://docs.aws.amazon.com/AmazonECS/latest/developerguide/task-iam-roles.html
logsource:
  product: aws
  service: cloudtrail
detection:
  selection:
    eventSource: ecs.amazonaws.com
    eventName:
    - DescribeTaskDefinition
    - RegisterTaskDefinition
    - RunTask
    requestParameters.containerDefinitions.command|contains: $AWS_CONTAINER_CREDENTIALS_RELATIVE_URI
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: b94bf91e-c2bf-4047-9c43-c6810f43baad
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/aws/cloudtrail/aws_ecs_task_definition_cred_endpoint_query.yml
falsepositives:
- Task Definition being modified to request credentials from the Task Metadata Service
  for valid reasons
notes:
  quarantine_reason: 'upstream status: test'
