id: sigmahq-sigma-8a63cdd4-6207-414a-85bc-7e032bd3c1a2
name: AWS RDS Master Password Change
description: Detects the change of database master password. It may be a part of data
  exfiltration.
severity: medium
enabled: false
tags:
  mitre:
  - T1020
  categories:
  - cloud
references:
- https://github.com/RhinoSecurityLabs/pacu/blob/866376cd711666c775bbfcde0524c817f2c5b181/pacu/modules/rds__explore_snapshots/main.py
logsource:
  product: aws
  service: cloudtrail
detection:
  selection_source:
    eventSource: rds.amazonaws.com
    responseElements.pendingModifiedValues.masterUserPassword|contains: '*'
    eventName: ModifyDBInstance
  condition: selection_source
provenance:
  source: SigmaHQ/sigma
  source_id: 8a63cdd4-6207-414a-85bc-7e032bd3c1a2
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/aws/cloudtrail/aws_rds_change_master_password.yml
falsepositives:
- Benign changes to a db instance
notes:
  quarantine_reason: 'upstream status: test'
