id: sigmahq-sigma-db014773-d9d9-4792-91e5-133337c0ffee
name: AWS IAM S3Browser User or AccessKey Creation
description: Detects S3 Browser utility creating IAM User or AccessKey.
severity: high
enabled: false
tags:
  mitre:
  - T1059.009
  - T1078.004
  categories:
  - cloud
references:
- https://permiso.io/blog/s/unmasking-guivil-new-cloud-threat-actor
logsource:
  product: aws
  service: cloudtrail
detection:
  selection:
    eventSource: iam.amazonaws.com
    eventName:
    - CreateUser
    - CreateAccessKey
    userAgent|contains: S3 Browser
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: db014773-d9d9-4792-91e5-133337c0ffee
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/aws/cloudtrail/aws_iam_s3browser_user_or_accesskey_creation.yml
falsepositives:
- Valid usage of S3 Browser for IAM User and/or AccessKey creation
notes:
  quarantine_reason: 'upstream status: test'
