id: sigmahq-sigma-b02f9591-12c3-4965-986a-88028629b2e1
name: Azure Kubernetes Pods Deleted
description: Identifies the deletion of Azure Kubernetes Pods.
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - cloud
references:
- https://learn.microsoft.com/en-us/azure/role-based-access-control/resource-provider-operations#microsoftkubernetes
- https://github.com/elastic/detection-rules/blob/065bf48a9987cd8bd826c098a30ce36e6868ee46/rules/integrations/azure/impact_kubernetes_pod_deleted.toml
logsource:
  product: azure
  service: activitylogs
detection:
  selection:
    operationName: MICROSOFT.KUBERNETES/CONNECTEDCLUSTERS/PODS/DELETE
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: b02f9591-12c3-4965-986a-88028629b2e1
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/azure/activity_logs/azure_kubernetes_pods_deleted.yml
falsepositives:
- Pods may be deleted by a system administrator. Verify whether the user identity,
  user agent, and/or hostname should be making changes in your environment.
- Pods deletions from unfamiliar users or hosts should be investigated. If known behavior
  is causing false positives, it can be exempted from the rule.
notes:
  quarantine_reason: 'upstream status: test'
