id: sigmahq-sigma-af6925b0-8826-47f1-9324-337507a0babd
name: Azure DNS Zone Modified or Deleted
description: Identifies when DNS zone is modified or deleted.
severity: medium
enabled: false
tags:
  mitre:
  - T1565.001
  categories:
  - cloud
references:
- https://learn.microsoft.com/en-us/azure/role-based-access-control/resource-provider-operations#microsoftkubernetes
logsource:
  product: azure
  service: activitylogs
detection:
  selection:
    operationName|startswith: MICROSOFT.NETWORK/DNSZONES
    operationName|endswith:
    - /WRITE
    - /DELETE
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: af6925b0-8826-47f1-9324-337507a0babd
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/azure/activity_logs/azure_dns_zone_modified_or_deleted.yml
falsepositives:
- DNS zone modified and deleted may be performed by a system administrator. Verify
  whether the user identity, user agent, and/or hostname should be making changes
  in your environment.
- DNS zone modification from unfamiliar users should be investigated. If known behavior
  is causing false positives, it can be exempted from the rule.
notes:
  quarantine_reason: 'upstream status: test'
