id: sigmahq-sigma-636e30d5-3736-42ea-96b1-e6e2f8429fd6
name: Azure Owner Removed From Application or Service Principal
description: Identifies when a owner is was removed from a application or service
  principal in Azure.
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - cloud
references:
- https://learn.microsoft.com/en-us/entra/identity/monitoring-health/reference-audit-activities#application-proxy
logsource:
  product: azure
  service: activitylogs
detection:
  selection:
    properties.message:
    - Remove owner from service principal
    - Remove owner from application
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 636e30d5-3736-42ea-96b1-e6e2f8429fd6
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/azure/activity_logs/azure_owner_removed_from_application_or_service_principal.yml
falsepositives:
- Owner being removed may be performed by a system administrator.
- Verify whether the user identity, user agent, and/or hostname should be making changes
  in your environment.
- Owner removed from unfamiliar users should be investigated. If known behavior is
  causing false positives, it can be exempted from the rule.
notes:
  quarantine_reason: 'upstream status: test'
