id: sigmahq-sigma-512cf937-ea9b-4332-939c-4c2c94baadcd
name: Azure Firewall Modified or Deleted
description: Identifies when a firewall is created, modified, or deleted.
severity: medium
enabled: false
tags:
  mitre:
  - T1686.001
  categories:
  - cloud
references:
- https://learn.microsoft.com/en-us/azure/role-based-access-control/resource-provider-operations
logsource:
  product: azure
  service: activitylogs
detection:
  selection:
    operationName:
    - MICROSOFT.NETWORK/AZUREFIREWALLS/WRITE
    - MICROSOFT.NETWORK/AZUREFIREWALLS/DELETE
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 512cf937-ea9b-4332-939c-4c2c94baadcd
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/azure/activity_logs/azure_firewall_modified_or_deleted.yml
falsepositives:
- Firewall being modified or deleted may be performed by a system administrator. Verify
  whether the user identity, user agent, and/or hostname should be making changes
  in your environment.
- Firewall modified or deleted from unfamiliar users should be investigated. If known
  behavior is causing false positives, it can be exempted from the rule.
notes:
  quarantine_reason: 'upstream status: test'
