id: sigmahq-sigma-410d2a41-1e6d-452f-85e5-abdd8257a823
name: Azure Application Deleted
description: Identifies when a application is deleted in Azure.
severity: medium
enabled: false
tags:
  mitre:
  - T1489
  categories:
  - cloud
references:
- https://learn.microsoft.com/en-us/entra/identity/monitoring-health/reference-audit-activities#application-proxy
logsource:
  product: azure
  service: activitylogs
detection:
  selection:
    properties.message:
    - Delete application
    - Hard Delete application
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 410d2a41-1e6d-452f-85e5-abdd8257a823
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/azure/activity_logs/azure_application_deleted.yml
falsepositives:
- Application being deleted may be performed by a system administrator.
- Verify whether the user identity, user agent, and/or hostname should be making changes
  in your environment.
- Application deleted from unfamiliar users should be investigated. If known behavior
  is causing false positives, it can be exempted from the rule.
notes:
  quarantine_reason: 'upstream status: test'
