id: sigmahq-sigma-025c9fe7-db72-49f9-af0d-31341dd7dd57
name: Azure Firewall Rule Collection Modified or Deleted
description: Identifies when Rule Collections (Application, NAT, and Network) is being
  modified or deleted.
severity: medium
enabled: false
tags:
  mitre:
  - T1686.001
  categories:
  - cloud
references:
- https://learn.microsoft.com/en-us/azure/role-based-access-control/resource-provider-operations
logsource:
  product: azure
  service: activitylogs
detection:
  selection:
    operationName:
    - MICROSOFT.NETWORK/AZUREFIREWALLS/APPLICATIONRULECOLLECTIONS/WRITE
    - MICROSOFT.NETWORK/AZUREFIREWALLS/APPLICATIONRULECOLLECTIONS/DELETE
    - MICROSOFT.NETWORK/AZUREFIREWALLS/NATRULECOLLECTIONS/WRITE
    - MICROSOFT.NETWORK/AZUREFIREWALLS/NATRULECOLLECTIONS/DELETE
    - MICROSOFT.NETWORK/AZUREFIREWALLS/NETWORKRULECOLLECTIONS/WRITE
    - MICROSOFT.NETWORK/AZUREFIREWALLS/NETWORKRULECOLLECTIONS/DELETE
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 025c9fe7-db72-49f9-af0d-31341dd7dd57
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/azure/activity_logs/azure_firewall_rule_collection_modified_or_deleted.yml
falsepositives:
- Rule Collections (Application, NAT, and Network) being modified or deleted may be
  performed by a system administrator. Verify whether the user identity, user agent,
  and/or hostname should be making changes in your environment.
- Rule Collections (Application, NAT, and Network) modified or deleted from unfamiliar
  users should be investigated. If known behavior is causing false positives, it can
  be exempted from the rule.
notes:
  quarantine_reason: 'upstream status: test'
