id: sigmahq-sigma-b831353c-1971-477b-abb6-2828edc3bca1
name: Azure Keyvault Secrets Modified or Deleted
description: Identifies when secrets are modified or deleted in Azure.
severity: medium
enabled: false
tags:
  mitre:
  - T1552
  - T1552.001
  categories:
  - cloud
references:
- https://learn.microsoft.com/en-us/azure/role-based-access-control/resource-provider-operations
logsource:
  product: azure
  service: activitylogs
detection:
  selection:
    operationName:
    - MICROSOFT.KEYVAULT/VAULTS/SECRETS/WRITE
    - MICROSOFT.KEYVAULT/VAULTS/SECRETS/DELETE
    - MICROSOFT.KEYVAULT/VAULTS/SECRETS/BACKUP/ACTION
    - MICROSOFT.KEYVAULT/VAULTS/SECRETS/PURGE/ACTION
    - MICROSOFT.KEYVAULT/VAULTS/SECRETS/UPDATE/ACTION
    - MICROSOFT.KEYVAULT/VAULTS/SECRETS/RECOVER/ACTION
    - MICROSOFT.KEYVAULT/VAULTS/SECRETS/RESTORE/ACTION
    - MICROSOFT.KEYVAULT/VAULTS/SECRETS/SETSECRET/ACTION
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: b831353c-1971-477b-abb6-2828edc3bca1
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/azure/activity_logs/azure_keyvault_secrets_modified_or_deleted.yml
falsepositives:
- Secrets being modified or deleted may be performed by a system administrator.
- Verify whether the user identity, user agent, and/or hostname should be making changes
  in your environment.
- Secrets modified or deleted from unfamiliar users should be investigated. If known
  behavior is causing false positives, it can be exempted from the rule.
notes:
  quarantine_reason: 'upstream status: test'
