id: sigmahq-sigma-92cc3e5d-eb57-419d-8c16-5c63f325a401
name: Azure Suppression Rule Created
description: Identifies when a suppression rule is created in Azure. Adversary's could
  attempt this to evade detection.
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - cloud
references:
- https://learn.microsoft.com/en-us/azure/role-based-access-control/resource-provider-operations
logsource:
  product: azure
  service: activitylogs
detection:
  selection:
    operationName: MICROSOFT.SECURITY/ALERTSSUPPRESSIONRULES/WRITE
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 92cc3e5d-eb57-419d-8c16-5c63f325a401
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/azure/activity_logs/azure_suppression_rule_created.yml
falsepositives:
- Suppression Rule being created may be performed by a system administrator.
- Verify whether the user identity, user agent, and/or hostname should be making changes
  in your environment.
- Suppression Rule created from unfamiliar users should be investigated. If known
  behavior is causing false positives, it can be exempted from the rule.
notes:
  quarantine_reason: 'upstream status: test'
