id: sigmahq-sigma-25cb259b-bbdc-4b87-98b7-90d7c72f8743
name: Azure Kubernetes RoleBinding/ClusterRoleBinding Modified and Deleted
description: Detects the creation or patching of potential malicious RoleBinding/ClusterRoleBinding.
severity: medium
enabled: false
tags:
  mitre:
  - T1485
  - T1496
  - T1489
  categories:
  - cloud
references:
- https://learn.microsoft.com/en-us/azure/role-based-access-control/resource-provider-operations#microsoftkubernetes
- https://www.microsoft.com/security/blog/2021/03/23/secure-containerized-environments-with-updated-threat-matrix-for-kubernetes/
- https://www.microsoft.com/security/blog/2020/04/02/attack-matrix-kubernetes/
- https://medium.com/mitre-engenuity/att-ck-for-containers-now-available-4c2359654bf1
logsource:
  product: azure
  service: activitylogs
detection:
  selection:
    operationName:
    - MICROSOFT.KUBERNETES/CONNECTEDCLUSTERS/RBAC.AUTHORIZATION.K8S.IO/CLUSTERROLEBINDINGS/WRITE
    - MICROSOFT.KUBERNETES/CONNECTEDCLUSTERS/RBAC.AUTHORIZATION.K8S.IO/CLUSTERROLEBINDINGS/DELETE
    - MICROSOFT.KUBERNETES/CONNECTEDCLUSTERS/RBAC.AUTHORIZATION.K8S.IO/ROLEBINDINGS/WRITE
    - MICROSOFT.KUBERNETES/CONNECTEDCLUSTERS/RBAC.AUTHORIZATION.K8S.IO/ROLEBINDINGS/DELETE
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 25cb259b-bbdc-4b87-98b7-90d7c72f8743
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/azure/activity_logs/azure_kubernetes_rolebinding_modified_or_deleted.yml
falsepositives:
- RoleBinding/ClusterRoleBinding being modified and deleted may be performed by a
  system administrator. Verify whether the user identity, user agent, and/or hostname
  should be making changes in your environment.
- RoleBinding/ClusterRoleBinding modification from unfamiliar users should be investigated.
  If known behavior is causing false positives, it can be exempted from the rule.
notes:
  quarantine_reason: 'upstream status: test'
