id: sigmahq-sigma-288a39fc-4914-4831-9ada-270e9dc12cb4
name: Azure Active Directory Hybrid Health AD FS New Server
description: 'This detection uses azureactivity logs (Administrative category) to
  identify the creation or update of a server instance in an Azure AD Hybrid health
  AD FS service.

  A threat actor can create a new AD Health ADFS service and create a fake server
  instance to spoof AD FS signing logs. There is no need to compromise an on-prem
  AD FS server.

  This can be done programmatically via HTTP requests to Azure.'
severity: medium
enabled: false
tags:
  mitre:
  - T1578
  categories:
  - cloud
references:
- https://o365blog.com/post/hybridhealthagent/
logsource:
  product: azure
  service: activitylogs
detection:
  selection:
    CategoryValue: Administrative
    ResourceProviderValue: Microsoft.ADHybridHealthService
    ResourceId|contains: AdFederationService
    OperationNameValue: Microsoft.ADHybridHealthService/services/servicemembers/action
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 288a39fc-4914-4831-9ada-270e9dc12cb4
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/azure/activity_logs/azure_aadhybridhealth_adfs_new_server.yml
falsepositives:
- Legitimate AD FS servers added to an AAD Health AD FS service instance
notes:
  quarantine_reason: 'upstream status: test'
