id: sigmahq-sigma-352a54e1-74ba-4929-9d47-8193d67aba1e
name: Azure Domain Federation Settings Modified
description: Identifies when an user or application modified the federation settings
  on the domain.
severity: medium
enabled: false
tags:
  mitre:
  - T1078
  categories:
  - cloud
references:
- https://learn.microsoft.com/en-us/azure/active-directory/hybrid/how-to-connect-monitor-federation-changes
logsource:
  product: azure
  service: auditlogs
detection:
  selection:
    ActivityDisplayName: Set federation settings on domain
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 352a54e1-74ba-4929-9d47-8193d67aba1e
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/azure/audit_logs/azure_federation_modified.yml
falsepositives:
- Federation Settings being modified or deleted may be performed by a system administrator.
- Verify whether the user identity, user agent, and/or hostname should be making changes
  in your environment.
- Federation Settings modified from unfamiliar users should be investigated. If known
  behavior is causing false positives, it can be exempted from the rule.
notes:
  quarantine_reason: 'upstream status: test'
