id: sigmahq-sigma-a61a3c56-4ce2-4351-a079-88ae4cbd2b58
name: Azure Kubernetes Admission Controller
description: 'Identifies when an admission controller is executed in Azure Kubernetes.

  A Kubernetes Admission controller intercepts, and possibly modifies, requests to
  the Kubernetes API server.

  The behavior of this admission controller is determined by an admission webhook
  (MutatingAdmissionWebhook or ValidatingAdmissionWebhook) that the user deploys in
  the cluster.

  An adversary can use such webhooks as the MutatingAdmissionWebhook for obtaining
  persistence in the cluster.

  For example, attackers can intercept and modify the pod creation operations in the
  cluster and add their malicious container to every created pod.

  An adversary can use the webhook ValidatingAdmissionWebhook, which could be used
  to obtain access credentials.

  An adversary could use the webhook to intercept the requests to the API server,
  record secrets, and other sensitive information.'
severity: medium
enabled: false
tags:
  mitre:
  - T1078
  - T1552
  - T1552.007
  categories:
  - cloud
references:
- https://learn.microsoft.com/en-us/azure/role-based-access-control/resource-provider-operations#microsoftkubernetes
logsource:
  product: azure
  service: activitylogs
detection:
  selection:
    operationName|startswith:
    - MICROSOFT.KUBERNETES/CONNECTEDCLUSTERS/ADMISSIONREGISTRATION.K8S.IO
    - MICROSOFT.CONTAINERSERVICE/MANAGEDCLUSTERS/ADMISSIONREGISTRATION.K8S.IO
    operationName|endswith:
    - /MUTATINGWEBHOOKCONFIGURATIONS/WRITE
    - /VALIDATINGWEBHOOKCONFIGURATIONS/WRITE
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: a61a3c56-4ce2-4351-a079-88ae4cbd2b58
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/azure/activity_logs/azure_kubernetes_admission_controller.yml
falsepositives:
- Azure Kubernetes Admissions Controller may be done by a system administrator.
- If known behavior is causing false positives, it can be exempted from the rule.
notes:
  quarantine_reason: 'upstream status: test'
