id: sigmahq-sigma-93e0ef48-37c8-49ed-a02c-038aab23628e
name: Azure Container Registry Created or Deleted
description: Detects when a Container Registry is created or deleted.
severity: low
enabled: false
tags:
  mitre:
  - T1485
  - T1496
  - T1489
  categories:
  - cloud
references:
- https://learn.microsoft.com/en-us/azure/role-based-access-control/resource-provider-operations#microsoftkubernetes
- https://www.microsoft.com/security/blog/2021/03/23/secure-containerized-environments-with-updated-threat-matrix-for-kubernetes/
- https://www.microsoft.com/security/blog/2020/04/02/attack-matrix-kubernetes/
- https://medium.com/mitre-engenuity/att-ck-for-containers-now-available-4c2359654bf1
logsource:
  product: azure
  service: activitylogs
detection:
  selection:
    operationName:
    - MICROSOFT.CONTAINERREGISTRY/REGISTRIES/WRITE
    - MICROSOFT.CONTAINERREGISTRY/REGISTRIES/DELETE
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 93e0ef48-37c8-49ed-a02c-038aab23628e
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/azure/activity_logs/azure_container_registry_created_or_deleted.yml
falsepositives:
- Container Registry being created or deleted may be performed by a system administrator.
  Verify whether the user identity, user agent, and/or hostname should be making changes
  in your environment.
- Container Registry created or deleted from unfamiliar users should be investigated.
  If known behavior is causing false positives, it can be exempted from the rule.
notes:
  quarantine_reason: 'upstream status: test'
