id: sigmahq-sigma-15ef3fac-f0f0-4dc4-ada0-660aa72980b3
name: Azure Virtual Network Device Modified or Deleted
description: 'Identifies when a virtual network device is being modified or deleted.

  This can be a network interface, network virtual appliance, virtual hub, or virtual
  router.'
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - cloud
references:
- https://learn.microsoft.com/en-us/azure/role-based-access-control/resource-provider-operations
logsource:
  product: azure
  service: activitylogs
detection:
  selection:
    operationName:
    - MICROSOFT.NETWORK/NETWORKINTERFACES/TAPCONFIGURATIONS/WRITE
    - MICROSOFT.NETWORK/NETWORKINTERFACES/TAPCONFIGURATIONS/DELETE
    - MICROSOFT.NETWORK/NETWORKINTERFACES/WRITE
    - MICROSOFT.NETWORK/NETWORKINTERFACES/JOIN/ACTION
    - MICROSOFT.NETWORK/NETWORKINTERFACES/DELETE
    - MICROSOFT.NETWORK/NETWORKVIRTUALAPPLIANCES/DELETE
    - MICROSOFT.NETWORK/NETWORKVIRTUALAPPLIANCES/WRITE
    - MICROSOFT.NETWORK/VIRTUALHUBS/DELETE
    - MICROSOFT.NETWORK/VIRTUALHUBS/WRITE
    - MICROSOFT.NETWORK/VIRTUALROUTERS/WRITE
    - MICROSOFT.NETWORK/VIRTUALROUTERS/DELETE
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 15ef3fac-f0f0-4dc4-ada0-660aa72980b3
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/azure/activity_logs/azure_network_virtual_device_modified_or_deleted.yml
falsepositives:
- Virtual Network Device being modified or deleted may be performed by a system administrator.
  Verify whether the user identity, user agent, and/or hostname should be making changes
  in your environment.
- Virtual Network Device modified or deleted from unfamiliar users should be investigated.
  If known behavior is causing false positives, it can be exempted from the rule.
notes:
  quarantine_reason: 'upstream status: test'
