id: sigmahq-sigma-61171ffc-d79c-4ae5-8e10-9323dba19cd3
name: Azure VPN Connection Modified or Deleted
description: Identifies when a VPN connection is modified or deleted.
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - cloud
references:
- https://learn.microsoft.com/en-us/azure/role-based-access-control/resource-provider-operations
logsource:
  product: azure
  service: activitylogs
detection:
  selection:
    operationName:
    - MICROSOFT.NETWORK/VPNGATEWAYS/VPNCONNECTIONS/WRITE
    - MICROSOFT.NETWORK/VPNGATEWAYS/VPNCONNECTIONS/DELETE
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 61171ffc-d79c-4ae5-8e10-9323dba19cd3
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/azure/activity_logs/azure_vpn_connection_modified_or_deleted.yml
falsepositives:
- VPN Connection being modified or deleted may be performed by a system administrator.
  Verify whether the user identity, user agent, and/or hostname should be making changes
  in your environment.
- VPN Connection modified or deleted from unfamiliar users should be investigated.
  If known behavior is causing false positives, it can be exempted from the rule.
notes:
  quarantine_reason: 'upstream status: test'
