id: sigmahq-sigma-6e8fe0a8-ba0b-4a93-8f9e-82657e7a5984
name: BaaUpdate.exe Suspicious DLL Load
description: 'Detects BitLocker Access Agent Update Utility (baaupdate.exe) loading
  DLLs from suspicious locations that are publicly writable which could indicate an
  attempt to lateral movement via BitLocker DCOM & COM Hijacking.

  This technique abuses COM Classes configured as INTERACTIVE USER to spawn processes
  in the context of the logged-on user''s session. Specifically, it targets the BDEUILauncher
  Class (CLSID ab93b6f1-be76-4185-a488-a9001b105b94)

  which can launch BaaUpdate.exe, which is vulnerable to COM Hijacking when started
  with input parameters. This allows attackers to execute code in the user''s context
  without needing to steal credentials or use additional techniques to compromise
  the account.'
severity: high
enabled: false
tags:
  mitre:
  - T1218
  - T1021.003
  categories:
  - endpoint
references:
- https://github.com/rtecCyberSec/BitlockMove
logsource:
  category: image_load
  product: windows
detection:
  selection:
    Image|endswith: \BaaUpdate.exe
    ImageLoaded|endswith: .dll
    ImageLoaded|contains:
    - :\Perflogs\
    - :\Users\Default\
    - :\Users\Public\
    - :\Windows\Temp\
    - \AppData\Local\Temp\
    - \AppData\Roaming\
    - \Contacts\
    - \Favorites\
    - \Favourites\
    - \Links\
    - \Music\
    - \Pictures\
    - \ProgramData\
    - \Temporary Internet
    - \Videos\
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 6e8fe0a8-ba0b-4a93-8f9e-82657e7a5984
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/image_load/image_load_susp_baaupdate_dll_load.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: experimental'
