id: sigmahq-sigma-9703792d-fd9a-456d-a672-ff92efe4806a
name: Backup Catalog Deleted
description: Detects backup catalog deletions
severity: medium
enabled: false
tags:
  mitre:
  - T1070.004
  categories:
  - endpoint
references:
- https://technet.microsoft.com/en-us/library/cc742154(v=ws.11).aspx
- https://www.hybrid-analysis.com/sample/ed01ebfbc9eb5bbea545af4d01bf5f1071661840480439c6e5babe8e080e41aa?environmentId=100
logsource:
  product: windows
  service: application
detection:
  selection:
    EventID: 524
    Provider_Name: Microsoft-Windows-Backup
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 9703792d-fd9a-456d-a672-ff92efe4806a
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/application/microsoft_windows_backup/win_susp_backup_delete.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
