id: sigmahq-sigma-a7c3d773-caef-227e-a7e7-c2f13c622329
name: Bad Opsec Defaults Sacrificial Processes With Improper Arguments
description: 'Detects attackers using tooling with bad opsec defaults.

  E.g. spawning a sacrificial process to inject a capability into the process without
  taking into account how the process is normally run.

  One trivial example of this is using rundll32.exe without arguments as a sacrificial
  process (default in CS, now highlighted by c2lint), running WerFault without arguments
  (Kraken - credit am0nsec), and other examples.'
severity: high
enabled: false
tags:
  mitre:
  - T1218.011
  categories:
  - endpoint
references:
- https://blog.malwarebytes.com/malwarebytes-news/2020/10/kraken-attack-abuses-wer-service/
- https://www.cobaltstrike.com/help-opsec
- https://twitter.com/CyberRaiju/status/1251492025678983169
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/regsvr32
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/rundll32
- https://learn.microsoft.com/en-us/dotnet/framework/tools/regasm-exe-assembly-registration-tool
- https://learn.microsoft.com/en-us/dotnet/framework/tools/regsvcs-exe-net-services-installation-tool
logsource:
  category: process_creation
  product: windows
detection:
  selection_werfault:
    Image|endswith: \WerFault.exe
    CommandLine|endswith: WerFault.exe
  selection_rundll32:
    Image|endswith: \rundll32.exe
    CommandLine|endswith: rundll32.exe
  selection_regsvcs:
    Image|endswith: \regsvcs.exe
    CommandLine|endswith: regsvcs.exe
  selection_regasm:
    Image|endswith: \regasm.exe
    CommandLine|endswith: regasm.exe
  selection_regsvr32:
    Image|endswith: \regsvr32.exe
    CommandLine|endswith: regsvr32.exe
  filter_optional_edge_update:
    ParentImage|contains: \AppData\Local\Microsoft\EdgeUpdate\Install\{
    Image|endswith: \rundll32.exe
    CommandLine|endswith: rundll32.exe
  filter_optional_chromium_installer:
    ParentImage|contains:
    - \AppData\Local\BraveSoftware\Brave-Browser\Application\
    - \AppData\Local\Google\Chrome\Application\
    ParentImage|endswith: \Installer\setup.exe
    ParentCommandLine|contains: '--uninstall '
    Image|endswith: \rundll32.exe
    CommandLine|endswith: rundll32.exe
  condition: 1 of selection_* and not 1 of filter_optional_*
provenance:
  source: SigmaHQ/sigma
  source_id: a7c3d773-caef-227e-a7e7-c2f13c622329
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_susp_bad_opsec_sacrificial_processes.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
