id: sigmahq-sigma-c52a914f-3d8b-4b2a-bb75-b3991e75f8ba
name: Binary Padding - Linux
description: 'Adversaries may use binary padding to add junk data and change the on-disk
  representation of malware.

  This rule detect using dd and truncate to add a junk data to file.'
severity: high
enabled: false
tags:
  mitre:
  - T1027.001
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1027.001/T1027.001.md
logsource:
  product: linux
  service: auditd
detection:
  selection_execve:
    type: EXECVE
  keywords_truncate:
    '|all':
    - truncate
    - -s
  keywords_dd:
    '|all':
    - dd
    - if=
  keywords_filter:
  - of=
  condition: selection_execve and (keywords_truncate or (keywords_dd and not keywords_filter))
provenance:
  source: SigmaHQ/sigma
  source_id: c52a914f-3d8b-4b2a-bb75-b3991e75f8ba
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/auditd/execve/lnx_auditd_binary_padding.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
