id: sigmahq-sigma-95361ce5-c891-4b0a-87ca-e24607884a96
name: Binary Padding - MacOS
description: Adversaries may use binary padding to add junk data and change the on-disk
  representation of malware. This rule detect using dd and truncate to add a junk
  data to file.
severity: high
enabled: false
tags:
  mitre:
  - T1027.001
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1027.001/T1027.001.md
- https://linux.die.net/man/1/truncate
- https://linux.die.net/man/1/dd
logsource:
  product: macos
  category: process_creation
detection:
  selection_truncate:
    Image|endswith: /truncate
    CommandLine|contains: -s +
  selection_dd:
    Image|endswith: /dd
    CommandLine|contains:
    - if=/dev/zero
    - if=/dev/random
    - if=/dev/urandom
  condition: 1 of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 95361ce5-c891-4b0a-87ca-e24607884a96
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/macos/process_creation/proc_creation_macos_binary_padding.yml
falsepositives:
- Legitimate script work
notes:
  quarantine_reason: 'upstream status: test'
