id: sigmahq-sigma-aac6c4f4-87c7-4961-96ac-c3fd3a42c310
name: Bitbucket Global Permission Changed
description: Detects global permissions change activity.
severity: medium
enabled: false
tags:
  mitre:
  - T1098
  categories:
  - endpoint
references:
- https://confluence.atlassian.com/bitbucketserver/audit-log-events-776640423.html
- https://confluence.atlassian.com/bitbucketserver/global-permissions-776640369.html
logsource:
  product: bitbucket
  service: audit
  definition: 'Requirements: "Advance" log level is required to receive these audit
    events.'
detection:
  selection:
    auditType.category: Permissions
    auditType.action:
    - Global permission remove request
    - Global permission removed
    - Global permission granted
    - Global permission requested
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: aac6c4f4-87c7-4961-96ac-c3fd3a42c310
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/application/bitbucket/audit/bitbucket_audit_global_permissions_change_detected.yml
falsepositives:
- Legitimate user activity.
notes:
  quarantine_reason: 'upstream status: test'
