id: sigmahq-sigma-87cc6698-3e07-4ba2-9b43-a85a73e151e2
name: Bitbucket User Permissions Export Attempt
description: Detects user permission data export attempt.
severity: medium
enabled: false
tags:
  mitre:
  - T1213
  - T1082
  - T1591.004
  categories:
  - endpoint
references:
- https://confluence.atlassian.com/bitbucketserver/audit-log-events-776640423.html
- https://confluence.atlassian.com/bitbucketserver/users-and-groups-776640439.html
logsource:
  product: bitbucket
  service: audit
  definition: 'Requirements: "Advance" log level is required to receive these audit
    events.'
detection:
  selection:
    auditType.category: Users and groups
    auditType.action:
    - User details export failed
    - User details export started
    - User details exported
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 87cc6698-3e07-4ba2-9b43-a85a73e151e2
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/application/bitbucket/audit/bitbucket_audit_user_permissions_export_attempt_detected.yml
falsepositives:
- Legitimate user activity.
notes:
  quarantine_reason: 'upstream status: test'
