id: sigmahq-sigma-e16cf0f0-ee88-4901-bd0b-4c8d13d9ee05
name: Bitbucket Global Secret Scanning Rule Deleted
description: Detects Bitbucket global secret scanning rule deletion activity.
severity: medium
enabled: false
tags:
  mitre:
  - T1685
  categories:
  - endpoint
references:
- https://confluence.atlassian.com/bitbucketserver/audit-log-events-776640423.html
- https://confluence.atlassian.com/bitbucketserver/secret-scanning-1157471613.html
logsource:
  product: bitbucket
  service: audit
  definition: 'Requirements: "Basic" log level is required to receive these audit
    events.'
detection:
  selection:
    auditType.category: Global administration
    auditType.action: Global secret scanning rule deleted
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: e16cf0f0-ee88-4901-bd0b-4c8d13d9ee05
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/application/bitbucket/audit/bitbucket_audit_global_secret_scanning_rule_deleted.yml
falsepositives:
- Legitimate user activity.
notes:
  quarantine_reason: 'upstream status: test'
