id: sigmahq-sigma-70ed1d26-0050-4b38-a599-92c53d57d45a
name: Bitbucket User Login Failure
description: 'Detects user authentication failure events.

  Please note that this rule can be noisy and it is recommended to use with correlation
  based on "author.name" field.'
severity: medium
enabled: false
tags:
  mitre:
  - T1078.004
  - T1110
  categories:
  - endpoint
references:
- https://confluence.atlassian.com/bitbucketserver/audit-log-events-776640423.html
logsource:
  product: bitbucket
  service: audit
  definition: 'Requirements: "Advance" log level is required to receive these audit
    events.'
detection:
  selection:
    auditType.category: Authentication
    auditType.action: User login failed
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 70ed1d26-0050-4b38-a599-92c53d57d45a
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/application/bitbucket/audit/bitbucket_audit_user_login_failure_detected.yml
falsepositives:
- Legitimate user wrong password attempts.
notes:
  quarantine_reason: 'upstream status: test'
