id: sigmahq-sigma-7215374a-de4f-4b33-8ba5-70804c9251d3
name: Bitbucket Unauthorized Access To A Resource
description: Detects unauthorized access attempts to a resource.
severity: critical
enabled: false
tags:
  mitre:
  - T1586
  categories:
  - endpoint
references:
- https://confluence.atlassian.com/bitbucketserver/audit-log-events-776640423.html
logsource:
  product: bitbucket
  service: audit
  definition: 'Requirements: "Advance" log level is required to receive these audit
    events.'
detection:
  selection:
    auditType.category: Security
    auditType.action: Unauthorized access to a resource
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 7215374a-de4f-4b33-8ba5-70804c9251d3
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/application/bitbucket/audit/bitbucket_audit_unauthorized_access_detected.yml
falsepositives:
- Access attempts to non-existent repositories or due to outdated plugins. Usually
  "Anonymous" user is reported in the "author.name" field in most cases.
notes:
  quarantine_reason: 'upstream status: test'
