id: sigmahq-sigma-6aa12161-235a-4dfb-9c74-fe08df8d8da1
name: Bitbucket Audit Log Configuration Updated
description: Detects changes to the bitbucket audit log configuration.
severity: medium
enabled: false
tags:
  mitre:
  - T1685
  categories:
  - endpoint
references:
- https://confluence.atlassian.com/bitbucketserver/view-and-configure-the-audit-log-776640417.html
logsource:
  product: bitbucket
  service: audit
  definition: 'Requirements: "Basic" log level is required to receive these audit
    events.'
detection:
  selection:
    auditType.category: Auditing
    auditType.action: Audit log configuration updated
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 6aa12161-235a-4dfb-9c74-fe08df8d8da1
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/application/bitbucket/audit/bitbucket_audit_log_configuration_update_detected.yml
falsepositives:
- Legitimate user activity.
notes:
  quarantine_reason: 'upstream status: test'
