id: sigmahq-sigma-ff91e3f0-ad15-459f-9a85-1556390c138d
name: Bitbucket Secret Scanning Rule Deleted
description: Detects when secret scanning rule is deleted for the project or repository.
severity: low
enabled: false
tags:
  mitre:
  - T1685
  categories:
  - endpoint
references:
- https://confluence.atlassian.com/bitbucketserver/audit-log-events-776640423.html
- https://confluence.atlassian.com/bitbucketserver/secret-scanning-1157471613.html
logsource:
  product: bitbucket
  service: audit
  definition: 'Requirements: "Basic" log level is required to receive these audit
    events.'
detection:
  selection:
    auditType.category:
    - Projects
    - Repositories
    auditType.action:
    - Project secret scanning rule deleted
    - Repository secret scanning rule deleted
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: ff91e3f0-ad15-459f-9a85-1556390c138d
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/application/bitbucket/audit/bitbucket_audit_secret_scanning_rule_deleted.yml
falsepositives:
- Legitimate user activity.
notes:
  quarantine_reason: 'upstream status: test'
