id: sigmahq-sigma-195e1b9d-bfc2-4ffa-ab4e-35aef69815f8
name: Bitbucket Full Data Export Triggered
description: Detects when full data export is attempted.
severity: high
enabled: false
tags:
  mitre:
  - T1213.003
  categories:
  - endpoint
references:
- https://confluence.atlassian.com/bitbucketserver/audit-log-events-776640423.html
- https://confluence.atlassian.com/adminjiraserver0811/importing-and-exporting-data-1019391889.html
logsource:
  product: bitbucket
  service: audit
  definition: 'Requirements: "Advance" log level is required to receive these audit
    events.'
detection:
  selection:
    auditType.category: Data pipeline
    auditType.action: Full data export triggered
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 195e1b9d-bfc2-4ffa-ab4e-35aef69815f8
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/application/bitbucket/audit/bitbucket_audit_full_data_export_triggered.yml
falsepositives:
- Legitimate user activity.
notes:
  quarantine_reason: 'upstream status: test'
