id: sigmahq-sigma-5259cbf2-0a75-48bf-b57a-c54d6fabaef3
name: Bitbucket User Details Export Attempt Detected
description: Detects user data export activity.
severity: medium
enabled: false
tags:
  mitre:
  - T1213
  - T1082
  - T1591.004
  categories:
  - endpoint
references:
- https://confluence.atlassian.com/bitbucketserver/audit-log-events-776640423.html
- https://support.atlassian.com/security-and-access-policies/docs/export-user-accounts
logsource:
  product: bitbucket
  service: audit
  definition: 'Requirements: "Advance" log level is required to receive these audit
    events.'
detection:
  selection:
    auditType.category: Users and groups
    auditType.action:
    - User permissions export failed
    - User permissions export started
    - User permissions exported
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 5259cbf2-0a75-48bf-b57a-c54d6fabaef3
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/application/bitbucket/audit/bitbucket_audit_user_details_export_attempt_detected.yml
falsepositives:
- Legitimate user activity.
notes:
  quarantine_reason: 'upstream status: test'
