id: sigmahq-sigma-34d81081-03c9-4a7f-91c9-5e46af625cde
name: Bitbucket Unauthorized Full Data Export Triggered
description: Detects when full data export is attempted an unauthorized user.
severity: critical
enabled: false
tags:
  mitre:
  - T1213.003
  - T1586
  categories:
  - endpoint
references:
- https://confluence.atlassian.com/bitbucketserver/audit-log-events-776640423.html
- https://confluence.atlassian.com/bitbucketserver/secret-scanning-1157471613.html
logsource:
  product: bitbucket
  service: audit
  definition: 'Requirements: "Advance" log level is required to receive these audit
    events.'
detection:
  selection:
    auditType.category: Data pipeline
    auditType.action: Unauthorized full data export triggered
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 34d81081-03c9-4a7f-91c9-5e46af625cde
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/application/bitbucket/audit/bitbucket_audit_unauthorized_full_data_export_triggered.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
