id: sigmahq-sigma-b91e8d5e-0033-44fe-973f-b730316f23a1
name: Bitbucket Secret Scanning Exempt Repository Added
description: Detects when a repository is exempted from secret scanning feature.
severity: high
enabled: false
tags:
  mitre:
  - T1685
  categories:
  - endpoint
references:
- https://confluence.atlassian.com/bitbucketserver/audit-log-events-776640423.html
- https://confluence.atlassian.com/bitbucketserver/secret-scanning-1157471613.html
logsource:
  product: bitbucket
  service: audit
  definition: 'Requirements: "Basic" log level is required to receive these audit
    events.'
detection:
  selection:
    auditType.category: Repositories
    auditType.action: Secret scanning exempt repository added
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: b91e8d5e-0033-44fe-973f-b730316f23a1
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/application/bitbucket/audit/bitbucket_audit_secret_scanning_exempt_repository_detected.yml
falsepositives:
- Legitimate user activity.
notes:
  quarantine_reason: 'upstream status: test'
