id: sigmahq-sigma-42ccce6d-7bd3-4930-95cd-e4d83fa94a30
name: Bitbucket Project Secret Scanning Allowlist Added
description: Detects when a secret scanning allowlist rule is added for projects.
severity: low
enabled: false
tags:
  mitre:
  - T1685
  categories:
  - endpoint
references:
- https://confluence.atlassian.com/bitbucketserver/audit-log-events-776640423.html
- https://confluence.atlassian.com/bitbucketserver/secret-scanning-1157471613.html
logsource:
  product: bitbucket
  service: audit
  definition: 'Requirements: "Basic" log level is required to receive these audit
    events.'
detection:
  selection:
    auditType.category: Projects
    auditType.action: Project secret scanning allowlist rule added
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 42ccce6d-7bd3-4930-95cd-e4d83fa94a30
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/application/bitbucket/audit/bitbucket_audit_project_secret_scanning_allowlist_added.yml
falsepositives:
- Legitimate user activity.
notes:
  quarantine_reason: 'upstream status: test'
