id: sigmahq-sigma-16ab6143-510a-44e2-a615-bdb80b8317fc
name: Bitbucket Global SSH Settings Changed
description: Detects Bitbucket global SSH access configuration changes.
severity: medium
enabled: false
tags:
  mitre:
  - T1685
  - T1021.004
  categories:
  - endpoint
references:
- https://confluence.atlassian.com/bitbucketserver/audit-log-events-776640423.html
- https://confluence.atlassian.com/bitbucketserver/enable-ssh-access-to-git-repositories-776640358.html
logsource:
  product: bitbucket
  service: audit
  definition: 'Requirements: "Advance" log level is required to receive these audit
    events.'
detection:
  selection:
    auditType.category: Global administration
    auditType.action: SSH settings changed
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 16ab6143-510a-44e2-a615-bdb80b8317fc
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/application/bitbucket/audit/bitbucket_audit_global_ssh_settings_change_detected.yml
falsepositives:
- Legitimate user activity.
notes:
  quarantine_reason: 'upstream status: test'
