id: sigmahq-sigma-f8a56cb7-a363-44ed-a82f-5926bb44cd05
name: BITS Transfer Job Download To Potential Suspicious Folder
description: Detects new BITS transfer job where the LocalName/Saved file is stored
  in a potentially suspicious location
severity: high
enabled: false
tags:
  mitre:
  - T1197
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1197/T1197.md
logsource:
  product: windows
  service: bits-client
detection:
  selection:
    EventID: 16403
    LocalName|contains:
    - \Desktop\
    - C:\Users\Public\
    - C:\PerfLogs\
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: f8a56cb7-a363-44ed-a82f-5926bb44cd05
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/bits_client/win_bits_client_new_trasnfer_susp_local_folder.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
