id: sigmahq-sigma-8ccd35a2-1c7c-468b-b568-ac6cdf80eec3
name: Bitsadmin to Uncommon IP Server Address
description: Detects Bitsadmin connections to IP addresses instead of FQDN names
severity: high
enabled: false
tags:
  mitre:
  - T1071.001
  - T1197
  categories:
  - network
references:
- https://isc.sans.edu/diary/Microsoft+BITS+Used+to+Download+Payloads/21027
logsource:
  category: proxy
detection:
  selection:
    c-useragent|startswith: Microsoft BITS/
    cs-host|endswith:
    - '1'
    - '2'
    - '3'
    - '4'
    - '5'
    - '6'
    - '7'
    - '8'
    - '9'
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 8ccd35a2-1c7c-468b-b568-ac6cdf80eec3
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/web/proxy_generic/proxy_ua_bitsadmin_susp_ip.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
