id: sigmahq-sigma-d635249d-86b5-4dad-a8c7-d7272b788586
name: BITS Transfer Job Download From File Sharing Domains
description: Detects BITS transfer job downloading files from a file sharing domain.
severity: high
enabled: false
tags:
  mitre:
  - T1197
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1197/T1197.md
- https://twitter.com/malmoeb/status/1535142803075960832
- https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/ransomware-hive-conti-avoslocker
- https://www.microsoft.com/en-us/security/blog/2024/01/17/new-ttps-observed-in-mint-sandstorm-campaign-targeting-high-profile-individuals-at-universities-and-research-orgs/
logsource:
  product: windows
  service: bits-client
detection:
  selection:
    EventID: 16403
    RemoteName|contains:
    - .githubusercontent.com
    - anonfiles.com
    - cdn.discordapp.com
    - ddns.net
    - dl.dropboxusercontent.com
    - ghostbin.co
    - github.com
    - glitch.me
    - gofile.io
    - hastebin.com
    - mediafire.com
    - mega.nz
    - onrender.com
    - pages.dev
    - paste.ee
    - pastebin.com
    - pastebin.pl
    - pastetext.net
    - pixeldrain.com
    - privatlab.com
    - privatlab.net
    - send.exploit.in
    - sendspace.com
    - storage.googleapis.com
    - storjshare.io
    - supabase.co
    - temp.sh
    - transfer.sh
    - trycloudflare.com
    - ufile.io
    - w3spaces.com
    - workers.dev
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: d635249d-86b5-4dad-a8c7-d7272b788586
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/bits_client/win_bits_client_new_transfer_via_file_sharing_domains.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
