id: sigmahq-sigma-9eb68894-7476-4cd6-8752-23b51f5883a7
name: Bitsadmin to Uncommon TLD
description: Detects Bitsadmin connections to domains with uncommon TLDs
severity: high
enabled: false
tags:
  mitre:
  - T1071.001
  - T1197
  categories:
  - network
references:
- https://twitter.com/jhencinski/status/1102695118455349248
- https://isc.sans.edu/forums/diary/Investigating+Microsoft+BITS+Activity/23281/
logsource:
  category: proxy
detection:
  selection:
    c-useragent|startswith: Microsoft BITS/
  falsepositives:
    cs-host|endswith:
    - .com
    - .net
    - .org
    - .scdn.co
    - .sfx.ms
  condition: selection and not falsepositives
provenance:
  source: SigmaHQ/sigma
  source_id: 9eb68894-7476-4cd6-8752-23b51f5883a7
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/web/proxy_generic/proxy_ua_bitsadmin_susp_tld.yml
falsepositives:
- Rare programs that use Bitsadmin and update from regional TLDs e.g. .uk or .ca
notes:
  quarantine_reason: 'upstream status: test'
