id: sigmahq-sigma-90f138c1-f578-4ac3-8c49-eecfd847c8b7
name: BITS Transfer Job Download From Direct IP
description: Detects a BITS transfer job downloading file(s) from a direct IP address.
severity: high
enabled: false
tags:
  mitre:
  - T1197
  categories:
  - endpoint
references:
- https://blog.netspi.com/15-ways-to-download-a-file/#bitsadmin
- https://isc.sans.edu/diary/22264
- https://lolbas-project.github.io/lolbas/Binaries/Bitsadmin/
- https://blog.talosintelligence.com/breaking-the-silence-recent-truebot-activity/
logsource:
  product: windows
  service: bits-client
detection:
  selection:
    EventID: 16403
    RemoteName|contains:
    - http://1
    - http://2
    - http://3
    - http://4
    - http://5
    - http://6
    - http://7
    - http://8
    - http://9
    - https://1
    - https://2
    - https://3
    - https://4
    - https://5
    - https://6
    - https://7
    - https://8
    - https://9
  filter_optional_local_networks:
    RemoteName|contains:
    - ://10.
    - ://192.168.
    - ://172.16.
    - ://172.17.
    - ://172.18.
    - ://172.19.
    - ://172.20.
    - ://172.21.
    - ://172.22.
    - ://172.23.
    - ://172.24.
    - ://172.25.
    - ://172.26.
    - ://172.27.
    - ://172.28.
    - ://172.29.
    - ://172.30.
    - ://172.31.
    - ://127.
    - ://169.254.
  filter_optional_seven_zip:
    RemoteName|contains:
    - https://7-
    - http://7-
  condition: selection and not 1 of filter_optional_*
provenance:
  source: SigmaHQ/sigma
  source_id: 90f138c1-f578-4ac3-8c49-eecfd847c8b7
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/bits_client/win_bits_client_new_transfer_via_ip_address.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
