id: sigmahq-sigma-70b4156e-50fc-4523-aa50-c9dddf1993fc
name: Bpfdoor TCP Ports Redirect
description: 'All TCP traffic on particular port from attacker is routed to different
  port. ex. ''/sbin/iptables -t nat -D PREROUTING -p tcp -s 192.168.1.1 --dport 22
  -j REDIRECT --to-ports 42392''

  The traffic looks like encrypted SSH communications going to TCP port 22, but in
  reality is being directed to the shell port once it hits the iptables rule for the
  attacker host only.'
severity: medium
enabled: false
tags:
  mitre:
  - T1686
  categories:
  - endpoint
references:
- https://www.sandflysecurity.com/blog/bpfdoor-an-evasive-linux-backdoor-technical-analysis/
- https://www.elastic.co/security-labs/a-peek-behind-the-bpfdoor
logsource:
  product: linux
  service: auditd
detection:
  cmd:
    type: EXECVE
    a0|endswith: iptables
    a1: -t
    a2: nat
  keywords:
  - --to-ports 42
  - --to-ports 43
  condition: cmd and keywords
provenance:
  source: SigmaHQ/sigma
  source_id: 70b4156e-50fc-4523-aa50-c9dddf1993fc
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/auditd/execve/lnx_auditd_bpfdoor_port_redirect.yml
falsepositives:
- Legitimate ports redirect
notes:
  quarantine_reason: 'upstream status: test'
