id: sigmahq-sigma-808146b2-9332-4d78-9416-d7e47012d83d
name: BPFDoor Abnormal Process ID or Lock File Accessed
description: detects BPFDoor .lock and .pid files access in temporary file storage
  facility
severity: high
enabled: false
tags:
  mitre:
  - T1106
  - T1059
  categories:
  - endpoint
references:
- https://www.sandflysecurity.com/blog/bpfdoor-an-evasive-linux-backdoor-technical-analysis/
- https://www.elastic.co/security-labs/a-peek-behind-the-bpfdoor
- https://www.rapid7.com/blog/post/tr-bpfdoor-telecom-networks-sleeper-cells-threat-research-report/
- https://github.com/rapid7/Rapid7-Labs/blob/741c7196ec12a0a56b63463d1fd726ff14d3a97a/BPFDoor/rapid7_detect_bpfdoor.sh
logsource:
  product: linux
  service: auditd
detection:
  selection:
    type: PATH
    name:
    - /var/run/aepmonend.pid
    - /var/run/auditd.lock
    - /var/run/cma.lock
    - /var/run/console-kit.pid
    - /var/run/consolekit.pid
    - /var/run/daemon.pid
    - /var/run/hald-addon.pid
    - /var/run/hald-smartd.pid
    - /var/run/haldrund.pid
    - /var/run/hp-health.pid
    - /var/run/hpasmlit.lock
    - /var/run/hpasmlited.pid
    - /var/run/kdevrund.pid
    - /var/run/lldpad.lock
    - /var/run/mcelog.pid
    - /var/run/system.pid
    - /var/run/uvp-srv.pid
    - /var/run/vmtoolagt.pid
    - /var/run/xinetd.lock
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 808146b2-9332-4d78-9416-d7e47012d83d
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/auditd/path/lnx_auditd_bpfdoor_file_accessed.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
