id: sigmahq-sigma-18b042f0-2ecd-4b6e-9f8d-aa7a7e7de781
name: Buffer Overflow Attempts
description: Detects buffer overflow attempts in Unix system log files
severity: high
enabled: false
tags:
  mitre:
  - T1068
  categories:
  - endpoint
references:
- https://github.com/ossec/ossec-hids/blob/1ecffb1b884607cb12e619f9ab3c04f530801083/etc/rules/attack_rules.xml
- https://docs.oracle.com/cd/E19683-01/816-4883/6mb2joatd/index.html
- https://www.giac.org/paper/gcih/266/review-ftp-protocol-cyber-defense-initiative/102802
- https://blu.org/mhonarc/discuss/2001/04/msg00285.php
- https://rapid7.com/blog/post/2019/02/19/stack-based-buffer-overflow-attacks-what-you-need-to-know/
logsource:
  product: linux
detection:
  keywords:
  - attempt to execute code on stack by
  - 0bin0sh1
  - AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA
  - stack smashing detected
  condition: keywords
provenance:
  source: SigmaHQ/sigma
  source_id: 18b042f0-2ecd-4b6e-9f8d-aa7a7e7de781
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/builtin/lnx_buffer_overflows.yml
falsepositives:
- Base64 encoded data in log entries
notes:
  quarantine_reason: 'upstream status: test'
