id: sigmahq-sigma-d797268e-28a9-49a7-b9a8-2f5039011c5c
name: Bypass UAC via WSReset.exe
description: Detects use of WSReset.exe to bypass User Account Control (UAC). Adversaries
  use this technique to execute privileged processes.
severity: high
enabled: false
tags:
  mitre:
  - T1548.002
  categories:
  - endpoint
references:
- https://eqllib.readthedocs.io/en/latest/analytics/532b5ed4-7930-11e9-8f5c-d46d6d62a49e.html
- https://lolbas-project.github.io/lolbas/Binaries/Wsreset/
- https://www.activecyber.us/activelabs/windows-uac-bypass
- https://twitter.com/ReaQta/status/1222548288731217921
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage|endswith: \wsreset.exe
  filter:
  - Image|endswith: \conhost.exe
  - OriginalFileName: CONHOST.EXE
  condition: selection and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: d797268e-28a9-49a7-b9a8-2f5039011c5c
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_uac_bypass_wsreset.yml
falsepositives:
- Unknown sub processes of Wsreset.exe
notes:
  quarantine_reason: 'upstream status: test'
