id: sigmahq-sigma-674202d0-b22a-4af4-ae5f-2eda1f3da1af
name: Bypass UAC Using Event Viewer
description: Bypasses User Account Control using Event Viewer and a relevant Windows
  Registry modification
severity: high
enabled: false
tags:
  mitre:
  - T1547.010
  categories:
  - endpoint
references:
- https://enigma0x3.net/2016/08/15/fileless-uac-bypass-using-eventvwr-exe-and-registry-hijacking/
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1548.002/T1548.002.md#atomic-test-1---bypass-uac-using-event-viewer-cmd
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|endswith: _Classes\mscfile\shell\open\command\(Default)
  filter:
    Details|startswith: '%SystemRoot%\system32\mmc.exe "%1" %'
  condition: selection and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: 674202d0-b22a-4af4-ae5f-2eda1f3da1af
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_bypass_uac_using_eventviewer.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
