id: sigmahq-sigma-e66779cc-383e-4224-a3a4-267eeb585c40
name: Bypass UAC via CMSTP
description: Detect commandline usage of Microsoft Connection Manager Profile Installer
  (cmstp.exe) to install specially formatted local .INF files
severity: high
enabled: false
tags:
  mitre:
  - T1548.002
  - T1218.003
  categories:
  - endpoint
references:
- https://eqllib.readthedocs.io/en/latest/analytics/e584f1a1-c303-4885-8a66-21360c90995b.html
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218.003/T1218.003.md
- https://lolbas-project.github.io/lolbas/Binaries/Cmstp/
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \cmstp.exe
  - OriginalFileName: CMSTP.EXE
  selection_cli:
    CommandLine|contains:
    - /s
    - -s
    - /au
    - -au
    - /ni
    - -ni
  condition: all of selection*
provenance:
  source: SigmaHQ/sigma
  source_id: e66779cc-383e-4224-a3a4-267eeb585c40
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_uac_bypass_cmstp.yml
falsepositives:
- Legitimate use of cmstp.exe utility by legitimate user
notes:
  quarantine_reason: 'upstream status: test'
