id: sigmahq-sigma-7f741dcf-fc22-4759-87b4-9ae8376676a2
name: Bypass UAC via Fodhelper.exe
description: Identifies use of Fodhelper.exe to bypass User Account Control. Adversaries
  use this technique to execute privileged processes.
severity: high
enabled: false
tags:
  mitre:
  - T1548.002
  categories:
  - endpoint
references:
- https://eqllib.readthedocs.io/en/latest/analytics/e491ce22-792f-11e9-8f5c-d46d6d62a49e.html
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1548.002/T1548.002.md
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage|endswith: \fodhelper.exe
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 7f741dcf-fc22-4759-87b4-9ae8376676a2
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_uac_bypass_fodhelper.yml
falsepositives:
- Legitimate use of fodhelper.exe utility by legitimate user
notes:
  quarantine_reason: 'upstream status: test'
