id: sigmahq-sigma-93671f99-04eb-4ab4-a161-70d446a84003
name: Capture Credentials with Rpcping.exe
description: Detects using Rpcping.exe to send a RPC test connection to the target
  server (-s) and force the NTLM hash to be sent in the process.
severity: medium
enabled: false
tags:
  mitre:
  - T1003
  categories:
  - endpoint
references:
- https://lolbas-project.github.io/lolbas/Binaries/Rpcping/
- https://twitter.com/vysecurity/status/974806438316072960
- https://twitter.com/vysecurity/status/873181705024266241
- https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/hh875578(v=ws.11)
logsource:
  category: process_creation
  product: windows
detection:
  selection_main_img:
  - Image|endswith: \RpcPing.exe
  - OriginalFileName: \RpcPing.exe
  selection_main_flag:
    CommandLine|contains|windash: -s
  selection_cli_ntlm:
    CommandLine|contains|windash: -u
    CommandLine|contains: NTLM
  selection_cli_ncacn:
    CommandLine|contains|windash: -t
    CommandLine|contains: ncacn_np
  condition: all of selection_main_* and 1 of selection_cli_*
provenance:
  source: SigmaHQ/sigma
  source_id: 93671f99-04eb-4ab4-a161-70d446a84003
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_rpcping_credential_capture.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
