id: sigmahq-sigma-c2496b41-16a9-4016-a776-b23f8910dc58
name: Certificate-Based Authentication Enabled
description: Detects when certificate based authentication has been enabled in an
  Azure Active Directory tenant.
severity: medium
enabled: false
tags:
  mitre:
  - T1556
  categories:
  - cloud
references:
- https://posts.specterops.io/passwordless-persistence-and-privilege-escalation-in-azure-98a01310be3f
- https://goodworkaround.com/2022/02/15/digging-into-azure-ad-certificate-based-authentication/
logsource:
  product: azure
  service: auditlogs
detection:
  selection:
    OperationName: Authentication Methods Policy Update
    TargetResources.modifiedProperties|contains: AuthenticationMethodsPolicy
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: c2496b41-16a9-4016-a776-b23f8910dc58
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/azure/audit_logs/azure_ad_certificate_based_authencation_enabled.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
