id: sigmahq-sigma-9e716b33-63b2-46da-86a4-bd3c3b9b5dfb
name: Certificate Exported Via PowerShell
description: Detects calls to cmdlets that are used to export certificates from the
  local certificate store. Threat actors were seen abusing this to steal private keys
  from compromised machines.
severity: medium
enabled: false
tags:
  mitre:
  - T1552.004
  - T1059.001
  categories:
  - endpoint
references:
- https://us-cert.cisa.gov/ncas/analysis-reports/ar21-112a
- https://learn.microsoft.com/en-us/powershell/module/pki/export-pfxcertificate?view=windowsserver2022-ps
- https://www.splunk.com/en_us/blog/security/breaking-the-chain-defending-against-certificate-services-abuse.html
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    CommandLine|contains:
    - 'Export-PfxCertificate '
    - 'Export-Certificate '
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 9e716b33-63b2-46da-86a4-bd3c3b9b5dfb
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_powershell_export_certificate.yml
falsepositives:
- Legitimate certificate exports by administrators. Additional filters might be required.
notes:
  quarantine_reason: 'upstream status: test'
