id: sigmahq-sigma-e3fdf743-f05b-4051-990a-b66919be1743
name: Change User Account Associated with the FAX Service
description: Detect change of the user account associated with the FAX service to
  avoid the escalation problem.
severity: high
enabled: false
tags:
  mitre:
  - T1112
  categories:
  - endpoint
references:
- https://twitter.com/dottor_morte/status/1544652325570191361
- https://raw.githubusercontent.com/RiccardoAncarani/talks/master/F-Secure/unorthodox-lateral-movement.pdf
logsource:
  product: windows
  category: registry_set
detection:
  selection:
    TargetObject: HKLM\System\CurrentControlSet\Services\Fax\ObjectName
  filter:
    Details|contains: NetworkService
  condition: selection and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: e3fdf743-f05b-4051-990a-b66919be1743
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_fax_change_service_user.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
