id: sigmahq-sigma-87e3c4e8-a6a8-4ad9-bb4f-46e7ff99a180
name: Change PowerShell Policies to an Insecure Level
description: Detects changing the PowerShell script execution policy to a potentially
  insecure level using the "-ExecutionPolicy" flag.
severity: medium
enabled: false
tags:
  mitre:
  - T1059.001
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/powershell/module/microsoft.powershell.security/set-executionpolicy?view=powershell-7.4
- https://learn.microsoft.com/en-us/powershell/module/microsoft.powershell.core/about/about_execution_policies?view=powershell-7.4
- https://adsecurity.org/?p=2604
- https://thedfirreport.com/2021/11/01/from-zero-to-domain-admin/
logsource:
  product: windows
  category: process_creation
detection:
  selection_img:
  - OriginalFileName:
    - powershell_ise.exe
    - PowerShell.EXE
    - pwsh.dll
  - Image|endswith:
    - \powershell_ise.exe
    - \powershell.exe
    - \pwsh.exe
  selection_option:
    CommandLine|contains:
    - '-executionpolicy '
    - ' -ep '
    - ' -exec '
  selection_level:
    CommandLine|contains:
    - Bypass
    - Unrestricted
  filter_main_powershell_core:
    ParentImage:
    - C:\Windows\SysWOW64\msiexec.exe
    - C:\Windows\System32\msiexec.exe
    CommandLine|contains:
    - -NoProfile -ExecutionPolicy Bypass -File "C:\Program Files\PowerShell\7\
    - -NoProfile -ExecutionPolicy Bypass -File "C:\Program Files (x86)\PowerShell\7\
  filter_optional_avast:
    ParentImage|contains:
    - C:\Program Files\Avast Software\Avast\
    - C:\Program Files (x86)\Avast Software\Avast\
    - \instup.exe
    CommandLine|contains:
    - -ExecutionPolicy ByPass -File "C:\Program Files\Avast Software\Avast
    - -ExecutionPolicy ByPass -File "C:\Program Files (x86)\Avast Software\Avast\
  condition: all of selection_* and not 1 of filter_main_* and not 1 of filter_optional_*
provenance:
  source: SigmaHQ/sigma
  source_id: 87e3c4e8-a6a8-4ad9-bb4f-46e7ff99a180
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_powershell_set_policies_to_unsecure_level.yml
falsepositives:
- Administrator scripts
notes:
  quarantine_reason: 'upstream status: test'
