id: sigmahq-sigma-61d0475c-173f-4844-86f7-f3eebae1c66b
name: Change PowerShell Policies to an Insecure Level - PowerShell
description: Detects changing the PowerShell script execution policy to a potentially
  insecure level using the "Set-ExecutionPolicy" cmdlet.
severity: medium
enabled: false
tags:
  mitre:
  - T1059.001
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/powershell/module/microsoft.powershell.security/set-executionpolicy?view=powershell-7.4
- https://learn.microsoft.com/en-us/powershell/module/microsoft.powershell.core/about/about_execution_policies?view=powershell-7.4
- https://adsecurity.org/?p=2604
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection_cmdlet:
    ScriptBlockText|contains: Set-ExecutionPolicy
  selection_option:
    ScriptBlockText|contains:
    - Unrestricted
    - bypass
  filter_optional_chocolatey:
    ScriptBlockText|contains:
    - (New-Object System.Net.WebClient).DownloadString('https://community.chocolatey.org/install.ps1')
    - (New-Object System.Net.WebClient).DownloadString('https://chocolatey.org/install.ps1')
  condition: all of selection_* and not 1 of filter_optional_*
provenance:
  source: SigmaHQ/sigma
  source_id: 61d0475c-173f-4844-86f7-f3eebae1c66b
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_set_policies_to_unsecure_level.yml
falsepositives:
- Administrator script
notes:
  quarantine_reason: 'upstream status: test'
