id: sigmahq-sigma-d4488827-73af-4f8d-9244-7b7662ef046e
name: Change User Agents with WebRequest
description: 'Adversaries may communicate using application layer protocols associated
  with web traffic to avoid detection/network filtering by blending in with existing
  traffic.

  Commands to the remote system, and often the results of those commands, will be
  embedded within the protocol traffic between the client and server.'
severity: medium
enabled: false
tags:
  mitre:
  - T1071.001
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1071.001/T1071.001.md#t1071001---web-protocols
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection_webrequest:
    ScriptBlockText|contains:
    - Invoke-WebRequest
    - Invoke-RestMethod
    - ' irm '
    - 'iwr '
  selection_useragent:
    ScriptBlockText|contains: '-UserAgent '
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: d4488827-73af-4f8d-9244-7b7662ef046e
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_susp_invoke_webrequest_useragent.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
