id: sigmahq-sigma-7d9263bd-dc47-4a58-bc92-5474abab390c
name: Change Winevt Channel Access Permission Via Registry
description: Detects tampering with the "ChannelAccess" registry key in order to change
  access to Windows event channel.
severity: high
enabled: false
tags:
  mitre:
  - T1685.001
  categories:
  - endpoint
references:
- https://app.any.run/tasks/77b2e328-8f36-46b2-b2e2-8a80398217ab/
- https://learn.microsoft.com/en-us/windows/win32/api/winevt/
- https://itconnect.uw.edu/tools-services-support/it-systems-infrastructure/msinf/other-help/understanding-sddl-syntax/
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains: \Microsoft\Windows\CurrentVersion\WINEVT\Channels\
    TargetObject|endswith: \ChannelAccess
    Details|contains:
    - (A;;0x1;;;LA)
    - (A;;0x1;;;SY)
    - (A;;0x5;;;BA)
  filter_main_trustedinstaller:
    Image: C:\Windows\servicing\TrustedInstaller.exe
  filter_main_tiworker:
    Image|startswith: C:\Windows\WinSxS\
    Image|endswith: \TiWorker.exe
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 7d9263bd-dc47-4a58-bc92-5474abab390c
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_change_winevt_channelaccess.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
