id: sigmahq-sigma-9e3357ba-09d4-4fbd-a7c5-ad6386314513
name: Change the Fax Dll
description: Detect possible persistence using Fax DLL load when service restart
severity: high
enabled: false
tags:
  mitre:
  - T1112
  categories:
  - endpoint
references:
- https://twitter.com/dottor_morte/status/1544652325570191361
- https://raw.githubusercontent.com/RiccardoAncarani/talks/master/F-Secure/unorthodox-lateral-movement.pdf
logsource:
  product: windows
  category: registry_set
detection:
  selection:
    TargetObject|contains|all:
    - \Software\Microsoft\Fax\Device Providers\
    - \ImageName
  filter:
    Details: '%systemroot%\system32\fxst30.dll'
  condition: selection and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: 9e3357ba-09d4-4fbd-a7c5-ad6386314513
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_fax_dll_persistance.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
