id: sigmahq-sigma-9494bff8-959f-4440-bbce-fb87a208d517
name: Changes to Device Registration Policy
description: Monitor and alert for changes to the device registration policy.
severity: high
enabled: false
tags:
  mitre:
  - T1484
  categories:
  - cloud
references:
- https://learn.microsoft.com/en-us/entra/architecture/security-operations-devices#device-registrations-and-joins-outside-policy
logsource:
  product: azure
  service: auditlogs
detection:
  selection:
    Category: Policy
    ActivityDisplayName: Set device registration policies
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 9494bff8-959f-4440-bbce-fb87a208d517
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/azure/audit_logs/azure_ad_device_registration_policy_changes.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
