id: sigmahq-sigma-6419afd1-3742-47a5-a7e6-b50386cd15f8
name: Chmod Targeting Sensitive Directories
description: 'Detects chmod targeting files in sensitive directory paths on Linux
  systems.

  Attackers may use chmod to change permissions of files in these directories to maintain
  persistence, escalate privileges, or disrupt system operations.'
severity: medium
enabled: false
tags:
  mitre:
  - T1222.002
  categories:
  - endpoint
references:
- https://www.intezer.com/blog/malware-analysis/new-backdoor-sysjoker/
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1222.002/T1222.002.md
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    Image|endswith: /chmod
    CommandLine|contains:
    - /tmp/
    - /.Library/
    - /etc/
    - /opt/
  filter_main_update_shells:
    CommandLine|contains: chmod --reference=/etc/shells
    ParentCommandLine|endswith: /update-shells
  filter_main_postinst:
    CommandLine|contains: /etc/
    ParentCommandLine|contains|all:
    - /var/lib/dpkg/info/
    - .postinst configure
  filter_main_apt_key:
    CommandLine|startswith: chmod 700 /tmp/apt-key-gpghome.
  filter_main_mkinitramfs:
    CommandLine|startswith: chmod 755 /var/tmp/mkinitramfs
  filter_main_landscape:
    CommandLine: chmod 0775 /etc/landscape/
  filter_main_ubuntu_apparmor:
    CommandLine: chmod 644 /etc/apparmor.d/tunables/home.d/ubuntu
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 6419afd1-3742-47a5-a7e6-b50386cd15f8
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/process_creation/proc_creation_lnx_chmod_targeting_sensitive_directories.yml
falsepositives:
- Some false positives are to be expected. Apply additional filters as needed before
  pushing to production.
notes:
  quarantine_reason: 'upstream status: test'
