id: sigmahq-sigma-fa3c117a-bc0d-416e-a31b-0c0e80653efb
name: Chopper Webshell Process Pattern
description: Detects patterns found in process executions cause by China Chopper like
  tiny (ASPX) webshells
severity: high
enabled: false
tags:
  mitre:
  - T1505.003
  - T1018
  - T1033
  - T1087
  categories:
  - endpoint
references:
- https://www.microsoft.com/security/blog/2022/09/30/analyzing-attacks-using-the-exchange-vulnerabilities-cve-2022-41040-and-cve-2022-41082/
logsource:
  category: process_creation
  product: windows
detection:
  selection_origin:
  - Image|endswith: \w3wp.exe
  - ParentImage|endswith: \w3wp.exe
  selection_cmdline:
    CommandLine|contains:
    - '&ipconfig&echo'
    - '&quser&echo'
    - '&whoami&echo'
    - '&c:&echo'
    - '&cd&echo'
    - '&dir&echo'
    - '&echo [E]'
    - '&echo [S]'
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: fa3c117a-bc0d-416e-a31b-0c0e80653efb
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_webshell_chopper.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
