id: sigmahq-sigma-88d6e60c-759d-4ac1-a447-c0f1466c2d21
name: Chromium Browser Instance Executed With Custom Extension
description: Detects a Chromium based browser process with the 'load-extension' flag
  to start a instance with a custom extension
severity: medium
enabled: false
tags:
  mitre:
  - T1176.001
  categories:
  - endpoint
references:
- https://redcanary.com/blog/chromeloader/
- https://emkc.org/s/RJjuLa
- https://www.mandiant.com/resources/blog/lnk-between-browsers
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith:
    - \brave.exe
    - \chrome.exe
    - \msedge.exe
    - \opera.exe
    - \vivaldi.exe
    CommandLine|contains: --load-extension=
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 88d6e60c-759d-4ac1-a447-c0f1466c2d21
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_browsers_chromium_load_extension.yml
falsepositives:
- Usage of Chrome Extensions in testing tools such as BurpSuite will trigger this
  alert
notes:
  quarantine_reason: 'upstream status: test'
