id: sigmahq-sigma-1c526788-0abe-4713-862f-b520da5e5316
name: Chromium Browser Headless Execution To Mockbin Like Site
description: Detects the execution of a Chromium based browser process with the "headless"
  flag and a URL pointing to the mockbin.org service (which can be used to exfiltrate
  data).
severity: high
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://www.zscaler.com/blogs/security-research/steal-it-campaign
logsource:
  product: windows
  category: process_creation
detection:
  selection_img:
    Image|endswith:
    - \brave.exe
    - \chrome.exe
    - \msedge.exe
    - \opera.exe
    - \vivaldi.exe
  selection_headless:
    CommandLine|contains: --headless
  selection_url:
    CommandLine|contains:
    - ://run.mocky
    - ://mockbin
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 1c526788-0abe-4713-862f-b520da5e5316
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_browsers_chromium_mockbin_abuse.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
