id: sigmahq-sigma-6f7e1c10-2dc9-4312-adb6-9574ff09a5c8
name: Cisco Duo Successful MFA Authentication Via Bypass Code
description: 'Detects when a successful MFA authentication occurs due to the use of
  a bypass code.

  A bypass code is a temporary passcode created by an administrator for a specific
  user to access a Duo-protected application. These are generally used as "backup
  codes," so that enrolled users who are having problems with their mobile devices
  (e.g., mobile service is disrupted, the device is lost or stolen, etc.) or who temporarily
  can''t use their enrolled devices (on a plane without mobile data services) can
  still access their Duo-protected systems.'
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://duo.com/docs/adminapi#logs
- https://help.duo.com/s/article/6327?language=en_US
logsource:
  product: cisco
  service: duo
detection:
  selection:
    event_type: authentication
    reason: bypass_user
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 6f7e1c10-2dc9-4312-adb6-9574ff09a5c8
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/identity/cisco_duo/cisco_duo_mfa_bypass_via_bypass_code.yml
falsepositives:
- Legitimate user that was assigned on purpose to a bypass group
notes:
  quarantine_reason: 'upstream status: test'
