id: sigmahq-sigma-9705a6a1-6db6-4a16-a987-15b7151e299b
name: Cisco Discovery
description: Find information about network devices that is not stored in config files
severity: low
enabled: false
tags:
  mitre:
  - T1083
  - T1201
  - T1057
  - T1018
  - T1082
  - T1016
  - T1049
  - T1033
  - T1124
  categories:
  - endpoint
references:
- https://www.cisco.com/c/en/us/td/docs/server_nw_virtual/2-5_release/command_reference/show.html
logsource:
  product: cisco
  service: aaa
detection:
  keywords:
  - dir
  - show arp
  - show cdp
  - show clock
  - show ip interface
  - show ip route
  - show ip sockets
  - show processes
  - show ssh
  - show users
  - show version
  condition: keywords
provenance:
  source: SigmaHQ/sigma
  source_id: 9705a6a1-6db6-4a16-a987-15b7151e299b
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/network/cisco/aaa/cisco_cli_discovery.yml
falsepositives:
- Commonly used by administrators for troubleshooting
notes:
  quarantine_reason: 'upstream status: test'
