id: sigmahq-sigma-50e606bf-04ce-4ca7-9d54-3449494bbd4b
name: Cisco LDP Authentication Failures
description: Detects LDP failures which may be indicative of brute force attacks to
  manipulate MPLS labels
severity: low
enabled: false
tags:
  mitre:
  - T1078
  - T1110
  - T1557
  categories:
  - endpoint
references:
- https://www.blackhat.com/presentations/bh-usa-03/bh-us-03-convery-franz-v3.pdf
logsource:
  product: cisco
  service: ldp
  definition: 'Requirements: cisco ldp logs need to be enabled and ingested'
detection:
  selection_protocol:
  - LDP
  selection_keywords:
  - SOCKET_TCP_PACKET_MD5_AUTHEN_FAIL
  - TCPMD5AuthenFail
  condition: selection_protocol and selection_keywords
provenance:
  source: SigmaHQ/sigma
  source_id: 50e606bf-04ce-4ca7-9d54-3449494bbd4b
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/network/cisco/ldp/cisco_ldp_md5_auth_failed.yml
falsepositives:
- Unlikely. Except due to misconfigurations
notes:
  quarantine_reason: 'upstream status: test'
