id: sigmahq-sigma-6d844f0f-1c18-41af-8f19-33e7654edfc3
name: Cisco Local Accounts
description: Find local accounts being created or modified as well as remote authentication
  configurations
severity: high
enabled: false
tags:
  mitre:
  - T1136.001
  - T1098
  categories:
  - endpoint
references: []
logsource:
  product: cisco
  service: aaa
detection:
  keywords:
  - username
  - aaa
  condition: keywords
provenance:
  source: SigmaHQ/sigma
  source_id: 6d844f0f-1c18-41af-8f19-33e7654edfc3
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/network/cisco/aaa/cisco_cli_local_accounts.yml
falsepositives:
- When remote authentication is in place, this should not change often
notes:
  quarantine_reason: 'upstream status: test'
