id: sigmahq-sigma-cd072b25-a418-4f98-8ebc-5093fb38fe1a
name: Cisco Collect Data
description: Collect pertinent data from the configuration files
severity: low
enabled: false
tags:
  mitre:
  - T1087.001
  - T1552.001
  - T1005
  categories:
  - endpoint
references:
- https://blog.router-switch.com/2013/11/show-running-config/
- https://www.cisco.com/E-Learning/bulk/public/tac/cim/cib/using_cisco_ios_software/cmdrefs/show_startup-config.htm
- https://www.cisco.com/c/en/us/td/docs/ios-xml/ios/config-mgmt/configuration/15-sy/config-mgmt-15-sy-book/cm-config-diff.html
logsource:
  product: cisco
  service: aaa
detection:
  keywords:
  - show running-config
  - show startup-config
  - show archive config
  - more
  condition: keywords
provenance:
  source: SigmaHQ/sigma
  source_id: cd072b25-a418-4f98-8ebc-5093fb38fe1a
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/network/cisco/aaa/cisco_cli_collect_data.yml
falsepositives:
- Commonly run by administrators
notes:
  quarantine_reason: 'upstream status: test'
