id: sigmahq-sigma-26b692dc-1722-49b2-b496-a8258aa6371d
name: Clear PowerShell History - PowerShell
description: Detects keywords that could indicate clearing PowerShell history
severity: medium
enabled: false
tags:
  mitre:
  - T1070.003
  categories:
  - endpoint
references:
- https://gist.github.com/hook-s3c/7363a856c3cdbadeb71085147f042c1a
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection1a:
    ScriptBlockText|contains:
    - del
    - Remove-Item
    - rm
  selection1b:
    ScriptBlockText|contains: (Get-PSReadlineOption).HistorySavePath
  selection_2:
    ScriptBlockText|contains|all:
    - Set-PSReadlineOption
    - –HistorySaveStyle
    - SaveNothing
  selection_3:
    ScriptBlockText|contains|all:
    - Set-PSReadlineOption
    - -HistorySaveStyle
    - SaveNothing
  condition: 1 of selection_* or all of selection1*
provenance:
  source: SigmaHQ/sigma
  source_id: 26b692dc-1722-49b2-b496-a8258aa6371d
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_clear_powershell_history.yml
falsepositives:
- Legitimate PowerShell scripts
notes:
  quarantine_reason: 'upstream status: test'
