id: sigmahq-sigma-fb4e2211-6d08-426b-8e6f-0d4a161e3b1d
name: Clfs.SYS Loaded By Process Located In a Potential Suspicious Location
description: Detects Clfs.sys being loaded by a process running from a potentially
  suspicious location. Clfs.sys is loaded as part of many CVEs exploits that targets
  Common Log File.
severity: medium
enabled: false
tags:
  mitre:
  - T1059
  categories:
  - endpoint
references:
- https://ssd-disclosure.com/ssd-advisory-common-log-file-system-clfs-driver-pe/
- https://x.com/Threatlabz/status/1879956781360976155
logsource:
  category: image_load
  product: windows
detection:
  selection_dll:
    ImageLoaded|endswith: \clfs.sys
  selection_folders_1:
    Image|contains:
    - :\Perflogs\
    - :\Users\Public\
    - \Temporary Internet
    - \Windows\Temp\
  selection_folders_2:
  - Image|contains|all:
    - :\Users\
    - \Favorites\
  - Image|contains|all:
    - :\Users\
    - \Favourites\
  - Image|contains|all:
    - :\Users\
    - \Contacts\
  - Image|contains|all:
    - :\Users\
    - \Pictures\
  condition: selection_dll and 1 of selection_folders_*
provenance:
  source: SigmaHQ/sigma
  source_id: fb4e2211-6d08-426b-8e6f-0d4a161e3b1d
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/image_load/image_load_clfs_load.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: experimental'
