id: sigmahq-sigma-ec127035-a636-4b9a-8555-0efd4e59f316
name: Clipboard Collection with Xclip Tool
description: 'Detects attempts to collect data stored in the clipboard from users
  with the usage of xclip tool. Xclip has to be installed.

  Highly recommended using rule on servers, due to high usage of clipboard utilities
  on user workstations.'
severity: low
enabled: false
tags:
  mitre:
  - T1115
  categories:
  - endpoint
references:
- https://www.packetlabs.net/posts/clipboard-data-security/
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    Image|contains: xclip
    CommandLine|contains|all:
    - -sel
    - clip
    - -o
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: ec127035-a636-4b9a-8555-0efd4e59f316
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/process_creation/proc_creation_lnx_clipboard_collection.yml
falsepositives:
- Legitimate usage of xclip tools.
notes:
  quarantine_reason: 'upstream status: test'
