id: sigmahq-sigma-a1d9eec5-33b2-4177-8d24-27fe754d0812
name: Cloudflared Tunnels Related DNS Requests
description: 'Detects DNS requests to Cloudflared tunnels domains.

  Attackers can abuse that feature to establish a reverse shell or persistence on
  a machine.'
severity: medium
enabled: false
tags:
  mitre:
  - T1071.001
  - T1572
  categories:
  - endpoint
references:
- https://www.guidepointsecurity.com/blog/tunnel-vision-cloudflared-abused-in-the-wild/
- Internal Research
logsource:
  category: dns_query
  product: windows
detection:
  selection:
    QueryName|endswith:
    - .v2.argotunnel.com
    - protocol-v2.argotunnel.com
    - trycloudflare.com
    - update.argotunnel.com
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: a1d9eec5-33b2-4177-8d24-27fe754d0812
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/dns_query/dns_query_win_cloudflared_communication.yml
falsepositives:
- Legitimate use of cloudflare tunnels will also trigger this.
notes:
  quarantine_reason: 'upstream status: test'
