id: sigmahq-sigma-7050bba1-1aed-454e-8f73-3f46f09ce56a
name: Cloudflared Tunnel Connections Cleanup
description: Detects execution of the "cloudflared" tool with the tunnel "cleanup"
  flag in order to cleanup tunnel connections.
severity: medium
enabled: false
tags:
  mitre:
  - T1102
  - T1090
  - T1572
  categories:
  - endpoint
references:
- https://github.com/cloudflare/cloudflared
- https://developers.cloudflare.com/cloudflare-one/connections/connect-apps
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains|all:
    - ' tunnel '
    - 'cleanup '
    CommandLine|contains:
    - '-config '
    - '-connector-id '
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 7050bba1-1aed-454e-8f73-3f46f09ce56a
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_cloudflared_tunnel_cleanup.yml
falsepositives:
- Legitimate usage of Cloudflared.
notes:
  quarantine_reason: 'upstream status: test'
