id: sigmahq-sigma-fadb84f0-4e84-4f6d-a1ce-9ef2bffb6ccd
name: Cloudflared Portable Execution
description: Detects the execution of the "cloudflared" binary from a non standard
  location.
severity: medium
enabled: false
tags:
  mitre:
  - T1090.001
  categories:
  - endpoint
references:
- https://developers.cloudflare.com/cloudflare-one/connections/connect-networks/do-more-with-tunnels/trycloudflare/
- https://github.com/cloudflare/cloudflared
- https://www.intrinsec.com/akira_ransomware/
- https://www.guidepointsecurity.com/blog/tunnel-vision-cloudflared-abused-in-the-wild/
- https://github.com/cloudflare/cloudflared/releases
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: \cloudflared.exe
  filter_main_admin_location:
    Image|contains:
    - :\Program Files (x86)\cloudflared\
    - :\Program Files\cloudflared\
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: fadb84f0-4e84-4f6d-a1ce-9ef2bffb6ccd
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_cloudflared_portable_execution.yml
falsepositives:
- Legitimate usage of Cloudflared portable versions
notes:
  quarantine_reason: 'upstream status: test'
