id: sigmahq-sigma-d7a95147-145f-4678-b85d-d1ff4a3bb3f6
name: CobaltStrike Service Installations - Security
description: Detects known malicious service installs that appear in cases in which
  a Cobalt Strike beacon elevates privileges or lateral movement
severity: high
enabled: false
tags:
  mitre:
  - T1021.002
  - T1543.003
  - T1569.002
  categories:
  - endpoint
references:
- https://www.sans.org/webcasts/119395
- https://www.crowdstrike.com/blog/getting-the-bacon-from-cobalt-strike-beacon/
- https://thedfirreport.com/2021/08/29/cobalt-strike-a-defenders-guide/
logsource:
  product: windows
  service: security
  definition: The 'System Security Extension' audit subcategory need to be enabled
    to log the EID 4697
detection:
  event_id:
    EventID: 4697
  selection1:
    ServiceFileName|contains|all:
    - ADMIN$
    - .exe
  selection2:
    ServiceFileName|contains|all:
    - '%COMSPEC%'
    - start
    - powershell
  selection3:
    ServiceFileName|contains: powershell -nop -w hidden -encodedcommand
  selection4:
    ServiceFileName|base64offset|contains: 'IEX (New-Object Net.Webclient).DownloadString(''http://127.0.0.1:'
  condition: event_id and 1 of selection*
provenance:
  source: SigmaHQ/sigma
  source_id: d7a95147-145f-4678-b85d-d1ff4a3bb3f6
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/security/win_security_cobaltstrike_service_installs.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
