id: sigmahq-sigma-ae9c6a7c-9521-42a6-915e-5aaa8689d529
name: CobaltStrike Load by Rundll32
description: Rundll32 can be use by Cobalt Strike with StartW function to load DLLs
  from the command line.
severity: high
enabled: false
tags:
  mitre:
  - T1218.011
  categories:
  - endpoint
references:
- https://www.cobaltstrike.com/help-windows-executable
- https://redcanary.com/threat-detection-report/
- https://thedfirreport.com/2020/10/18/ryuk-in-5-hours/
logsource:
  category: process_creation
  product: windows
detection:
  selection_rundll:
  - Image|endswith: \rundll32.exe
  - OriginalFileName: RUNDLL32.EXE
  - CommandLine|contains:
    - rundll32.exe
    - 'rundll32 '
  selection_params:
    CommandLine|contains: .dll
    CommandLine|endswith:
    - ' StartW'
    - ',StartW'
  condition: all of selection*
provenance:
  source: SigmaHQ/sigma
  source_id: ae9c6a7c-9521-42a6-915e-5aaa8689d529
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_hktl_cobaltstrike_load_by_rundll32.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
