id: sigmahq-sigma-2f8cd7a0-9d5a-4f62-9f8b-2c951aa0dd1f
name: CodeIntegrity - Unmet WHQL Requirements For Loaded Kernel Module
description: Detects loaded kernel modules that did not meet the WHQL signing requirements.
severity: high
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/windows/security/application-security/application-control/windows-defender-application-control/operations/event-id-explanations
- https://learn.microsoft.com/en-us/windows/security/application-security/application-control/windows-defender-application-control/operations/event-tag-explanations
- Internal Research
logsource:
  product: windows
  service: codeintegrity-operational
detection:
  selection:
    EventID:
    - 3082
    - 3083
  filter_optional_vmware:
    FileNameBuffer:
    - system32\drivers\vsock.sys
    - System32\drivers\vmci.sys
  condition: selection and not 1 of filter_optional_*
provenance:
  source: SigmaHQ/sigma
  source_id: 2f8cd7a0-9d5a-4f62-9f8b-2c951aa0dd1f
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/code_integrity/win_codeintegrity_whql_failure.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
