id: sigmahq-sigma-7e3c4651-c347-40c4-b1d4-d48590fdf684
name: Code Injection by ld.so Preload
description: Detects the ld.so preload persistence file. See `man ld.so` for more
  information.
severity: high
enabled: false
tags:
  mitre:
  - T1574.006
  categories:
  - endpoint
references:
- https://man7.org/linux/man-pages/man8/ld.so.8.html
logsource:
  product: linux
detection:
  keywords:
  - /etc/ld.so.preload
  condition: keywords
provenance:
  source: SigmaHQ/sigma
  source_id: 7e3c4651-c347-40c4-b1d4-d48590fdf684
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/builtin/lnx_ldso_preload_injection.yml
falsepositives:
- Rare temporary workaround for library misconfiguration
notes:
  quarantine_reason: 'upstream status: test'
