id: sigmahq-sigma-c92c24e7-f595-493f-9c98-53d5142f5c18
name: CodeIntegrity - Unsigned Image Loaded
description: Detects loaded unsigned image on the system
severity: high
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/windows/security/application-security/application-control/windows-defender-application-control/operations/event-id-explanations
- https://learn.microsoft.com/en-us/windows/security/application-security/application-control/windows-defender-application-control/operations/event-tag-explanations
- Internal Research
logsource:
  product: windows
  service: codeintegrity-operational
detection:
  selection:
    EventID: 3037
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: c92c24e7-f595-493f-9c98-53d5142f5c18
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/code_integrity/win_codeintegrity_unsigned_image_loaded.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
