id: sigmahq-sigma-12fbff88-16b5-4b42-9754-cd001a789fb3
name: CodePage Modification Via MODE.COM To Russian Language
description: 'Detects a CodePage modification using the "mode.com" utility to Russian
  language.

  This behavior has been used by threat actors behind Dharma ransomware.'
severity: medium
enabled: false
tags:
  mitre:
  - T1036
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/windows/win32/intl/code-page-identifiers
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/mode
- https://strontic.github.io/xcyclopedia/library/mode.com-59D1ED51ACB8C3D50F1306FD75F20E99.html
- https://www.virustotal.com/gui/file/5e75ef02517afd6e8ba6462b19217dc4a5a574abb33d10eb0f2bab49d8d48c22/behavior
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \mode.com
  - OriginalFileName: MODE.COM
  selection_cli:
    CommandLine|contains|all:
    - ' con '
    - ' cp '
    - ' select='
    CommandLine|endswith:
    - =1251
    - =866
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 12fbff88-16b5-4b42-9754-cd001a789fb3
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_mode_codepage_russian.yml
falsepositives:
- Russian speaking people changing the CodePage
notes:
  quarantine_reason: 'upstream status: test'
