id: sigmahq-sigma-07743f65-7ec9-404a-a519-913db7118a8d
name: COM Hijack via Sdclt
description: Detects changes to 'HKCU\Software\Classes\Folder\shell\open\command\DelegateExecute'
severity: high
enabled: false
tags:
  mitre:
  - T1546
  - T1548
  categories:
  - endpoint
references:
- http://blog.sevagas.com/?Yet-another-sdclt-UAC-bypass
- https://www.exploit-db.com/exploits/47696
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains: \Software\Classes\Folder\shell\open\command\DelegateExecute
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 07743f65-7ec9-404a-a519-913db7118a8d
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_comhijack_sdclt.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
