id: sigmahq-sigma-dc5c24af-6995-49b2-86eb-a9ff62199e82
name: COM Hijacking via TreatAs
description: Detect modification of TreatAs key to enable "rundll32.exe -sta" command
severity: medium
enabled: false
tags:
  mitre:
  - T1546.015
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1546.015/T1546.015.md
- https://www.youtube.com/watch?v=3gz1QmiMhss&t=1251s
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|endswith: TreatAs\(Default)
  filter_office:
    Image|startswith: C:\Program Files\Common Files\Microsoft Shared\ClickToRun\
    Image|endswith: \OfficeClickToRun.exe
  filter_office2:
    Image:
    - C:\Program Files\Microsoft Office\root\integration\integrator.exe
    - C:\Program Files (x86)\Microsoft Office\root\integration\integrator.exe
  filter_svchost:
    Image: C:\Windows\system32\svchost.exe
  filter_misexec:
    Image:
    - C:\Windows\system32\msiexec.exe
    - C:\Windows\SysWOW64\msiexec.exe
  condition: selection and not 1 of filter_*
provenance:
  source: SigmaHQ/sigma
  source_id: dc5c24af-6995-49b2-86eb-a9ff62199e82
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_treatas_persistence.yml
falsepositives:
- Legitimate use
notes:
  quarantine_reason: 'upstream status: test'
