id: sigmahq-sigma-53d4bb30-3f36-4e8a-b078-69d36c4a79ff
name: COM Object Execution via Xwizard.EXE
description: 'Detects the execution of Xwizard tool with the "RunWizard" flag and
  a GUID like argument.

  This utility can be abused in order to run custom COM object created in the registry.'
severity: medium
enabled: false
tags:
  mitre:
  - T1218
  categories:
  - endpoint
references:
- https://lolbas-project.github.io/lolbas/Binaries/Xwizard/
- https://www.elastic.co/guide/en/security/current/execution-of-com-object-via-xwizard.html
- https://www.hexacorn.com/blog/2017/07/31/the-wizard-of-x-oppa-plugx-style/
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine: RunWizard
    CommandLine|re: \{[a-fA-F0-9]{8}-[a-fA-F0-9]{4}-[a-fA-F0-9]{4}-[a-fA-F0-9]{4}-[a-fA-F0-9]{12}\}
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 53d4bb30-3f36-4e8a-b078-69d36c4a79ff
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_xwizard_runwizard_com_object_exec.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
