id: sigmahq-sigma-19bf6fdb-7721-4f3d-867f-53467f6a5db6
name: Communication To Ngrok Tunneling Service - Linux
description: Detects an executable accessing an ngrok tunneling endpoint, which could
  be a sign of forbidden exfiltration of data exfiltration by malicious actors
severity: high
enabled: false
tags:
  mitre:
  - T1567
  - T1568.002
  - T1572
  - T1090
  - T1102
  categories:
  - endpoint
references:
- https://twitter.com/hakluke/status/1587733971814977537/photo/1
- https://ngrok.com/docs/secure-tunnels/tunnels/ssh-reverse-tunnel-agent
logsource:
  product: linux
  category: network_connection
detection:
  selection:
    DestinationHostname|contains:
    - tunnel.us.ngrok.com
    - tunnel.eu.ngrok.com
    - tunnel.ap.ngrok.com
    - tunnel.au.ngrok.com
    - tunnel.sa.ngrok.com
    - tunnel.jp.ngrok.com
    - tunnel.in.ngrok.com
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 19bf6fdb-7721-4f3d-867f-53467f6a5db6
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/network_connection/net_connection_lnx_ngrok_tunnel.yml
falsepositives:
- Legitimate use of ngrok
notes:
  quarantine_reason: 'upstream status: test'
