id: sigmahq-sigma-1d08ac94-400d-4469-a82f-daee9a908849
name: Communication To Ngrok Tunneling Service Initiated
description: 'Detects an executable initiating a network connection to "ngrok" tunneling
  domains.

  Attackers were seen using this "ngrok" in order to store their second stage payloads
  and malware.

  While communication with such domains can be legitimate, often times is a sign of
  either data exfiltration by malicious actors or additional download.'
severity: high
enabled: false
tags:
  mitre:
  - T1567
  - T1568.002
  - T1572
  - T1090
  - T1102
  categories:
  - endpoint
references:
- https://twitter.com/hakluke/status/1587733971814977537/photo/1
- https://ngrok.com/docs/secure-tunnels/tunnels/ssh-reverse-tunnel-agent
logsource:
  category: network_connection
  product: windows
detection:
  selection:
    DestinationHostname|contains:
    - tunnel.us.ngrok.com
    - tunnel.eu.ngrok.com
    - tunnel.ap.ngrok.com
    - tunnel.au.ngrok.com
    - tunnel.sa.ngrok.com
    - tunnel.jp.ngrok.com
    - tunnel.in.ngrok.com
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 1d08ac94-400d-4469-a82f-daee9a908849
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/network_connection/net_connection_win_domain_ngrok_tunnel.yml
falsepositives:
- Legitimate use of the ngrok service.
notes:
  quarantine_reason: 'upstream status: test'
