id: sigmahq-sigma-e2e80da2-8c66-4e00-ae3c-2eebd29f6b6d
name: Compress Data and Lock With Password for Exfiltration With WINZIP
description: An adversary may compress or encrypt data that is collected prior to
  exfiltration using 3rd party utilities
severity: medium
enabled: false
tags:
  mitre:
  - T1560.001
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1560.001/T1560.001.md
logsource:
  category: process_creation
  product: windows
detection:
  selection_winzip:
    CommandLine|contains:
    - winzip.exe
    - winzip64.exe
  selection_password:
    CommandLine|contains: -s"
  selection_other:
    CommandLine|contains:
    - ' -min '
    - ' -a '
  condition: all of selection*
provenance:
  source: SigmaHQ/sigma
  source_id: e2e80da2-8c66-4e00-ae3c-2eebd29f6b6d
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_winzip_password_compression.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
