id: sigmahq-sigma-9fbf5927-5261-4284-a71d-f681029ea574
name: Compress Data and Lock With Password for Exfiltration With 7-ZIP
description: An adversary may compress or encrypt data that is collected prior to
  exfiltration using 3rd party utilities
severity: medium
enabled: false
tags:
  mitre:
  - T1560.001
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1560.001/T1560.001.md
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Description|contains: 7-Zip
  - Image|endswith:
    - \7z.exe
    - \7zr.exe
    - \7za.exe
  - OriginalFileName:
    - 7z.exe
    - 7za.exe
  selection_password:
    CommandLine|contains: ' -p'
  selection_action:
    CommandLine|contains:
    - ' a '
    - ' u '
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 9fbf5927-5261-4284-a71d-f681029ea574
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_7zip_password_compression.yml
falsepositives:
- Legitimate activity is expected since compressing files with a password is common.
notes:
  quarantine_reason: 'upstream status: test'
