id: sigmahq-sigma-435e10e4-992a-4281-96f3-38b11106adde
name: Computer Discovery And Export Via Get-ADComputer Cmdlet
description: Detects usage of the Get-ADComputer cmdlet to collect computer information
  and output it to a file
severity: medium
enabled: false
tags:
  mitre:
  - T1033
  categories:
  - endpoint
references:
- http://blog.talosintelligence.com/2022/09/lazarus-three-rats.html
- https://www.microsoft.com/en-us/security/blog/2022/10/18/defenders-beware-a-case-for-post-ransomware-investigations/
- https://www.cisa.gov/uscert/sites/default/files/publications/aa22-320a_joint_csa_iranian_government-sponsored_apt_actors_compromise_federal%20network_deploy_crypto%20miner_credential_harvester.pdf
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - \powershell.exe
    - \pwsh.exe
  - OriginalFileName:
    - PowerShell.EXE
    - pwsh.dll
  selection_cli:
    CommandLine|contains|all:
    - 'Get-ADComputer '
    - ' -Filter \*'
    CommandLine|contains:
    - ' > '
    - ' | Select '
    - Out-File
    - Set-Content
    - Add-Content
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 435e10e4-992a-4281-96f3-38b11106adde
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_powershell_computer_discovery_get_adcomputer.yml
falsepositives:
- Legitimate admin scripts may use the same technique, it's better to exclude specific
  computers or users who execute these commands or scripts often
notes:
  quarantine_reason: 'upstream status: test'
