id: sigmahq-sigma-72f4ab3f-787d-495d-a55d-68c2ff46cf4c
name: Connection Proxy
description: Detects setting proxy configuration
severity: low
enabled: false
tags:
  mitre:
  - T1090
  categories:
  - endpoint
references: []
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    CommandLine|contains:
    - http_proxy=
    - https_proxy=
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 72f4ab3f-787d-495d-a55d-68c2ff46cf4c
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/process_creation/proc_creation_lnx_proxy_connection.yml
falsepositives:
- Legitimate administration activities
notes:
  quarantine_reason: 'upstream status: test'
