id: sigmahq-sigma-0ba863e6-def5-4e50-9cea-4dd8c7dc46a4
name: Control Panel Items
description: Detects the malicious use of a control panel item
severity: high
enabled: false
tags:
  mitre:
  - T1218.002
  - T1546
  categories:
  - endpoint
references:
- https://ired.team/offensive-security/code-execution/code-execution-through-control-panel-add-ins
logsource:
  product: windows
  category: process_creation
detection:
  selection_reg_img:
  - Image|endswith: \reg.exe
  - OriginalFileName: reg.exe
  selection_reg_cli:
    CommandLine|contains|all:
    - add
    - CurrentVersion\Control Panel\CPLs
  selection_cpl:
    CommandLine|endswith: .cpl
  filter_cpl_sys:
    CommandLine|contains:
    - \System32\
    - '%System%'
    - '|C:\Windows\system32|'
  filter_cpl_igfx:
    CommandLine|contains|all:
    - 'regsvr32 '
    - ' /s '
    - igfxCPL.cpl
  condition: all of selection_reg_* or (selection_cpl and not 1 of filter_cpl_*)
provenance:
  source: SigmaHQ/sigma
  source_id: 0ba863e6-def5-4e50-9cea-4dd8c7dc46a4
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_control_panel_item.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
