id: sigmahq-sigma-fa4aaed5-4fe0-498d-bbc0-08e3346387ba
name: Copy Passwd Or Shadow From TMP Path
description: Detects when the file "passwd" or "shadow" is copied from tmp path
severity: high
enabled: false
tags:
  mitre:
  - T1552.001
  categories:
  - endpoint
references:
- https://blogs.blackberry.com/
- https://twitter.com/Joseliyo_Jstnk/status/1620131033474822144
logsource:
  product: linux
  category: process_creation
detection:
  selection_img:
    Image|endswith: /cp
  selection_path:
    CommandLine|contains: /tmp/
  selection_file:
    CommandLine|contains:
    - passwd
    - shadow
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: fa4aaed5-4fe0-498d-bbc0-08e3346387ba
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/process_creation/proc_creation_lnx_cp_passwd_or_shadow_tmp.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
