id: sigmahq-sigma-e7be6119-fc37-43f0-ad4f-1f3f99be2f9f
name: Copying Sensitive Files with Credential Data
description: Files with well-known filenames (sensitive files with credential data)
  copying
severity: high
enabled: false
tags:
  mitre:
  - T1003.002
  - T1003.003
  categories:
  - endpoint
references:
- https://room362.com/post/2013/2013-06-10-volume-shadow-copy-ntdsdit-domain-hashes-remotely-part-1/
- https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
- https://dfironthemountain.wordpress.com/2018/12/06/locked-file-access-using-esentutl-exe/
- https://github.com/LOLBAS-Project/LOLBAS/blob/2cc01b01132b5c304027a658c698ae09dd6a92bf/yml/OSBinaries/Esentutl.yml
logsource:
  category: process_creation
  product: windows
detection:
  selection_esent_img:
  - Image|endswith: \esentutl.exe
  - OriginalFileName: \esentutl.exe
  selection_esent_cli:
    CommandLine|contains|windash:
    - vss
    - ' /m '
    - ' /y '
  selection_susp_paths:
    CommandLine|contains:
    - \config\RegBack\sam
    - \config\RegBack\security
    - \config\RegBack\system
    - \config\sam
    - \config\security
    - '\config\system '
    - \repair\sam
    - \repair\security
    - \repair\system
    - \windows\ntds\ntds.dit
  condition: all of selection_esent_* or selection_susp_paths
provenance:
  source: SigmaHQ/sigma
  source_id: e7be6119-fc37-43f0-ad4f-1f3f99be2f9f
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_esentutl_sensitive_file_copy.yml
falsepositives:
- Copying sensitive files for legitimate use (eg. backup) or forensic investigation
  by legitimate incident responder or forensic investigator.
notes:
  quarantine_reason: 'upstream status: test'
