id: sigmahq-sigma-855bc8b5-2ae8-402e-a9ed-b889e6df1900
name: Copy From Or To Admin Share Or Sysvol Folder
description: Detects a copy command or a copy utility execution to or from an Admin
  share or remote
severity: medium
enabled: false
tags:
  mitre:
  - T1039
  - T1048
  - T1021.002
  categories:
  - endpoint
references:
- https://twitter.com/SBousseaden/status/1211636381086339073
- https://drive.google.com/file/d/1lKya3_mLnR3UQuCoiYruO3qgu052_iS_/view
- https://www.elastic.co/guide/en/security/current/remote-file-copy-to-a-hidden-share.html
- https://www.microsoft.com/en-us/security/blog/2022/10/18/defenders-beware-a-case-for-post-ransomware-investigations/
logsource:
  category: process_creation
  product: windows
detection:
  selection_target:
    CommandLine|contains:
    - \\\\*\\*$
    - \Sysvol\
  selection_other_tools:
  - Image|endswith:
    - \robocopy.exe
    - \xcopy.exe
  - OriginalFileName:
    - robocopy.exe
    - XCOPY.EXE
  selection_cmd_img:
  - Image|endswith: \cmd.exe
  - OriginalFileName: Cmd.Exe
  selection_cmd_cli:
    CommandLine|contains: copy
  selection_pwsh_img:
  - Image|contains:
    - \powershell_ise.exe
    - \powershell.exe
    - \pwsh.exe
  - OriginalFileName:
    - powershell_ise.exe
    - PowerShell.EXE
    - pwsh.dll
  selection_pwsh_cli:
    CommandLine|contains:
    - copy-item
    - 'copy '
    - 'cpi '
    - ' cp '
    - 'move '
    - ' move-item'
    - ' mi '
    - ' mv '
  condition: selection_target and (selection_other_tools or all of selection_cmd_*
    or all of selection_pwsh_*)
provenance:
  source: SigmaHQ/sigma
  source_id: 855bc8b5-2ae8-402e-a9ed-b889e6df1900
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_susp_copy_lateral_movement.yml
falsepositives:
- Administrative scripts
notes:
  quarantine_reason: 'upstream status: test'
