id: sigmahq-sigma-882fbe50-d8d7-4e29-ae80-0648a8556866
name: Crash Dump Created By Operating System
description: Detects "BugCheck" errors indicating the system rebooted due to a crash,
  capturing the bugcheck code, dump file path, and report ID.
severity: medium
enabled: false
tags:
  mitre:
  - T1003.002
  - T1005
  categories:
  - endpoint
references:
- https://www.sans.edu/cyber-research/from-crash-compromise-unlocking-potential-windows-crash-dumps-offensive-security/
- https://jasonmull.com/articles/offensive/2025-05-12-windows-crash-dumps-offensive-security/
logsource:
  product: windows
  service: system
detection:
  selection:
    Provider_Name: Microsoft-Windows-WER-SystemErrorReporting
    EventID: 1001
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 882fbe50-d8d7-4e29-ae80-0648a8556866
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/system/microsoft_windows_wer_systemerrorreporting/win_system_crash_dump_created.yml
notes:
  quarantine_reason: 'upstream status: experimental'
