id: sigmahq-sigma-28a452f3-786c-4fd8-b8f2-bddbe9d616d1
name: Creation of WerFault.exe/Wer.dll in Unusual Folder
description: Detects the creation of a file named "WerFault.exe" or "wer.dll" in an
  uncommon folder, which could be a sign of WerFault DLL hijacking.
severity: medium
enabled: false
tags:
  mitre:
  - T1574.001
  categories:
  - endpoint
references:
- https://www.bleepingcomputer.com/news/security/hackers-are-now-hiding-malware-in-windows-event-logs/
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename|endswith:
    - \WerFault.exe
    - \wer.dll
  filter_main_known_locations:
    TargetFilename|startswith:
    - C:\Windows\SoftwareDistribution\
    - C:\Windows\System32\
    - C:\Windows\SysWOW64\
    - C:\Windows\WinSxS\
    - C:\Windows\UUS\arm64\
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 28a452f3-786c-4fd8-b8f2-bddbe9d616d1
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_werfault_dll_hijacking.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
