id: sigmahq-sigma-a80d927d-ac6e-443f-a867-e8d6e3897318
name: Creation Of Pod In System Namespace
description: 'Detects deployments of pods within the kube-system namespace, which
  could be intended to imitate system pods.

  System pods, created by controllers such as Deployments or DaemonSets have random
  suffixes in their names.

  Attackers can use this fact and name their backdoor pods as if they were created
  by these controllers to avoid detection.

  Deployment of such a backdoor container e.g. named kube-proxy-bv61v, could be attempted
  in the kube-system namespace alongside the other administrative containers.'
severity: medium
enabled: false
tags:
  mitre:
  - T1036.005
  categories:
  - endpoint
references:
- https://microsoft.github.io/Threat-Matrix-for-Kubernetes/techniques/Pod%20or%20container%20name%20similarily/
logsource:
  category: application
  product: kubernetes
  service: audit
detection:
  selection:
    verb: create
    objectRef.resource: pods
    objectRef.namespace: kube-system
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: a80d927d-ac6e-443f-a867-e8d6e3897318
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/application/kubernetes/audit/kubernetes_audit_pod_in_system_namespace.yml
falsepositives:
- System components such as daemon-set-controller and kube-scheduler also create pods
  in the kube-system namespace
notes:
  quarantine_reason: 'upstream status: test'
