id: sigmahq-sigma-8c3c76ca-8f8b-4b1d-aaf3-81aebcd367c9
name: Creation Exe for Service with Unquoted Path
description: 'Adversaries may execute their own malicious payloads by hijacking vulnerable
  file path references.

  Adversaries can take advantage of paths that lack surrounding quotations by placing
  an executable in a higher level directory within the path, so that Windows will
  choose the adversary''s executable to launch.'
severity: high
enabled: false
tags:
  mitre:
  - T1547.009
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1574.009/T1574.009.md
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename: C:\program.exe
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 8c3c76ca-8f8b-4b1d-aaf3-81aebcd367c9
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_creation_unquoted_service_path.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
