id: sigmahq-sigma-8fbf3271-1ef6-4e94-8210-03c2317947f6
name: Cred Dump Tools Dropped Files
description: Files with well-known filenames (parts of credential dump software or
  files produced by them) creation
severity: high
enabled: false
tags:
  mitre:
  - T1003.001
  - T1003.002
  - T1003.003
  - T1003.004
  - T1003.005
  categories:
  - endpoint
references:
- https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
logsource:
  category: file_event
  product: windows
detection:
  selection:
  - TargetFilename|contains:
    - \fgdump-log
    - \kirbi
    - \pwdump
    - \pwhashes
    - \wce_ccache
    - \wce_krbtkts
  - TargetFilename|endswith:
    - \cachedump.exe
    - \cachedump64.exe
    - \DumpExt.dll
    - \DumpSvc.exe
    - \Dumpy.exe
    - \fgexec.exe
    - \lsremora.dll
    - \lsremora64.dll
    - \NTDS.out
    - \procdump.exe
    - \procdump64.exe
    - \procdump64a.exe
    - \pstgdump.exe
    - \pwdump.exe
    - \SAM.out
    - \SECURITY.out
    - \servpw.exe
    - \servpw64.exe
    - \SYSTEM.out
    - \test.pwd
    - \wceaux.dll
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 8fbf3271-1ef6-4e94-8210-03c2317947f6
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_cred_dump_tools_dropped_files.yml
falsepositives:
- Legitimate Administrator using tool for password recovery
notes:
  quarantine_reason: 'upstream status: test'
