id: sigmahq-sigma-174afcfa-6e40-4ae9-af64-496546389294
name: Credential Dumping Attempt Via Svchost
description: Detects when a process tries to access the memory of svchost to potentially
  dump credentials.
severity: high
enabled: false
tags:
  mitre:
  - T1548
  categories:
  - endpoint
references:
- Internal Research
logsource:
  product: windows
  category: process_access
detection:
  selection:
    TargetImage|endswith: \svchost.exe
    GrantedAccess: '0x143a'
  filter_main_known_processes:
    SourceImage|endswith:
    - \services.exe
    - \msiexec.exe
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 174afcfa-6e40-4ae9-af64-496546389294
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_access/proc_access_win_svchost_credential_dumping.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
