id: sigmahq-sigma-f0d1feba-4344-4ca9-8121-a6c97bd6df52
name: Credential Dumping Tools Service Execution - Security
description: Detects well-known credential dumping tools execution via service execution
  events
severity: high
enabled: false
tags:
  mitre:
  - T1003.001
  - T1003.002
  - T1003.004
  - T1003.005
  - T1003.006
  - T1569.002
  categories:
  - endpoint
references:
- https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
logsource:
  product: windows
  service: security
  definition: The 'System Security Extension' audit subcategory need to be enabled
    to log the EID 4697
detection:
  selection:
    EventID: 4697
    ServiceFileName|contains:
    - cachedump
    - dumpsvc
    - fgexec
    - gsecdump
    - mimidrv
    - pwdump
    - servpw
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: f0d1feba-4344-4ca9-8121-a6c97bd6df52
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/security/win_security_mal_creddumper.yml
falsepositives:
- Legitimate Administrator using credential dumping tool for password recovery
notes:
  quarantine_reason: 'upstream status: test'
