id: sigmahq-sigma-53b1b378-9b06-4992-b972-dde6e423d2b4
name: Credentials In Files
description: Detecting attempts to extract passwords with grep and laZagne
severity: high
enabled: false
tags:
  mitre:
  - T1552.001
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1552.001/T1552.001.md
logsource:
  product: macos
  category: process_creation
detection:
  selection1:
    Image|endswith: /grep
    CommandLine|contains: password
  selection2:
    CommandLine|contains: laZagne
  condition: 1 of selection*
provenance:
  source: SigmaHQ/sigma
  source_id: 53b1b378-9b06-4992-b972-dde6e423d2b4
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/macos/process_creation/proc_creation_macos_find_cred_in_files.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
