id: sigmahq-sigma-407aecb1-e762-4acf-8c7b-d087bcff3bb6
name: Credential Manager Access By Uncommon Applications
description: 'Detects suspicious processes based on name and location that access
  the windows credential manager and vault.

  Which can be a sign of credential stealing. Example case would be usage of mimikatz
  "dpapi::cred" function'
severity: medium
enabled: false
tags:
  mitre:
  - T1003
  categories:
  - endpoint
references:
- https://hunter2.gitbook.io/darthsidious/privilege-escalation/mimikatz
- https://www.absolomb.com/2018-01-26-Windows-Privilege-Escalation-Guide/
logsource:
  category: file_access
  product: windows
  definition: 'Requirements: Microsoft-Windows-Kernel-File ETW provider'
detection:
  selection:
    FileName|contains:
    - \AppData\Local\Microsoft\Credentials\
    - \AppData\Roaming\Microsoft\Credentials\
    - \AppData\Local\Microsoft\Vault\
    - \ProgramData\Microsoft\Vault\
  filter_system_folders:
    Image|startswith:
    - C:\Program Files\
    - C:\Program Files (x86)\
    - C:\Windows\system32\
    - C:\Windows\SysWOW64\
  condition: selection and not 1 of filter_*
provenance:
  source: SigmaHQ/sigma
  source_id: 407aecb1-e762-4acf-8c7b-d087bcff3bb6
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_access/file_access_win_susp_credential_manager_access.yml
falsepositives:
- Legitimate software installed by the users for example in the "AppData" directory
  may access these files (for any reason).
notes:
  quarantine_reason: 'upstream status: test'
