id: sigmahq-sigma-4976aa50-8f41-45c6-8b15-ab3fc10e79ed
name: Credential Dumping Tools Service Execution - System
description: Detects well-known credential dumping tools execution via service execution
  events
severity: high
enabled: false
tags:
  mitre:
  - T1003.001
  - T1003.002
  - T1003.004
  - T1003.005
  - T1003.006
  - T1569.002
  categories:
  - endpoint
references:
- https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
logsource:
  product: windows
  service: system
detection:
  selection:
    Provider_Name: Service Control Manager
    EventID: 7045
    ImagePath|contains:
    - cachedump
    - dumpsvc
    - fgexec
    - gsecdump
    - mimidrv
    - pwdump
    - servpw
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 4976aa50-8f41-45c6-8b15-ab3fc10e79ed
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/system/service_control_manager/win_system_mal_creddumper.yml
falsepositives:
- Legitimate Administrator using credential dumping tool for password recovery
notes:
  quarantine_reason: 'upstream status: test'
