id: sigmahq-sigma-e5b33f7d-eb93-48b6-9851-09e1e610b6d7
name: Credential Dumping Attempt Via WerFault
description: Detects process LSASS memory dump using Mimikatz, NanoDump, Invoke-Mimikatz,
  Procdump or Taskmgr based on the CallTrace pointing to ntdll.dll, dbghelp.dll or
  dbgcore.dll for win10, server2016 and up.
severity: high
enabled: false
tags:
  mitre:
  - T1003.001
  categories:
  - endpoint
references:
- https://github.com/helpsystems/nanodump/commit/578116faea3d278d53d70ea932e2bbfe42569507
logsource:
  category: process_access
  product: windows
detection:
  selection:
    SourceImage|endswith: \WerFault.exe
    TargetImage|endswith: \lsass.exe
    GrantedAccess: '0x1FFFFF'
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: e5b33f7d-eb93-48b6-9851-09e1e610b6d7
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_access/proc_access_win_lsass_werfault.yml
falsepositives:
- Actual failures in lsass.exe that trigger a crash dump (unlikely)
- Unknown cases in which WerFault accesses lsass.exe
notes:
  quarantine_reason: 'upstream status: test'
