id: sigmahq-sigma-df3fcaea-2715-4214-99c5-0056ea59eb35
name: Credentials In Files - Linux
description: Detecting attempts to extract passwords with grep
severity: high
enabled: false
tags:
  mitre:
  - T1552.001
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1552.001/T1552.001.md
logsource:
  product: linux
  service: auditd
detection:
  selection:
    type: EXECVE
  keywords:
    '|all':
    - grep
    - password
  condition: selection and keywords
provenance:
  source: SigmaHQ/sigma
  source_id: df3fcaea-2715-4214-99c5-0056ea59eb35
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/auditd/execve/lnx_auditd_find_cred_in_files.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
