id: sigmahq-sigma-b120b587-a4c2-4b94-875d-99c9807d6955
name: Credentials from Password Stores - Keychain
description: Detects passwords dumps from Keychain
severity: medium
enabled: false
tags:
  mitre:
  - T1555.001
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1555.001/T1555.001.md
- https://gist.github.com/Capybara/6228955
logsource:
  category: process_creation
  product: macos
detection:
  selection1:
    Image: /usr/bin/security
    CommandLine|contains:
    - find-certificate
    - ' export '
  selection2:
    CommandLine|contains:
    - ' dump-keychain '
    - ' login-keychain '
  condition: 1 of selection*
provenance:
  source: SigmaHQ/sigma
  source_id: b120b587-a4c2-4b94-875d-99c9807d6955
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/macos/process_creation/proc_creation_macos_creds_from_keychain.yml
falsepositives:
- Legitimate administration activities
notes:
  quarantine_reason: 'upstream status: test'
