id: sigmahq-sigma-403ed92c-b7ec-4edd-9947-5b535ee12d46
name: Crontab Enumeration
description: Detects usage of crontab to list the tasks of the user
severity: low
enabled: false
tags:
  mitre:
  - T1007
  categories:
  - endpoint
references:
- https://blogs.jpcert.or.jp/en/2023/05/gobrat.html
- https://jstnk9.github.io/jstnk9/research/GobRAT-Malware/
- https://www.virustotal.com/gui/file/60bcd645450e4c846238cf0e7226dc40c84c96eba99f6b2cffcd0ab4a391c8b3/detection
- https://www.virustotal.com/gui/file/3e44c807a25a56f4068b5b8186eee5002eed6f26d665a8b791c472ad154585d1/detection
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    Image|endswith: /crontab
    CommandLine|contains: ' -l'
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 403ed92c-b7ec-4edd-9947-5b535ee12d46
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/process_creation/proc_creation_lnx_crontab_enumeration.yml
falsepositives:
- Legitimate use of crontab
notes:
  quarantine_reason: 'upstream status: test'
