id: sigmahq-sigma-fa935401-513b-467b-81f4-f9e77aa0dd78
name: Crypto Miner User Agent
description: Detects suspicious user agent strings used by crypto miners in proxy
  logs
severity: high
enabled: false
tags:
  mitre:
  - T1071.001
  categories:
  - network
references:
- https://github.com/xmrig/xmrig/blob/da22b3e6c45825f3ac1f208255126cb8585cd4fc/src/base/kernel/Platform_win.cpp#L65
- https://github.com/xmrig/xmrig/blob/427b6516e0550200c17ca28675118f0fffcc323f/src/version.h
logsource:
  category: proxy
detection:
  selection:
    c-useragent|startswith:
    - 'XMRig '
    - ccminer
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: fa935401-513b-467b-81f4-f9e77aa0dd78
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/web/proxy_generic/proxy_ua_cryptominer.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
