id: sigmahq-sigma-a27e5fa9-c35e-4e3d-b7e0-1ce2af66ad12
name: CSExec Service Installation
description: Detects CSExec service installation and execution events
severity: medium
enabled: false
tags:
  mitre:
  - T1569.002
  categories:
  - endpoint
references:
- https://github.com/malcomvetter/CSExec
logsource:
  product: windows
  service: system
detection:
  selection_eid:
    Provider_Name: Service Control Manager
    EventID: 7045
  selection_service:
  - ServiceName: csexecsvc
  - ImagePath|endswith: \csexecsvc.exe
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: a27e5fa9-c35e-4e3d-b7e0-1ce2af66ad12
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/system/service_control_manager/win_system_service_install_csexecsvc.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
