id: sigmahq-sigma-85de1f22-d189-44e4-8239-dc276b45379b
name: Curl Web Request With Potential Custom User-Agent
description: Detects execution of "curl.exe" with a potential custom "User-Agent".
  Attackers can leverage this to download or exfiltrate data via "curl" to a domain
  that only accept specific "User-Agent" strings
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://labs.withsecure.com/publications/fin7-target-veeam-servers
- https://github.com/WithSecureLabs/iocs/blob/344203de742bb7e68bd56618f66d34be95a9f9fc/FIN7VEEAM/iocs.csv
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \curl.exe
  - OriginalFileName: curl.exe
  selection_header_flag_1:
    CommandLine|re: \s-H\s
  selection_header_flag_2:
    CommandLine|contains: --header
  selection_user_agent:
    CommandLine|contains: 'User-Agent:'
  condition: selection_img and 1 of selection_header_* and selection_user_agent
provenance:
  source: SigmaHQ/sigma
  source_id: 85de1f22-d189-44e4-8239-dc276b45379b
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_curl_custom_user_agent.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
