id: sigmahq-sigma-21dd6d38-2b18-4453-9404-a0fe4a0cc288
name: Curl Download And Execute Combination
description: Adversaries can use curl to download payloads remotely and execute them.
  Curl is included by default in Windows 10 build 17063 and later.
severity: high
enabled: false
tags:
  mitre:
  - T1218
  - T1105
  categories:
  - endpoint
references:
- https://medium.com/@reegun/curl-exe-is-the-new-rundll32-exe-lolbin-3f79c5f35983
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains|windash: ' -c '
    CommandLine|contains|all:
    - 'curl '
    - http
    - -o
    - '&'
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 21dd6d38-2b18-4453-9404-a0fe4a0cc288
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_cmd_curl_download_exec_combo.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
