id: sigmahq-sigma-ddeff553-5233-4ae9-bbab-d64d2bd634be
name: Data Copied To Clipboard Via Clip.EXE
description: Detects the execution of clip.exe in order to copy data to the clipboard.
  Adversaries may collect data stored in the clipboard from users copying information
  within or between applications.
severity: low
enabled: false
tags:
  mitre:
  - T1115
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/clip
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1115/T1115.md
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Image|endswith: \clip.exe
  - OriginalFileName: clip.exe
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: ddeff553-5233-4ae9-bbab-d64d2bd634be
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_clip_execution.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
