id: sigmahq-sigma-a3b5e3e9-1b49-4119-8b8e-0344a01f21ee
name: Data Compressed
description: An adversary may compress data (e.g., sensitive documents) that is collected
  prior to exfiltration in order to make it portable and minimize the amount of data
  sent over the network.
severity: low
enabled: false
tags:
  mitre:
  - T1560.001
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/a78b9ed805ab9ea2e422e1aa7741e9407d82d7b1/atomics/T1560.001/T1560.001.md
logsource:
  product: linux
  service: auditd
detection:
  selection1:
    type: execve
    a0: zip
  selection2:
    type: execve
    a0: gzip
    a1: -k
  selection3:
    type: execve
    a0: tar
    a1|contains: -c
  condition: 1 of selection*
provenance:
  source: SigmaHQ/sigma
  source_id: a3b5e3e9-1b49-4119-8b8e-0344a01f21ee
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/auditd/execve/lnx_auditd_data_compressed.yml
falsepositives:
- Legitimate use of archiving tools by legitimate user.
notes:
  quarantine_reason: 'upstream status: test'
