id: sigmahq-sigma-c615d676-f655-46b9-b913-78729021e5d7
name: Data Export From MSSQL Table Via BCP.EXE
description: 'Detects the execution of the BCP utility in order to export data from
  the database.

  Attackers were seen saving their malware to a database column or table and then
  later extracting it via "bcp.exe" into a file.'
severity: medium
enabled: false
tags:
  mitre:
  - T1048
  categories:
  - endpoint
references:
- https://docs.microsoft.com/en-us/sql/tools/bcp-utility
- https://asec.ahnlab.com/en/61000/
- https://asec.ahnlab.com/en/78944/
- https://www.huntress.com/blog/attacking-mssql-servers
- https://www.huntress.com/blog/attacking-mssql-servers-pt-ii
- https://news.sophos.com/en-us/2024/08/07/sophos-mdr-hunt-tracks-mimic-ransomware-campaign-against-organizations-in-india/
- https://research.nccgroup.com/2018/03/10/apt15-is-alive-and-strong-an-analysis-of-royalcli-and-royaldns/
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \bcp.exe
  - OriginalFileName: BCP.exe
  selection_cli:
    CommandLine|contains:
    - ' out '
    - ' queryout '
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: c615d676-f655-46b9-b913-78729021e5d7
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_bcp_export_data.yml
falsepositives:
- Legitimate data export operations.
notes:
  quarantine_reason: 'upstream status: test'
