id: sigmahq-sigma-c39f0c81-7348-4965-ab27-2fde35a1b641
name: DCOM InternetExplorer.Application Iertutil DLL Hijack - Security
description: Detects a threat actor creating a file named `iertutil.dll` in the `C:\Program
  Files\Internet Explorer\` directory over the network for a DCOM InternetExplorer
  DLL Hijack scenario.
severity: high
enabled: false
tags:
  mitre:
  - T1021.002
  - T1021.003
  categories:
  - endpoint
references:
- https://threathunterplaybook.com/hunts/windows/201009-RemoteDCOMIErtUtilDLLHijack/notebook.html
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 5145
    RelativeTargetName|endswith: \Internet Explorer\iertutil.dll
  filter:
    SubjectUserName|endswith: $
  condition: selection and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: c39f0c81-7348-4965-ab27-2fde35a1b641
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/security/win_security_dcom_iertutil_dll_hijack.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
