id: sigmahq-sigma-dbc1f800-0fe0-4bc0-9c66-292c2abe3f78
name: Delete Important Scheduled Task
description: Detects when adversaries stop services or processes by deleting their
  respective scheduled tasks in order to conduct data destructive activities
severity: high
enabled: false
tags:
  mitre:
  - T1489
  categories:
  - endpoint
references:
- Internal Research
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \schtasks.exe
  - OriginalFileName: schtasks.exe
  selection_cli_delete:
    CommandLine|contains|windash: /delete
  selection_cli_task:
    CommandLine|contains:
    - \Windows\BitLocker
    - \Windows\ExploitGuard
    - \Windows\SystemRestore\SR
    - \Windows\UpdateOrchestrator\
    - \Windows\Windows Defender\
    - \Windows\WindowsBackup\
    - \Windows\WindowsUpdate\
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: dbc1f800-0fe0-4bc0-9c66-292c2abe3f78
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_schtasks_delete.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
