id: sigmahq-sigma-21ff4ca9-f13a-41ad-b828-0077b2af2e40
name: Deletion of Volume Shadow Copies via WMI with PowerShell
description: Detects deletion of Windows Volume Shadow Copies with PowerShell code
  and Get-WMIObject. This technique is used by numerous ransomware families such as
  Sodinokibi/REvil
severity: high
enabled: false
tags:
  mitre:
  - T1490
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1490/T1490.md#atomic-test-5---windows---delete-volume-shadow-copies-via-wmi-with-powershell
- https://www.elastic.co/guide/en/security/current/volume-shadow-copy-deletion-via-powershell.html
logsource:
  category: process_creation
  product: windows
detection:
  selection_get:
    CommandLine|contains:
    - Get-WmiObject
    - gwmi
    - Get-CimInstance
    - gcim
  selection_shadowcopy:
    CommandLine|contains: Win32_ShadowCopy
  selection_delete:
    CommandLine|contains:
    - .Delete()
    - Remove-WmiObject
    - rwmi
    - Remove-CimInstance
    - rcim
  condition: all of selection*
provenance:
  source: SigmaHQ/sigma
  source_id: 21ff4ca9-f13a-41ad-b828-0077b2af2e40
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_powershell_shadowcopy_deletion.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
