id: sigmahq-sigma-72a0369a-2576-4aaf-bfc9-6bb24a574ac6
name: Delete Defender Scan ShellEx Context Menu Registry Key
description: Detects deletion of registry key that adds 'Scan with Defender' option
  in context menu. Attackers may use this to make it harder for users to scan files
  that are suspicious.
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://research.splunk.com/endpoint/395ed5fe-ad13-4366-9405-a228427bdd91/
- https://winaero.com/how-to-delete-scan-with-windows-defender-from-context-menu-in-windows-10/
- https://thedfirreport.com/2021/10/18/icedid-to-xinglocker-ransomware-in-24-hours/
- https://blog.malwarebytes.com/malwarebytes-news/2021/02/lazyscripter-from-empire-to-double-rat/
logsource:
  category: registry_delete
  product: windows
detection:
  selection:
    TargetObject|contains: shellex\ContextMenuHandlers\EPP
  filter_main_defender:
    Image|startswith:
    - C:\ProgramData\Microsoft\Windows Defender\Platform\
    - C:\Program Files\Windows Defender\
    - C:\Program Files (x86)\Windows Defender\
    Image|endswith: \MsMpEng.exe
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 72a0369a-2576-4aaf-bfc9-6bb24a574ac6
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_delete/registry_delete_defender_context_menu.yml
falsepositives:
- Unlikely as this weakens defenses and normally would not be done even if using another
  AV.
notes:
  quarantine_reason: 'upstream status: experimental'
