id: sigmahq-sigma-99cf1e02-00fb-4c0d-8375-563f978dfd37
name: Deny Service Access Using Security Descriptor Tampering Via Sc.EXE
description: Detects suspicious DACL modifications to deny access to a service that
  affects critical trustees. This can be used to hide services or make them unstoppable.
severity: high
enabled: false
tags:
  mitre:
  - T1543.003
  categories:
  - endpoint
references:
- https://www.sans.org/blog/red-team-tactics-hiding-windows-services/
- https://itconnect.uw.edu/tools-services-support/it-systems-infrastructure/msinf/other-help/understanding-sddl-syntax/
- https://learn.microsoft.com/en-us/windows/win32/secauthz/sid-strings
logsource:
  category: process_creation
  product: windows
detection:
  selection_sc:
  - Image|endswith: \sc.exe
  - OriginalFileName: sc.exe
  selection_sdset:
    CommandLine|contains|all:
    - sdset
    - D;
  selection_trustee:
    CommandLine|contains:
    - ;IU
    - ;SU
    - ;BA
    - ;SY
    - ;WD
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 99cf1e02-00fb-4c0d-8375-563f978dfd37
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_sc_sdset_deny_service_access.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
