id: sigmahq-sigma-40967487-139b-4811-81d9-c9767a92aa5a
name: Deployment Deleted From Kubernetes Cluster
description: 'Detects the removal of a deployment from a Kubernetes cluster.

  This could indicate disruptive activity aiming to impact business operations.'
severity: low
enabled: false
tags:
  mitre:
  - T1498
  categories:
  - endpoint
references:
- https://microsoft.github.io/Threat-Matrix-for-Kubernetes/techniques/Data%20destruction/
logsource:
  category: application
  product: kubernetes
  service: audit
detection:
  selection:
    verb: delete
    objectRef.resource: deployments
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 40967487-139b-4811-81d9-c9767a92aa5a
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/application/kubernetes/audit/kubernetes_audit_deployment_deleted.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
