id: sigmahq-sigma-6ae53108-c3a0-4bee-8f45-c7591a2c337f
name: Deployment AppX Package Was Blocked By AppLocker
description: Detects an appx package deployment that was blocked by AppLocker policy.
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/windows/win32/appxpkg/troubleshooting
- https://github.com/nasbench/EVTX-ETW-Resources/blob/7a806a148b3d9d381193d4a80356016e6e8b1ee8/ETWEventsList/CSV/Windows11/22H2/W11_22H2_Pro_20220920_22621.382/Providers/Microsoft-Windows-AppXDeployment-Server.csv
logsource:
  product: windows
  service: appxdeployment-server
detection:
  selection:
    EventID: 412
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 6ae53108-c3a0-4bee-8f45-c7591a2c337f
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/appxdeployment_server/win_appxdeployment_server_applocker_block.yml
falsepositives:
- Unlikely, since this event notifies about blocked application deployment. Tune your
  applocker rules to avoid blocking legitimate applications.
notes:
  quarantine_reason: 'upstream status: test'
