id: sigmahq-sigma-81315b50-6b60-4d8f-9928-3466e1022515
name: Desktop.INI Created by Uncommon Process
description: Detects unusual processes accessing desktop.ini, which can be leveraged
  to alter how Explorer displays a folder's content (i.e. renaming files) without
  changing them on disk.
severity: medium
enabled: false
tags:
  mitre:
  - T1547.009
  categories:
  - endpoint
references:
- https://isc.sans.edu/forums/diary/Desktopini+as+a+postexploitation+tool/25912/
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename|endswith: \desktop.ini
  filter_main_generic:
    Image|startswith:
    - C:\Windows\
    - C:\Program Files\
    - C:\Program Files (x86)\
  filter_main_upgrade:
    TargetFilename|startswith: C:\$WINDOWS.~BT\NewOS\
  filter_optional_jetbrains:
    Image|startswith: C:\Users\
    Image|endswith: \AppData\Local\JetBrains\Toolbox\bin\7z.exe
    TargetFilename|contains: \JetBrains\apps\
  filter_optional_onedrive:
    Image|startswith: C:\Users\
    Image|contains: \AppData\Local\Microsoft\OneDrive\
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
provenance:
  source: SigmaHQ/sigma
  source_id: 81315b50-6b60-4d8f-9928-3466e1022515
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_desktop_ini_created_by_uncommon_process.yml
falsepositives:
- Operations performed through Windows SCCM or equivalent
- Read only access list authority
notes:
  quarantine_reason: 'upstream status: test'
