id: sigmahq-sigma-0152550d-3a26-4efd-9f0e-54a0b28ae2f3
name: Detection of PowerShell Execution via Sqlps.exe
description: 'This rule detects execution of a PowerShell code through the sqlps.exe
  utility, which is included in the standard set of utilities supplied with the MSSQL
  Server.

  Script blocks are not logged in this case, so this utility helps to bypass protection
  mechanisms based on the analysis of these logs.'
severity: medium
enabled: false
tags:
  mitre:
  - T1059.001
  - T1127
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/sql/tools/sqlps-utility?view=sql-server-ver15
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Sqlps/
- https://twitter.com/bryon_/status/975835709587075072
logsource:
  category: process_creation
  product: windows
detection:
  selection_parent:
    ParentImage|endswith: \sqlps.exe
  selection_image:
  - Image|endswith: \sqlps.exe
  - OriginalFileName: sqlps.exe
  filter_image:
    ParentImage|endswith: \sqlagent.exe
  condition: selection_parent or (selection_image and not filter_image)
provenance:
  source: SigmaHQ/sigma
  source_id: 0152550d-3a26-4efd-9f0e-54a0b28ae2f3
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_mssql_sqlps_susp_execution.yml
falsepositives:
- Direct PS command execution through SQLPS.exe is uncommon, childprocess sqlps.exe
  spawned by sqlagent.exe is a legitimate action.
notes:
  quarantine_reason: 'upstream status: test'
