id: sigmahq-sigma-b8b1b304-a60f-4999-9a6e-c547bde03ffd
name: DeviceCredentialDeployment Execution
description: Detects the execution of DeviceCredentialDeployment to hide a process
  from view.
severity: medium
enabled: false
tags:
  mitre:
  - T1218
  categories:
  - endpoint
references:
- https://github.com/LOLBAS-Project/LOLBAS/pull/147
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: \DeviceCredentialDeployment.exe
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: b8b1b304-a60f-4999-9a6e-c547bde03ffd
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_device_credential_deployment.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
