id: sigmahq-sigma-cc268ac1-42d9-40fd-9ed3-8c4e1a5b87e6
name: Devtoolslauncher.exe Executes Specified Binary
description: The Devtoolslauncher.exe executes other binary
severity: high
enabled: false
tags:
  mitre:
  - T1218
  categories:
  - endpoint
references:
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Devtoolslauncher/
- https://twitter.com/_felamos/status/1179811992841797632
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: \devtoolslauncher.exe
    CommandLine|contains: LaunchForDeploy
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: cc268ac1-42d9-40fd-9ed3-8c4e1a5b87e6
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_lolbin_devtoolslauncher.yml
falsepositives:
- Legitimate use of devtoolslauncher.exe by legitimate user
notes:
  quarantine_reason: 'upstream status: test'
