id: sigmahq-sigma-9d3436ef-9476-4c43-acca-90ce06bdf33a
name: DHCP Callout DLL Installation
description: Detects the installation of a Callout DLL via CalloutDlls and CalloutEnabled
  parameter in Registry, which can be used to execute code in context of the DHCP
  server (restart required)
severity: high
enabled: false
tags:
  mitre:
  - T1574.001
  - T1112
  categories:
  - endpoint
references:
- https://blog.3or.de/mimilib-dhcp-server-callout-dll-injection.html
- https://technet.microsoft.com/en-us/library/cc726884(v=ws.10).aspx
- https://msdn.microsoft.com/de-de/library/windows/desktop/aa363389(v=vs.85).aspx
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|endswith:
    - \Services\DHCPServer\Parameters\CalloutDlls
    - \Services\DHCPServer\Parameters\CalloutEnabled
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 9d3436ef-9476-4c43-acca-90ce06bdf33a
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_dhcp_calloutdll.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
