id: sigmahq-sigma-41ca393d-538c-408a-ac27-cf1e038be80c
name: Directory Removal Via Rmdir
description: 'Detects execution of the builtin "rmdir" command in order to delete
  directories.

  Adversaries may delete files left behind by the actions of their intrusion activity.

  Malware, tools, or other non-native files dropped or created on a system by an adversary
  may leave traces to indicate to what was done within a network and how.

  Removal of these files can occur during an intrusion, or as part of a post-intrusion
  process to minimize the adversary''s footprint.'
severity: low
enabled: false
tags:
  mitre:
  - T1070.004
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1070.004/T1070.004.md
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/erase
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \cmd.exe
  - OriginalFileName: Cmd.Exe
  selection_rmdir:
    CommandLine|contains: rmdir
  selection_flags:
    CommandLine|contains:
    - /s
    - /q
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 41ca393d-538c-408a-ac27-cf1e038be80c
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_cmd_rmdir_execution.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
