id: sigmahq-sigma-b61e87c0-50db-4b2e-8986-6a2be94b33b0
name: Directory Service Restore Mode(DSRM) Registry Value Tampering
description: 'Detects changes to "DsrmAdminLogonBehavior" registry value.

  During a Domain Controller (DC) promotion, administrators create a Directory Services
  Restore Mode (DSRM) local administrator account with a password that rarely changes.
  The DSRM account is an “Administrator” account that logs in with the DSRM mode when
  the server is booting up to restore AD backups or recover the server from a failure.

  Attackers could abuse DSRM account to maintain their persistence and access to the
  organization''s Active Directory.

  If the "DsrmAdminLogonBehavior" value is set to "0", the administrator account can
  only be used if the DC starts in DSRM.

  If the "DsrmAdminLogonBehavior" value is set to "1", the administrator account can
  only be used if the local AD DS service is stopped.

  If the "DsrmAdminLogonBehavior" value is set to "2", the administrator account can
  always be used.'
severity: high
enabled: false
tags:
  mitre:
  - T1556
  categories:
  - endpoint
references:
- https://adsecurity.org/?p=1785
- https://www.sentinelone.com/blog/detecting-dsrm-account-misconfigurations/
- https://book.hacktricks.xyz/windows-hardening/active-directory-methodology/dsrm-credentials
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|endswith: \Control\Lsa\DsrmAdminLogonBehavior
  filter_main_default_value:
    Details: DWORD (0x00000000)
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: b61e87c0-50db-4b2e-8986-6a2be94b33b0
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_dsrm_tampering.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
