id: sigmahq-sigma-ab871450-37dc-4a3a-997f-6662aa8ae0f1
name: Disable Macro Runtime Scan Scope
description: Detects tampering with the MacroRuntimeScanScope registry key to disable
  runtime scanning of enabled macros
severity: high
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://www.microsoft.com/en-us/security/blog/2018/09/12/office-vba-amsi-parting-the-veil-on-malicious-macros/
- https://admx.help/?Category=Office2016&Policy=office16.Office.Microsoft.Policies.Windows::L_MacroRuntimeScanScope
- https://github.com/S3cur3Th1sSh1t/OffensiveVBA/blob/28cc6a2802d8176195ac19b3c8e9a749009a82a3/src/AMSIbypasses.vba
logsource:
  product: windows
  category: registry_set
detection:
  selection:
    TargetObject|contains|all:
    - \SOFTWARE\
    - \Microsoft\Office\
    - \Common\Security
    TargetObject|endswith: \MacroRuntimeScanScope
    Details: DWORD (0x00000000)
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: ab871450-37dc-4a3a-997f-6662aa8ae0f1
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_disable_macroruntimescanscope.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
