id: sigmahq-sigma-60de9b57-dc4d-48b9-a6a0-b39e0469f876
name: Disabling Multi Factor Authentication
description: Detects disabling of Multi Factor Authentication.
severity: high
enabled: false
tags:
  mitre:
  - T1556.006
  categories:
  - cloud
references:
- https://research.splunk.com/cloud/c783dd98-c703-4252-9e8a-f19d9f5c949e/
logsource:
  service: audit
  product: m365
detection:
  selection:
    Operation|contains: Disable Strong Authentication.
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 60de9b57-dc4d-48b9-a6a0-b39e0469f876
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/m365/audit/microsoft365_disabling_mfa.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
