id: sigmahq-sigma-e3a8a052-111f-4606-9aee-f28ebeb76776
name: Disabling Security Tools
description: Detects disabling security tools
severity: medium
enabled: false
tags:
  mitre:
  - T1686
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.004/T1562.004.md
logsource:
  category: process_creation
  product: linux
detection:
  selection_iptables_1:
    Image|endswith: /service
    CommandLine|contains|all:
    - iptables
    - stop
  selection_iptables_2:
    Image|endswith: /service
    CommandLine|contains|all:
    - ip6tables
    - stop
  selection_iptables_3:
    Image|endswith: /chkconfig
    CommandLine|contains|all:
    - iptables
    - stop
  selection_iptables_4:
    Image|endswith: /chkconfig
    CommandLine|contains|all:
    - ip6tables
    - stop
  selection_firewall_1:
    Image|endswith: /systemctl
    CommandLine|contains|all:
    - firewalld
    - stop
  selection_firewall_2:
    Image|endswith: /systemctl
    CommandLine|contains|all:
    - firewalld
    - disable
  selection_carbonblack_1:
    Image|endswith: /service
    CommandLine|contains|all:
    - cbdaemon
    - stop
  selection_carbonblack_2:
    Image|endswith: /chkconfig
    CommandLine|contains|all:
    - cbdaemon
    - 'off'
  selection_carbonblack_3:
    Image|endswith: /systemctl
    CommandLine|contains|all:
    - cbdaemon
    - stop
  selection_carbonblack_4:
    Image|endswith: /systemctl
    CommandLine|contains|all:
    - cbdaemon
    - disable
  selection_selinux:
    Image|endswith: /setenforce
    CommandLine|contains: '0'
  selection_crowdstrike_1:
    Image|endswith: /systemctl
    CommandLine|contains|all:
    - stop
    - falcon-sensor
  selection_crowdstrike_2:
    Image|endswith: /systemctl
    CommandLine|contains|all:
    - disable
    - falcon-sensor
  condition: 1 of selection*
provenance:
  source: SigmaHQ/sigma
  source_id: e3a8a052-111f-4606-9aee-f28ebeb76776
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/process_creation/proc_creation_lnx_security_tools_disabling.yml
falsepositives:
- Legitimate administration activities
notes:
  quarantine_reason: 'upstream status: test'
