id: sigmahq-sigma-9ac94dc8-9042-493c-ba45-3b5e7c86b980
name: Disable Important Scheduled Task
description: Detects when adversaries stop services or processes by disabling their
  respective scheduled tasks in order to conduct data destructive activities
severity: high
enabled: false
tags:
  mitre:
  - T1489
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1490/T1490.md#atomic-test-8---windows---disable-the-sr-scheduled-task
- https://twitter.com/MichalKoczwara/status/1553634816016498688
- https://thedfirreport.com/2021/10/18/icedid-to-xinglocker-ransomware-in-24-hours/
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \schtasks.exe
  - OriginalFileName: schtasks.exe
  selection_cli_disable:
    CommandLine|contains|windash: /disable
  selection_cli_task:
    CommandLine|contains:
    - \Windows\BitLocker
    - \Windows\ExploitGuard
    - \Windows\ExploitGuard\ExploitGuard MDM policy Refresh
    - \Windows\SystemRestore\SR
    - \Windows\UpdateOrchestrator\
    - \Windows\Windows Defender\
    - \Windows\WindowsBackup\
    - \Windows\WindowsUpdate\
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 9ac94dc8-9042-493c-ba45-3b5e7c86b980
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_schtasks_disable.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
