id: sigmahq-sigma-8ffc5407-52e3-478f-9596-0a7371eafe13
name: Disable PUA Protection on Windows Defender
description: Detects disabling Windows Defender PUA protection
severity: high
enabled: false
tags:
  mitre:
  - T1685
  categories:
  - endpoint
references:
- https://www.tenforums.com/tutorials/32236-enable-disable-microsoft-defender-pua-protection-windows-10-a.html
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains: \Policies\Microsoft\Windows Defender\PUAProtection
    Details: DWORD (0x00000000)
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 8ffc5407-52e3-478f-9596-0a7371eafe13
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_disabled_pua_protection_on_microsoft_defender.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
