id: sigmahq-sigma-e4ed6030-ffe5-4e6a-8a8a-ab3c1ab9d94e
name: Disable Windows IIS HTTP Logging
description: Disables HTTP logging on a Windows IIS web server as seen by Threat Group
  3390 (Bronze Union)
severity: high
enabled: false
tags:
  mitre:
  - T1685.001
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.002/T1562.002.md#atomic-test-1---disable-windows-iis-http-logging
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \appcmd.exe
  - OriginalFileName: appcmd.exe
  selection_cli:
    CommandLine|contains|all:
    - set
    - config
    - section:httplogging
    - dontLog:true
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: e4ed6030-ffe5-4e6a-8a8a-ab3c1ab9d94e
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_iis_appcmd_http_logging.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
