id: sigmahq-sigma-2f78da12-f7c7-430b-8b19-a28f269b77a3
name: Disable Windows Event Logging Via Registry
description: Detects tampering with the "Enabled" registry key in order to disable
  Windows logging of a Windows event channel
severity: high
enabled: false
tags:
  mitre:
  - T1685.001
  categories:
  - endpoint
references:
- https://twitter.com/WhichbufferArda/status/1543900539280293889
- https://github.com/DebugPrivilege/CPP/blob/c39d365617dbfbcb01fffad200d52b6239b2918c/Windows%20Defender/RestoreDefenderConfig.cpp
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains: \Microsoft\Windows\CurrentVersion\WINEVT\Channels\
    TargetObject|endswith: \Enabled
    Details: DWORD (0x00000000)
  filter_main_wevutil:
    Image: C:\Windows\system32\wevtutil.exe
  filter_main_iis:
    Image|startswith: C:\Windows\winsxs\
    Image|endswith: \TiWorker.exe
  filter_main_svchost:
    Image: C:\Windows\System32\svchost.exe
    TargetObject|contains:
    - \Microsoft\Windows\CurrentVersion\WINEVT\Channels\Microsoft-Windows-FileInfoMinifilter
    - \Microsoft\Windows\CurrentVersion\WINEVT\Channels\Microsoft-Windows-ASN1\
    - \Microsoft\Windows\CurrentVersion\WINEVT\Channels\Microsoft-Windows-Kernel-AppCompat\
    - \Microsoft\Windows\CurrentVersion\WINEVT\Channels\Microsoft-Windows-Runtime\Error\
    - \Microsoft\Windows\CurrentVersion\WINEVT\Channels\Microsoft-Windows-CAPI2/Operational\
  filter_main_trusted_installer:
    Image: C:\Windows\servicing\TrustedInstaller.exe
    TargetObject|contains: \Microsoft\Windows\CurrentVersion\WINEVT\Channels\Microsoft-Windows-Compat-Appraiser
  filter_optional_empty:
    Image: ''
  filter_optional_null:
    Image: null
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
provenance:
  source: SigmaHQ/sigma
  source_id: 2f78da12-f7c7-430b-8b19-a28f269b77a3
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_disable_winevt_logging.yml
falsepositives:
- Rare falsepositives may occur from legitimate administrators disabling specific
  event log for troubleshooting
notes:
  quarantine_reason: 'upstream status: test'
