id: sigmahq-sigma-115fdba9-f017-42e6-84cf-d5573bf2ddf8
name: Disable of ETW Trace - Powershell
description: Detects usage of powershell cmdlets to disable or remove ETW trace sessions
severity: high
enabled: false
tags:
  mitre:
  - T1070
  - T1685
  categories:
  - endpoint
references:
- https://medium.com/palantir/tampering-with-windows-event-tracing-background-offense-and-defense-4be7ac62ac63
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection_pwsh_remove:
    ScriptBlockText|contains: 'Remove-EtwTraceProvider '
  selection_pwsh_set:
    ScriptBlockText|contains|all:
    - 'Set-EtwTraceProvider '
    - '0x11'
  condition: 1 of selection*
provenance:
  source: SigmaHQ/sigma
  source_id: 115fdba9-f017-42e6-84cf-d5573bf2ddf8
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_etw_trace_evasion.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
