id: sigmahq-sigma-e78c408a-e2ea-43cd-b5ea-51975cf358c0
name: Disable Windows Firewall by Registry
description: Detect set EnableFirewall to 0 to disable the Windows firewall
severity: medium
enabled: false
tags:
  mitre:
  - T1686.003
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1562.004/T1562.004.md
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|endswith:
    - \SOFTWARE\Policies\Microsoft\WindowsFirewall\StandardProfile\EnableFirewall
    - \SOFTWARE\Policies\Microsoft\WindowsFirewall\DomainProfile\EnableFirewall
    Details: DWORD (0x00000000)
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: e78c408a-e2ea-43cd-b5ea-51975cf358c0
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_disable_windows_firewall.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
