id: sigmahq-sigma-0eb46774-f1ab-4a74-8238-1155855f2263
name: Disable Windows Defender Functionalities Via Registry Keys
description: Detects when attackers or tools disable Windows Defender functionalities
  via the Windows registry
severity: high
enabled: false
tags:
  mitre:
  - T1685
  categories:
  - endpoint
references:
- https://thedfirreport.com/2021/10/18/icedid-to-xinglocker-ransomware-in-24-hours/
- https://gist.github.com/anadr/7465a9fde63d41341136949f14c21105
- https://admx.help/?Category=Windows_7_2008R2&Policy=Microsoft.Policies.WindowsDefender::SpyNetReporting
- https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/ransomware-hive-conti-avoslocker
- https://www.tenforums.com/tutorials/32236-enable-disable-microsoft-defender-pua-protection-windows-10-a.html
- https://www.tenforums.com/tutorials/105533-enable-disable-windows-defender-exploit-protection-settings.html
- https://www.tenforums.com/tutorials/123792-turn-off-tamper-protection-microsoft-defender-antivirus.html
- https://securelist.com/key-group-ransomware-samples-and-telegram-schemes/114025/
logsource:
  product: windows
  category: registry_set
detection:
  selection_main:
    TargetObject|contains:
    - \SOFTWARE\Microsoft\Windows Defender\
    - \SOFTWARE\Policies\Microsoft\Windows Defender Security Center\
    - \SOFTWARE\Policies\Microsoft\Windows Defender\
  selection_dword_1:
    TargetObject|endswith:
    - \DisableAntiSpyware
    - \DisableAntiVirus
    - \DisableBehaviorMonitoring
    - \DisableBlockAtFirstSeen
    - \DisableEnhancedNotifications
    - \DisableIntrusionPreventionSystem
    - \DisableIOAVProtection
    - \DisableOnAccessProtection
    - \DisableRealtimeMonitoring
    - \DisableScanOnRealtimeEnable
    - \DisableScriptScanning
    Details: DWORD (0x00000001)
  selection_dword_0:
    TargetObject|endswith:
    - \DisallowExploitProtectionOverride
    - \Features\TamperProtection
    - \MpEngine\MpEnablePus
    - \PUAProtection
    - \Signature Update\ForceUpdateFromMU
    - \SpyNet\SpynetReporting
    - \SpyNet\SubmitSamplesConsent
    - \Windows Defender Exploit Guard\Controlled Folder Access\EnableControlledFolderAccess
    Details: DWORD (0x00000000)
  filter_optional_symantec:
    Image|startswith: C:\Program Files\Symantec\Symantec Endpoint Protection\
    Image|endswith: \sepWscSvc64.exe
  condition: selection_main and 1 of selection_dword_* and not 1 of filter_optional_*
provenance:
  source: SigmaHQ/sigma
  source_id: 0eb46774-f1ab-4a74-8238-1155855f2263
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_windows_defender_tamper.yml
falsepositives:
- Administrator actions via the Windows Defender interface
- Third party Antivirus
notes:
  quarantine_reason: 'upstream status: test'
