id: sigmahq-sigma-99c4658d-2c5e-4d87-828d-7c066ca537c3
name: Disable-WindowsOptionalFeature Command PowerShell
description: 'Detect built in PowerShell cmdlet Disable-WindowsOptionalFeature, Deployment
  Image Servicing and Management tool.

  Similar to DISM.exe, this cmdlet is used to enumerate, install, uninstall, configure,
  and update features and packages in Windows images'
severity: high
enabled: false
tags:
  mitre:
  - T1685
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/5b67c9b141fa3918017f8fa44f2f88f0b1ecb9e1/atomics/T1562.001/T1562.001.md
- https://learn.microsoft.com/en-us/powershell/module/dism/disable-windowsoptionalfeature?view=windowsserver2022-ps
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection_cmd:
    ScriptBlockText|contains|all:
    - Disable-WindowsOptionalFeature
    - -Online
    - -FeatureName
  selection_feature:
    ScriptBlockText|contains:
    - Windows-Defender-Gui
    - Windows-Defender-Features
    - Windows-Defender
    - Windows-Defender-ApplicationGuard
  condition: all of selection*
provenance:
  source: SigmaHQ/sigma
  source_id: 99c4658d-2c5e-4d87-828d-7c066ca537c3
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_disable_windows_optional_feature.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
