id: sigmahq-sigma-fb50eb7a-5ab1-43ae-bcc9-091818cb8424
name: Disabled IE Security Features
description: Detects command lines that indicate unwanted modifications to registry
  keys that disable important Internet Explorer security features
severity: high
enabled: false
tags:
  mitre:
  - T1685
  categories:
  - endpoint
references:
- https://unit42.paloaltonetworks.com/operation-ke3chang-resurfaces-with-new-tidepool-malware/
logsource:
  category: process_creation
  product: windows
detection:
  selection1:
    CommandLine|contains|all:
    - ' -name IEHarden '
    - ' -value 0 '
  selection2:
    CommandLine|contains|all:
    - ' -name DEPOff '
    - ' -value 1 '
  selection3:
    CommandLine|contains|all:
    - ' -name DisableFirstRunCustomize '
    - ' -value 2 '
  condition: 1 of selection*
provenance:
  source: SigmaHQ/sigma
  source_id: fb50eb7a-5ab1-43ae-bcc9-091818cb8424
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_powershell_disable_ie_features.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
