id: sigmahq-sigma-a7ee1722-c3c5-aeff-3212-c777e4733217
name: Disable Windows Defender AV Security Monitoring
description: Detects attackers attempting to disable Windows Defender using Powershell
severity: high
enabled: false
tags:
  mitre:
  - T1685
  categories:
  - endpoint
references:
- https://research.nccgroup.com/2020/06/23/wastedlocker-a-new-ransomware-variant-developed-by-the-evil-corp-group/
- https://rvsec0n.wordpress.com/2020/01/24/malwares-that-bypass-windows-defender/
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md
logsource:
  category: process_creation
  product: windows
detection:
  selection_pwsh_binary:
  - Image|endswith:
    - \powershell.exe
    - \pwsh.exe
  - OriginalFileName:
    - PowerShell.EXE
    - pwsh.dll
  selection_pwsh_cli:
    CommandLine|contains:
    - -DisableBehaviorMonitoring $true
    - -DisableRuntimeMonitoring $true
  selection_sc_binary:
  - Image|endswith: \sc.exe
  - OriginalFileName: sc.exe
  selection_sc_tamper_cmd_stop:
    CommandLine|contains|all:
    - stop
    - WinDefend
  selection_sc_tamper_cmd_delete:
    CommandLine|contains|all:
    - delete
    - WinDefend
  selection_sc_tamper_cmd_disabled:
    CommandLine|contains|all:
    - config
    - WinDefend
    - start=disabled
  condition: all of selection_pwsh_* or (selection_sc_binary and 1 of selection_sc_tamper_*)
provenance:
  source: SigmaHQ/sigma
  source_id: a7ee1722-c3c5-aeff-3212-c777e4733217
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_powershell_disable_defender_av_security_monitoring.yml
falsepositives:
- Minimal, for some older versions of dev tools, such as pycharm, developers were
  known to sometimes disable Windows Defender to improve performance, but this generally
  is not considered a good security practice.
notes:
  quarantine_reason: 'upstream status: test'
