id: sigmahq-sigma-b243b280-65fe-48df-ba07-6ddea7646427
name: Discovery of a System Time
description: Identifies use of various commands to query a systems time. This technique
  may be used before executing a scheduled task or to discover the time zone of a
  target system.
severity: low
enabled: false
tags:
  mitre:
  - T1124
  categories:
  - endpoint
references:
- https://eqllib.readthedocs.io/en/latest/analytics/fcdb99c2-ac3c-4bde-b664-4b336329bed2.html
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1124/T1124.md
logsource:
  category: process_creation
  product: windows
detection:
  selection_time:
    Image|endswith:
    - \net.exe
    - \net1.exe
    CommandLine|contains: time
  selection_w32tm:
    Image|endswith: \w32tm.exe
    CommandLine|contains: tz
  condition: 1 of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: b243b280-65fe-48df-ba07-6ddea7646427
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_remote_time_discovery.yml
falsepositives:
- Legitimate use of the system utilities to discover system time for legitimate reason
notes:
  quarantine_reason: 'upstream status: test'
