id: sigmahq-sigma-1dde5376-a648-492e-9e54-4241dd9b0c7f
name: Diskshadow Script Mode - Uncommon Script Extension Execution
description: 'Detects execution of "Diskshadow.exe" in script mode to execute an script
  with a potentially uncommon extension.

  Initial baselining of the allowed extension list is required.'
severity: medium
enabled: false
tags:
  mitre:
  - T1218
  categories:
  - endpoint
references:
- https://bohops.com/2018/03/26/diskshadow-the-return-of-vss-evasion-persistence-and-active-directory-database-extraction/
- https://www.ired.team/offensive-security/credential-access-and-credential-dumping/ntds.dit-enumeration
- https://medium.com/@cyberjyot/lolbin-execution-via-diskshadow-f6ff681a27a4
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/diskshadow
- https://www.lifars.com/wp-content/uploads/2022/01/GriefRansomware_Whitepaper-2.pdf
- https://www.zscaler.com/blogs/security-research/technical-analysis-crytox-ransomware
- https://research.checkpoint.com/2022/evilplayout-attack-against-irans-state-broadcaster/
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - OriginalFileName: diskshadow.exe
  - Image|endswith: \diskshadow.exe
  selection_flag:
    CommandLine|contains|windash: '-s '
  filter_main_ext:
    CommandLine|contains: .txt
  condition: all of selection_* and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 1dde5376-a648-492e-9e54-4241dd9b0c7f
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_diskshadow_script_mode_susp_ext.yml
falsepositives:
- False postitve might occur with legitimate or uncommon extensions used internally.
  Initial baseline is required.
notes:
  quarantine_reason: 'upstream status: test'
