id: sigmahq-sigma-75e508f7-932d-4ebc-af77-269237a84ce1
name: DLL Loaded From Suspicious Location Via Cmspt.EXE
description: Detects cmstp loading "dll" or "ocx" files from suspicious locations
severity: high
enabled: false
tags:
  mitre:
  - T1218.003
  categories:
  - endpoint
references:
- https://github.com/vadim-hunter/Detection-Ideas-Rules/blob/02bcbfc2bfb8b4da601bb30de0344ae453aa1afe/TTPs/Defense%20Evasion/T1218%20-%20Signed%20Binary%20Proxy%20Execution/T1218.003%20-%20CMSTP/Procedures.yaml
logsource:
  category: image_load
  product: windows
detection:
  selection:
    Image|endswith: \cmstp.exe
    ImageLoaded|contains:
    - \PerfLogs\
    - \ProgramData\
    - \Users\
    - \Windows\Temp\
    - C:\Temp\
    ImageLoaded|endswith:
    - .dll
    - .ocx
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 75e508f7-932d-4ebc-af77-269237a84ce1
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/image_load/image_load_cmstp_load_dll_from_susp_location.yml
falsepositives:
- Unikely
notes:
  quarantine_reason: 'upstream status: test'
