id: sigmahq-sigma-9e9a9002-56c4-40fd-9eff-e4b09bfa5f6c
name: DLL Load By System Process From Suspicious Locations
description: Detects when a system process (i.e. located in system32, syswow64, etc.)
  loads a DLL from a suspicious location or a location with permissive permissions
  such as "C:\Users\Public"
severity: medium
enabled: false
tags:
  mitre:
  - T1070
  categories:
  - endpoint
references:
- https://github.com/hackerhouse-opensource/iscsicpl_bypassUAC (Idea)
logsource:
  product: windows
  category: image_load
detection:
  selection:
    Image|startswith: C:\Windows\
    ImageLoaded|startswith:
    - C:\Users\Public\
    - C:\PerfLogs\
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 9e9a9002-56c4-40fd-9eff-e4b09bfa5f6c
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/image_load/image_load_susp_dll_load_system_process.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
