id: sigmahq-sigma-b6f91281-20aa-446a-b986-38a92813a18f
name: DLL Search Order Hijackig Via Additional Space in Path
description: 'Detects when an attacker create a similar folder structure to windows
  system folders such as (Windows, Program Files...)

  but with a space in order to trick DLL load search order and perform a "DLL Search
  Order Hijacking" attack'
severity: high
enabled: false
tags:
  mitre:
  - T1574.001
  categories:
  - endpoint
references:
- https://twitter.com/cyb3rops/status/1552932770464292864
- https://www.wietzebeukema.nl/blog/hijacking-dlls-in-windows
logsource:
  category: file_event
  product: windows
detection:
  selection:
    TargetFilename|startswith:
    - C:\Windows \
    - C:\Program Files \
    - C:\Program Files (x86) \
    TargetFilename|endswith: .dll
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: b6f91281-20aa-446a-b986-38a92813a18f
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_dll_sideloading_space_path.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
