id: sigmahq-sigma-ebea773c-a8f1-42ad-a856-00cb221966e8
name: DLL Sideloading by VMware Xfer Utility
description: Detects execution of VMware Xfer utility (VMwareXferlogs.exe) from the
  non-default directory which may be an attempt to sideload arbitrary DLL
severity: high
enabled: false
tags:
  mitre:
  - T1574.001
  categories:
  - endpoint
references:
- https://www.sentinelone.com/labs/lockbit-ransomware-side-loads-cobalt-strike-beacon-with-legitimate-vmware-utility/
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image|endswith: \VMwareXferlogs.exe
  filter:
    Image|startswith: C:\Program Files\VMware\
  condition: selection and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: ebea773c-a8f1-42ad-a856-00cb221966e8
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_dll_sideload_vmware_xfer.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
