id: sigmahq-sigma-cd3d1298-eb3b-476c-ac67-12847de55813
name: DLL Execution via Rasautou.exe
description: Detects using Rasautou.exe for loading arbitrary .DLL specified in -d
  option and executes the export specified in -p.
severity: medium
enabled: false
tags:
  mitre:
  - T1218
  categories:
  - endpoint
references:
- https://lolbas-project.github.io/lolbas/Binaries/Rasautou/
- https://github.com/fireeye/DueDLLigence
- https://www.fireeye.com/blog/threat-research/2019/10/staying-hidden-on-the-endpoint-evading-detection-with-shellcode.html
logsource:
  product: windows
  category: process_creation
  definition: Since options '-d' and '-p' were removed in Windows 10 this rule is
    relevant only for Windows before 10. And as Windows 7 doesn't log command line
    in 4688 by default, to detect this attack you need Sysmon 1 configured or KB3004375
    installed for command-line auditing (https://support.microsoft.com/en-au/help/3004375/microsoft-security-advisory-update-to-improve-windows-command-line-aud)
detection:
  selection_img:
  - Image|endswith: \rasautou.exe
  - OriginalFileName: rasdlui.exe
  selection_cli:
    CommandLine|contains|all:
    - ' -d '
    - ' -p '
  condition: all of selection*
provenance:
  source: SigmaHQ/sigma
  source_id: cd3d1298-eb3b-476c-ac67-12847de55813
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_lolbin_rasautou_dll_execution.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
