id: sigmahq-sigma-ee4c5d06-3abc-48cc-8885-77f1c20f4451
name: DLL Sideloading Of ShellChromeAPI.DLL
description: 'Detects processes loading the non-existent DLL "ShellChromeAPI". One
  known example is the "DeviceEnroller" binary in combination with the "PhoneDeepLink"
  flag tries to load this DLL.

  Adversaries can drop their own renamed DLL and execute it via DeviceEnroller.exe
  using this parameter'
severity: high
enabled: false
tags:
  mitre:
  - T1574.001
  categories:
  - endpoint
references:
- https://mobile.twitter.com/0gtweet/status/1564131230941122561
- https://strontic.github.io/xcyclopedia/library/DeviceEnroller.exe-24BEF0D6B0ECED36BB41831759FDE18D.html
logsource:
  category: image_load
  product: windows
detection:
  selection:
    ImageLoaded|endswith: \ShellChromeAPI.dll
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: ee4c5d06-3abc-48cc-8885-77f1c20f4451
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/image_load/image_load_side_load_shell_chrome_api.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
