id: sigmahq-sigma-84f52741-8834-4a8c-a413-2eb2269aa6c8
name: DllUnregisterServer Function Call Via Msiexec.EXE
description: Detects MsiExec loading a DLL and calling its DllUnregisterServer function
severity: medium
enabled: false
tags:
  mitre:
  - T1218.007
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218.007/T1218.007.md
- https://lolbas-project.github.io/lolbas/Binaries/Msiexec/
- https://twitter.com/_st0pp3r_/status/1583914515996897281
logsource:
  product: windows
  category: process_creation
detection:
  selection_img:
  - Image|endswith: \msiexec.exe
  - OriginalFileName: \msiexec.exe
  selection_flag:
    CommandLine|contains|windash: ' -z '
  selection_dll:
    CommandLine|contains: .dll
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 84f52741-8834-4a8c-a413-2eb2269aa6c8
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_msiexec_dll.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
