id: sigmahq-sigma-02122374-b74e-495c-b285-9e4da973f3d6
name: DMSA Service Account Created in Specific OUs - PowerShell
description: 'Detects the creation of a dMSA service account using the New-ADServiceAccount
  cmdlet in certain OUs.

  The fact that the cmdlet is used to create a dMSASvc account in a specific OU is
  highly suspicious.

  It is a pattern trying to exploit the BadSuccessor privilege escalation vulnerability
  in Windows Server 2025.

  On top of that, if the user that is creating the dMSASvc account is not a legitimate
  administrator or does not have the necessary permissions,

  it is a strong signal of an attempted or successful abuse of the BaDSuccessor vulnerability
  for privilege escalation within the Windows Server 2025 Active Directory environment.'
severity: medium
enabled: false
tags:
  mitre:
  - T1078.002
  - T1098
  categories:
  - endpoint
references:
- https://www.akamai.com/blog/security-research/abusing-bad-successor-for-privilege-escalation-in-active-directory
logsource:
  category: ps_script
  product: windows
detection:
  selection:
    ScriptBlockText|contains|all:
    - New-ADServiceAccount
    - -CreateDelegatedServiceAccount
    - -path
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 02122374-b74e-495c-b285-9e4da973f3d6
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_create_new_dmsasvc_account.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: experimental'
