id: sigmahq-sigma-b3e6418f-7c7a-4fad-993a-93b65027a9f1
name: DNS Query To Visual Studio Code Tunnels Domain
description: Detects DNS query requests to Visual Studio Code tunnel domains. Attackers
  can abuse that feature to establish a reverse shell or persistence on a machine.
severity: medium
enabled: false
tags:
  mitre:
  - T1071.001
  categories:
  - endpoint
references:
- https://ipfyx.fr/post/visual-studio-code-tunnel/
- https://badoption.eu/blog/2023/01/31/code_c2.html
- https://cydefops.com/vscode-data-exfiltration
logsource:
  product: windows
  category: dns_query
detection:
  selection:
    QueryName|endswith: .tunnels.api.visualstudio.com
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: b3e6418f-7c7a-4fad-993a-93b65027a9f1
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/dns_query/dns_query_win_vscode_tunnel_communication.yml
falsepositives:
- Legitimate use of Visual Studio Code tunnel will also trigger this.
notes:
  quarantine_reason: 'upstream status: test'
