id: sigmahq-sigma-36e037c4-c228-4866-b6a3-48eb292b9955
name: DNS Query Request By Regsvr32.EXE
description: Detects DNS queries initiated by "Regsvr32.exe"
severity: medium
enabled: false
tags:
  mitre:
  - T1559.001
  - T1218.010
  categories:
  - endpoint
references:
- https://pentestlab.blog/2017/05/11/applocker-bypass-regsvr32/
- https://oddvar.moe/2017/12/13/applocker-case-study-how-insecure-is-it-really-part-1/
logsource:
  category: dns_query
  product: windows
detection:
  selection:
    Image|endswith: \regsvr32.exe
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 36e037c4-c228-4866-b6a3-48eb292b9955
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/dns_query/dns_query_win_regsvr32_dns_query.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
