id: sigmahq-sigma-cbe51394-cd93-4473-b555-edf0144952d9
name: DNS Server Error Failed Loading the ServerLevelPluginDLL
description: Detects a DNS server error in which a specified plugin DLL (in registry)
  could not be loaded
severity: high
enabled: false
tags:
  mitre:
  - T1574.001
  categories:
  - endpoint
references:
- https://medium.com/@esnesenon/feature-not-bug-dnsadmin-to-dc-compromise-in-one-line-a0f779b8dc83
- https://technet.microsoft.com/en-us/library/cc735829(v=ws.10).aspx
- https://twitter.com/gentilkiwi/status/861641945944391680
logsource:
  product: windows
  service: dns-server
detection:
  selection:
    EventID:
    - 150
    - 770
    - 771
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: cbe51394-cd93-4473-b555-edf0144952d9
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/dns_server/win_dns_server_susp_server_level_plugin_dll.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
