id: sigmahq-sigma-a21bcd7e-38ec-49ad-b69a-9ea17e69509e
name: DNS Server Discovery Via LDAP Query
description: Detects DNS server discovery via LDAP query requests from uncommon applications
severity: low
enabled: false
tags:
  mitre:
  - T1482
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/980f3f83fd81f37c1ca9c02dccfd1c3d9f9d0841/atomics/T1016/T1016.md#atomic-test-9---dns-server-discovery-using-nslookup
- https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-adts/7fcdce70-5205-44d6-9c3a-260e616a2f04
logsource:
  product: windows
  category: dns_query
detection:
  selection:
    QueryName|startswith: _ldap.
  filter_main_generic:
    Image|contains:
    - :\Program Files\
    - :\Program Files (x86)\
    - :\Windows\
  filter_main_defender:
    Image|contains: :\ProgramData\Microsoft\Windows Defender\Platform\
    Image|endswith: \MsMpEng.exe
  filter_main_unknown:
    Image: <unknown process>
  filter_optional_azure:
    Image|startswith: C:\WindowsAzure\GuestAgent
  filter_main_null:
    Image: null
  filter_optional_browsers:
    Image|endswith:
    - \chrome.exe
    - \firefox.exe
    - \opera.exe
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
provenance:
  source: SigmaHQ/sigma
  source_id: a21bcd7e-38ec-49ad-b69a-9ea17e69509e
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/dns_query/dns_query_win_dns_server_discovery_via_ldap_query.yml
falsepositives:
- Likely
notes:
  quarantine_reason: 'upstream status: test'
