id: sigmahq-sigma-66474410-b883-415f-9f8d-75345a0a66a6
name: DNS Query To MEGA Hosting Website - DNS Client
description: Detects DNS queries for subdomains related to MEGA sharing website
severity: medium
enabled: false
tags:
  mitre:
  - T1567.002
  categories:
  - endpoint
references:
- https://research.nccgroup.com/2021/05/27/detecting-rclone-an-effective-tool-for-exfiltration/
logsource:
  product: windows
  service: dns-client
  definition: 'Requirements: Microsoft-Windows-DNS Client Events/Operational Event
    Log must be enabled/collected in order to receive the events.'
detection:
  selection:
    EventID: 3008
    QueryName|contains: userstorage.mega.co.nz
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 66474410-b883-415f-9f8d-75345a0a66a6
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/dns_client/win_dns_client_mega_nz.yml
falsepositives:
- Legitimate DNS queries and usage of Mega
notes:
  quarantine_reason: 'upstream status: test'
