id: sigmahq-sigma-cf610c15-ed71-46e1-bdf8-2bd1a99de6c4
name: Download File To Potentially Suspicious Directory Via Wget
description: Detects the use of wget to download content to a suspicious directory
severity: medium
enabled: false
tags:
  mitre:
  - T1105
  categories:
  - endpoint
references:
- https://blogs.jpcert.or.jp/en/2023/05/gobrat.html
- https://jstnk9.github.io/jstnk9/research/GobRAT-Malware/
- https://www.virustotal.com/gui/file/60bcd645450e4c846238cf0e7226dc40c84c96eba99f6b2cffcd0ab4a391c8b3/detection
- https://www.virustotal.com/gui/file/3e44c807a25a56f4068b5b8186eee5002eed6f26d665a8b791c472ad154585d1/detection
logsource:
  category: process_creation
  product: linux
detection:
  selection_img:
    Image|endswith: /wget
  selection_output:
  - CommandLine|re: \s-O\s
  - CommandLine|contains: --output-document
  selection_path:
    CommandLine|contains: /tmp/
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: cf610c15-ed71-46e1-bdf8-2bd1a99de6c4
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/process_creation/proc_creation_lnx_wget_download_suspicious_directory.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
