id: sigmahq-sigma-7892ec59-c5bb-496d-8968-e5d210ca3ac4
name: DPAPI Backup Keys And Certificate Export Activity IOC
description: Detects file names with specific patterns seen generated and used by
  tools such as Mimikatz and DSInternals related to exported or stolen DPAPI backup
  keys and certificates.
severity: high
enabled: false
tags:
  mitre:
  - T1555
  - T1552.004
  categories:
  - endpoint
references:
- https://www.dsinternals.com/en/dpapi-backup-key-theft-auditing/
- https://github.com/MichaelGrafnetter/DSInternals/blob/39ee8a69bbdc1cfd12c9afdd7513b4788c4895d4/Src/DSInternals.Common/Data/DPAPI/DPAPIBackupKey.cs#L28-L32
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename|contains:
    - ntds_capi_
    - ntds_legacy_
    - ntds_unknown_
    TargetFilename|endswith:
    - .cer
    - .key
    - .pfx
    - .pvk
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 7892ec59-c5bb-496d-8968-e5d210ca3ac4
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_susp_dpapi_backup_and_cert_export_ioc.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
