id: sigmahq-sigma-a20def93-0709-4eae-9bd2-31206e21e6b2
name: DriverQuery.EXE Execution
description: Detect usage of the "driverquery" utility. Which can be used to perform
  reconnaissance on installed drivers
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://thedfirreport.com/2023/01/09/unwrapping-ursnifs-gifts/
- https://www.vmray.com/cyber-security-blog/analyzing-ursnif-behavior-malware-sandbox/
- https://www.fireeye.com/blog/threat-research/2020/01/saigon-mysterious-ursnif-fork.html
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Image|endswith: driverquery.exe
  - OriginalFileName: drvqry.exe
  filter_main_other:
  - ParentImage|endswith:
    - \cscript.exe
    - \mshta.exe
    - \regsvr32.exe
    - \rundll32.exe
    - \wscript.exe
  - ParentImage|contains:
    - \AppData\Local\
    - \Users\Public\
    - \Windows\Temp\
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: a20def93-0709-4eae-9bd2-31206e21e6b2
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_driverquery_usage.yml
falsepositives:
- Legitimate use by third party tools in order to investigate installed drivers
notes:
  quarantine_reason: 'upstream status: test'
