id: sigmahq-sigma-555155a2-03bf-4fe7-af74-d176b3fdbe16
name: Driver Added To Disallowed Images In HVCI - Registry
description: Detects changes to the "HVCIDisallowedImages" registry value to potentially
  add a driver to the list, in order to prevent it from loading.
severity: high
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://github.com/yardenshafir/conference_talks/blob/3de1f5d7c02656c35117f067fbff0a219c304b09/OffensiveCon_2023_Your_Mitigations_are_My_Opportunities.pdf
- https://x.com/yarden_shafir/status/1822667605175324787
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains|all:
    - \Control\CI\
    - \HVCIDisallowedImages
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 555155a2-03bf-4fe7-af74-d176b3fdbe16
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_hvci_disallowed_images.yml
falsepositives:
- Legitimate usage of this key would also trigger this. Investigate the driver being
  added and make sure its intended
notes:
  quarantine_reason: 'upstream status: test'
