id: sigmahq-sigma-b7966f4a-b333-455b-8370-8ca53c229762
name: Dropping Of Password Filter DLL
description: Detects dropping of dll files in system32 that may be used to retrieve
  user credentials from LSASS
severity: medium
enabled: false
tags:
  mitre:
  - T1556.002
  categories:
  - endpoint
references:
- https://pentestlab.blog/2020/02/10/credential-access-password-filter-dll/
- https://github.com/3gstudent/PasswordFilter/tree/master/PasswordFilter
logsource:
  category: process_creation
  product: windows
detection:
  selection_cmdline:
    CommandLine|contains|all:
    - HKLM\SYSTEM\CurrentControlSet\Control\Lsa
    - scecli\0*
    - reg add
  condition: selection_cmdline
provenance:
  source: SigmaHQ/sigma
  source_id: b7966f4a-b333-455b-8370-8ca53c229762
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_reg_credential_access_via_password_filter.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
