id: sigmahq-sigma-4f647cfa-b598-4e12-ad69-c68dd16caef8
name: DumpStack.log Defender Evasion
description: Detects the use of the filename DumpStack.log to evade Microsoft Defender
severity: critical
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://twitter.com/mrd0x/status/1479094189048713219
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: \DumpStack.log
  selection_download:
    CommandLine|contains: ' -o DumpStack.log'
  condition: 1 of selection*
provenance:
  source: SigmaHQ/sigma
  source_id: 4f647cfa-b598-4e12-ad69-c68dd16caef8
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_susp_dumpstack_log_evasion.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
