id: sigmahq-sigma-fd877b94-9bb5-4191-bb25-d79cbd93c167
name: Dumping of Sensitive Hives Via Reg.EXE
description: Detects the usage of "reg.exe" in order to dump sensitive registry hives.
  This includes SAM, SYSTEM and SECURITY hives.
severity: high
enabled: false
tags:
  mitre:
  - T1003.002
  - T1003.004
  - T1003.005
  categories:
  - endpoint
references:
- https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
- https://eqllib.readthedocs.io/en/latest/analytics/aed95fc6-5e3f-49dc-8b35-06508613f979.html
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1003/T1003.md
- https://www.wietzebeukema.nl/blog/windows-command-line-obfuscation
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1003.002/T1003.002.md#atomic-test-1---registry-dump-of-sam-creds-and-secrets
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \reg.exe
  - OriginalFileName: reg.exe
  selection_cli_flag:
    CommandLine|contains:
    - ' save '
    - ' export '
    - ' ˢave '
    - ' eˣport '
  selection_cli_hklm:
    CommandLine|contains:
    - hklm
    - hk˪m
    - hkey_local_machine
    - hkey_˪ocal_machine
    - hkey_loca˪_machine
    - hkey_˪oca˪_machine
  selection_cli_hive:
    CommandLine|contains:
    - \system
    - \sam
    - \security
    - \ˢystem
    - \syˢtem
    - \ˢyˢtem
    - \ˢam
    - \ˢecurity
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: fd877b94-9bb5-4191-bb25-d79cbd93c167
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_reg_dumping_sensitive_hives.yml
falsepositives:
- Dumping hives for legitimate purpouse i.e. backup or forensic investigation
notes:
  quarantine_reason: 'upstream status: test'
