id: sigmahq-sigma-99c49d9c-34ea-45f7-84a7-4751ae6b2cbc
name: Dump Credentials from Windows Credential Manager With PowerShell
description: 'Adversaries may search for common password storage locations to obtain
  user credentials.

  Passwords are stored in several places on a system, depending on the operating system
  or application holding the credentials.'
severity: medium
enabled: false
tags:
  mitre:
  - T1555
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1555/T1555.md
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection_kiddie:
    ScriptBlockText|contains:
    - Get-PasswordVaultCredentials
    - Get-CredManCreds
  selection_rename_Password:
    ScriptBlockText|contains|all:
    - New-Object
    - Windows.Security.Credentials.PasswordVault
  selection_rename_credman:
    ScriptBlockText|contains|all:
    - New-Object
    - Microsoft.CSharp.CSharpCodeProvider
    - '[System.Runtime.InteropServices.RuntimeEnvironment]::GetRuntimeDirectory())'
    - Collections.ArrayList
    - System.CodeDom.Compiler.CompilerParameters
  condition: 1 of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 99c49d9c-34ea-45f7-84a7-4751ae6b2cbc
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_dump_password_windows_credential_manager.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
