id: sigmahq-sigma-312d0384-401c-4b8b-abdf-685ffba9a332
name: Email Exifiltration Via Powershell
description: Detects email exfiltration via powershell cmdlets
severity: high
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://www.microsoft.com/security/blog/2022/09/07/profiling-dev-0270-phosphorus-ransomware-operations/
- https://github.com/Azure/Azure-Sentinel/blob/7e6aa438e254d468feec061618a7877aa528ee9f/Hunting%20Queries/Microsoft%20365%20Defender/Ransomware/DEV-0270/Email%20data%20exfiltration%20via%20PowerShell.yaml
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith:
    - \powershell.exe
    - \pwsh.exe
    CommandLine|contains|all:
    - Add-PSSnapin
    - Get-Recipient
    - -ExpandProperty
    - EmailAddresses
    - SmtpAddress
    - -hidetableheaders
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 312d0384-401c-4b8b-abdf-685ffba9a332
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_powershell_email_exfil.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
