id: sigmahq-sigma-311b6ce2-7890-4383-a8c2-663a9f6b43cd
name: Enabled User Right in AD to Control User Objects
description: Detects scenario where if a user is assigned the SeEnableDelegationPrivilege
  right in Active Directory it would allow control of other AD user objects.
severity: high
enabled: false
tags:
  mitre:
  - T1098
  categories:
  - endpoint
references:
- https://blog.harmj0y.net/activedirectory/the-most-dangerous-user-right-you-probably-have-never-heard-of/
logsource:
  product: windows
  service: security
  definition: 'Requirements: Audit Policy : Policy Change > Audit Authorization Policy
    Change, Group Policy : Computer Configuration\Windows Settings\Security Settings\Advanced
    Audit Policy Configuration\Audit Policies\Policy Change\Audit Authorization Policy
    Change'
detection:
  selection_base:
    EventID: 4704
  selection_keywords:
    PrivilegeList|contains: SeEnableDelegationPrivilege
  condition: all of selection*
provenance:
  source: SigmaHQ/sigma
  source_id: 311b6ce2-7890-4383-a8c2-663a9f6b43cd
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/security/win_security_alert_active_directory_user_control.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
