id: sigmahq-sigma-ad89044a-8f49-4673-9a55-cbd88a1b374f
name: Enabling COR Profiler Environment Variables
description: Detects .NET Framework CLR and .NET Core CLR "cor_enable_profiling" and
  "cor_profiler" variables being set and configured.
severity: medium
enabled: false
tags:
  mitre:
  - T1574.012
  categories:
  - endpoint
references:
- https://twitter.com/jamieantisocial/status/1304520651248668673
- https://www.slideshare.net/JamieWilliams130/started-from-the-bottom-exploiting-data-sources-to-uncover-attck-behaviors
- https://www.sans.org/cyber-security-summit/archives
- https://learn.microsoft.com/en-us/dotnet/core/runtime-config/debugging-profiling
logsource:
  category: registry_set
  product: windows
detection:
  selection_1:
    TargetObject|endswith:
    - \COR_ENABLE_PROFILING
    - \COR_PROFILER
    - \CORECLR_ENABLE_PROFILING
  selection_2:
    TargetObject|contains: \CORECLR_PROFILER_PATH
  condition: 1 of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: ad89044a-8f49-4673-9a55-cbd88a1b374f
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_enabling_cor_profiler_env_variables.yml
notes:
  quarantine_reason: 'upstream status: test'
