id: sigmahq-sigma-4d431012-2ab5-4db7-a84e-b29809da2172
name: Enable Remote Connection Between Anonymous Computer - AllowAnonymousCallback
description: Detects enabling of the "AllowAnonymousCallback" registry value, which
  allows a remote connection between computers that do not have a trust relationship.
severity: medium
enabled: false
tags:
  mitre:
  - T1685
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/windows/win32/wmisdk/connecting-to-wmi-remotely-starting-with-vista
logsource:
  product: windows
  category: registry_set
detection:
  selection:
    TargetObject|contains: \Microsoft\WBEM\CIMOM\AllowAnonymousCallback
    Details: DWORD (0x00000001)
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 4d431012-2ab5-4db7-a84e-b29809da2172
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_event/registry_set_enable_anonymous_connection.yml
falsepositives:
- Administrative activity
notes:
  quarantine_reason: 'upstream status: test'
