id: sigmahq-sigma-991a9744-f2f0-44f2-bd33-9092eba17dc3
name: Enable Windows Remote Management
description: Adversaries may use Valid Accounts to interact with remote systems using
  Windows Remote Management (WinRM). The adversary may then perform actions as the
  logged-on user.
severity: medium
enabled: false
tags:
  mitre:
  - T1021.006
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1021.006/T1021.006.md#atomic-test-1---enable-windows-remote-management
- https://learn.microsoft.com/en-us/powershell/module/microsoft.powershell.core/enable-psremoting?view=powershell-7.2
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection_cmdlet:
    ScriptBlockText|contains: 'Enable-PSRemoting '
  condition: selection_cmdlet
provenance:
  source: SigmaHQ/sigma
  source_id: 991a9744-f2f0-44f2-bd33-9092eba17dc3
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_enable_psremoting.yml
falsepositives:
- Legitimate script
notes:
  quarantine_reason: 'upstream status: test'
