id: sigmahq-sigma-e0b0c2ab-3d52-46d9-8cb7-049dc775fbd1
name: Enumeration for Credentials in Registry
description: 'Adversaries may search the Registry on compromised systems for insecurely
  stored credentials.

  The Windows Registry stores configuration information that can be used by the system
  or other programs.

  Adversaries may query the Registry looking for credentials and passwords that have
  been stored for use by other programs or services'
severity: medium
enabled: false
tags:
  mitre:
  - T1552.002
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1552.002/T1552.002.md
logsource:
  category: process_creation
  product: windows
detection:
  reg:
    Image|endswith: \reg.exe
    CommandLine|contains|all:
    - ' query '
    - '/t '
    - REG_SZ
    - /s
  hive:
  - CommandLine|contains|all:
    - '/f '
    - HKLM
  - CommandLine|contains|all:
    - '/f '
    - HKCU
  - CommandLine|contains: HKCU\Software\SimonTatham\PuTTY\Sessions
  condition: reg and hive
provenance:
  source: SigmaHQ/sigma
  source_id: e0b0c2ab-3d52-46d9-8cb7-049dc775fbd1
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_reg_enumeration_for_credentials_in_registry.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
