id: sigmahq-sigma-c248c896-e412-4279-8c15-1c558067b6fa
name: Enumerate All Information With Whoami.EXE
description: Detects the execution of "whoami.exe" with the "/all" flag
severity: medium
enabled: false
tags:
  mitre:
  - T1033
  categories:
  - endpoint
references:
- https://brica.de/alerts/alert/public/1247926/agent-tesla-keylogger-delivered-inside-a-power-iso-daa-archive/
- https://app.any.run/tasks/7eaba74e-c1ea-400f-9c17-5e30eee89906/
- https://www.youtube.com/watch?v=DsJ9ByX84o4&t=6s
logsource:
  category: process_creation
  product: windows
detection:
  selection_main_img:
  - Image|endswith: \whoami.exe
  - OriginalFileName: whoami.exe
  selection_main_cli:
    CommandLine|contains|windash: ' -all'
  condition: all of selection_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: c248c896-e412-4279-8c15-1c558067b6fa
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_whoami_all_execution.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
