id: sigmahq-sigma-603c6630-5225-49c1-8047-26c964553e0e
name: Enumerate Credentials from Windows Credential Manager With PowerShell
description: 'Adversaries may search for common password storage locations to obtain
  user credentials.

  Passwords are stored in several places on a system, depending on the operating system
  or application holding the credentials.'
severity: medium
enabled: false
tags:
  mitre:
  - T1555
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1555/T1555.md
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection_cmd:
    ScriptBlockText|contains|all:
    - vaultcmd
    - '/listcreds:'
  selection_option:
    ScriptBlockText|contains:
    - Windows Credentials
    - Web Credentials
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 603c6630-5225-49c1-8047-26c964553e0e
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_enumerate_password_windows_credential_manager.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
