id: sigmahq-sigma-7df1713a-1a5b-4a4b-a071-dc83b144a101
name: Esentutl Gather Credentials
description: Conti recommendation to its affiliates to use esentutl to access NTDS
  dumped file. Trickbot also uses this utilities to get MSEdge info via its module
  pwgrab.
severity: medium
enabled: false
tags:
  mitre:
  - T1003
  - T1003.003
  categories:
  - endpoint
references:
- https://twitter.com/vxunderground/status/1423336151860002816
- https://thedfirreport.com/2021/08/01/bazarcall-to-conti-ransomware-via-trickbot-and-cobalt-strike/
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains|all:
    - esentutl
    - ' /p'
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 7df1713a-1a5b-4a4b-a071-dc83b144a101
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_esentutl_params.yml
falsepositives:
- To be determined
notes:
  quarantine_reason: 'upstream status: test'
