id: sigmahq-sigma-5f1573a7-363b-4114-9208-ad7a61de46eb
name: ESXi VM List Discovery Via ESXCLI
description: Detects execution of the "esxcli" command with the "vm" flag in order
  to retrieve information about the installed VMs.
severity: medium
enabled: false
tags:
  mitre:
  - T1033
  - T1007
  - T1059.012
  categories:
  - endpoint
references:
- https://www.crowdstrike.com/blog/hypervisor-jackpotting-ecrime-actors-increase-targeting-of-esxi-servers/
- https://developer.broadcom.com/xapis/esxcli-command-reference/7.0.0/namespace/esxcli_vm.html
- https://www.secuinfra.com/en/techtalk/hide-your-hypervisor-analysis-of-esxiargs-ransomware/
- https://www.trendmicro.com/en_us/research/22/e/new-linux-based-ransomware-cheerscrypt-targets-exsi-devices.html
logsource:
  category: process_creation
  product: linux
detection:
  selection:
    Image|endswith: /esxcli
    CommandLine|contains: vm process
    CommandLine|endswith: ' list'
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 5f1573a7-363b-4114-9208-ad7a61de46eb
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/process_creation/proc_creation_lnx_esxcli_vm_discovery.yml
falsepositives:
- Legitimate administration activities
notes:
  quarantine_reason: 'upstream status: test'
