id: sigmahq-sigma-2992ac4d-31e9-4325-99f2-b18a73221bb2
name: ESXi VM Kill Via ESXCLI
description: Detects execution of the "esxcli" command with the "vm" and "kill" flag
  in order to kill/shutdown a specific VM.
severity: medium
enabled: false
tags:
  mitre:
  - T1059.012
  - T1529
  categories:
  - endpoint
references:
- https://www.crowdstrike.com/blog/hypervisor-jackpotting-ecrime-actors-increase-targeting-of-esxi-servers/
- https://developer.broadcom.com/xapis/esxcli-command-reference/7.0.0/namespace/esxcli_vm.html
- https://www.secuinfra.com/en/techtalk/hide-your-hypervisor-analysis-of-esxiargs-ransomware/
- https://www.trendmicro.com/en_us/research/22/e/new-linux-based-ransomware-cheerscrypt-targets-exsi-devices.html
logsource:
  category: process_creation
  product: linux
detection:
  selection:
    Image|endswith: /esxcli
    CommandLine|contains|all:
    - vm process
    - kill
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 2992ac4d-31e9-4325-99f2-b18a73221bb2
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/process_creation/proc_creation_lnx_esxcli_vm_kill.yml
falsepositives:
- Legitimate administration activities
notes:
  quarantine_reason: 'upstream status: test'
