id: sigmahq-sigma-d54c2f06-aca9-4e2b-81c9-5317858f4b79
name: ESXi VSAN Information Discovery Via ESXCLI
description: Detects execution of the "esxcli" command with the "vsan" flag in order
  to retrieve information about virtual storage. Seen used by malware such as DarkSide.
severity: medium
enabled: false
tags:
  mitre:
  - T1033
  - T1007
  - T1059.012
  categories:
  - endpoint
references:
- https://www.trendmicro.com/en_us/research/21/e/darkside-linux-vms-targeted.html
- https://www.trendmicro.com/en_us/research/22/a/analysis-and-Impact-of-lockbit-ransomwares-first-linux-and-vmware-esxi-variant.html
- https://developer.broadcom.com/xapis/esxcli-command-reference/7.0.0/namespace/esxcli_vsan.html
logsource:
  category: process_creation
  product: linux
detection:
  selection_img:
    Image|endswith: /esxcli
    CommandLine|contains: vsan
  selection_cli:
    CommandLine|contains:
    - ' get'
    - ' list'
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: d54c2f06-aca9-4e2b-81c9-5317858f4b79
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/process_creation/proc_creation_lnx_esxcli_vsan_discovery.yml
falsepositives:
- Legitimate administration activities
notes:
  quarantine_reason: 'upstream status: test'
