id: sigmahq-sigma-33e814e0-1f00-4e43-9c34-31fb7ae2b174
name: ESXi Network Configuration Discovery Via ESXCLI
description: Detects execution of the "esxcli" command with the "network" flag in
  order to retrieve information about the network configuration.
severity: medium
enabled: false
tags:
  mitre:
  - T1033
  - T1007
  - T1059.012
  categories:
  - endpoint
references:
- https://www.crowdstrike.com/blog/hypervisor-jackpotting-ecrime-actors-increase-targeting-of-esxi-servers/
- https://developer.broadcom.com/xapis/esxcli-command-reference/7.0.0/namespace/esxcli_network.html
logsource:
  category: process_creation
  product: linux
detection:
  selection_img:
    Image|endswith: /esxcli
    CommandLine|contains: network
  selection_cli:
    CommandLine|contains:
    - ' get'
    - ' list'
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 33e814e0-1f00-4e43-9c34-31fb7ae2b174
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/process_creation/proc_creation_lnx_esxcli_network_discovery.yml
falsepositives:
- Legitimate administration activities
notes:
  quarantine_reason: 'upstream status: test'
