id: sigmahq-sigma-9691f58d-92c1-4416-8bf3-2edd753ec9cf
name: ESXi Admin Permission Assigned To Account Via ESXCLI
description: Detects execution of the "esxcli" command with the "system" and "permission"
  flags in order to assign admin permissions to an account.
severity: high
enabled: false
tags:
  mitre:
  - T1059.012
  - T1098
  categories:
  - endpoint
references:
- https://developer.broadcom.com/xapis/esxcli-command-reference/7.0.0/namespace/esxcli_system.html
logsource:
  category: process_creation
  product: linux
detection:
  selection:
    Image|endswith: /esxcli
    CommandLine|contains: system
    CommandLine|contains|all:
    - ' permission '
    - ' set'
    - Admin
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 9691f58d-92c1-4416-8bf3-2edd753ec9cf
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/process_creation/proc_creation_lnx_esxcli_permission_change_admin.yml
falsepositives:
- Legitimate administration activities
notes:
  quarantine_reason: 'upstream status: test'
