id: sigmahq-sigma-e80273e1-9faf-40bc-bd85-dbaff104c4e9
name: ESXi System Information Discovery Via ESXCLI
description: Detects execution of the "esxcli" command with the "system" flag in order
  to retrieve information about the different component of the system. Such as accounts,
  modules, NTP, etc.
severity: medium
enabled: false
tags:
  mitre:
  - T1033
  - T1007
  - T1059.012
  categories:
  - endpoint
references:
- https://www.crowdstrike.com/blog/hypervisor-jackpotting-ecrime-actors-increase-targeting-of-esxi-servers/
- https://developer.broadcom.com/xapis/esxcli-command-reference/7.0.0/namespace/esxcli_system.html
logsource:
  category: process_creation
  product: linux
detection:
  selection_img:
    Image|endswith: /esxcli
    CommandLine|contains: system
  selection_cli:
    CommandLine|contains:
    - ' get'
    - ' list'
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: e80273e1-9faf-40bc-bd85-dbaff104c4e9
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/process_creation/proc_creation_lnx_esxcli_system_discovery.yml
falsepositives:
- Legitimate administration activities
notes:
  quarantine_reason: 'upstream status: test'
