id: sigmahq-sigma-a5b40a90-baf5-4bf7-a6f7-373494881d22
name: ETW Logging/Processing Option Disabled On IIS Server
description: Detects changes to of the IIS server configuration in order to disable/remove
  the ETW logging/processing option.
severity: medium
enabled: false
tags:
  mitre:
  - T1685.001
  - T1505.004
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/iis/manage/provisioning-and-managing-iis/configure-logging-in-iis
- https://www.microsoft.com/en-us/security/blog/2022/12/12/iis-modules-the-evolution-of-web-shells-and-how-to-detect-them/
- https://learn.microsoft.com/en-us/iis/configuration/system.applicationhost/sites/sitedefaults/logfile/
logsource:
  product: windows
  service: iis-configuration
detection:
  selection:
    EventID: 29
    Configuration|endswith: '@logTargetW3C'
    OldValue|contains: ETW
  filter_main_etw_added:
    NewValue|contains: ETW
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: a5b40a90-baf5-4bf7-a6f7-373494881d22
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/iis-configuration/win_iis_logging_etw_disabled.yml
falsepositives:
- Legitimate administrator activity
notes:
  quarantine_reason: 'upstream status: test'
