id: sigmahq-sigma-a238b5d0-ce2d-4414-a676-7a531b3d13d6
name: ETW Trace Evasion Activity
description: Detects command line activity that tries to clear or disable any ETW
  trace log which could be a sign of logging evasion.
severity: high
enabled: false
tags:
  mitre:
  - T1070
  - T1685
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/wevtutil
- https://abuse.io/lockergoga.txt
- https://medium.com/palantir/tampering-with-windows-event-tracing-background-offense-and-defense-4be7ac62ac63
logsource:
  category: process_creation
  product: windows
detection:
  selection_clear_1:
    CommandLine|contains|all:
    - cl
    - /Trace
  selection_clear_2:
    CommandLine|contains|all:
    - clear-log
    - /Trace
  selection_disable_1:
    CommandLine|contains|all:
    - sl
    - /e:false
  selection_disable_2:
    CommandLine|contains|all:
    - set-log
    - /e:false
  selection_disable_3:
    CommandLine|contains|all:
    - logman
    - update
    - trace
    - --p
    - -ets
  selection_pwsh_remove:
    CommandLine|contains: Remove-EtwTraceProvider
  selection_pwsh_set:
    CommandLine|contains|all:
    - Set-EtwTraceProvider
    - '0x11'
  condition: 1 of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: a238b5d0-ce2d-4414-a676-7a531b3d13d6
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_susp_etw_trace_evasion.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
