id: sigmahq-sigma-90f342e1-1aaa-4e43-b092-39fda57ed11e
name: ETW Logging Disabled For rpcrt4.dll
description: Detects changes to the "ExtErrorInformation" key in order to disable
  ETW logging for rpcrt4.dll
severity: low
enabled: false
tags:
  mitre:
  - T1112
  - T1685
  categories:
  - endpoint
references:
- http://redplait.blogspot.com/2020/07/whats-wrong-with-etw.html
logsource:
  product: windows
  category: registry_set
detection:
  selection:
    TargetObject|endswith: \Microsoft\Windows NT\Rpc\ExtErrorInformation
    Details:
    - DWORD (0x00000000)
    - DWORD (0x00000002)
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 90f342e1-1aaa-4e43-b092-39fda57ed11e
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_rpcrt4_etw_tamper.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
