id: sigmahq-sigma-65236ec7-ace0-4f0c-82fd-737b04fd4dcb
name: EVTX Created In Uncommon Location
description: 'Detects the creation of new files with the ".evtx" extension in non-common
  or non-standard location.

  This could indicate tampering with default EVTX locations in order to evade security
  controls or simply exfiltration of event log to search for sensitive information
  within.

  Note that backup software and legitimate administrator might perform similar actions
  during troubleshooting.'
severity: medium
enabled: false
tags:
  mitre:
  - T1685.001
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/windows/win32/eventlog/eventlog-key
logsource:
  category: file_event
  product: windows
  definition: 'Requirements: The ".evtx" extension should be monitored via a Sysmon
    configuration. Example: <TargetFilename condition="end with">.evtx<TargetFilename>'
detection:
  selection:
    TargetFilename|endswith: .evtx
  filter_main_path:
    TargetFilename|startswith: C:\Windows\System32\winevt\Logs\
  filter_main_baseimage:
    TargetFilename|startswith: C:\ProgramData\Microsoft\Windows\Containers\BaseImages\
    TargetFilename|endswith: \Windows\System32\winevt\Logs\
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 65236ec7-ace0-4f0c-82fd-737b04fd4dcb
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_create_evtx_non_common_locations.yml
falsepositives:
- Administrator or backup activity
- An unknown bug seems to trigger the Windows "svchost" process to drop EVTX files
  in the "C:\Windows\Temp" directory in the form "<log_name">_<uuid>.evtx". See https://superuser.com/questions/1371229/low-disk-space-after-filling-up-c-windows-temp-with-evtx-and-txt-files
notes:
  quarantine_reason: 'upstream status: test'
