id: sigmahq-sigma-25676e10-2121-446e-80a4-71ff8506af47
name: Exchange PowerShell Snap-Ins Usage
description: Detects adding and using Exchange PowerShell snap-ins to export mailbox
  data. As seen used by HAFNIUM and APT27
severity: high
enabled: false
tags:
  mitre:
  - T1059.001
  - T1114
  categories:
  - endpoint
references:
- https://www.volexity.com/blog/2021/03/02/active-exploitation-of-microsoft-exchange-zero-day-vulnerabilities/
- https://www.microsoft.com/security/blog/2021/03/02/hafnium-targeting-exchange-servers/
- https://www.intrinsec.com/apt27-analysis/
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - \powershell.exe
    - \pwsh.exe
  - OriginalFileName:
    - PowerShell.EXE
    - pwsh.dll
  selection_cli:
    CommandLine|contains: Add-PSSnapin
  selection_module:
    CommandLine|contains:
    - Microsoft.Exchange.Powershell.Snapin
    - Microsoft.Exchange.Management.PowerShell.SnapIn
  filter_msiexec:
    ParentImage: C:\Windows\System32\msiexec.exe
    CommandLine|contains: $exserver=Get-ExchangeServer ([Environment]::MachineName)
      -ErrorVariable exerr 2> $null
  condition: all of selection_* and not 1 of filter_*
provenance:
  source: SigmaHQ/sigma
  source_id: 25676e10-2121-446e-80a4-71ff8506af47
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_powershell_snapins_hafnium.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
