id: sigmahq-sigma-18988e1b-9087-4f8a-82fe-0414dce49878
name: Execute Code with Pester.bat as Parent
description: Detects code execution via Pester.bat (Pester - Powershell Modulte for
  testing)
severity: medium
enabled: false
tags:
  mitre:
  - T1059.001
  - T1216
  categories:
  - endpoint
references:
- https://twitter.com/Oddvarmoe/status/993383596244258816
- https://twitter.com/_st0pp3r_/status/1560072680887525378
logsource:
  category: process_creation
  product: windows
detection:
  selection_module:
    ParentImage|endswith:
    - \powershell.exe
    - \pwsh.exe
    ParentCommandLine|contains: \WindowsPowerShell\Modules\Pester\
  selection_cli:
    ParentCommandLine|contains:
    - '{ Invoke-Pester -EnableExit ;'
    - '{ Get-Help "'
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 18988e1b-9087-4f8a-82fe-0414dce49878
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_lolbin_pester.yml
falsepositives:
- Legitimate use of Pester for writing tests for Powershell scripts and modules
notes:
  quarantine_reason: 'upstream status: test'
