id: sigmahq-sigma-30bcce26-51c5-49f2-99c8-7b59e3af36c7
name: Execution Of Script Located In Potentially Suspicious Directory
description: Detects executions of scripts located in potentially suspicious locations
  such as "/tmp" via a shell such as "bash", "sh", etc.
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://blogs.jpcert.or.jp/en/2023/05/gobrat.html
- https://jstnk9.github.io/jstnk9/research/GobRAT-Malware/
- https://www.virustotal.com/gui/file/60bcd645450e4c846238cf0e7226dc40c84c96eba99f6b2cffcd0ab4a391c8b3/detection
- https://www.virustotal.com/gui/file/3e44c807a25a56f4068b5b8186eee5002eed6f26d665a8b791c472ad154585d1/detection
logsource:
  product: linux
  category: process_creation
detection:
  selection_img:
    Image|endswith:
    - /bash
    - /csh
    - /dash
    - /fish
    - /ksh
    - /sh
    - /zsh
  selection_flag:
    CommandLine|contains: ' -c '
  selection_paths:
    CommandLine|contains: /tmp/
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 30bcce26-51c5-49f2-99c8-7b59e3af36c7
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/process_creation/proc_creation_lnx_susp_shell_script_exec_from_susp_location.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
