id: sigmahq-sigma-71158e3f-df67-472b-930e-7d287acaa3e1
name: Execution Of Non-Existing File
description: Checks whether the image specified in a process creation event is not
  a full, absolute path (caused by process ghosting or other unorthodox methods to
  start a process)
severity: high
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://pentestlaboratories.com/2021/12/08/process-ghosting/
logsource:
  category: process_creation
  product: windows
detection:
  image_absolute_path:
    Image|contains: \
  filter_null:
    Image: null
  filter_empty:
    Image:
    - '-'
    - ''
  filter_4688:
  - Image:
    - System
    - Registry
    - MemCompression
    - vmmem
  - CommandLine:
    - Registry
    - MemCompression
    - vmmem
  condition: not image_absolute_path and not 1 of filter*
provenance:
  source: SigmaHQ/sigma
  source_id: 71158e3f-df67-472b-930e-7d287acaa3e1
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_susp_image_missing.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
