id: sigmahq-sigma-7b836d7f-179c-4ba4-90a7-a7e60afb48e6
name: Execute Invoke-command on Remote Host
description: Adversaries may use Valid Accounts to interact with remote systems using
  Windows Remote Management (WinRM). The adversary may then perform actions as the
  logged-on user.
severity: medium
enabled: false
tags:
  mitre:
  - T1021.006
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1021.006/T1021.006.md#atomic-test-2---invoke-command
- https://learn.microsoft.com/en-us/powershell/module/microsoft.powershell.core/invoke-command?view=powershell-7.4
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection_cmdlet:
    ScriptBlockText|contains|all:
    - 'invoke-command '
    - ' -ComputerName '
  condition: selection_cmdlet
provenance:
  source: SigmaHQ/sigma
  source_id: 7b836d7f-179c-4ba4-90a7-a7e60afb48e6
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_invoke_command_remote.yml
falsepositives:
- Legitimate script
notes:
  quarantine_reason: 'upstream status: test'
