id: sigmahq-sigma-0bbc6369-43e3-453d-9944-cae58821c173
name: Execution via WorkFolders.exe
description: Detects using WorkFolders.exe to execute an arbitrary control.exe
severity: high
enabled: false
tags:
  mitre:
  - T1218
  categories:
  - endpoint
references:
- https://twitter.com/elliotkillick/status/1449812843772227588
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: \control.exe
    ParentImage|endswith: \WorkFolders.exe
  filter:
    Image: C:\Windows\System32\control.exe
  condition: selection and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: 0bbc6369-43e3-453d-9944-cae58821c173
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_susp_workfolders.yml
falsepositives:
- Legitimate usage of the uncommon Windows Work Folders feature.
notes:
  quarantine_reason: 'upstream status: test'
