id: sigmahq-sigma-fb9d3ff7-7348-46ab-af8c-b55f5fbf39b4
name: Execution of Powershell Script in Public Folder
description: This rule detects execution of PowerShell scripts located in the "C:\Users\Public"
  folder
severity: high
enabled: false
tags:
  mitre:
  - T1059.001
  categories:
  - endpoint
references:
- https://www.mandiant.com/resources/evolution-of-fin7
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith:
    - \powershell.exe
    - \pwsh.exe
    CommandLine|contains:
    - -f C:\Users\Public
    - -f "C:\Users\Public
    - -f %Public%
    - -fi C:\Users\Public
    - -fi "C:\Users\Public
    - -fi %Public%
    - -fil C:\Users\Public
    - -fil "C:\Users\Public
    - -fil %Public%
    - -file C:\Users\Public
    - -file "C:\Users\Public
    - -file %Public%
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: fb9d3ff7-7348-46ab-af8c-b55f5fbf39b4
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_powershell_public_folder.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
