id: sigmahq-sigma-7f43c430-5001-4f8b-aaa9-c3b88f18fa5c
name: Execute From Alternate Data Streams
description: Detects execution from an Alternate Data Stream (ADS). Adversaries may
  use NTFS file attributes to hide their malicious data in order to evade detection
severity: medium
enabled: false
tags:
  mitre:
  - T1564.004
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1564.004/T1564.004.md
logsource:
  category: process_creation
  product: windows
detection:
  selection_stream:
    CommandLine|contains: 'txt:'
  selection_tools_type:
    CommandLine|contains|all:
    - 'type '
    - ' > '
  selection_tools_makecab:
    CommandLine|contains|all:
    - 'makecab '
    - .cab
  selection_tools_reg:
    CommandLine|contains|all:
    - 'reg '
    - ' export '
  selection_tools_regedit:
    CommandLine|contains|all:
    - 'regedit '
    - ' /E '
  selection_tools_esentutl:
    CommandLine|contains|all:
    - 'esentutl '
    - ' /y '
    - ' /d '
    - ' /o '
  condition: selection_stream and (1 of selection_tools_*)
provenance:
  source: SigmaHQ/sigma
  source_id: 7f43c430-5001-4f8b-aaa9-c3b88f18fa5c
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_susp_alternate_data_streams.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
