id: sigmahq-sigma-646bc99f-6682-4b47-a73a-17b1b64c9d34
name: Execute Files with Msdeploy.exe
description: Detects file execution using the msdeploy.exe lolbin
severity: medium
enabled: false
tags:
  mitre:
  - T1218
  categories:
  - endpoint
references:
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Msdeploy/
- https://twitter.com/pabraeken/status/995837734379032576
- https://twitter.com/pabraeken/status/999090532839313408
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains|all:
    - verb:sync
    - -source:RunCommand
    - -dest:runCommand
    Image|endswith: \msdeploy.exe
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 646bc99f-6682-4b47-a73a-17b1b64c9d34
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_lolbin_msdeploy.yml
falsepositives:
- System administrator Usage
notes:
  quarantine_reason: 'upstream status: test'
