id: sigmahq-sigma-59e938ff-0d6d-4dc3-b13f-36cc28734d4e
name: Execute Code with Pester.bat
description: Detects code execution via Pester.bat (Pester - Powershell Modulte for
  testing)
severity: medium
enabled: false
tags:
  mitre:
  - T1059.001
  - T1216
  categories:
  - endpoint
references:
- https://twitter.com/Oddvarmoe/status/993383596244258816
- https://github.com/api0cradle/LOLBAS/blob/d148d278f5f205ce67cfaf49afdfb68071c7252a/OSScripts/pester.md
logsource:
  category: process_creation
  product: windows
detection:
  powershell_module:
    Image|endswith:
    - \powershell.exe
    - \pwsh.exe
    CommandLine|contains|all:
    - Pester
    - Get-Help
  cmd_execution:
    Image|endswith: \cmd.exe
    CommandLine|contains|all:
    - pester
    - ;
  get_help:
    CommandLine|contains:
    - help
    - \?
  condition: powershell_module or (cmd_execution and get_help)
provenance:
  source: SigmaHQ/sigma
  source_id: 59e938ff-0d6d-4dc3-b13f-36cc28734d4e
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_lolbin_pester_1.yml
falsepositives:
- Legitimate use of Pester for writing tests for Powershell scripts and modules
notes:
  quarantine_reason: 'upstream status: test'
