id: sigmahq-sigma-534f2ef7-e8a2-4433-816d-c91bccde289b
name: Explorer NOUACCHECK Flag
description: Detects suspicious starts of explorer.exe that use the /NOUACCHECK flag
  that allows to run all sub processes of that newly started explorer.exe without
  any UAC checks
severity: high
enabled: false
tags:
  mitre:
  - T1548.002
  categories:
  - endpoint
references:
- https://twitter.com/ORCA6665/status/1496478087244095491
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: \explorer.exe
    CommandLine|contains: /NOUACCHECK
  filter_dc_logon:
  - ParentCommandLine: C:\Windows\system32\svchost.exe -k netsvcs -p -s Schedule
  - ParentImage: C:\Windows\System32\svchost.exe
  condition: selection and not 1 of filter_*
provenance:
  source: SigmaHQ/sigma
  source_id: 534f2ef7-e8a2-4433-816d-c91bccde289b
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_explorer_nouaccheck.yml
falsepositives:
- Domain Controller User Logon
- Unknown how many legitimate software products use that method
notes:
  quarantine_reason: 'upstream status: test'
