id: sigmahq-sigma-82880171-b475-4201-b811-e9c826cd5eaa
name: Exports Critical Registry Keys To a File
description: Detects the export of a crital Registry key to a file.
severity: high
enabled: false
tags:
  mitre:
  - T1012
  categories:
  - endpoint
references:
- https://lolbas-project.github.io/lolbas/Binaries/Regedit/
- https://gist.github.com/api0cradle/cdd2d0d0ec9abb686f0e89306e277b8f
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \regedit.exe
  - OriginalFileName: REGEDIT.EXE
  selection_cli_1:
    CommandLine|contains|windash: ' -E '
  selection_cli_2:
    CommandLine|contains:
    - hklm
    - hkey_local_machine
  selection_cli_3:
    CommandLine|endswith:
    - \system
    - \sam
    - \security
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 82880171-b475-4201-b811-e9c826cd5eaa
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_regedit_export_critical_keys.yml
falsepositives:
- Dumping hives for legitimate purpouse i.e. backup or forensic investigation
notes:
  quarantine_reason: 'upstream status: test'
