id: sigmahq-sigma-259a9cdf-c4dd-4fa2-b243-2269e5ab18a2
name: External Remote RDP Logon from Public IP
description: Detects successful logon from public IP address via RDP. This can indicate
  a publicly-exposed RDP port.
severity: medium
enabled: false
tags:
  mitre:
  - T1133
  - T1078
  - T1110
  categories:
  - endpoint
references:
- https://www.inversecos.com/2020/04/successful-4624-anonymous-logons-to.html
- https://twitter.com/Purp1eW0lf/status/1616144561965002752
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4624
    LogonType: 10
  filter_main_local_ranges:
    IpAddress|cidr:
    - ::1/128
    - 10.0.0.0/8
    - 127.0.0.0/8
    - 172.16.0.0/12
    - 192.168.0.0/16
    - 169.254.0.0/16
    - fc00::/7
    - fe80::/10
  filter_main_empty:
    IpAddress: '-'
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 259a9cdf-c4dd-4fa2-b243-2269e5ab18a2
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/security/account_management/win_security_successful_external_remote_rdp_login.yml
falsepositives:
- Legitimate or intentional inbound connections from public IP addresses on the RDP
  port.
notes:
  quarantine_reason: 'upstream status: test'
