id: sigmahq-sigma-b59c98c6-95e8-4d65-93ee-f594dfb96b17
name: F5 BIG-IP iControl Rest API Command Execution - Proxy
description: Detects POST requests to the F5 BIG-IP iControl Rest API "bash" endpoint,
  which allows the execution of commands on the BIG-IP
severity: medium
enabled: false
tags:
  mitre:
  - T1190
  categories:
  - network
references:
- https://f5-sdk.readthedocs.io/en/latest/apidoc/f5.bigip.tm.util.html#module-f5.bigip.tm.util.bash
- https://community.f5.com/t5/technical-forum/icontrolrest-11-5-execute-bash-command/td-p/203029
- https://community.f5.com/t5/technical-forum/running-bash-commands-via-rest-api/td-p/272516
logsource:
  category: proxy
detection:
  selection:
    cs-method: POST
    c-uri|endswith: /mgmt/tm/util/bash
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: b59c98c6-95e8-4d65-93ee-f594dfb96b17
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/web/proxy_generic/proxy_f5_tm_utility_bash_api_request.yml
falsepositives:
- Legitimate usage of the BIG IP REST API to execute command for administration purposes
notes:
  quarantine_reason: 'upstream status: test'
