id: sigmahq-sigma-28870ae4-6a13-4616-bd1a-235a7fad7458
name: Failed Authentications From Countries You Do Not Operate Out Of
description: Detect failed authentications from countries you do not operate out of.
severity: low
enabled: false
tags:
  mitre:
  - T1078.004
  - T1110
  categories:
  - cloud
references:
- https://learn.microsoft.com/en-gb/entra/architecture/security-operations-user-accounts
logsource:
  product: azure
  service: signinlogs
detection:
  selection:
    Status: Success
  selection1:
    Location|contains: <Countries you DO operate out of e,g GB, use OR for multiple>
  condition: not selection and not selection1
provenance:
  source: SigmaHQ/sigma
  source_id: 28870ae4-6a13-4616-bd1a-235a7fad7458
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/azure/signin_logs/azure_ad_failed_auth_from_countries_you_do_not_operate_out_of.yml
falsepositives:
- If this was approved by System Administrator.
notes:
  quarantine_reason: 'upstream status: test'
