id: sigmahq-sigma-828af599-4c53-4ed2-ba4a-a9f835c434ea
name: Fax Service DLL Search Order Hijack
description: The Fax service attempts to load ualapi.dll, which is non-existent. An
  attacker can then (side)load their own malicious DLL using this service.
severity: high
enabled: false
tags:
  mitre:
  - T1574.001
  categories:
  - endpoint
references:
- https://windows-internals.com/faxing-your-way-to-system/
logsource:
  category: image_load
  product: windows
detection:
  selection:
    Image|endswith: \fxssvc.exe
    ImageLoaded|endswith: ualapi.dll
  filter:
    ImageLoaded|startswith: C:\Windows\WinSxS\
  condition: selection and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: 828af599-4c53-4ed2-ba4a-a9f835c434ea
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/image_load/image_load_side_load_ualapi.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
