id: sigmahq-sigma-6d8a7cf1-8085-423b-b87d-7e880faabbdf
name: File Download Via Nscurl - MacOS
description: Detects the execution of the nscurl utility in order to download files.
severity: medium
enabled: false
tags:
  mitre:
  - T1105
  categories:
  - endpoint
references:
- https://www.loobins.io/binaries/nscurl/
- https://www.agnosticdev.com/content/how-diagnose-app-transport-security-issues-using-nscurl-and-openssl
- https://gist.github.com/nasbench/ca6ef95db04ae04ffd1e0b1ce709cadd
logsource:
  category: process_creation
  product: macos
detection:
  selection:
    Image|endswith: /nscurl
    CommandLine|contains:
    - '--download '
    - '--download-directory '
    - '--output '
    - '-dir '
    - '-dl '
    - -ld
    - '-o '
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 6d8a7cf1-8085-423b-b87d-7e880faabbdf
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/macos/process_creation/proc_creation_macos_nscurl_usage.yml
falsepositives:
- Legitimate usage of nscurl by administrators and users.
notes:
  quarantine_reason: 'upstream status: test'
