id: sigmahq-sigma-e62a9f0c-ca1e-46b2-85d5-a6da77f86d1a
name: File Encoded To Base64 Via Certutil.EXE
description: Detects the execution of certutil with the "encode" flag to encode a
  file to base64. This can be abused by threat actors and attackers for data exfiltration
severity: medium
enabled: false
tags:
  mitre:
  - T1027
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/certutil
- https://unit42.paloaltonetworks.com/new-babyshark-malware-targets-u-s-national-security-think-tanks/
- https://lolbas-project.github.io/lolbas/Binaries/Certutil/
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \certutil.exe
  - OriginalFileName: CertUtil.exe
  selection_cli:
    CommandLine|contains|windash: -encode
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: e62a9f0c-ca1e-46b2-85d5-a6da77f86d1a
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_certutil_encode.yml
falsepositives:
- As this is a general purpose rule, legitimate usage of the encode functionality
  will trigger some false positives. Apply additional filters accordingly
notes:
  quarantine_reason: 'upstream status: test'
