id: sigmahq-sigma-7c9340a9-e2ee-4e43-94c5-c54ebbea1006
name: File And SubFolder Enumeration Via Dir Command
description: Detects usage of the "dir" command part of Windows CMD with the "/S"
  command line flag in order to enumerate files in a specified directory and all subdirectories.
severity: low
enabled: false
tags:
  mitre:
  - T1217
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1217/T1217.md
logsource:
  category: process_creation
  product: windows
detection:
  selection_cmd:
  - Image|endswith: \cmd.exe
  - OriginalFileName: Cmd.Exe
  selection_cli:
    CommandLine|contains|windash: dir*-s
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 7c9340a9-e2ee-4e43-94c5-c54ebbea1006
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_cmd_dir_execution.yml
falsepositives:
- Likely
notes:
  quarantine_reason: 'upstream status: test'
