id: sigmahq-sigma-104cdb48-a7a8-4ca7-a453-32942c6e5dcb
name: File Download Using ProtocolHandler.exe
description: Detects usage of "ProtocolHandler" to download files. Downloaded files
  will be located in the cache folder (for example - %LOCALAPPDATA%\Microsoft\Windows\INetCache\IE)
severity: medium
enabled: false
tags:
  mitre:
  - T1218
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218/T1218.md
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/ProtocolHandler/
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \protocolhandler.exe
  - OriginalFileName: ProtocolHandler.exe
  selection_cli:
    CommandLine|contains:
    - ftp://
    - http://
    - https://
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 104cdb48-a7a8-4ca7-a453-32942c6e5dcb
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_protocolhandler_download.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
