id: sigmahq-sigma-94771a71-ba41-4b6e-a757-b531372eaab6
name: File Download From Browser Process Via Inline URL
description: Detects execution of a browser process with a URL argument pointing to
  a file with a potentially interesting extension. This can be abused to download
  arbitrary files or to hide from the user for example by launching the browser in
  a minimized state.
severity: medium
enabled: false
tags:
  mitre:
  - T1105
  categories:
  - endpoint
references:
- https://twitter.com/mrd0x/status/1478116126005641220
- https://lolbas-project.github.io/lolbas/Binaries/Msedge/
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
    Image|endswith:
    - \brave.exe
    - \chrome.exe
    - \msedge.exe
    - \opera.exe
    - \vivaldi.exe
  selection_http:
    CommandLine|contains: http
  selection_extensions:
  - CommandLine|endswith:
    - .7z
    - .dat
    - .dll
    - .exe
    - .hta
    - .ps1
    - .psm1
    - .txt
    - .vbe
    - .vbs
    - .zip
  - CommandLine|contains:
    - .7z"
    - .dat"
    - .dll"
    - .hta"
    - .ps1"
    - .psm1"
    - .txt"
    - .vbe"
    - .vbs"
    - .zip"
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 94771a71-ba41-4b6e-a757-b531372eaab6
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_browsers_inline_file_download.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
