id: sigmahq-sigma-74c01ace-0152-4094-8ae2-6fd776dd43e5
name: File or Folder Permissions Change
description: Detects file and folder permission changes.
severity: low
enabled: false
tags:
  mitre:
  - T1222.002
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1222.002/T1222.002.md
logsource:
  product: linux
  service: auditd
detection:
  selection:
    type: EXECVE
    a0|contains:
    - chmod
    - chown
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 74c01ace-0152-4094-8ae2-6fd776dd43e5
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/auditd/execve/lnx_auditd_file_or_folder_permissions.yml
falsepositives:
- User interacting with files permissions (normal/daily behaviour).
notes:
  quarantine_reason: 'upstream status: test'
