id: sigmahq-sigma-550bbb84-ce5d-4e61-84ad-e590f0024dcd
name: File Encryption Using Gpg4win
description: Detects usage of Gpg4win to encrypt files
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://blogs.vmware.com/security/2022/11/batloader-the-evasive-downloader-malware.html
- https://www.gpg4win.de/documentation.html
- https://news.sophos.com/en-us/2022/01/19/zloader-installs-remote-access-backdoors-and-delivers-cobalt-strike/
logsource:
  category: process_creation
  product: windows
detection:
  selection_metadata:
  - Image|endswith:
    - \gpg.exe
    - \gpg2.exe
  - Description: GnuPG’s OpenPGP tool
  selection_cli:
    CommandLine|contains|all:
    - ' -c '
    - passphrase
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 550bbb84-ce5d-4e61-84ad-e590f0024dcd
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_gpg4win_encryption.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
