id: sigmahq-sigma-b86f6dea-0b2f-41f5-bdcc-a057bd19cd6a
name: File Download From IP Based URL Via CertOC.EXE
description: Detects when a user downloads a file from an IP based URL using CertOC.exe
severity: high
enabled: false
tags:
  mitre:
  - T1105
  categories:
  - endpoint
references:
- https://lolbas-project.github.io/lolbas/Binaries/Certoc/
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \certoc.exe
  - OriginalFileName: CertOC.exe
  selection_ip:
    CommandLine|re: ://[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}
  selection_cli:
    CommandLine|contains: -GetCACAPS
  condition: all of selection*
provenance:
  source: SigmaHQ/sigma
  source_id: b86f6dea-0b2f-41f5-bdcc-a057bd19cd6a
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_certoc_download_direct_ip.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
