id: sigmahq-sigma-d059842b-6b9d-4ed1-b5c3-5b89143c6ede
name: File Download Via Bitsadmin
description: Detects usage of bitsadmin downloading a file
severity: medium
enabled: false
tags:
  mitre:
  - T1197
  - T1036.003
  - T1105
  categories:
  - endpoint
references:
- https://blog.netspi.com/15-ways-to-download-a-file/#bitsadmin
- https://isc.sans.edu/diary/22264
- https://lolbas-project.github.io/lolbas/Binaries/Bitsadmin/
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \bitsadmin.exe
  - OriginalFileName: bitsadmin.exe
  selection_cmd:
    CommandLine|contains: ' /transfer '
  selection_cli_1:
    CommandLine|contains:
    - ' /create '
    - ' /addfile '
  selection_cli_2:
    CommandLine|contains: http
  condition: selection_img and (selection_cmd or all of selection_cli_*)
provenance:
  source: SigmaHQ/sigma
  source_id: d059842b-6b9d-4ed1-b5c3-5b89143c6ede
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_bitsadmin_download.yml
falsepositives:
- Some legitimate apps use this, but limited.
notes:
  quarantine_reason: 'upstream status: test'
