id: sigmahq-sigma-c7a74c80-ba5a-486e-9974-ab9e682bc5e4
name: File With Uncommon Extension Created By An Office Application
description: Detects the creation of files with an executable or script extension
  by an Office application.
severity: high
enabled: false
tags:
  mitre:
  - T1204.002
  categories:
  - endpoint
references:
- https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware/
- https://github.com/vadim-hunter/Detection-Ideas-Rules/blob/02bcbfc2bfb8b4da601bb30de0344ae453aa1afe/Threat%20Intelligence/The%20DFIR%20Report/20210329_Sodinokibi_(aka_REvil)_Ransomware.yaml
logsource:
  product: windows
  category: file_event
detection:
  selection1:
    Image|endswith:
    - \excel.exe
    - \msaccess.exe
    - \mspub.exe
    - \powerpnt.exe
    - \visio.exe
    - \winword.exe
  selection2:
    TargetFilename|endswith:
    - .bat
    - .cmd
    - .com
    - .dll
    - .exe
    - .hta
    - .ocx
    - .proj
    - .ps1
    - .scf
    - .scr
    - .sys
    - .vbe
    - .vbs
    - .wsf
    - .wsh
  filter_main_localassembly:
    TargetFilename|contains: \AppData\Local\assembly\tmp\
    TargetFilename|endswith: .dll
  filter_optional_webservicecache:
    TargetFilename|contains|all:
    - C:\Users\
    - \AppData\Local\Microsoft\Office\
    - \WebServiceCache\AllUsers
    TargetFilename|endswith: .com
  filter_optional_webex:
    Image|endswith: \winword.exe
    TargetFilename|contains: \AppData\Local\Temp\webexdelta\
    TargetFilename|endswith:
    - .dll
    - .exe
  filter_optional_backstageinappnavcache:
    TargetFilename|contains|all:
    - C:\Users\
    - \AppData\Local\Microsoft\Office\
    - \BackstageInAppNavCache\
    TargetFilename|endswith: .com
  condition: all of selection* and not 1 of filter_main_* and not 1 of filter_optional_*
provenance:
  source: SigmaHQ/sigma
  source_id: c7a74c80-ba5a-486e-9974-ab9e682bc5e4
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_office_susp_file_extension.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
