id: sigmahq-sigma-6ddab845-b1b8-49c2-bbf7-1a11967f64bc
name: File Deleted Via Sysinternals SDelete
description: Detects the deletion of files by the Sysinternals SDelete utility. It
  looks for the common name pattern used to rename files.
severity: medium
enabled: false
tags:
  mitre:
  - T1070.004
  categories:
  - endpoint
references:
- https://github.com/OTRF/detection-hackathon-apt29/issues/9
- https://github.com/OTRF/ThreatHunter-Playbook/blob/2d4257f630f4c9770f78d0c1df059f891ffc3fec/docs/evals/apt29/detections/4.B.4_83D62033-105A-4A02-8B75-DAB52D8D51EC.md
logsource:
  product: windows
  category: file_delete
detection:
  selection:
    TargetFilename|endswith:
    - .AAA
    - .ZZZ
  filter_wireshark:
    TargetFilename|endswith: \Wireshark\radius\dictionary.alcatel-lucent.aaa
  condition: selection and not 1 of filter_*
provenance:
  source: SigmaHQ/sigma
  source_id: 6ddab845-b1b8-49c2-bbf7-1a11967f64bc
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_delete/file_delete_win_sysinternals_sdelete_file_deletion.yml
falsepositives:
- Legitimate usage
notes:
  quarantine_reason: 'upstream status: test'
