id: sigmahq-sigma-0e8cfe08-02c9-4815-a2f8-0d157b7ed33e
name: File Download with Headless Browser
description: Detects execution of chromium based browser in headless mode using the
  "dump-dom" command line to download files
severity: high
enabled: false
tags:
  mitre:
  - T1105
  - T1564.003
  categories:
  - endpoint
references:
- https://twitter.com/mrd0x/status/1478234484881436672?s=12
- https://www.trendmicro.com/en_us/research/23/e/managed-xdr-investigation-of-ducktail-in-trend-micro-vision-one.html
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith:
    - \brave.exe
    - \chrome.exe
    - \msedge.exe
    - \opera.exe
    - \vivaldi.exe
    CommandLine|contains|all:
    - --headless
    - dump-dom
    - http
  filter_optional_edge_1:
    Image|startswith:
    - C:\Program Files (x86)\Microsoft\Edge\Application\
    - C:\Program Files (x86)\Microsoft\EdgeCore\
    - C:\Program Files (x86)\Microsoft\EdgeWebView\
    - C:\Program Files\Microsoft\Edge\Application\
    - C:\Program Files\Microsoft\EdgeCore\
    - C:\Program Files\Microsoft\EdgeWebView\
    - C:\Program Files\WindowsApps\Microsoft.MicrosoftEdge
    Image|endswith:
    - \msedge.exe
    - \msedgewebview2.exe
    - \MicrosoftEdge.exe
    CommandLine|contains: --headless --disable-gpu --disable-extensions --disable-plugins
      --mute-audio --no-first-run --incognito --aggressive-cache-discard --dump-dom
  filter_optional_edge_2:
    Image|contains:
    - \AppData\Local\Microsoft\WindowsApps\
    - \Windows\SystemApps\Microsoft.MicrosoftEdge
    Image|endswith:
    - \msedge.exe
    - \MicrosoftEdge.exe
    CommandLine|contains: --headless --disable-gpu --disable-extensions --disable-plugins
      --mute-audio --no-first-run --incognito --aggressive-cache-discard --dump-dom
  condition: selection and not 1 of filter_optional_*
provenance:
  source: SigmaHQ/sigma
  source_id: 0e8cfe08-02c9-4815-a2f8-0d157b7ed33e
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_browsers_chromium_headless_file_download.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
