id: sigmahq-sigma-e1e0b7d7-e10b-4ee4-ac49-a4bda05d320d
name: File Encryption/Decryption Via Gpg4win From Suspicious Locations
description: Detects usage of Gpg4win to encrypt/decrypt files located in potentially
  suspicious locations.
severity: high
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://blogs.vmware.com/security/2022/11/batloader-the-evasive-downloader-malware.html
- https://news.sophos.com/en-us/2022/01/19/zloader-installs-remote-access-backdoors-and-delivers-cobalt-strike/
logsource:
  category: process_creation
  product: windows
detection:
  selection_metadata:
  - Image|endswith:
    - \gpg.exe
    - \gpg2.exe
  - Product: GNU Privacy Guard (GnuPG)
  - Description: GnuPG’s OpenPGP tool
  selection_cli:
    CommandLine|contains: -passphrase
  selection_paths:
    CommandLine|contains:
    - :\PerfLogs\
    - :\Temp\
    - :\Users\Public\
    - :\Windows\Temp\
    - \AppData\Local\Temp\
    - \AppData\Roaming\
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: e1e0b7d7-e10b-4ee4-ac49-a4bda05d320d
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_gpg4win_susp_location.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
