id: sigmahq-sigma-0e4164da-94bc-450d-a7be-a4b176179f1f
name: Firewall Configuration Discovery Via Netsh.EXE
description: Adversaries may look for details about the network configuration and
  settings of systems they access or through information discovery of remote systems
severity: low
enabled: false
tags:
  mitre:
  - T1016
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1016/T1016.md#atomic-test-2---list-windows-firewall-rules
- https://ss64.com/nt/netsh.html
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \netsh.exe
  - OriginalFileName: netsh.exe
  selection_cli:
    CommandLine|contains|all:
    - netsh
    - 'show '
    - 'firewall '
    CommandLine|contains:
    - 'config '
    - 'state '
    - 'rule '
    - name=all
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 0e4164da-94bc-450d-a7be-a4b176179f1f
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_netsh_fw_rules_discovery.yml
falsepositives:
- Administrative activity
notes:
  quarantine_reason: 'upstream status: test'
