id: sigmahq-sigma-57c4bf16-227f-4394-8ec7-1b745ee061c3
name: Firewall Disabled via Netsh.EXE
description: Detects netsh commands that turns off the Windows firewall
severity: medium
enabled: false
tags:
  mitre:
  - T1686.003
  categories:
  - endpoint
references:
- https://www.winhelponline.com/blog/enable-and-disable-windows-firewall-quickly-using-command-line/
- https://app.any.run/tasks/210244b9-0b6b-4a2c-83a3-04bd3175d017/
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.004/T1562.004.md#atomic-test-1---disable-microsoft-defender-firewall
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \netsh.exe
  - OriginalFileName: netsh.exe
  selection_cli_1:
    CommandLine|contains|all:
    - firewall
    - set
    - opmode
    - disable
  selection_cli_2:
    CommandLine|contains|all:
    - advfirewall
    - set
    - state
    - 'off'
  condition: selection_img and 1 of selection_cli_*
provenance:
  source: SigmaHQ/sigma
  source_id: 57c4bf16-227f-4394-8ec7-1b745ee061c3
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_netsh_fw_disable.yml
falsepositives:
- Legitimate administration activity
notes:
  quarantine_reason: 'upstream status: test'
