id: sigmahq-sigma-021310d9-30a6-480a-84b7-eaa69aeb92bb
name: First Time Seen Remote Named Pipe - Zeek
description: This detection excludes known namped pipes accessible remotely and notify
  on newly observed ones, may help to detect lateral movement and remote exec using
  named pipes
severity: high
enabled: false
tags:
  mitre:
  - T1021.002
  categories:
  - endpoint
references:
- https://twitter.com/menasec1/status/1104489274387451904
logsource:
  product: zeek
  service: smb_files
detection:
  selection:
    path: \\\\\*\\IPC$
  filter_keywords:
  - samr
  - lsarpc
  - winreg
  - netlogon
  - srvsvc
  - protected_storage
  - wkssvc
  - browser
  - netdfs
  - svcctl
  - spoolss
  - ntsvcs
  - LSM_API_service
  - HydraLsPipe
  - TermSrv_API_service
  - MsFteWds
  condition: selection and not 1 of filter_*
provenance:
  source: SigmaHQ/sigma
  source_id: 021310d9-30a6-480a-84b7-eaa69aeb92bb
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/network/zeek/zeek_smb_converted_win_lm_namedpipe.yml
falsepositives:
- Update the excluded named pipe to filter out any newly observed legit named pipe
notes:
  quarantine_reason: 'upstream status: test'
