id: sigmahq-sigma-3be619f4-d9ec-4ea8-a173-18fdd01996ab
name: Flush Iptables Ufw Chain
description: Detect use of iptables to flush all firewall rules, tables and chains
  and allow all network traffic
severity: medium
enabled: false
tags:
  mitre:
  - T1686
  categories:
  - endpoint
references:
- https://blogs.blackberry.com/
- https://www.cyberciti.biz/tips/linux-iptables-how-to-flush-all-rules.html
- https://twitter.com/Joseliyo_Jstnk/status/1620131033474822144
logsource:
  product: linux
  category: process_creation
detection:
  selection_img:
    Image|endswith:
    - /iptables
    - /xtables-legacy-multi
    - /iptables-legacy-multi
    - /ip6tables
    - /ip6tables-legacy-multi
  selection_params:
    CommandLine|contains:
    - -F
    - -Z
    - -X
  selection_ufw:
    CommandLine|contains:
    - ufw-logging-deny
    - ufw-logging-allow
    - ufw6-logging-deny
    - ufw6-logging-allow
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 3be619f4-d9ec-4ea8-a173-18fdd01996ab
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/process_creation/proc_creation_lnx_iptables_flush_ufw.yml
falsepositives:
- Network administrators
notes:
  quarantine_reason: 'upstream status: test'
