id: sigmahq-sigma-9aa5106d-bce3-4b13-86df-3a20f1d5cf0b
name: Forfiles Command Execution
description: 'Detects the execution of "forfiles" with the "/c" flag.

  While this is an expected behavior of the tool, it can be abused in order to proxy
  execution through it with any binary.

  Can be used to bypass application whitelisting.'
severity: medium
enabled: false
tags:
  mitre:
  - T1059
  categories:
  - endpoint
references:
- https://lolbas-project.github.io/lolbas/Binaries/Forfiles/
- https://pentestlab.blog/2020/07/06/indirect-command-execution/
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \forfiles.exe
  - OriginalFileName: forfiles.exe
  selection_cli:
    CommandLine|contains|windash: ' -c '
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 9aa5106d-bce3-4b13-86df-3a20f1d5cf0b
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_forfiles_proxy_execution_.yml
falsepositives:
- Legitimate use via a batch script or by an administrator.
notes:
  quarantine_reason: 'upstream status: test'
