id: sigmahq-sigma-2bfb6216-0c31-4d20-8501-2629b29a3fa2
name: FortiGate - New VPN SSL Web Portal Added
description: 'Detects the addition of a VPN SSL Web Portal on a Fortinet FortiGate
  Firewall.

  This behavior was observed in pair with modification of VPN SSL settings.'
severity: medium
enabled: false
tags:
  mitre:
  - T1133
  categories:
  - endpoint
references:
- https://www.fortiguard.com/psirt/FG-IR-24-535
- https://docs.fortinet.com/document/fortigate/7.6.4/fortios-log-message-reference/398/event
- https://docs.fortinet.com/document/fortigate/7.6.4/cli-reference/113121765/config-vpn-ssl-web-portal
- https://docs.fortinet.com/document/fortigate/7.6.4/fortios-log-message-reference/44547/44547-logid-event-config-objattr
logsource:
  product: fortigate
  service: event
detection:
  selection:
    action: Add
    cfgpath: vpn.ssl.web.portal
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 2bfb6216-0c31-4d20-8501-2629b29a3fa2
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/network/fortinet/fortigate/fortinet_fortigate_new_vpn_ssl_web_portal.yml
falsepositives:
- A VPN SSL Web Portal can be added for legitimate purposes.
notes:
  quarantine_reason: 'upstream status: experimental'
