id: sigmahq-sigma-ddbbe845-1d74-43a8-8231-2156d180234d
name: FortiGate - New Local User Created
description: 'Detects the creation of a new local user on a Fortinet FortiGate Firewall.

  The new local user could be used for VPN connections.'
severity: medium
enabled: false
tags:
  mitre:
  - T1136.001
  categories:
  - endpoint
references:
- https://www.fortiguard.com/psirt/FG-IR-24-535
- https://docs.fortinet.com/document/fortigate/7.6.4/fortios-log-message-reference/398/event
- https://docs.fortinet.com/document/fortigate/7.6.4/cli-reference/109120963/config-user-local
- https://docs.fortinet.com/document/fortigate/7.6.4/fortios-log-message-reference/44547/44547-logid-event-config-objattr
logsource:
  product: fortigate
  service: event
detection:
  selection:
    action: Add
    cfgpath: user.local
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: ddbbe845-1d74-43a8-8231-2156d180234d
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/network/fortinet/fortigate/fortinet_fortigate_new_local_user_created.yml
falsepositives:
- A local user can be created for legitimate purposes. Investigate the user details
  to determine if it is authorized.
notes:
  quarantine_reason: 'upstream status: experimental'
