id: sigmahq-sigma-5c8d7b41-3812-432f-a0bb-4cfb7c31827e
name: FortiGate - Firewall Address Object Added
description: Detects the addition of firewall address objects on a Fortinet FortiGate
  Firewall.
severity: medium
enabled: false
tags:
  mitre:
  - T1685
  categories:
  - endpoint
references:
- https://www.fortiguard.com/psirt/FG-IR-24-535
- https://docs.fortinet.com/document/fortigate/7.6.4/fortios-log-message-reference/398/event
- https://docs.fortinet.com/document/fortigate/7.6.4/cli-reference/306021697/config-firewall-address
- https://docs.fortinet.com/document/fortigate/7.6.4/fortios-log-message-reference/44547/44547-logid-event-config-objattr
logsource:
  product: fortigate
  service: event
detection:
  selection:
    action: Add
    cfgpath: firewall.address
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 5c8d7b41-3812-432f-a0bb-4cfb7c31827e
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/network/fortinet/fortigate/fortinet_fortigate_new_firewall_address_object.yml
falsepositives:
- An address could be added or deleted for legitimate purposes.
notes:
  quarantine_reason: 'upstream status: experimental'
