id: sigmahq-sigma-69ffc84e-8b1a-4024-8351-e018f66b8275
name: FortiGate - User Group Modified
description: 'Detects the modification of a user group on a Fortinet FortiGate Firewall.

  The group could be used to grant VPN access to a network.'
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://www.fortiguard.com/psirt/FG-IR-24-535
- https://docs.fortinet.com/document/fortigate/7.6.4/fortios-log-message-reference/398/event
- https://docs.fortinet.com/document/fortigate/7.6.4/cli-reference/328136827/config-user-group
- https://docs.fortinet.com/document/fortigate/7.6.4/fortios-log-message-reference/44547/44547-logid-event-config-objattr
logsource:
  product: fortigate
  service: event
detection:
  selection:
    action: Edit
    cfgpath: user.group
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 69ffc84e-8b1a-4024-8351-e018f66b8275
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/network/fortinet/fortigate/fortinet_fortigate_user_group_modified.yml
falsepositives:
- A group can be modified for legitimate purposes.
notes:
  quarantine_reason: 'upstream status: experimental'
