id: sigmahq-sigma-cd0a4943-0edd-42cf-b50c-06f77a10d4c1
name: FortiGate - New Administrator Account Created
description: Detects the creation of an administrator account on a Fortinet FortiGate
  Firewall.
severity: medium
enabled: false
tags:
  mitre:
  - T1136.001
  categories:
  - endpoint
references:
- https://www.fortiguard.com/psirt/FG-IR-24-535
- https://docs.fortinet.com/document/fortigate/7.6.4/fortios-log-message-reference/398/event
- https://docs.fortinet.com/document/fortigate/7.6.4/cli-reference/390485493/config-system-admin
- https://docs.fortinet.com/document/fortigate/7.6.4/fortios-log-message-reference/44547/44547-logid-event-config-objattr
logsource:
  product: fortigate
  service: event
detection:
  selection:
    action: Add
    cfgpath: system.admin
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: cd0a4943-0edd-42cf-b50c-06f77a10d4c1
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/network/fortinet/fortigate/fortinet_fortigate_new_admin_account_created.yml
falsepositives:
- An administrator account can be created for legitimate purposes. Investigate the
  account details to determine if it is authorized.
notes:
  quarantine_reason: 'upstream status: experimental'
