id: sigmahq-sigma-63de06b9-a385-40b5-8b32-73f2b9ef84b6
name: Fsutil Drive Enumeration
description: Attackers may leverage fsutil to enumerated connected drives.
severity: low
enabled: false
tags:
  mitre:
  - T1120
  categories:
  - endpoint
references:
- Turla has used fsutil fsinfo drives to list connected drives.
- https://github.com/elastic/detection-rules/blob/414d32027632a49fb239abb8fbbb55d3fa8dd861/rules/windows/discovery_peripheral_device.toml
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \fsutil.exe
  - OriginalFileName: fsutil.exe
  selection_cli:
    CommandLine|contains: drives
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 63de06b9-a385-40b5-8b32-73f2b9ef84b6
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_fsutil_drive_enumeration.yml
falsepositives:
- Certain software or administrative tasks may trigger false positives.
notes:
  quarantine_reason: 'upstream status: test'
