id: sigmahq-sigma-90217a70-13fc-48e4-b3db-0d836c5824ac
name: GAC DLL Loaded Via Office Applications
description: Detects any GAC DLL being loaded by an Office Product
severity: high
enabled: false
tags:
  mitre:
  - T1204.002
  categories:
  - endpoint
references:
- https://medium.com/threatpunter/detecting-adversary-tradecraft-with-image-load-event-logging-and-eql-8de93338c16
logsource:
  category: image_load
  product: windows
detection:
  selection:
    Image|endswith:
    - \excel.exe
    - \mspub.exe
    - \onenote.exe
    - \onenoteim.exe
    - \outlook.exe
    - \powerpnt.exe
    - \winword.exe
    ImageLoaded|startswith: C:\Windows\Microsoft.NET\assembly\GAC_MSIL
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 90217a70-13fc-48e4-b3db-0d836c5824ac
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/image_load/image_load_office_dotnet_gac_dll_load.yml
falsepositives:
- Legitimate macro usage. Add the appropriate filter according to your environment
notes:
  quarantine_reason: 'upstream status: test'
