id: sigmahq-sigma-f92a6f1e-a512-4a15-9735-da09e78d7273
name: GatherNetworkInfo.VBS Reconnaissance Script Output
description: Detects creation of files which are the results of executing the built-in
  reconnaissance script "C:\Windows\System32\gatherNetworkInfo.vbs".
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://posts.slayerlabs.com/living-off-the-land/#gathernetworkinfovbs
- https://www.mandiant.com/resources/blog/trojanized-windows-installers-ukrainian-government
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename|startswith: C:\Windows\System32\config
    TargetFilename|endswith:
    - \Hotfixinfo.txt
    - \netiostate.txt
    - \sysportslog.txt
    - \VmSwitchLog.evtx
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: f92a6f1e-a512-4a15-9735-da09e78d7273
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_lolbin_gather_network_info_script_output.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
