id: sigmahq-sigma-04ad83ef-1a37-4c10-b57a-81092164bf33
name: Github Repository/Organization Transferred
description: Detects when a repository or an organization is being transferred to
  another location.
severity: medium
enabled: false
tags:
  mitre:
  - T1020
  - T1537
  categories:
  - endpoint
references:
- https://docs.github.com/en/repositories/creating-and-managing-repositories/transferring-a-repository
- https://docs.github.com/en/organizations/managing-organization-settings/transferring-organization-ownership
- https://docs.github.com/en/migrations
- https://docs.github.com/en/enterprise-cloud@latest/admin/monitoring-activity-in-your-enterprise/reviewing-audit-logs-for-your-enterprise/audit-log-events-for-your-enterprise#migration
logsource:
  product: github
  service: audit
  definition: 'Requirements: The audit log streaming feature must be enabled to be
    able to receive such logs. You can enable following the documentation here: https://docs.github.com/en/enterprise-cloud@latest/admin/monitoring-activity-in-your-enterprise/reviewing-audit-logs-for-your-enterprise/streaming-the-audit-log-for-your-enterprise#setting-up-audit-log-streaming'
detection:
  selection:
    action:
    - migration.create
    - org.transfer_outgoing
    - org.transfer
    - repo.transfer_outgoing
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 04ad83ef-1a37-4c10-b57a-81092164bf33
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/application/github/audit/github_repo_or_org_transferred.yml
falsepositives:
- Allowed administrative activities.
notes:
  quarantine_reason: 'upstream status: test'
