id: sigmahq-sigma-eaa9ac35-1730-441f-9587-25767bde99d7
name: Github Outside Collaborator Detected
description: Detects when an organization member or an outside collaborator is added
  to or removed from a project board or has their permission level changed or when
  an owner removes an outside collaborator from an organization or when two-factor
  authentication is required in an organization and an outside collaborator does not
  use 2FA or disables 2FA.
severity: medium
enabled: false
tags:
  mitre:
  - T1098.001
  - T1098.003
  - T1213.003
  categories:
  - endpoint
references:
- https://docs.github.com/en/organizations/keeping-your-organization-secure/managing-security-settings-for-your-organization/reviewing-the-audit-log-for-your-organization#audit-log-actions
- https://docs.github.com/en/organizations/keeping-your-organization-secure/managing-two-factor-authentication-for-your-organization/requiring-two-factor-authentication-in-your-organization
logsource:
  product: github
  service: audit
  definition: 'Requirements: The audit log streaming feature must be enabled to be
    able to receive such logs. You can enable following the documentation here: https://docs.github.com/en/enterprise-cloud@latest/admin/monitoring-activity-in-your-enterprise/reviewing-audit-logs-for-your-enterprise/streaming-the-audit-log-for-your-enterprise#setting-up-audit-log-streaming'
detection:
  selection:
    action:
    - org.remove_outside_collaborator
    - project.update_user_permission
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: eaa9ac35-1730-441f-9587-25767bde99d7
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/application/github/audit/github_outside_collaborator_detected.yml
falsepositives:
- Validate the actor if permitted to access the repo.
- Validate the Multifactor Authentication changes.
notes:
  quarantine_reason: 'upstream status: test'
