id: sigmahq-sigma-dca8991c-cb16-4128-abf8-6b11e5cd156f
name: GitHub Repository Archive Status Changed
description: Detects when a GitHub repository is archived or unarchived, which may
  indicate unauthorized changes to repository status.
severity: low
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://docs.github.com/en/repositories/archiving-a-github-repository/archiving-repositories
- https://www.sentinelone.com/blog/exploiting-repos-6-ways-threat-actors-abuse-github-other-devops-platforms
- https://docs.github.com/en/authentication/keeping-your-account-and-data-secure/security-log-events
logsource:
  product: github
  service: audit
detection:
  selection:
    action:
    - repo.archived
    - repo.unarchived
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: dca8991c-cb16-4128-abf8-6b11e5cd156f
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/application/github/audit/github_repository_archive_status_changed.yml
falsepositives:
- Archiving or unarchiving a repository is often legitimate. Investigate this action
  to determine if it was authorized.
notes:
  quarantine_reason: 'upstream status: experimental'
