id: sigmahq-sigma-2f575940-d85e-4ddc-af13-17dad6f1a0ef
name: Github SSH Certificate Configuration Changed
description: Detects when changes are made to the SSH certificate configuration of
  the organization.
severity: medium
enabled: false
tags:
  mitre:
  - T1078.004
  categories:
  - endpoint
references:
- https://docs.github.com/en/enterprise-cloud@latest/organizations/managing-git-access-to-your-organizations-repositories/about-ssh-certificate-authorities
- https://docs.github.com/en/enterprise-cloud@latest/admin/monitoring-activity-in-your-enterprise/reviewing-audit-logs-for-your-enterprise/audit-log-events-for-your-enterprise#ssh_certificate_authority
logsource:
  product: github
  service: audit
  definition: 'Requirements: The audit log streaming feature must be enabled to be
    able to receive such logs. You can enable following the documentation here: https://docs.github.com/en/enterprise-cloud@latest/admin/monitoring-activity-in-your-enterprise/reviewing-audit-logs-for-your-enterprise/streaming-the-audit-log-for-your-enterprise#setting-up-audit-log-streaming'
detection:
  selection:
    action:
    - ssh_certificate_authority.create
    - ssh_certificate_requirement.disable
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 2f575940-d85e-4ddc-af13-17dad6f1a0ef
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/application/github/audit/github_ssh_certificate_config_changed.yml
falsepositives:
- Allowed administrative activities.
notes:
  quarantine_reason: 'upstream status: test'
