id: sigmahq-sigma-3883d9a0-fd0f-440f-afbb-445a2a799bb8
name: Github Secret Scanning Feature Disabled
description: Detects if the secret scanning feature is disabled for an enterprise
  or repository.
severity: high
enabled: false
tags:
  mitre:
  - T1685
  categories:
  - endpoint
references:
- https://docs.github.com/en/enterprise-cloud@latest/code-security/secret-scanning/about-secret-scanning
logsource:
  product: github
  service: audit
  definition: 'Requirements: The audit log streaming feature must be enabled to be
    able to receive such logs. You can enable following the documentation here: https://docs.github.com/en/enterprise-cloud@latest/admin/monitoring-activity-in-your-enterprise/reviewing-audit-logs-for-your-enterprise/streaming-the-audit-log-for-your-enterprise#setting-up-audit-log-streaming'
detection:
  selection:
    action:
    - business_secret_scanning.disable
    - business_secret_scanning.disabled_for_new_repos
    - repository_secret_scanning.disable
    - secret_scanning_new_repos.disable
    - secret_scanning.disable
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 3883d9a0-fd0f-440f-afbb-445a2a799bb8
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/application/github/audit/github_secret_scanning_feature_disabled.yml
falsepositives:
- Allowed administrative activities.
notes:
  quarantine_reason: 'upstream status: test'
