id: sigmahq-sigma-f8ed0e8f-7438-4b79-85eb-f358ef2fbebd
name: Github Self Hosted Runner Changes Detected
description: 'A self-hosted runner is a system that you deploy and manage to execute
  jobs from GitHub Actions on GitHub.com.

  This rule detects changes to self-hosted runners configurations in the environment.
  The self-hosted runner configuration changes once detected,

  it should be validated from GitHub UI because the log entry may not provide full
  context.'
severity: low
enabled: false
tags:
  mitre:
  - T1526
  - T1213.003
  - T1078.004
  categories:
  - endpoint
references:
- https://docs.github.com/en/actions/hosting-your-own-runners/about-self-hosted-runners#about-self-hosted-runners
- https://docs.github.com/en/organizations/keeping-your-organization-secure/managing-security-settings-for-your-organization/reviewing-the-audit-log-for-your-organization#search-based-on-operation
logsource:
  product: github
  service: audit
  definition: 'Requirements: The audit log streaming feature must be enabled to be
    able to receive such logs. You can enable following the documentation here: https://docs.github.com/en/enterprise-cloud@latest/admin/monitoring-activity-in-your-enterprise/reviewing-audit-logs-for-your-enterprise/streaming-the-audit-log-for-your-enterprise#setting-up-audit-log-streaming'
detection:
  selection:
    action:
    - org.remove_self_hosted_runner
    - org.runner_group_created
    - org.runner_group_removed
    - org.runner_group_runner_removed
    - org.runner_group_runners_added
    - org.runner_group_runners_updated
    - org.runner_group_updated
    - repo.register_self_hosted_runner
    - repo.remove_self_hosted_runner
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: f8ed0e8f-7438-4b79-85eb-f358ef2fbebd
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/application/github/audit/github_self_hosted_runner_changes_detected.yml
falsepositives:
- Allowed self-hosted runners changes in the environment.
- A self-hosted runner is automatically removed from GitHub if it has not connected
  to GitHub Actions for more than 14 days.
- An ephemeral self-hosted runner is automatically removed from GitHub if it has not
  connected to GitHub Actions for more than 1 day.
notes:
  quarantine_reason: 'upstream status: test'
