id: sigmahq-sigma-f9405037-bc97-4eb7-baba-167dad399b83
name: Github New Secret Created
description: Detects when a user creates action secret for the organization, environment,
  codespaces or repository.
severity: low
enabled: false
tags:
  mitre:
  - T1078.004
  categories:
  - endpoint
references:
- https://docs.github.com/en/organizations/keeping-your-organization-secure/managing-security-settings-for-your-organization/reviewing-the-audit-log-for-your-organization#audit-log-actions
logsource:
  product: github
  service: audit
  definition: 'Requirements: The audit log streaming feature must be enabled to be
    able to receive such logs. You can enable following the documentation here: https://docs.github.com/en/enterprise-cloud@latest/admin/monitoring-activity-in-your-enterprise/reviewing-audit-logs-for-your-enterprise/streaming-the-audit-log-for-your-enterprise#setting-up-audit-log-streaming'
detection:
  selection:
    action:
    - codespaces.create_an_org_secret
    - environment.create_actions_secret
    - org.create_actions_secret
    - repo.create_actions_secret
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: f9405037-bc97-4eb7-baba-167dad399b83
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/application/github/audit/github_new_secret_created.yml
falsepositives:
- This detection cloud be noisy depending on the environment. It is recommended to
  keep a check on the new secrets when created and validate the "actor".
notes:
  quarantine_reason: 'upstream status: test'
