id: sigmahq-sigma-04e2a23a-9b29-4a5c-be3a-3542e3f982ba
name: Google Workspace Granted Domain API Access
description: Detects when an API access service account is granted domain authority.
severity: medium
enabled: false
tags:
  mitre:
  - T1098
  categories:
  - cloud
references:
- https://cloud.google.com/logging/docs/audit/gsuite-audit-logging#3
- https://developers.google.com/admin-sdk/reports/v1/appendix/activity/admin-domain-settings#AUTHORIZE_API_CLIENT_ACCESS
logsource:
  product: gcp
  service: google_workspace.admin
detection:
  selection:
    eventService: admin.googleapis.com
    eventName: AUTHORIZE_API_CLIENT_ACCESS
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 04e2a23a-9b29-4a5c-be3a-3542e3f982ba
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/gcp/gworkspace/admin/gcp_gworkspace_granted_domain_api_access.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
