id: sigmahq-sigma-99980a85-3a61-43d3-ac0f-b68d6b4797b1
name: Google Cloud VPN Tunnel Modified or Deleted
description: Identifies when a VPN Tunnel Modified or Deleted in Google Cloud.
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - cloud
references:
- https://any-api.com/googleapis_com/compute/docs/vpnTunnels
logsource:
  product: gcp
  service: gcp.audit
detection:
  selection:
    gcp.audit.method_name:
    - compute.vpnTunnels.insert
    - compute.vpnTunnels.delete
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 99980a85-3a61-43d3-ac0f-b68d6b4797b1
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/gcp/audit/gcp_vpn_tunnel_modified_or_deleted.yml
falsepositives:
- VPN Tunnel being modified or deleted may be performed by a system administrator.
- Verify whether the user identity, user agent, and/or hostname should be making changes
  in your environment.
- VPN Tunnel modified or deleted from unfamiliar users should be investigated. If
  known behavior is causing false positives, it can be exempted from the rule.
notes:
  quarantine_reason: 'upstream status: test'
