id: sigmahq-sigma-2f0bae2d-bf20-4465-be86-1311addebaa3
name: Google Cloud Kubernetes Secrets Modified or Deleted
description: Identifies when the Secrets are Modified or Deleted.
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - cloud
references:
- https://cloud.google.com/kubernetes-engine/docs/how-to/audit-logging
logsource:
  product: gcp
  service: gcp.audit
detection:
  selection:
    gcp.audit.method_name:
    - io.k8s.core.v*.secrets.create
    - io.k8s.core.v*.secrets.update
    - io.k8s.core.v*.secrets.patch
    - io.k8s.core.v*.secrets.delete
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 2f0bae2d-bf20-4465-be86-1311addebaa3
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/gcp/audit/gcp_kubernetes_secrets_modified_or_deleted.yml
falsepositives:
- Secrets being modified or deleted may be performed by a system administrator. Verify
  whether the user identity, user agent, and/or hostname should be making changes
  in your environment.
- Secrets modified or deleted from unfamiliar users should be investigated. If known
  behavior is causing false positives, it can be exempted from the rule.
notes:
  quarantine_reason: 'upstream status: test'
