id: sigmahq-sigma-cd3a808c-c7b7-4c50-a2f3-f4cfcd436435
name: Google Cloud Kubernetes CronJob
description: 'Identifies when a Google Cloud Kubernetes CronJob runs in Azure Cloud.
  Kubernetes Job is a controller that creates one or more pods and ensures that a
  specified number of them successfully terminate.

  Kubernetes Job can be used to run containers that perform finite tasks for batch
  jobs. Kubernetes CronJob is used to schedule Jobs.

  An Adversary may use Kubernetes CronJob for scheduling execution of malicious code
  that would run as a container in the cluster.'
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - cloud
references:
- https://cloud.google.com/kubernetes-engine/docs
- https://kubernetes.io/docs/concepts/workloads/controllers/cron-jobs/
- https://kubernetes.io/docs/concepts/workloads/controllers/job/
logsource:
  product: gcp
  service: gcp.audit
detection:
  selection:
    gcp.audit.method_name:
    - io.k8s.api.batch.v*.Job
    - io.k8s.api.batch.v*.CronJob
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: cd3a808c-c7b7-4c50-a2f3-f4cfcd436435
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/gcp/audit/gcp_kubernetes_cronjob.yml
falsepositives:
- Google Cloud Kubernetes CronJob/Job may be done by a system administrator.
- If known behavior is causing false positives, it can be exempted from the rule.
notes:
  quarantine_reason: 'upstream status: test'
