id: sigmahq-sigma-bf638ef7-4d2d-44bb-a1dc-a238252e6267
name: Google Workspace Role Privilege Deleted
description: Detects when an a role privilege is deleted in Google Workspace.
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - cloud
references:
- https://cloud.google.com/logging/docs/audit/gsuite-audit-logging#3
- https://developers.google.com/admin-sdk/reports/v1/appendix/activity/admin-delegated-admin-settings
logsource:
  product: gcp
  service: google_workspace.admin
detection:
  selection:
    eventService: admin.googleapis.com
    eventName: REMOVE_PRIVILEGE
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: bf638ef7-4d2d-44bb-a1dc-a238252e6267
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/gcp/gworkspace/admin/gcp_gworkspace_role_privilege_deleted.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
