id: sigmahq-sigma-13f81a90-a69c-4fab-8f07-b5bb55416a9f
name: Google Cloud Service Account Disabled or Deleted
description: Identifies when a service account is disabled or deleted in Google Cloud.
severity: medium
enabled: false
tags:
  mitre:
  - T1531
  categories:
  - cloud
references:
- https://cloud.google.com/iam/docs/reference/rest/v1/projects.serviceAccounts
logsource:
  product: gcp
  service: gcp.audit
detection:
  selection:
    gcp.audit.method_name|endswith:
    - .serviceAccounts.disable
    - .serviceAccounts.delete
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 13f81a90-a69c-4fab-8f07-b5bb55416a9f
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/gcp/audit/gcp_service_account_disabled_or_deleted.yml
falsepositives:
- Service Account being disabled or deleted may be performed by a system administrator.
  Verify whether the user identity, user agent, and/or hostname should be making changes
  in your environment.
- Service Account disabled or deleted from unfamiliar users should be investigated.
  If known behavior is causing false positives, it can be exempted from the rule.
notes:
  quarantine_reason: 'upstream status: test'
