id: sigmahq-sigma-980a7598-1e7f-4962-9372-2d754c930d0e
name: Google Full Network Traffic Packet Capture
description: Identifies potential full network packet capture in gcp. This feature
  can potentially be abused to read sensitive data from unencrypted internal traffic.
severity: medium
enabled: false
tags:
  mitre:
  - T1074
  categories:
  - cloud
references:
- https://cloud.google.com/kubernetes-engine/docs/how-to/audit-logging
- https://developers.google.com/resources/api-libraries/documentation/compute/v1/java/latest/com/google/api/services/compute/Compute.PacketMirrorings.html
logsource:
  product: gcp
  service: gcp.audit
detection:
  selection:
    gcp.audit.method_name:
    - v*.Compute.PacketMirrorings.Get
    - v*.Compute.PacketMirrorings.Delete
    - v*.Compute.PacketMirrorings.Insert
    - v*.Compute.PacketMirrorings.Patch
    - v*.Compute.PacketMirrorings.List
    - v*.Compute.PacketMirrorings.aggregatedList
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 980a7598-1e7f-4962-9372-2d754c930d0e
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/gcp/audit/gcp_full_network_traffic_packet_capture.yml
falsepositives:
- Full Network Packet Capture may be done by a system or network administrator.
- If known behavior is causing false positives, it can be exempted from the rule.
notes:
  quarantine_reason: 'upstream status: test'
