id: sigmahq-sigma-ee2803f0-71c8-4831-b48b-a1fc57601ee4
name: Google Workspace Application Removed
description: Detects when an an application is removed from Google Workspace.
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - cloud
references:
- https://cloud.google.com/logging/docs/audit/gsuite-audit-logging#3
- https://developers.google.com/admin-sdk/reports/v1/appendix/activity/admin-domain-settings?hl=en#REMOVE_APPLICATION
- https://developers.google.com/admin-sdk/reports/v1/appendix/activity/admin-domain-settings?hl=en#REMOVE_APPLICATION_FROM_WHITELIST
logsource:
  product: gcp
  service: google_workspace.admin
detection:
  selection:
    eventService: admin.googleapis.com
    eventName:
    - REMOVE_APPLICATION
    - REMOVE_APPLICATION_FROM_WHITELIST
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: ee2803f0-71c8-4831-b48b-a1fc57601ee4
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/gcp/gworkspace/admin/gcp_gworkspace_application_removed.yml
falsepositives:
- Application being removed may be performed by a System Administrator.
notes:
  quarantine_reason: 'upstream status: test'
