id: sigmahq-sigma-6b67c12e-5e40-47c6-b3b0-1e6b571184cc
name: Google Cloud Service Account Modified
description: Identifies when a service account is modified in Google Cloud.
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - cloud
references:
- https://cloud.google.com/iam/docs/reference/rest/v1/projects.serviceAccounts
logsource:
  product: gcp
  service: gcp.audit
detection:
  selection:
    gcp.audit.method_name|endswith:
    - .serviceAccounts.patch
    - .serviceAccounts.create
    - .serviceAccounts.update
    - .serviceAccounts.enable
    - .serviceAccounts.undelete
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 6b67c12e-5e40-47c6-b3b0-1e6b571184cc
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/gcp/audit/gcp_service_account_modified.yml
falsepositives:
- Service Account being modified may be performed by a system administrator. Verify
  whether the user identity, user agent, and/or hostname should be making changes
  in your environment.
- Service Account modified from unfamiliar users should be investigated. If known
  behavior is causing false positives, it can be exempted from the rule.
notes:
  quarantine_reason: 'upstream status: test'
