id: sigmahq-sigma-fe513c69-734c-4d4a-8548-ac5f609be82b
name: Google Cloud Firewall Modified or Deleted
description: Detects  when a firewall rule is modified or deleted in Google Cloud
  Platform (GCP).
severity: medium
enabled: false
tags:
  mitre:
  - T1685
  categories:
  - cloud
references:
- https://cloud.google.com/kubernetes-engine/docs/how-to/audit-logging
- https://developers.google.com/resources/api-libraries/documentation/compute/v1/java/latest/com/google/api/services/compute/Compute.Firewalls.html
logsource:
  product: gcp
  service: gcp.audit
detection:
  selection:
    gcp.audit.method_name:
    - v*.Compute.Firewalls.Delete
    - v*.Compute.Firewalls.Patch
    - v*.Compute.Firewalls.Update
    - v*.Compute.Firewalls.Insert
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: fe513c69-734c-4d4a-8548-ac5f609be82b
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/gcp/audit/gcp_firewall_rule_modified_or_deleted.yml
falsepositives:
- Firewall rules being modified or deleted may be performed by a system administrator.
  Verify that the firewall configuration change was expected.
- Exceptions can be added to this rule to filter expected behavior.
notes:
  quarantine_reason: 'upstream status: test'
