id: sigmahq-sigma-6aef64e3-60c6-4782-8db3-8448759c714e
name: Google Workspace Role Modified or Deleted
description: Detects when an a role is modified or deleted in Google Workspace.
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - cloud
references:
- https://cloud.google.com/logging/docs/audit/gsuite-audit-logging#3
- https://developers.google.com/admin-sdk/reports/v1/appendix/activity/admin-delegated-admin-settings
logsource:
  product: gcp
  service: google_workspace.admin
detection:
  selection:
    eventService: admin.googleapis.com
    eventName:
    - DELETE_ROLE
    - RENAME_ROLE
    - UPDATE_ROLE
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 6aef64e3-60c6-4782-8db3-8448759c714e
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/gcp/gworkspace/admin/gcp_gworkspace_role_modified_or_deleted.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
