id: sigmahq-sigma-e56d3073-83ff-4021-90fe-c658e0709e72
name: Gpresult Display Group Policy Information
description: Detects cases in which a user uses the built-in Windows utility gpresult
  to display the Resultant Set of Policy (RSoP) information
severity: medium
enabled: false
tags:
  mitre:
  - T1615
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1615/T1615.md
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/gpresult
- https://unit42.paloaltonetworks.com/emissary-trojan-changelog-did-operation-lotus-blossom-cause-it-to-evolve/
- https://www.welivesecurity.com/wp-content/uploads/2020/05/ESET_Turla_ComRAT.pdf
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image|endswith: \gpresult.exe
    CommandLine|contains:
    - /z
    - /v
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: e56d3073-83ff-4021-90fe-c658e0709e72
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_gpresult_execution.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
