id: sigmahq-sigma-8a46f16c-8c4c-82d1-b121-0fdd3ba70a84
name: Group Has Been Deleted Via Groupdel
description: Detects execution of the "groupdel" binary. Which is used to delete a
  group. This is sometimes abused by threat actors in order to cover their tracks
severity: medium
enabled: false
tags:
  mitre:
  - T1531
  categories:
  - endpoint
references:
- https://linuxize.com/post/how-to-delete-group-in-linux/
- https://www.cyberciti.biz/faq/linux-remove-user-command/
- https://www.cybrary.it/blog/0p3n/linux-commands-used-attackers/
- https://linux.die.net/man/8/groupdel
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    Image|endswith: /groupdel
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 8a46f16c-8c4c-82d1-b121-0fdd3ba70a84
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/process_creation/proc_creation_lnx_groupdel.yml
falsepositives:
- Legitimate administrator activities
notes:
  quarantine_reason: 'upstream status: test'
