id: sigmahq-sigma-4ad97bf5-a514-41a4-abd3-4f3455ad4865
name: Guest Users Invited To Tenant By Non Approved Inviters
description: Detects guest users being invited to tenant by non-approved inviters
severity: medium
enabled: false
tags:
  mitre:
  - T1078
  categories:
  - cloud
references:
- https://learn.microsoft.com/en-gb/entra/architecture/security-operations-user-accounts#monitoring-external-user-sign-ins
logsource:
  product: azure
  service: auditlogs
detection:
  selection:
    Category: UserManagement
    OperationName: Invite external user
  filter:
    InitiatedBy|contains: <approved guest inviter use OR for multiple>
  condition: selection and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: 4ad97bf5-a514-41a4-abd3-4f3455ad4865
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/azure/audit_logs/azure_ad_guest_users_invited_to_tenant_by_non_approved_inviters.yml
falsepositives:
- If this was approved by System Administrator.
notes:
  quarantine_reason: 'upstream status: test'
