id: sigmahq-sigma-60f1ce20-484e-41bd-85f4-ac4afec2c541
name: GUI Input Capture - macOS
description: Detects attempts to use system dialog prompts to capture user credentials
severity: low
enabled: false
tags:
  mitre:
  - T1056.002
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1056.002/T1056.002.md
- https://scriptingosx.com/2018/08/user-interaction-from-bash-scripts/
logsource:
  product: macos
  category: process_creation
detection:
  selection_img:
    Image|endswith: /osascript
  selection_cli_1:
    CommandLine|contains|all:
    - -e
    - display
    - dialog
    - answer
  selection_cli_2:
    CommandLine|contains:
    - admin
    - administrator
    - authenticate
    - authentication
    - credentials
    - pass
    - password
    - unlock
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 60f1ce20-484e-41bd-85f4-ac4afec2c541
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/macos/process_creation/proc_creation_macos_gui_input_capture.yml
falsepositives:
- Legitimate administration tools and activities
notes:
  quarantine_reason: 'upstream status: test'
