id: sigmahq-sigma-f89b08d0-77ad-4728-817b-9b16c5a69c7a
name: HackTool - SharpImpersonation Execution
description: Detects execution of the SharpImpersonation tool. Which can be used to
  manipulate tokens on a Windows computers remotely (PsExec/WmiExec) or interactively
severity: high
enabled: false
tags:
  mitre:
  - T1134.001
  - T1134.003
  categories:
  - endpoint
references:
- https://s3cur3th1ssh1t.github.io/SharpImpersonation-Introduction/
- https://github.com/S3cur3Th1sSh1t/SharpImpersonation
logsource:
  product: windows
  category: process_creation
detection:
  selection_img:
  - Image|endswith: \SharpImpersonation.exe
  - OriginalFileName: SharpImpersonation.exe
  selection_cli:
  - CommandLine|contains|all:
    - ' user:'
    - ' binary:'
  - CommandLine|contains|all:
    - ' user:'
    - ' shellcode:'
  - CommandLine|contains:
    - ' technique:CreateProcessAsUserW'
    - ' technique:ImpersonateLoggedOnuser'
  condition: 1 of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: f89b08d0-77ad-4728-817b-9b16c5a69c7a
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_hktl_sharp_impersonation.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
