id: sigmahq-sigma-637f689e-b4a5-4a86-be0e-0100a0a33ba2
name: HackTool - EfsPotato Named Pipe Creation
description: Detects the pattern of a pipe name as used by the hack tool EfsPotato
severity: high
enabled: false
tags:
  mitre:
  - T1055
  categories:
  - endpoint
references:
- https://twitter.com/SBousseaden/status/1429530155291193354?s=20
- https://github.com/zcgonvh/EfsPotato
logsource:
  product: windows
  category: pipe_created
  definition: Note that you have to configure logging for Named Pipe Events in Sysmon
    config (Event ID 17 and Event ID 18). The basic configuration is in popular sysmon
    configuration (https://github.com/SwiftOnSecurity/sysmon-config), but it is worth
    verifying. You can also use other repo, e.g. https://github.com/Neo23x0/sysmon-config,
    https://github.com/olafhartong/sysmon-modular. How to test detection? You can
    check powershell script from this site https://svch0st.medium.com/guide-to-named-pipes-and-hunting-for-cobalt-strike-pipes-dc46b2c5f575
detection:
  selection:
    PipeName|contains:
    - \pipe\
    - \pipe\srvsvc
  filter_optional_ctx:
    PipeName|contains: \CtxShare
  filter_optional_default:
    PipeName|startswith: \pipe\
  condition: selection and not 1 of filter_optional_*
provenance:
  source: SigmaHQ/sigma
  source_id: 637f689e-b4a5-4a86-be0e-0100a0a33ba2
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/pipe_created/pipe_created_hktl_efspotato.yml
falsepositives:
- \pipe\LOCAL\Monitorian
notes:
  quarantine_reason: 'upstream status: test'
