id: sigmahq-sigma-ff23ffbc-3378-435e-992f-0624dcf93ab4
name: HackTool - PurpleSharp Execution
description: Detects the execution of the PurpleSharp adversary simulation tool
severity: critical
enabled: false
tags:
  mitre:
  - T1587
  categories:
  - endpoint
references:
- https://github.com/mvelazc0/PurpleSharp
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|contains: \purplesharp
  - OriginalFileName: PurpleSharp.exe
  selection_cli:
    CommandLine|contains:
    - xyz123456.exe
    - PurpleSharp
  condition: 1 of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: ff23ffbc-3378-435e-992f-0624dcf93ab4
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_hktl_purplesharp_indicators.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
