id: sigmahq-sigma-c7d33b50-f690-4b51-8cfb-0fb912a31e57
name: HackTool - SharpDPAPI Execution
description: 'Detects the execution of the SharpDPAPI tool based on CommandLine flags
  and PE metadata.

  SharpDPAPI is a C# port of some DPAPI functionality from the Mimikatz project.'
severity: high
enabled: false
tags:
  mitre:
  - T1134.001
  - T1134.003
  categories:
  - endpoint
references:
- https://github.com/GhostPack/SharpDPAPI
logsource:
  product: windows
  category: process_creation
detection:
  selection_img:
  - Image|endswith: \SharpDPAPI.exe
  - OriginalFileName: SharpDPAPI.exe
  selection_other_cli:
    CommandLine|contains:
    - ' backupkey '
    - ' blob '
    - ' certificates '
    - ' credentials '
    - ' keepass '
    - ' masterkeys '
    - ' rdg '
    - ' vaults '
  selection_other_options_guid:
    CommandLine|contains|all:
    - ' {'
    - '}:'
  selection_other_options_flags:
    CommandLine|contains:
    - ' /file:'
    - ' /machine'
    - ' /mkfile:'
    - ' /password:'
    - ' /pvk:'
    - ' /server:'
    - ' /target:'
    - ' /unprotect'
  condition: selection_img or (selection_other_cli and 1 of selection_other_options_*)
provenance:
  source: SigmaHQ/sigma
  source_id: c7d33b50-f690-4b51-8cfb-0fb912a31e57
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_hktl_sharp_dpapi_execution.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
