id: sigmahq-sigma-c260b6db-48ba-4b4a-a76f-2f67644e99d2
name: HackTool - Covenant PowerShell Launcher
description: Detects suspicious command lines used in Covenant luanchers
severity: high
enabled: false
tags:
  mitre:
  - T1059.001
  - T1564.003
  categories:
  - endpoint
references:
- https://posts.specterops.io/covenant-v0-5-eee0507b85ba
logsource:
  category: process_creation
  product: windows
detection:
  selection_1:
    CommandLine|contains|all:
    - -Sta
    - -Nop
    - -Window
    - Hidden
    CommandLine|contains:
    - -Command
    - -EncodedCommand
  selection_2:
    CommandLine|contains:
    - 'sv o (New-Object IO.MemorySteam);sv d '
    - mshta file.hta
    - GruntHTTP
    - -EncodedCommand cwB2ACAAbwAgA
  condition: 1 of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: c260b6db-48ba-4b4a-a76f-2f67644e99d2
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_hktl_covenant.yml
notes:
  quarantine_reason: 'upstream status: test'
