id: sigmahq-sigma-69ca006d-b9a9-47f5-80ff-ecd4d25d481a
name: HackTool - TruffleSnout Execution
description: Detects the use of TruffleSnout.exe an iterative AD discovery toolkit
  for offensive operators, situational awareness and targeted low noise enumeration.
severity: high
enabled: false
tags:
  mitre:
  - T1482
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1482/T1482.md
- https://github.com/dsnezhkov/TruffleSnout
- https://github.com/dsnezhkov/TruffleSnout/blob/7c2f22e246ef704bc96c396f66fa854e9ca742b9/TruffleSnout/Docs/USAGE.md
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - OriginalFileName: TruffleSnout.exe
  - Image|endswith: \TruffleSnout.exe
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 69ca006d-b9a9-47f5-80ff-ecd4d25d481a
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_hktl_trufflesnout.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
