id: sigmahq-sigma-93d94efc-d7ad-4161-ad7d-1638c4f908d8
name: HackTool - Dumpert Process Dumper Default File
description: Detects the creation of the default dump file used by Outflank Dumpert
  tool. A process dumper, which dumps the lsass process memory
severity: critical
enabled: false
tags:
  mitre:
  - T1003.001
  categories:
  - endpoint
references:
- https://github.com/outflanknl/Dumpert
- https://unit42.paloaltonetworks.com/actors-still-exploiting-sharepoint-vulnerability/
logsource:
  category: file_event
  product: windows
detection:
  selection:
    TargetFilename|endswith: dumpert.dmp
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 93d94efc-d7ad-4161-ad7d-1638c4f908d8
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_hktl_dumpert.yml
falsepositives:
- Very unlikely
notes:
  quarantine_reason: 'upstream status: test'
