id: sigmahq-sigma-3ab79e90-9fab-4cdf-a7b2-6522bc742adb
name: HackTool - RemoteKrbRelay SMB Relay Secrets Dump Module Indicators
description: Detects the creation of file with specific names used by RemoteKrbRelay
  SMB Relay attack module.
severity: high
enabled: false
tags:
  mitre:
  - T1219.002
  categories:
  - endpoint
references:
- https://github.com/CICADA8-Research/RemoteKrbRelay/blob/19ec76ba7aa50c2722b23359bc4541c0a9b2611c/Exploit/RemoteKrbRelay/Relay/Attacks/RemoteRegistry.cs#L31-L40
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename|endswith:
    - :\windows\temp\sam.tmp
    - :\windows\temp\sec.tmp
    - :\windows\temp\sys.tmp
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 3ab79e90-9fab-4cdf-a7b2-6522bc742adb
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_hktl_krbrelay_remote_ioc.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
