id: sigmahq-sigma-b1876533-4ed5-4a83-90f3-b8645840a413
name: HackTool - SafetyKatz Execution
description: Detects the execution of the hacktool SafetyKatz via PE information and
  default Image name
severity: critical
enabled: false
tags:
  mitre:
  - T1003.001
  categories:
  - endpoint
references:
- https://github.com/GhostPack/SafetyKatz
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Image|endswith: \SafetyKatz.exe
  - OriginalFileName: SafetyKatz.exe
  - Description: SafetyKatz
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: b1876533-4ed5-4a83-90f3-b8645840a413
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_hktl_safetykatz.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
