id: sigmahq-sigma-a29808fd-ef50-49ff-9c7a-59a9b040b404
name: HackTool - Pypykatz Credentials Dumping Activity
description: Detects the usage of "pypykatz" to obtain stored credentials. Adversaries
  may attempt to extract credential material from the Security Account Manager (SAM)
  database through Windows registry where the SAM database is stored
severity: high
enabled: false
tags:
  mitre:
  - T1003.002
  categories:
  - endpoint
references:
- https://github.com/skelsec/pypykatz
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1003.002/T1003.002.md#atomic-test-2---registry-parse-with-pypykatz
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith:
    - \pypykatz.exe
    - \python.exe
    CommandLine|contains|all:
    - live
    - registry
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: a29808fd-ef50-49ff-9c7a-59a9b040b404
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_hktl_pypykatz.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
