id: sigmahq-sigma-ca621ba5-54ab-4035-9942-d378e6fcde3c
name: HackTool - HandleKatz LSASS Dumper Execution
description: Detects the use of HandleKatz, a tool that demonstrates the usage of
  cloned handles to Lsass in order to create an obfuscated memory dump of the same
severity: high
enabled: false
tags:
  mitre:
  - T1003.001
  categories:
  - endpoint
references:
- https://github.com/codewhitesec/HandleKatz
logsource:
  category: process_creation
  product: windows
detection:
  selection_loader_img:
    Image|endswith: \loader.exe
    CommandLine|contains: '--pid:'
  selection_loader_imphash:
    Hashes|contains:
    - IMPHASH=38D9E015591BBFD4929E0D0F47FA0055
    - IMPHASH=0E2216679CA6E1094D63322E3412D650
  selection_flags:
    CommandLine|contains|all:
    - '--pid:'
    - '--outfile:'
    CommandLine|contains:
    - .dmp
    - lsass
    - .obf
    - dump
  condition: 1 of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: ca621ba5-54ab-4035-9942-d378e6fcde3c
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_hktl_handlekatz.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
