id: sigmahq-sigma-589ac73f-8e12-409c-964e-31a2f5775ae2
name: HackTool - WSASS Execution
description: 'Detects execution of WSASS, a tool used to dump LSASS memory on Windows
  systems by leveraging WER''s

  (Windows Error Reporting) WerFaultSecure.EXE to bypass PPL (Protected Process Light)
  protections.'
severity: high
enabled: false
tags:
  mitre:
  - T1003.001
  categories:
  - endpoint
references:
- https://github.com/TwoSevenOneT/WSASS
- https://www.zerosalarium.com/2025/09/Dumping-LSASS-With-WER-On-Modern-Windows-11.html
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
    Image|endswith: \wsass.exe
  selection_hash:
    Hashes|contains: IMPHASH=32F5095C9BBDCACF28FD4060EB4DFC42
  selection_cli:
    CommandLine|re: (?i)\.exe[\"\']?\s+[^\"]{0,64}werfaultsecure\.exe[\"\']?\s+\d{2,10}
  condition: 1 of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 589ac73f-8e12-409c-964e-31a2f5775ae2
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_hktl_wsass.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: experimental'
