id: sigmahq-sigma-961d0ba2-3eea-4303-a930-2cf78bbfcc5e
name: HackTool - Credential Dumping Tools Named Pipe Created
description: Detects well-known credential dumping tools execution via specific named
  pipe creation
severity: critical
enabled: false
tags:
  mitre:
  - T1003.001
  - T1003.002
  - T1003.004
  - T1003.005
  categories:
  - endpoint
references:
- https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
- https://image.slidesharecdn.com/zeronights2017kheirkhabarov-171118103000/75/hunting-for-credentials-dumping-in-windows-environment-57-2048.jpg?cb=1666035799
logsource:
  product: windows
  category: pipe_created
  definition: Note that you have to configure logging for Named Pipe Events in Sysmon
    config (Event ID 17 and Event ID 18). The basic configuration is in popular sysmon
    configuration (https://github.com/SwiftOnSecurity/sysmon-config), but it is worth
    verifying. You can also use other repo, e.g. https://github.com/Neo23x0/sysmon-config,
    https://github.com/olafhartong/sysmon-modular. How to test detection? You can
    check powershell script from this site https://svch0st.medium.com/guide-to-named-pipes-and-hunting-for-cobalt-strike-pipes-dc46b2c5f575
detection:
  selection:
    PipeName|contains:
    - \cachedump
    - \lsadump
    - \wceservicepipe
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 961d0ba2-3eea-4303-a930-2cf78bbfcc5e
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/pipe_created/pipe_created_hktl_generic_cred_dump_tools_pipes.yml
falsepositives:
- Legitimate Administrator using tool for password recovery
notes:
  quarantine_reason: 'upstream status: test'
