id: sigmahq-sigma-e074832a-eada-4fd7-94a1-10642b130e16
name: HackTool - SafetyKatz Dump Indicator
description: Detects default lsass dump filename generated by SafetyKatz.
severity: high
enabled: false
tags:
  mitre:
  - T1003.001
  categories:
  - endpoint
references:
- https://github.com/GhostPack/SafetyKatz
- https://github.com/GhostPack/SafetyKatz/blob/715b311f76eb3a4c8d00a1bd29c6cd1899e450b7/SafetyKatz/Program.cs#L63
logsource:
  category: file_event
  product: windows
detection:
  selection:
    TargetFilename|endswith: \Temp\debug.bin
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: e074832a-eada-4fd7-94a1-10642b130e16
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_hktl_safetykatz.yml
falsepositives:
- Rare legitimate files with similar filename structure
notes:
  quarantine_reason: 'upstream status: test'
