id: sigmahq-sigma-d9367cbb-c2e0-47ce-bdc0-128cb6da898d
name: HackTool - SharpLdapWhoami Execution
description: Detects SharpLdapWhoami, a whoami alternative that queries the LDAP service
  on a domain controller
severity: high
enabled: false
tags:
  mitre:
  - T1033
  categories:
  - endpoint
references:
- https://github.com/bugch3ck/SharpLdapWhoami
logsource:
  category: process_creation
  product: windows
detection:
  selection_name:
    Image|endswith: \SharpLdapWhoami.exe
  selection_pe:
  - OriginalFileName|contains: SharpLdapWhoami
  - Product: SharpLdapWhoami
  selection_flags1:
    CommandLine|endswith:
    - ' /method:ntlm'
    - ' /method:kerb'
    - ' /method:nego'
    - ' /m:nego'
    - ' /m:ntlm'
    - ' /m:kerb'
  condition: 1 of selection*
provenance:
  source: SigmaHQ/sigma
  source_id: d9367cbb-c2e0-47ce-bdc0-128cb6da898d
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_hktl_sharpldapwhoami.yml
falsepositives:
- Programs that use the same command line flags
notes:
  quarantine_reason: 'upstream status: test'
