id: sigmahq-sigma-c42a3073-30fb-48ae-8c99-c23ada84b103
name: Hack Tool User Agent
description: Detects suspicious user agent strings user by hack tools in proxy logs
severity: high
enabled: false
tags:
  mitre:
  - T1190
  - T1110
  categories:
  - network
references:
- https://github.com/fastly/waf_testbed/blob/8bfc406551f3045e418cbaad7596cff8da331dfc/templates/default/scanners-user-agents.data.erb
- http://rules.emergingthreats.net/open/snort-2.9.0/rules/emerging-user_agents.rules
logsource:
  category: proxy
detection:
  selection:
    c-useragent|contains:
    - (hydra)
    - ' arachni/'
    - ' BFAC '
    - ' brutus '
    - ' cgichk '
    - core-project/1.0
    - ' crimscanner/'
    - datacha0s
    - dirbuster
    - domino hunter
    - dotdotpwn
    - FHScan Core
    - floodgate
    - get-minimal
    - gootkit auto-rooter scanner
    - grendel-scan
    - ' inspath '
    - internet ninja
    - jaascois
    - ' zmeu '
    - masscan
    - ' metis '
    - morfeus fucking scanner
    - n-stealth
    - nsauditor
    - pmafind
    - security scan
    - springenwerk
    - teh forest lobster
    - toata dragostea
    - ' vega/'
    - voideye
    - webshag
    - webvulnscan
    - ' whcc/'
    - ' Havij'
    - absinthe
    - bsqlbf
    - mysqloit
    - pangolin
    - sql power injector
    - sqlmap
    - sqlninja
    - uil2pn
    - ruler
    - Mozilla/5.0 (Windows; U; Windows NT 5.1; pt-PT; rv:1.9.1.2) Gecko/20090729 Firefox/3.5.2
      (.NET CLR 3.5.30729)
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: c42a3073-30fb-48ae-8c99-c23ada84b103
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/web/proxy_generic/proxy_ua_hacktool.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
