id: sigmahq-sigma-9082ff1f-88ab-4678-a3cc-5bcff99fc74d
name: HackTool - GMER Rootkit Detector and Remover Execution
description: Detects the execution GMER tool based on image and hash fields.
severity: high
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- http://www.gmer.net/
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
    Image|endswith: \gmer.exe
  selection_sysmon_hash:
    Hashes|contains:
    - MD5=E9DC058440D321AA17D0600B3CA0AB04
    - SHA1=539C228B6B332F5AA523E5CE358C16647D8BBE57
    - SHA256=E8A3E804A96C716A3E9B69195DB6FFB0D33E2433AF871E4D4E1EAB3097237173
  condition: 1 of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 9082ff1f-88ab-4678-a3cc-5bcff99fc74d
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_hktl_gmer.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
