id: sigmahq-sigma-6309645e-122d-4c5b-bb2b-22e4f9c2fa42
name: HackTool - Potential CobaltStrike Process Injection
description: Detects a potential remote threat creation with certain characteristics
  which are typical for Cobalt Strike beacons
severity: high
enabled: false
tags:
  mitre:
  - T1055.001
  categories:
  - endpoint
references:
- https://medium.com/@olafhartong/cobalt-strike-remote-threads-detection-206372d11d0f
- https://blog.cobaltstrike.com/2018/04/09/cobalt-strike-3-11-the-snake-that-eats-its-tail/
logsource:
  product: windows
  category: create_remote_thread
detection:
  selection:
    StartAddress|endswith:
    - 0B80
    - 0C7C
    - 0C88
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 6309645e-122d-4c5b-bb2b-22e4f9c2fa42
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/create_remote_thread/create_remote_thread_win_hktl_cobaltstrike.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
