id: sigmahq-sigma-9f8fc146-1d1a-4dbf-b8fd-dfae15e08541
name: HackTool - SharpLDAPmonitor Execution
description: Detects execution of the SharpLDAPmonitor. Which can monitor the creation,
  deletion and changes to LDAP objects.
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://github.com/p0dalirius/LDAPmonitor
logsource:
  product: windows
  category: process_creation
detection:
  selection_img:
  - Image|endswith: \SharpLDAPmonitor.exe
  - OriginalFileName: SharpLDAPmonitor.exe
  selection_cli:
    CommandLine|contains|all:
    - '/user:'
    - '/pass:'
    - '/dcip:'
  condition: 1 of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 9f8fc146-1d1a-4dbf-b8fd-dfae15e08541
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_hktl_sharp_ldap_monitor.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
