id: sigmahq-sigma-b0ce780f-10bd-496d-9067-066d23dc3aa5
name: HackTool - SharpWSUS/WSUSpendu Execution
description: 'Detects the execution of SharpWSUS or WSUSpendu, utilities that allow
  for lateral movement through WSUS.

  Windows Server Update Services (WSUS) is a critical component of Windows systems
  and is frequently configured in a way that allows an attacker to circumvent internal
  networking limitations.'
severity: high
enabled: false
tags:
  mitre:
  - T1210
  categories:
  - endpoint
references:
- https://labs.nettitude.com/blog/introducing-sharpwsus/
- https://github.com/nettitude/SharpWSUS
- https://web.archive.org/web/20210512154016/https://github.com/AlsidOfficial/WSUSpendu/blob/master/WSUSpendu.ps1
logsource:
  product: windows
  category: process_creation
detection:
  selection_wsuspendu_inject:
    CommandLine|contains: ' -Inject '
  selection_wsuspendu_payload:
    CommandLine|contains:
    - ' -PayloadArgs '
    - ' -PayloadFile '
  selection_sharpwsus_commands:
    CommandLine|contains:
    - ' approve '
    - ' create '
    - ' check '
    - ' delete '
  selection_sharpwsus_flags:
    CommandLine|contains:
    - ' /payload:'
    - ' /payload='
    - ' /updateid:'
    - ' /updateid='
  condition: all of selection_wsuspendu_* or all of selection_sharpwsus_*
provenance:
  source: SigmaHQ/sigma
  source_id: b0ce780f-10bd-496d-9067-066d23dc3aa5
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_hktl_sharpwsus_wsuspendu_execution.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
