id: sigmahq-sigma-f26307d8-14cd-47e3-a26b-4b4769f24af6
name: HackTool - CrackMapExec Process Patterns
description: Detects suspicious process patterns found in logs when CrackMapExec is
  used
severity: high
enabled: false
tags:
  mitre:
  - T1003.001
  categories:
  - endpoint
references:
- https://mpgn.gitbook.io/crackmapexec/smb-protocol/obtaining-credentials/dump-lsass
logsource:
  product: windows
  category: process_creation
detection:
  selection_lsass_dump1:
    CommandLine|contains|all:
    - 'tasklist /fi '
    - Imagename eq lsass.exe
    CommandLine|contains:
    - 'cmd.exe /c '
    - 'cmd.exe /r '
    - 'cmd.exe /k '
    - 'cmd /c '
    - 'cmd /r '
    - 'cmd /k '
    User|contains:
    - AUTHORI
    - AUTORI
  selection_lsass_dump2:
    CommandLine|contains|all:
    - do rundll32.exe C:\windows\System32\comsvcs.dll, MiniDump
    - \Windows\Temp\
    - ' full'
    - '%%B'
  selection_procdump:
    CommandLine|contains|all:
    - tasklist /v /fo csv
    - findstr /i "lsass"
  condition: 1 of selection*
provenance:
  source: SigmaHQ/sigma
  source_id: f26307d8-14cd-47e3-a26b-4b4769f24af6
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_hktl_crackmapexec_patterns.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
