id: sigmahq-sigma-f5e3b62f-e577-4e59-931e-0a15b2b94e1e
name: HackTool - Htran/NATBypass Execution
description: Detects executable names or flags used by Htran or Htran-like tools (e.g.
  NATBypass)
severity: high
enabled: false
tags:
  mitre:
  - T1090
  categories:
  - endpoint
references:
- https://github.com/HiwinCN/HTran
- https://github.com/cw1997/NATBypass
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
    Image|endswith:
    - \htran.exe
    - \lcx.exe
  selection_cli:
    CommandLine|contains:
    - '.exe -tran '
    - '.exe -slave '
  condition: 1 of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: f5e3b62f-e577-4e59-931e-0a15b2b94e1e
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_hktl_htran_or_natbypass.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
