id: sigmahq-sigma-0a99eb3e-1617-41bd-b095-13dc767f3def
name: HackTool - Jlaive In-Memory Assembly Execution
description: Detects the use of Jlaive to execute assemblies in a copied PowerShell
severity: medium
enabled: false
tags:
  mitre:
  - T1059.003
  categories:
  - endpoint
references:
- https://jstnk9.github.io/jstnk9/research/Jlaive-Antivirus-Evasion-Tool
- https://web.archive.org/web/20220514073704/https://github.com/ch2sh/Jlaive
logsource:
  product: windows
  category: process_creation
detection:
  parent_selection:
    ParentImage|endswith: \cmd.exe
    ParentCommandLine|endswith: .bat
  selection1:
    Image|endswith: \xcopy.exe
    CommandLine|contains|all:
    - powershell.exe
    - .bat.exe
  selection2:
    Image|endswith: \xcopy.exe
    CommandLine|contains|all:
    - pwsh.exe
    - .bat.exe
  selection3:
    Image|endswith: \attrib.exe
    CommandLine|contains|all:
    - +s
    - +h
    - .bat.exe
  condition: parent_selection and (1 of selection*)
provenance:
  source: SigmaHQ/sigma
  source_id: 0a99eb3e-1617-41bd-b095-13dc767f3def
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_hktl_jlaive_batch_execution.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
