id: sigmahq-sigma-36d88494-1d43-4dc0-b3fa-35c8fea0ca9d
name: HackTool - CreateMiniDump Execution
description: Detects the use of CreateMiniDump hack tool used to dump the LSASS process
  memory for credential extraction on the attacker's machine
severity: high
enabled: false
tags:
  mitre:
  - T1003.001
  categories:
  - endpoint
references:
- https://ired.team/offensive-security/credential-access-and-credential-dumping/dumping-lsass-passwords-without-mimikatz-minidumpwritedump-av-signature-bypass
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Image|endswith: \CreateMiniDump.exe
  - Hashes|contains: IMPHASH=4a07f944a83e8a7c2525efa35dd30e2f
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 36d88494-1d43-4dc0-b3fa-35c8fea0ca9d
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_hktl_createminidump.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
