id: sigmahq-sigma-42a993dd-bb3e-48c8-b372-4d6684c4106c
name: HackTool - CrackMapExec Execution
description: This rule detect common flag combinations used by CrackMapExec in order
  to detect its use even if the binary has been replaced.
severity: high
enabled: false
tags:
  mitre:
  - T1047
  - T1053
  - T1059.003
  - T1059.001
  - T1110
  - T1201
  categories:
  - endpoint
references:
- https://mpgn.gitbook.io/crackmapexec/smb-protocol/authentication/checking-credentials-local
- https://www.mandiant.com/resources/telegram-malware-iranian-espionage
- https://www.infosecmatter.com/crackmapexec-module-library/?cmem=mssql-mimikatz
- https://www.infosecmatter.com/crackmapexec-module-library/?cmem=smb-pe_inject
logsource:
  category: process_creation
  product: windows
detection:
  selection_binary:
    Image|endswith: \crackmapexec.exe
  selection_special:
    CommandLine|contains: ' -M pe_inject '
  selection_execute:
    CommandLine|contains|all:
    - ' --local-auth'
    - ' -u '
    - ' -x '
  selection_hash:
    CommandLine|contains|all:
    - ' --local-auth'
    - ' -u '
    - ' -p '
    - ' -H ''NTHASH'''
  selection_module_mssql:
    CommandLine|contains|all:
    - ' mssql '
    - ' -u '
    - ' -p '
    - ' -M '
    - ' -d '
  selection_module_smb1:
    CommandLine|contains|all:
    - ' smb '
    - ' -u '
    - ' -H '
    - ' -M '
    - ' -o '
  selection_module_smb2:
    CommandLine|contains|all:
    - ' smb '
    - ' -u '
    - ' -p '
    - ' --local-auth'
  part_localauth_1:
    CommandLine|contains|all:
    - ' --local-auth'
    - ' -u '
    - ' -p '
  part_localauth_2:
    CommandLine|contains|all:
    - ' 10.'
    - ' 192.168.'
    - '/24 '
  condition: 1 of selection_* or all of part_localauth*
provenance:
  source: SigmaHQ/sigma
  source_id: 42a993dd-bb3e-48c8-b372-4d6684c4106c
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_hktl_crackmapexec_execution.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
