id: sigmahq-sigma-d78b5d61-187d-44b6-bf02-93486a80de5a
name: HackTool - DInjector PowerShell Cradle Execution
description: Detects the use of the Dinject PowerShell cradle based on the specific
  flags
severity: critical
enabled: false
tags:
  mitre:
  - T1055
  categories:
  - endpoint
references:
- https://web.archive.org/web/20211001064856/https://github.com/snovvcrash/DInjector
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains|all:
    - ' /am51'
    - ' /password'
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: d78b5d61-187d-44b6-bf02-93486a80de5a
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_hktl_dinjector.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
