id: sigmahq-sigma-0685b176-c816-4837-8e7b-1216f346636b
name: HackTool - Quarks PwDump Execution
description: Detects usage of the Quarks PwDump tool via commandline arguments
severity: high
enabled: false
tags:
  mitre:
  - T1003.002
  categories:
  - endpoint
references:
- https://github.com/quarkslab/quarkspwdump
- https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/seedworm-apt-iran-middle-east
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
    Image|endswith: \QuarksPwDump.exe
  selection_cli:
    CommandLine:
    - ' -dhl'
    - ' --dump-hash-local'
    - ' -dhdc'
    - ' --dump-hash-domain-cached'
    - ' --dump-bitlocker'
    - ' -dhd '
    - ' --dump-hash-domain '
    - --ntds-file
  condition: 1 of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 0685b176-c816-4837-8e7b-1216f346636b
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_hktl_quarks_pwdump.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
