id: sigmahq-sigma-7b14c76a-c602-4ae6-9717-eff868153fc0
name: HackTool - NoFilter Execution
description: Detects execution of NoFilter, a tool for abusing the Windows Filtering
  Platform for privilege escalation via hardcoded policy name indicators
severity: high
enabled: false
tags:
  mitre:
  - T1134
  - T1134.001
  categories:
  - endpoint
references:
- https://github.com/deepinstinct/NoFilter/blob/121d215ab130c5e8e3ad45a7e7fcd56f4de97b4d/NoFilter/Consts.cpp
- https://github.com/deepinstinct/NoFilter
- https://www.deepinstinct.com/blog/nofilter-abusing-windows-filtering-platform-for-privilege-escalation
- https://x.com/_st0pp3r_/status/1742203752361128162?s=20
logsource:
  product: windows
  service: security
  definition: 'Requirements: Audit Filtering Platform Policy Change needs to be enabled'
detection:
  selection_5447:
    EventID: 5447
    FilterName|contains: RonPolicy
  selection_5449:
    EventID: 5449
    ProviderContextName|contains: RonPolicy
  condition: 1 of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 7b14c76a-c602-4ae6-9717-eff868153fc0
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/security/win_security_hktl_nofilter.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
