id: sigmahq-sigma-6938366d-8954-4ddc-baff-c830b3ba8fcd
name: HackTool - Certipy Execution
description: Detects Certipy execution, a tool for Active Directory Certificate Services
  enumeration and abuse based on PE metadata characteristics and common command line
  arguments.
severity: high
enabled: false
tags:
  mitre:
  - T1649
  categories:
  - endpoint
references:
- https://github.com/ly4k/Certipy
- https://research.ifcr.dk/certipy-4-0-esc9-esc10-bloodhound-gui-new-authentication-and-request-methods-and-more-7237d88061f7
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \Certipy.exe
  - OriginalFileName: Certipy.exe
  - Description|contains: Certipy
  selection_cli_commands:
    CommandLine|contains:
    - ' account '
    - ' auth '
    - ' cert '
    - ' find '
    - ' forge '
    - ' ptt '
    - ' relay '
    - ' req '
    - ' shadow '
    - ' template '
  selection_cli_flags:
    CommandLine|contains:
    - ' -bloodhound'
    - ' -ca-pfx '
    - ' -dc-ip '
    - ' -kirbi'
    - ' -old-bloodhound'
    - ' -pfx '
    - ' -target'
    - ' -template'
    - ' -username '
    - ' -vulnerable'
    - auth -pfx
    - shadow auto
    - shadow list
  condition: selection_img or all of selection_cli_*
provenance:
  source: SigmaHQ/sigma
  source_id: 6938366d-8954-4ddc-baff-c830b3ba8fcd
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_hktl_certipy.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
