id: sigmahq-sigma-2704ab9e-afe2-4854-a3b1-0c0706d03578
name: HackTool - Dumpert Process Dumper Execution
description: Detects the use of Dumpert process dumper, which dumps the lsass.exe
  process memory
severity: critical
enabled: false
tags:
  mitre:
  - T1003.001
  categories:
  - endpoint
references:
- https://github.com/outflanknl/Dumpert
- https://unit42.paloaltonetworks.com/actors-still-exploiting-sharepoint-vulnerability/
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Hashes|contains: MD5=09D278F9DE118EF09163C6140255C690
  - CommandLine|contains: Dumpert.dll
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 2704ab9e-afe2-4854-a3b1-0c0706d03578
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_hktl_dumpert.yml
falsepositives:
- Very unlikely
notes:
  quarantine_reason: 'upstream status: test'
