id: sigmahq-sigma-7a4d9232-92fc-404d-8ce1-4c92e7caf539
name: HackTool - Stracciatella Execution
description: Detects Stracciatella which executes a Powershell runspace from within
  C# (aka SharpPick technique) with AMSI, ETW and Script Block Logging disabled based
  on PE metadata characteristics.
severity: high
enabled: false
tags:
  mitre:
  - T1059
  - T1685
  categories:
  - endpoint
references:
- https://github.com/mgeeky/Stracciatella
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Image|endswith: \Stracciatella.exe
  - OriginalFileName: Stracciatella.exe
  - Description: Stracciatella
  - Hashes|contains:
    - SHA256=9d25e61ec1527e2a69d7c2a4e3fe2fe15890710c198a66a9f25d99fdf6c7b956
    - SHA256=fd16609bd9830c63b9413671678bb159b89c357d21942ddbb6b93add808d121a
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 7a4d9232-92fc-404d-8ce1-4c92e7caf539
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_hktl_stracciatella_execution.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
