id: sigmahq-sigma-6bd75993-9888-4f91-9404-e1e4e4e34b77
name: HackTool - LocalPotato Execution
description: Detects the execution of the LocalPotato POC based on basic PE metadata
  information and default CLI examples
severity: high
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://www.localpotato.com/localpotato_html/LocalPotato.html
- https://github.com/decoder-it/LocalPotato
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
    Image|endswith: \LocalPotato.exe
  selection_cli:
    CommandLine|contains|all:
    - .exe -i C:\
    - -o Windows\
  selection_hash_plain:
    Hashes|contains:
    - IMPHASH=E1742EE971D6549E8D4D81115F88F1FC
    - IMPHASH=DD82066EFBA94D7556EF582F247C8BB5
  condition: 1 of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 6bd75993-9888-4f91-9404-e1e4e4e34b77
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_hktl_localpotato.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
