id: sigmahq-sigma-7aa7009a-28b9-4344-8c1f-159489a390df
name: HackTool - Windows Credential Editor (WCE) Execution
description: 'Detects the use of Windows Credential Editor (WCE), a popular post-exploitation
  tool used to extract plaintext passwords, hash, PIN code and Kerberos tickets from
  memory.

  It is often used by threat actors for credential dumping and lateral movement within
  compromised networks.'
severity: critical
enabled: false
tags:
  mitre:
  - T1003.001
  categories:
  - endpoint
references:
- https://www.ampliasecurity.com/research/windows-credentials-editor/
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
    Image|endswith:
    - \WCE.exe
    - \WCE64.exe
  selection_hash:
    Hashes|contains:
    - IMPHASH=136F0A8572C058A96436C82E541E4C41
    - IMPHASH=589657C64DDE88533186C39F82FA1F50
    - IMPHASH=6BFE09EFCB4FFDE061EBDBAFC4DB84CF
    - IMPHASH=7D490037BF450877E6D0287BDCFF8D2E
    - IMPHASH=8AB93B061287C79F3088C5BC7E7D97ED
    - IMPHASH=A53A02B997935FD8EEDCB5F7ABAB9B9F
    - IMPHASH=BA434A7A729EEC20E136CA4C32D6C740
    - IMPHASH=BD1D1547DA13C0FCB6C15E86217D5EB8
    - IMPHASH=E96A73C7BF33A464C510EDE582318BF2
  condition: 1 of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 7aa7009a-28b9-4344-8c1f-159489a390df
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_hktl_wce.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
