id: sigmahq-sigma-6e2a900a-ced9-4e4a-a9c2-13e706f9518a
name: HackTool - Potential Remote Credential Dumping Activity Via CrackMapExec Or
  Impacket-Secretsdump
description: Detects default filenames output from the execution of CrackMapExec and
  Impacket-secretsdump against an endpoint.
severity: high
enabled: false
tags:
  mitre:
  - T1003
  categories:
  - endpoint
references:
- https://github.com/Porchetta-Industries/CrackMapExec
- https://github.com/fortra/impacket/blob/ff8c200fd040b04d3b5ff05449646737f836235d/examples/secretsdump.py
logsource:
  product: windows
  category: file_event
detection:
  selection:
    Image|endswith: \svchost.exe
    TargetFilename|re: \\Windows\\System32\\[a-zA-Z0-9]{8}\.tmp$
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 6e2a900a-ced9-4e4a-a9c2-13e706f9518a
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_hktl_remote_cred_dump.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
