id: sigmahq-sigma-762f2482-ff21-4970-8939-0aa317a886bb
name: HackTool - Certify Execution
description: Detects Certify a tool for Active Directory certificate abuse based on
  PE metadata characteristics and common command line arguments.
severity: high
enabled: false
tags:
  mitre:
  - T1649
  categories:
  - endpoint
references:
- https://github.com/GhostPack/Certify
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \Certify.exe
  - OriginalFileName: Certify.exe
  - Description|contains: Certify
  selection_cli_commands:
    CommandLine|contains:
    - '.exe cas '
    - '.exe find '
    - '.exe pkiobjects '
    - '.exe request '
    - '.exe download '
  selection_cli_options:
    CommandLine|contains:
    - ' /vulnerable'
    - ' /template:'
    - ' /altname:'
    - ' /domain:'
    - ' /path:'
    - ' /ca:'
  condition: selection_img or all of selection_cli_*
provenance:
  source: SigmaHQ/sigma
  source_id: 762f2482-ff21-4970-8939-0aa317a886bb
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_hktl_certify.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
