id: sigmahq-sigma-a34f79a3-8e5f-4cc3-b765-de00695452c2
name: HackTool - PowerTool Execution
description: Detects the execution of the tool PowerTool which has the ability to
  kill a process, delete its process file, unload drivers, and delete the driver files
severity: high
enabled: false
tags:
  mitre:
  - T1685
  categories:
  - endpoint
references:
- https://thedfirreport.com/2022/11/28/emotet-strikes-again-lnk-file-leads-to-domain-wide-ransomware/
- https://www.trendmicro.com/en_us/research/22/i/play-ransomware-s-attack-playbook-unmasks-it-as-another-hive-aff.html
- https://twitter.com/gbti_sa/status/1249653895900602375?lang=en
- https://www.softpedia.com/get/Antivirus/Removal-Tools/ithurricane-PowerTool.shtml
logsource:
  product: windows
  category: process_creation
detection:
  selection:
  - Image|endswith:
    - \PowerTool.exe
    - \PowerTool64.exe
  - OriginalFileName: PowerTool.exe
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: a34f79a3-8e5f-4cc3-b765-de00695452c2
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_hktl_powertool.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
