id: sigmahq-sigma-cad1fe90-2406-44dc-bd03-59d0b58fe722
name: HackTool - NPPSpy Hacktool Usage
description: Detects the use of NPPSpy hacktool that stores cleartext passwords of
  users that logged in to a local file
severity: high
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1003/T1003.md#atomic-test-2---credential-dumping-with-nppspy
- https://twitter.com/0gtweet/status/1465282548494487554
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename|endswith:
    - \NPPSpy.txt
    - \NPPSpy.dll
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: cad1fe90-2406-44dc-bd03-59d0b58fe722
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_hktl_nppspy.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
