id: sigmahq-sigma-03552375-cc2c-4883-bbe4-7958d5a980be
name: HackTool - SILENTTRINITY Stager Execution
description: Detects SILENTTRINITY stager use via PE metadata
severity: high
enabled: false
tags:
  mitre:
  - T1071
  categories:
  - endpoint
references:
- https://github.com/byt3bl33d3r/SILENTTRINITY
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Description|contains: st2stager
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 03552375-cc2c-4883-bbe4-7958d5a980be
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_hktl_silenttrinity_stager.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
