id: sigmahq-sigma-79f4ede3-402e-41c8-bc3e-ebbf5f162581
name: HackTool - Empire PowerShell Launch Parameters
description: Detects suspicious powershell command line parameters used in Empire
severity: high
enabled: false
tags:
  mitre:
  - T1059.001
  categories:
  - endpoint
references:
- https://github.com/EmpireProject/Empire/blob/c2ba61ca8d2031dad0cfc1d5770ba723e8b710db/lib/common/helpers.py#L165
- https://github.com/EmpireProject/Empire/blob/e37fb2eef8ff8f5a0a689f1589f424906fe13055/lib/modules/powershell/persistence/powerbreach/deaduser.py#L191
- https://github.com/EmpireProject/Empire/blob/e37fb2eef8ff8f5a0a689f1589f424906fe13055/lib/modules/powershell/persistence/powerbreach/resolver.py#L178
- https://github.com/EmpireProject/Empire/blob/e37fb2eef8ff8f5a0a689f1589f424906fe13055/data/module_source/privesc/Invoke-EventVwrBypass.ps1#L64
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains:
    - ' -NoP -sta -NonI -W Hidden -Enc '
    - ' -noP -sta -w 1 -enc '
    - ' -NoP -NonI -W Hidden -enc '
    - ' -noP -sta -w 1 -enc'
    - ' -enc  SQB'
    - ' -nop -exec bypass -EncodedCommand '
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 79f4ede3-402e-41c8-bc3e-ebbf5f162581
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_hktl_empire_powershell_launch.yml
falsepositives:
- Other tools that incidentally use the same command line parameters
notes:
  quarantine_reason: 'upstream status: test'
