id: sigmahq-sigma-42333b2c-b425-441c-b70e-99404a17170f
name: HackTool - Sliver C2 Implant Activity Pattern
description: Detects process activity patterns as seen being used by Sliver C2 framework
  implants
severity: critical
enabled: false
tags:
  mitre:
  - T1059
  categories:
  - endpoint
references:
- https://github.com/BishopFox/sliver/blob/79f2d48fcdfc2bee4713b78d431ea4b27f733f30/implant/sliver/shell/shell_windows.go#L36
- https://www.microsoft.com/security/blog/2022/08/24/looking-for-the-sliver-lining-hunting-for-emerging-command-and-control-frameworks/
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains: -NoExit -Command [Console]::OutputEncoding=[Text.UTF8Encoding]::UTF8
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 42333b2c-b425-441c-b70e-99404a17170f
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_hktl_sliver_c2_execution_pattern.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
