id: sigmahq-sigma-bb09dd3e-2b78-4819-8e35-a7c1b874e449
name: HackTool - Inveigh Execution Artefacts
description: Detects the presence and execution of Inveigh via dropped artefacts
severity: critical
enabled: false
tags:
  mitre:
  - T1219.002
  categories:
  - endpoint
references:
- https://github.com/Kevin-Robertson/Inveigh/blob/29d9e3c3a625b3033cdaf4683efaafadcecb9007/Inveigh/Support/Output.cs
- https://github.com/Kevin-Robertson/Inveigh/blob/29d9e3c3a625b3033cdaf4683efaafadcecb9007/Inveigh/Support/Control.cs
- https://thedfirreport.com/2020/11/23/pysa-mespinoza-ransomware/
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename|endswith:
    - \Inveigh-Log.txt
    - \Inveigh-Cleartext.txt
    - \Inveigh-NTLMv1Users.txt
    - \Inveigh-NTLMv2Users.txt
    - \Inveigh-NTLMv1.txt
    - \Inveigh-NTLMv2.txt
    - \Inveigh-FormInput.txt
    - \Inveigh.dll
    - \Inveigh.exe
    - \Inveigh.ps1
    - \Inveigh-Relay.ps1
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: bb09dd3e-2b78-4819-8e35-a7c1b874e449
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_hktl_inveigh_artefacts.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
