id: sigmahq-sigma-98b53e78-ebaf-46f8-be06-421aafd176d9
name: HackTool - winPEAS Execution
description: WinPEAS is a script that search for possible paths to escalate privileges
  on Windows hosts. The checks are explained on book.hacktricks.xyz
severity: high
enabled: false
tags:
  mitre:
  - T1082
  - T1087
  - T1046
  categories:
  - endpoint
references:
- https://github.com/carlospolop/PEASS-ng
- https://book.hacktricks.xyz/windows-hardening/windows-local-privilege-escalation
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - OriginalFileName: winPEAS.exe
  - Image|endswith:
    - \winPEASany_ofs.exe
    - \winPEASany.exe
    - \winPEASx64_ofs.exe
    - \winPEASx64.exe
    - \winPEASx86_ofs.exe
    - \winPEASx86.exe
  selection_cli_option:
    CommandLine|contains:
    - ' applicationsinfo'
    - ' browserinfo'
    - ' eventsinfo'
    - ' fileanalysis'
    - ' filesinfo'
    - ' processinfo'
    - ' servicesinfo'
    - ' windowscreds'
  selection_cli_dl:
    CommandLine|contains: https://github.com/carlospolop/PEASS-ng/releases/latest/download/
  selection_cli_specific:
  - ParentCommandLine|endswith: ' -linpeas'
  - CommandLine|endswith: ' -linpeas'
  condition: 1 of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 98b53e78-ebaf-46f8-be06-421aafd176d9
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_hktl_winpeas.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
