id: sigmahq-sigma-f376c8a7-a2d0-4ddc-aa0c-16c17236d962
name: HackTool - Bloodhound/Sharphound Execution
description: Detects command line parameters used by Bloodhound and Sharphound hack
  tools
severity: high
enabled: false
tags:
  mitre:
  - T1087.001
  - T1087.002
  - T1482
  - T1069.001
  - T1069.002
  - T1059.001
  categories:
  - endpoint
references:
- https://github.com/BloodHoundAD/BloodHound
- https://github.com/BloodHoundAD/SharpHound
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Product|contains: SharpHound
  - Description|contains: SharpHound
  - Company|contains:
    - SpecterOps
    - evil corp
  - Image|contains:
    - \Bloodhound.exe
    - \SharpHound.exe
  selection_cli_1:
    CommandLine|contains:
    - ' -CollectionMethod All '
    - ' --CollectionMethods Session '
    - ' --Loop --Loopduration '
    - ' --PortScanTimeout '
    - '.exe -c All -d '
    - Invoke-Bloodhound
    - Get-BloodHoundData
  selection_cli_2:
    CommandLine|contains|all:
    - ' -JsonFolder '
    - ' -ZipFileName '
  selection_cli_3:
    CommandLine|contains|all:
    - ' DCOnly '
    - ' --NoSaveCache '
  condition: 1 of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: f376c8a7-a2d0-4ddc-aa0c-16c17236d962
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_hktl_bloodhound_sharphound.yml
falsepositives:
- Other programs that use these command line option and accepts an 'All' parameter
notes:
  quarantine_reason: 'upstream status: test'
