id: sigmahq-sigma-aaafa146-074c-11eb-adc1-0242ac120002
name: HackTool - Hydra Password Bruteforce Execution
description: Detects command line parameters used by Hydra password guessing hack
  tool
severity: high
enabled: false
tags:
  mitre:
  - T1110
  - T1110.001
  categories:
  - endpoint
references:
- https://github.com/vanhauser-thc/thc-hydra
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains|all:
    - '-u '
    - '-p '
    CommandLine|contains:
    - ^USER^
    - ^PASS^
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: aaafa146-074c-11eb-adc1-0242ac120002
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_hktl_hydra.yml
falsepositives:
- Software that uses the caret encased keywords PASS and USER in its command line
notes:
  quarantine_reason: 'upstream status: test'
