id: sigmahq-sigma-37c1333a-a0db-48be-b64b-7393b2386e3b
name: Hacktool Execution - PE Metadata
description: Detects the execution of different Windows based hacktools via PE metadata
  (company, product, etc.) even if the files have been renamed
severity: high
enabled: false
tags:
  mitre:
  - T1588.002
  - T1003
  categories:
  - endpoint
references:
- https://github.com/cube0x0
- https://www.virustotal.com/gui/search/metadata%253ACube0x0/files
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Company: Cube0x0
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 37c1333a-a0db-48be-b64b-7393b2386e3b
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_hktl_execution_via_pe_metadata.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
