id: sigmahq-sigma-b99a1518-1ad5-4f65-bc95-1ffff97a8fd0
name: HackTool - Inveigh Execution
description: Detects the use of Inveigh a cross-platform .NET IPv4/IPv6 machine-in-the-middle
  tool
severity: critical
enabled: false
tags:
  mitre:
  - T1003.001
  categories:
  - endpoint
references:
- https://github.com/Kevin-Robertson/Inveigh
- https://thedfirreport.com/2020/11/23/pysa-mespinoza-ransomware/
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Image|endswith: \Inveigh.exe
  - OriginalFileName:
    - \Inveigh.exe
    - \Inveigh.dll
  - Description: Inveigh
  - CommandLine|contains:
    - ' -SpooferIP'
    - ' -ReplyToIPs '
    - ' -ReplyToDomains '
    - ' -ReplyToMACs '
    - ' -SnifferIP'
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: b99a1518-1ad5-4f65-bc95-1ffff97a8fd0
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_hktl_inveigh.yml
falsepositives:
- Very unlikely
notes:
  quarantine_reason: 'upstream status: test'
