id: sigmahq-sigma-39b31e81-5f5f-4898-9c0e-2160cfc0f9bf
name: HackTool - Hashcat Password Cracker Execution
description: Execute Hashcat.exe with provided SAM file from registry of Windows and
  Password list to crack against
severity: high
enabled: false
tags:
  mitre:
  - T1110.002
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1110.002/T1110.002.md#atomic-test-1---password-cracking-with-hashcat
- https://hashcat.net/wiki/doku.php?id=hashcat
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
    Image|endswith: \hashcat.exe
  selection_cli:
    CommandLine|contains|all:
    - '-a '
    - '-m 1000 '
    - '-r '
  condition: 1 of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 39b31e81-5f5f-4898-9c0e-2160cfc0f9bf
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_hktl_hashcat.yml
falsepositives:
- Tools that use similar command line flags and values
notes:
  quarantine_reason: 'upstream status: test'
