id: sigmahq-sigma-736ffa74-5f6f-44ca-94ef-1c0df4f51d2a
name: HackTool - CrackMapExec File Indicators
description: Detects file creation events with filename patterns used by CrackMapExec.
severity: high
enabled: false
tags:
  mitre:
  - T1003.001
  categories:
  - endpoint
references:
- https://github.com/byt3bl33d3r/CrackMapExec/
logsource:
  product: windows
  category: file_event
detection:
  selection_path:
    TargetFilename|startswith: C:\Windows\Temp\
  selection_names_str:
    TargetFilename|endswith:
    - \temp.ps1
    - \msol.ps1
  selection_names_re:
  - TargetFilename|re: \\[0-9a-f]{8}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{12}\.txt$
  - TargetFilename|re: \\[a-zA-Z]{8}\.tmp$
  condition: selection_path and 1 of selection_names_*
provenance:
  source: SigmaHQ/sigma
  source_id: 736ffa74-5f6f-44ca-94ef-1c0df4f51d2a
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_hktl_crackmapexec_indicators.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
