id: sigmahq-sigma-1f7025a6-e747-4130-aac4-961eb47015f1
name: HackTool - DiagTrackEoP Default Named Pipe
description: Detects creation of default named pipe used by the DiagTrackEoP POC,
  a tool that abuses "SeImpersonate" privilege.
severity: critical
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://github.com/Wh04m1001/DiagTrackEoP/blob/3a2fc99c9700623eb7dc7d4b5f314fd9ce5ef51f/main.cpp#L22
logsource:
  product: windows
  category: pipe_created
  definition: Note that you have to configure logging for Named Pipe Events in Sysmon
    config (Event ID 17 and Event ID 18). The basic configuration is in popular sysmon
    configuration (https://github.com/SwiftOnSecurity/sysmon-config), but it is worth
    verifying. You can also use other repo, e.g. https://github.com/Neo23x0/sysmon-config,
    https://github.com/olafhartong/sysmon-modular. How to test detection? You can
    check powershell script from this site https://svch0st.medium.com/guide-to-named-pipes-and-hunting-for-cobalt-strike-pipes-dc46b2c5f575
detection:
  selection:
    PipeName|contains: thisispipe
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 1f7025a6-e747-4130-aac4-961eb47015f1
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/pipe_created/pipe_created_hktl_diagtrack_eop.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
