id: sigmahq-sigma-30e92f50-bb5a-4884-98b5-d20aa80f3d7a
name: Hidden Powershell in Link File Pattern
description: Detects events that appear when a user click on a link file with a powershell
  command in it
severity: medium
enabled: false
tags:
  mitre:
  - T1059.001
  categories:
  - endpoint
references:
- https://www.x86matthew.com/view_post?id=embed_exe_lnk
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage: C:\Windows\explorer.exe
    Image: C:\Windows\System32\cmd.exe
    CommandLine|contains|all:
    - powershell
    - .lnk
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 30e92f50-bb5a-4884-98b5-d20aa80f3d7a
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_susp_embed_exe_lnk.yml
falsepositives:
- Legitimate commands in .lnk files
notes:
  quarantine_reason: 'upstream status: test'
