id: sigmahq-sigma-d08722cd-3d09-449a-80b4-83ea2d9d4616
name: Hidden Files and Directories
description: Detects adversary creating hidden file or directory, by detecting directories
  or files with . as the first character
severity: low
enabled: false
tags:
  mitre:
  - T1564.001
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1564.001/T1564.001.md
logsource:
  product: linux
  service: auditd
detection:
  selection_commands:
    type: EXECVE
    a0:
    - mkdir
    - nano
    - touch
    - vi
    - vim
  selection_arguments:
  - a1|re: (^|\/)\.[^.\/]
  - a2|re: (^|\/)\.[^.\/]
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: d08722cd-3d09-449a-80b4-83ea2d9d4616
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/auditd/execve/lnx_auditd_hidden_files_directories.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
