id: sigmahq-sigma-7b449a5e-1db5-4dd0-a2dc-4e3a67282538
name: Hidden Local User Creation
description: Detects the creation of a local hidden user account which should not
  happen for event ID 4720.
severity: high
enabled: false
tags:
  mitre:
  - T1136.001
  categories:
  - endpoint
references:
- https://twitter.com/SBousseaden/status/1387743867663958021
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4720
    TargetUserName|endswith: $
  filter_main_homegroup:
    TargetUserName: HomeGroupUser$
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 7b449a5e-1db5-4dd0-a2dc-4e3a67282538
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/security/win_security_hidden_user_creation.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
