id: sigmahq-sigma-b22a5b36-2431-493a-8be1-0bae56c28ef3
name: Hidden User Creation
description: Detects creation of a hidden user account on macOS (UserID < 500) or
  with IsHidden option
severity: medium
enabled: false
tags:
  mitre:
  - T1564.002
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1564.002/T1564.002.md
logsource:
  category: process_creation
  product: macos
detection:
  dscl_create:
    Image|endswith: /dscl
    CommandLine|contains: create
  id_below_500:
    CommandLine|contains: UniqueID
    CommandLine|re: ([0-9]|[1-9][0-9]|[1-4][0-9]{2})
  ishidden_option_declaration:
    CommandLine|contains: IsHidden
  ishidden_option_confirmation:
    CommandLine|contains:
    - 'true'
    - 'yes'
    - '1'
  condition: dscl_create and id_below_500 or dscl_create and (ishidden_option_declaration
    and ishidden_option_confirmation)
provenance:
  source: SigmaHQ/sigma
  source_id: b22a5b36-2431-493a-8be1-0bae56c28ef3
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/macos/process_creation/proc_creation_macos_create_hidden_account.yml
falsepositives:
- Legitimate administration activities
notes:
  quarantine_reason: 'upstream status: test'
