id: sigmahq-sigma-4281cb20-2994-4580-aa63-c8b86d019934
name: Hiding Files with Attrib.exe
description: Detects usage of attrib.exe to hide files from users.
severity: medium
enabled: false
tags:
  mitre:
  - T1564.001
  categories:
  - endpoint
references:
- https://unit42.paloaltonetworks.com/unit42-sure-ill-take-new-combojack-malware-alters-clipboards-steal-cryptocurrency/
- https://www.uptycs.com/blog/lolbins-are-no-laughing-matter
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \attrib.exe
  - OriginalFileName: ATTRIB.EXE
  selection_cli:
    CommandLine|contains: ' +h '
  filter_main_msiexec:
    CommandLine|contains: '\desktop.ini '
  filter_optional_intel:
    ParentImage|endswith: \cmd.exe
    CommandLine: +R +H +S +A \\\*.cui
    ParentCommandLine: C:\\WINDOWS\\system32\\\*.bat
  condition: all of selection_* and not 1 of filter_main_* and not 1 of filter_optional_*
provenance:
  source: SigmaHQ/sigma
  source_id: 4281cb20-2994-4580-aa63-c8b86d019934
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_attrib_hiding_files.yml
falsepositives:
- IgfxCUIService.exe hiding *.cui files via .bat script (attrib.exe a child of cmd.exe
  and igfxCUIService.exe is the parent of the cmd.exe)
- Msiexec.exe hiding desktop.ini
notes:
  quarantine_reason: 'upstream status: test'
