id: sigmahq-sigma-9ec9fb1b-e059-4489-9642-f270c207923d
name: Hiding User Account Via SpecialAccounts Registry Key - CommandLine
description: Detects changes to the registry key "HKLM\Software\Microsoft\Windows
  NT\CurrentVersion\Winlogon\SpecialAccounts\Userlist" where the value is set to "0"
  in order to hide user account from being listed on the logon screen.
severity: medium
enabled: false
tags:
  mitre:
  - T1564.002
  categories:
  - endpoint
references:
- https://thedfirreport.com/2024/01/29/buzzing-on-christmas-eve-trigona-ransomware-in-3-hours/
- https://thedfirreport.com/2024/04/01/from-onenote-to-ransomnote-an-ice-cold-intrusion/
- https://thedfirreport.com/2024/04/29/from-icedid-to-dagon-locker-ransomware-in-29-days/
- https://thedfirreport.com/2022/07/11/select-xmrig-from-sqlserver/
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: \reg.exe
    CommandLine|contains|all:
    - \SOFTWARE\Microsoft\Windows NT\CurrentVersion\Winlogon\SpecialAccounts\UserList
    - add
    - /v
    - /d 0
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 9ec9fb1b-e059-4489-9642-f270c207923d
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_registry_special_accounts_hide_user.yml
falsepositives:
- System administrator activities
notes:
  quarantine_reason: 'upstream status: test'
