id: sigmahq-sigma-a557ffe6-ac54-43d2-ae69-158027082350
name: Huawei BGP Authentication Failures
description: Detects BGP failures which may be indicative of brute force attacks to
  manipulate routing.
severity: low
enabled: false
tags:
  mitre:
  - T1078
  - T1110
  - T1557
  categories:
  - endpoint
references:
- https://www.blackhat.com/presentations/bh-usa-03/bh-us-03-convery-franz-v3.pdf
logsource:
  product: huawei
  service: bgp
  definition: 'Requirements: huawei bgp logs need to be enabled and ingested'
detection:
  keywords_bgp_huawei:
    '|all':
    - :179
    - BGP_AUTH_FAILED
  condition: keywords_bgp_huawei
provenance:
  source: SigmaHQ/sigma
  source_id: a557ffe6-ac54-43d2-ae69-158027082350
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/network/huawei/bgp/huawei_bgp_auth_failed.yml
falsepositives:
- Unlikely. Except due to misconfigurations
notes:
  quarantine_reason: 'upstream status: test'
