id: sigmahq-sigma-45e112d0-7759-4c2a-aa36-9f8fb79d3393
name: IE Change Domain Zone
description: Hides the file extension through modification of the registry
severity: medium
enabled: false
tags:
  mitre:
  - T1137
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1112/T1112.md#atomic-test-4---add-domain-to-trusted-sites-zone
- https://learn.microsoft.com/en-us/troubleshoot/developer/browsers/security-privacy/ie-security-zones-registry-entries
logsource:
  category: registry_set
  product: windows
detection:
  selection_domains:
    TargetObject|contains: \SOFTWARE\Microsoft\Windows\CurrentVersion\Internet Settings\ZoneMap\Domains\
  filter:
    Details:
    - DWORD (0x00000000)
    - DWORD (0x00000001)
    - (Empty)
  condition: selection_domains and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: 45e112d0-7759-4c2a-aa36-9f8fb79d3393
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_change_security_zones.yml
falsepositives:
- Administrative scripts
notes:
  quarantine_reason: 'upstream status: test'
