id: sigmahq-sigma-f11f2808-adb4-46c0-802a-8660db50fa99
name: ImagingDevices Unusual Parent/Child Processes
description: Detects unusual parent or children of the ImagingDevices.exe (Windows
  Contacts) process as seen being used with Bumblebee activity
severity: high
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://thedfirreport.com/2022/09/26/bumblebee-round-two/
logsource:
  category: process_creation
  product: windows
detection:
  selection_parent:
    ParentImage|endswith:
    - \WmiPrvSE.exe
    - \svchost.exe
    - \dllhost.exe
    Image|endswith: \ImagingDevices.exe
  selection_child:
    ParentImage|endswith: \ImagingDevices.exe
  condition: 1 of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: f11f2808-adb4-46c0-802a-8660db50fa99
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_imagingdevices_unusual_parents.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
