id: sigmahq-sigma-32d56ea1-417f-44ff-822b-882873f5f43b
name: Impacket PsExec Execution
description: Detects execution of Impacket's psexec.py.
severity: high
enabled: false
tags:
  mitre:
  - T1021.002
  categories:
  - endpoint
references:
- https://web.archive.org/web/20230329171218/https://blog.menasec.net/2019/02/threat-hunting-3-detecting-psexec.html
logsource:
  product: windows
  service: security
  definition: The advanced audit policy setting "Object Access > Audit Detailed File
    Share" must be configured for Success/Failure
detection:
  selection1:
    EventID: 5145
    ShareName: \\\\\*\\IPC$
    RelativeTargetName|contains:
    - RemCom_stdin
    - RemCom_stdout
    - RemCom_stderr
  condition: selection1
provenance:
  source: SigmaHQ/sigma
  source_id: 32d56ea1-417f-44ff-822b-882873f5f43b
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/security/win_security_impacket_psexec.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
