id: sigmahq-sigma-73bba97f-a82d-42ce-b315-9182e76c57b1
name: Imports Registry Key From a File
description: Detects the import of the specified file to the registry with regedit.exe.
severity: medium
enabled: false
tags:
  mitre:
  - T1112
  categories:
  - endpoint
references:
- https://lolbas-project.github.io/lolbas/Binaries/Regedit/
- https://gist.github.com/api0cradle/cdd2d0d0ec9abb686f0e89306e277b8f
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \regedit.exe
  - OriginalFileName: REGEDIT.EXE
  selection_cli:
    CommandLine|contains:
    - ' /i '
    - ' /s '
    - .reg
  filter_1:
    CommandLine|contains|windash:
    - ' -e '
    - ' -a '
    - ' -c '
  filter_2:
    CommandLine|re: :[^ \\]
  condition: all of selection_* and not all of filter_*
provenance:
  source: SigmaHQ/sigma
  source_id: 73bba97f-a82d-42ce-b315-9182e76c57b1
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_regedit_import_keys.yml
falsepositives:
- Legitimate import of keys
- Evernote
notes:
  quarantine_reason: 'upstream status: test'
