id: sigmahq-sigma-0b80ade5-6997-4b1d-99a1-71701778ea61
name: Imports Registry Key From an ADS
description: Detects the import of a alternate datastream to the registry with regedit.exe.
severity: high
enabled: false
tags:
  mitre:
  - T1112
  categories:
  - endpoint
references:
- https://lolbas-project.github.io/lolbas/Binaries/Regedit/
- https://gist.github.com/api0cradle/cdd2d0d0ec9abb686f0e89306e277b8f
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \regedit.exe
  - OriginalFileName: REGEDIT.EXE
  selection_cli:
    CommandLine|contains:
    - ' /i '
    - .reg
    CommandLine|re: :[^ \\]
  filter:
    CommandLine|contains|windash:
    - ' -e '
    - ' -a '
    - ' -c '
  condition: all of selection_* and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: 0b80ade5-6997-4b1d-99a1-71701778ea61
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_regedit_import_keys_ads.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
