id: sigmahq-sigma-9e3cb244-bdb8-4632-8c90-6079c8f4f16d
name: Important Scheduled Task Deleted or Disabled
description: Detects when adversaries try to stop system services or processes by
  deleting or disabling their respective scheduled tasks in order to conduct data
  destructive activities
severity: high
enabled: false
tags:
  mitre:
  - T1489
  categories:
  - endpoint
references:
- https://www.socinvestigation.com/most-common-windows-event-ids-to-hunt-mind-map/
logsource:
  product: windows
  service: taskscheduler
  definition: 'Requirements: The "Microsoft-Windows-TaskScheduler/Operational" is
    disabled by default and needs to be enabled in order for this detection to trigger'
detection:
  selection:
    EventID:
    - 141
    - 142
    TaskName|contains:
    - \Windows\SystemRestore\SR
    - \Windows\Windows Defender\
    - \Windows\BitLocker
    - \Windows\WindowsBackup\
    - \Windows\WindowsUpdate\
    - \Windows\UpdateOrchestrator\
    - \Windows\ExploitGuard
  filter_main_user:
    UserName|contains:
    - AUTHORI
    - AUTORI
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 9e3cb244-bdb8-4632-8c90-6079c8f4f16d
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/taskscheduler/win_taskscheduler_susp_schtasks_delete_or_disable.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
