id: sigmahq-sigma-21f9162c-5f5d-4b01-89a8-b705bd7d10ab
name: Import PowerShell Modules From Suspicious Directories
description: Detects powershell scripts that import modules from suspicious directories
severity: medium
enabled: false
tags:
  mitre:
  - T1059.001
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1003.002/T1003.002.md
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection:
    ScriptBlockText|contains:
    - Import-Module "$Env:Temp\
    - Import-Module '$Env:Temp\
    - Import-Module $Env:Temp\
    - Import-Module "$Env:Appdata\
    - Import-Module '$Env:Appdata\
    - Import-Module $Env:Appdata\
    - Import-Module C:\Users\Public\
    - ipmo "$Env:Temp\
    - ipmo '$Env:Temp\
    - ipmo $Env:Temp\
    - ipmo "$Env:Appdata\
    - ipmo '$Env:Appdata\
    - ipmo $Env:Appdata\
    - ipmo C:\Users\Public\
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 21f9162c-5f5d-4b01-89a8-b705bd7d10ab
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_import_module_susp_dirs.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
