id: sigmahq-sigma-e1d02b53-c03c-4948-b11d-4d00cca49d03
name: Increased Failed Authentications Of Any Type
description: Detects when sign-ins increased by 10% or greater.
severity: medium
enabled: false
tags:
  mitre:
  - T1078
  categories:
  - cloud
references:
- https://learn.microsoft.com/en-us/entra/architecture/security-operations-user-accounts#monitoring-for-failed-unusual-sign-ins
logsource:
  product: azure
  service: signinlogs
detection:
  selection:
    Status: failure
    Count: <10%
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: e1d02b53-c03c-4948-b11d-4d00cca49d03
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/azure/signin_logs/azure_ad_auth_failure_increase.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
