id: sigmahq-sigma-2d22a514-e024-4428-9dba-41505bd63a5b
name: Indirect Command Execution From Script File Via Bash.EXE
description: 'Detects execution of Microsoft bash launcher without any flags to execute
  the content of a bash script directly.

  This can be used to potentially bypass defenses and execute Linux or Windows-based
  binaries directly via bash.'
severity: medium
enabled: false
tags:
  mitre:
  - T1202
  categories:
  - endpoint
references:
- https://lolbas-project.github.io/lolbas/Binaries/Bash/
- https://linux.die.net/man/1/bash
- Internal Research
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Image|endswith:
    - :\Windows\System32\bash.exe
    - :\Windows\SysWOW64\bash.exe
  - OriginalFileName: Bash.exe
  filter_main_cli_flag:
    CommandLine|contains:
    - bash.exe -
    - bash -
  filter_main_no_cli:
    CommandLine: null
  filter_main_empty:
    CommandLine: ''
  filter_main_no_flag:
    CommandLine:
    - bash.exe
    - bash
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 2d22a514-e024-4428-9dba-41505bd63a5b
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_bash_file_execution.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
