id: sigmahq-sigma-acf61bd8-d814-4272-81f0-a7a269aa69aa
name: Indicator Removal on Host - Clear Mac System Logs
description: Detects deletion of local audit logs
severity: medium
enabled: false
tags:
  mitre:
  - T1685.006
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1070.002/T1070.002.md
logsource:
  product: macos
  category: process_creation
detection:
  selection1:
    Image|endswith:
    - /rm
    - /unlink
    - /shred
  selection_cli_1:
    CommandLine|contains: /var/log
  selection_cli_2:
    CommandLine|contains|all:
    - /Users/
    - /Library/Logs/
  condition: selection1 and 1 of selection_cli*
provenance:
  source: SigmaHQ/sigma
  source_id: acf61bd8-d814-4272-81f0-a7a269aa69aa
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/macos/process_creation/proc_creation_macos_clear_system_logs.yml
falsepositives:
- Legitimate administration activities
notes:
  quarantine_reason: 'upstream status: test'
