id: sigmahq-sigma-6fb77778-040f-4015-9440-572aa9b6b580
name: Ingress/Egress Security Group Modification
description: 'Detects when an account makes changes to the ingress or egress rules
  of a security group.

  This can indicate that an attacker is attempting to open up new attack vectors in
  the account, that they are trying to exfiltrate data over the network, or that they
  are trying to allow machines in that VPC/Subnet to contact a C&C server.'
severity: medium
enabled: false
tags:
  mitre:
  - T1190
  categories:
  - cloud
references:
- https://www.gorillastack.com/blog/real-time-events/important-aws-cloudtrail-security-events-tracking/
logsource:
  product: aws
  service: cloudtrail
detection:
  selection:
    eventSource: ec2.amazonaws.com
    eventName:
    - AuthorizeSecurityGroupEgress
    - AuthorizeSecurityGroupIngress
    - RevokeSecurityGroupEgress
    - RevokeSecurityGroupIngress
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 6fb77778-040f-4015-9440-572aa9b6b580
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/aws/cloudtrail/aws_cloudtrail_security_group_change_ingress_egress.yml
falsepositives:
- New VPCs and Subnets being setup requiring a different security profile to those
  already defined
- A single port being opened for a new service that is known to be deploying
- Administrators closing unused ports to reduce the attack surface
notes:
  quarantine_reason: 'upstream status: test'
