id: sigmahq-sigma-cb9cc1d1-e84e-4bdc-b7ad-c31b1b7908ec
name: Insecure Transfer Via Curl.EXE
description: Detects execution of "curl.exe" with the "--insecure" flag.
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://curl.se/docs/manpage.html
logsource:
  product: windows
  category: process_creation
detection:
  selection_img:
  - Image|endswith: \curl.exe
  - OriginalFileName: curl.exe
  selection_cli:
  - CommandLine|re: \s-k\s
  - CommandLine|contains: --insecure
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: cb9cc1d1-e84e-4bdc-b7ad-c31b1b7908ec
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_curl_insecure_connection.yml
falsepositives:
- Access to badly maintained internal or development systems
notes:
  quarantine_reason: 'upstream status: test'
