id: sigmahq-sigma-04936b66-3915-43ad-a8e5-809eadfd1141
name: Insensitive Subfolder Search Via Findstr.EXE
description: Detects execution of findstr with the "s" and "i" flags for a "subfolder"
  and "insensitive" search respectively. Attackers sometimes leverage this built-in
  utility to search the system for interesting files or filter through results of
  commands.
severity: low
enabled: false
tags:
  mitre:
  - T1218
  - T1564.004
  - T1552.001
  - T1105
  categories:
  - endpoint
references:
- https://lolbas-project.github.io/lolbas/Binaries/Findstr/
- https://oddvar.moe/2018/04/11/putting-data-in-alternate-data-streams-and-how-to-execute-it-part-2/
- https://gist.github.com/api0cradle/cdd2d0d0ec9abb686f0e89306e277b8f
logsource:
  category: process_creation
  product: windows
detection:
  selection_findstr:
  - CommandLine|contains: findstr
  - Image|endswith: findstr.exe
  - OriginalFileName: FINDSTR.EXE
  selection_cli_search_subfolder:
    CommandLine|contains|windash: ' -s '
  selection_cli_search_insensitive:
    CommandLine|contains|windash: ' -i '
  condition: selection_findstr and all of selection_cli_search_*
provenance:
  source: SigmaHQ/sigma
  source_id: 04936b66-3915-43ad-a8e5-809eadfd1141
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_findstr_subfolder_search.yml
falsepositives:
- Administrative or software activity
notes:
  quarantine_reason: 'upstream status: test'
