id: sigmahq-sigma-78a80655-a51e-4669-bc6b-e9d206a462ee
name: Install Root Certificate
description: Detects installation of new certificate on the system which attackers
  may use to avoid warnings when connecting to controlled web servers or C2s
severity: low
enabled: false
tags:
  mitre:
  - T1553.004
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1553.004/T1553.004.md
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    Image|endswith:
    - /update-ca-certificates
    - /update-ca-trust
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 78a80655-a51e-4669-bc6b-e9d206a462ee
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/process_creation/proc_creation_lnx_install_root_certificate.yml
falsepositives:
- Legitimate administration activities
notes:
  quarantine_reason: 'upstream status: test'
