id: sigmahq-sigma-eca8ae39-5c3c-4321-b538-9e64fe25822e
name: Installation of WSL Kali-Linux
description: 'Detects installation of Kali Linux distribution through Windows Subsystem
  for Linux (WSL).

  Attackers may use Kali Linux WSL to leverage its penetration testing tools and capabilities
  for malicious purposes.'
severity: high
enabled: false
tags:
  mitre:
  - T1059
  categories:
  - endpoint
references:
- https://medium.com/@redfanatic7/running-kali-linux-on-windows-51ad95166e6e
- https://learn.microsoft.com/en-us/windows/wsl/install
logsource:
  category: process_creation
  product: windows
detection:
  selection_wsl_img:
  - Image|endswith: \wsl.exe
  - OriginalFileName: wsl
  selection_wsl_install:
    CommandLine|contains:
    - ' --install '
    - ' -i '
  selection_wsl_kali:
    CommandLine|contains: kali
  condition: all of selection_wsl_*
provenance:
  source: SigmaHQ/sigma
  source_id: eca8ae39-5c3c-4321-b538-9e64fe25822e
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_wsl_kali_linux_installation.yml
falsepositives:
- Legitimate installation or usage of Kali Linux WSL by administrators or security
  teams
notes:
  quarantine_reason: 'upstream status: experimental'
