id: sigmahq-sigma-313d6012-51a0-4d93-8dfc-de8553239e25
name: Install New Package Via Winget Local Manifest
description: 'Detects usage of winget to install applications via manifest file. Adversaries
  can abuse winget to download payloads remotely and execute them.

  The manifest option enables you to install an application by passing in a YAML file
  directly to the client.

  Winget can be used to download and install exe, msi or msix files later.'
severity: medium
enabled: false
tags:
  mitre:
  - T1059
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/windows/package-manager/winget/install#local-install
- https://lolbas-project.github.io/lolbas/Binaries/Winget/
- https://github.com/nasbench/Misc-Research/tree/b9596e8109dcdb16ec353f316678927e507a5b8d/LOLBINs/Winget
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \winget.exe
  - OriginalFileName: winget.exe
  selection_install_flag:
    CommandLine|contains:
    - install
    - ' add '
  selection_manifest_flag:
    CommandLine|contains:
    - '-m '
    - --manifest
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 313d6012-51a0-4d93-8dfc-de8553239e25
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_winget_local_install_via_manifest.yml
falsepositives:
- Some false positives are expected in some environment that may use this functionality
  to install and test their custom applications
notes:
  quarantine_reason: 'upstream status: test'
