id: sigmahq-sigma-60fc936d-2eb0-4543-8a13-911c750a1dfc
name: Interactive AT Job
description: Detects an interactive AT job, which may be used as a form of privilege
  escalation.
severity: high
enabled: false
tags:
  mitre:
  - T1053.002
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1053.002/T1053.002.md
- https://eqllib.readthedocs.io/en/latest/analytics/d8db43cf-ed52-4f5c-9fb3-c9a4b95a0b56.html
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: \at.exe
    CommandLine|contains: interactive
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 60fc936d-2eb0-4543-8a13-911c750a1dfc
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_at_interactive_execution.yml
falsepositives:
- Unlikely (at.exe deprecated as of Windows 8)
notes:
  quarantine_reason: 'upstream status: test'
