id: sigmahq-sigma-ab567429-1dfb-4674-b6d2-979fd2f9d125
name: Internet Explorer DisableFirstRunCustomize Enabled
description: Detects changes to the Internet Explorer "DisableFirstRunCustomize" value,
  which prevents Internet Explorer from running the first run wizard the first time
  a user starts the browser after installing Internet Explorer or Windows.
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://www.ncsc.gov.uk/static-assets/documents/malware-analysis-reports/devil-bait/NCSC-MAR-Devil-Bait.pdf
- https://unit42.paloaltonetworks.com/operation-ke3chang-resurfaces-with-new-tidepool-malware/
- https://admx.help/?Category=InternetExplorer&Policy=Microsoft.Policies.InternetExplorer::NoFirstRunCustomise
logsource:
  product: windows
  category: registry_set
detection:
  selection:
    TargetObject|endswith: \Microsoft\Internet Explorer\Main\DisableFirstRunCustomize
    Details:
    - DWORD (0x00000001)
    - DWORD (0x00000002)
  filter_main_generic:
    Image:
    - C:\Windows\explorer.exe
    - C:\Windows\System32\ie4uinit.exe
  filter_optional_avira:
    Image|contains|all:
    - \Temp\
    - \.cr\avira_
    Details|contains: DWORD (0x00000001)
  filter_optional_foxit:
    Image:
    - C:\Program Files (x86)\Foxit Software\Foxit PDF Reader\FoxitPDFReader.exe
    - C:\Program Files\Foxit Software\Foxit PDF Reader\FoxitPDFReader.exe
    Details|contains: DWORD (0x00000001)
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
provenance:
  source: SigmaHQ/sigma
  source_id: ab567429-1dfb-4674-b6d2-979fd2f9d125
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_internet_explorer_disable_first_run_customize.yml
falsepositives:
- As this is controlled by group policy as well as user settings. Some false positives
  may occur.
notes:
  quarantine_reason: 'upstream status: test'
