id: sigmahq-sigma-ea3ecad2-db86-4a89-ad0b-132a10d2db55
name: Interactive Bash Suspicious Children
description: Detects suspicious interactive bash as a parent to rather uncommon child
  processes
severity: medium
enabled: false
tags:
  mitre:
  - T1059.004
  - T1036
  categories:
  - endpoint
references:
- Internal Research
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    ParentCommandLine: bash -i
  anomaly1:
    CommandLine|contains:
    - '-c import '
    - base64
    - pty.spawn
  anomaly2:
    Image|endswith:
    - whoami
    - iptables
    - /ncat
    - /nc
    - /netcat
  condition: selection and 1 of anomaly*
provenance:
  source: SigmaHQ/sigma
  source_id: ea3ecad2-db86-4a89-ad0b-132a10d2db55
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/process_creation/proc_creation_lnx_susp_interactive_bash.yml
falsepositives:
- Legitimate software that uses these patterns
notes:
  quarantine_reason: 'upstream status: test'
