id: sigmahq-sigma-a80f662f-022f-4429-9b8c-b1a41aaa6688
name: Internet Explorer Autorun Keys Modification
description: Detects modification of autostart extensibility point (ASEP) in registry.
severity: medium
enabled: false
tags:
  mitre:
  - T1547.001
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1547.001/T1547.001.md
- https://learn.microsoft.com/en-us/sysinternals/downloads/autoruns
- https://gist.github.com/GlebSukhodolskiy/0fc5fa5f482903064b448890db1eaf9d
logsource:
  category: registry_set
  product: windows
detection:
  ie:
    TargetObject|contains:
    - \Software\Wow6432Node\Microsoft\Internet Explorer
    - \Software\Microsoft\Internet Explorer
  ie_details:
    TargetObject|contains:
    - \Toolbar
    - \Extensions
    - \Explorer Bars
  filter_empty:
    Details: (Empty)
  filter_extensions:
    TargetObject|contains:
    - \Extensions\{2670000A-7350-4f3c-8081-5663EE0C6C49}
    - \Extensions\{31D09BA0-12F5-4CCE-BE8A-2923E76605DA}
    - \Extensions\{789FE86F-6FC4-46A1-9849-EDE0DB0C95CA}
    - \Extensions\{A95fe080-8f5d-11d2-a20b-00aa003c157a}
  filter_toolbar:
    TargetObject|endswith:
    - \Toolbar\ShellBrowser\ITBar7Layout
    - \Toolbar\ShowDiscussionButton
    - \Toolbar\Locked
  condition: ie and ie_details and not 1 of filter_*
provenance:
  source: SigmaHQ/sigma
  source_id: a80f662f-022f-4429-9b8c-b1a41aaa6688
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_asep_reg_keys_modification_internet_explorer.yml
falsepositives:
- Legitimate software automatically (mostly, during installation) sets up autorun
  keys for legitimate reason
- Legitimate administrator sets up autorun keys for legitimate reason
notes:
  quarantine_reason: 'upstream status: test'
