id: sigmahq-sigma-f7385ee2-0e0c-11eb-adc1-0242ac120002
name: Invoke-Obfuscation CLIP+ Launcher - System
description: Detects Obfuscated use of Clip.exe to execute PowerShell
severity: high
enabled: false
tags:
  mitre:
  - T1027
  - T1059.001
  categories:
  - endpoint
references:
- https://github.com/SigmaHQ/sigma/issues/1009
logsource:
  product: windows
  service: system
detection:
  selection:
    Provider_Name: Service Control Manager
    EventID: 7045
    ImagePath|contains|all:
    - cmd
    - '&&'
    - 'clipboard]::'
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: f7385ee2-0e0c-11eb-adc1-0242ac120002
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/system/service_control_manager/win_system_invoke_obfuscation_clip_services.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
