id: sigmahq-sigma-6c96fc76-0eb1-11eb-adc1-0242ac120002
name: Invoke-Obfuscation STDIN+ Launcher
description: Detects Obfuscated use of stdin to execute PowerShell
severity: high
enabled: false
tags:
  mitre:
  - T1027
  - T1059.001
  categories:
  - endpoint
references:
- https://github.com/SigmaHQ/sigma/issues/1009
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|re: cmd.{0,5}(?:/c|/r).+powershell.+(?:\$\{?input\}?|noexit).+\"
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 6c96fc76-0eb1-11eb-adc1-0242ac120002
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_hktl_invoke_obfuscation_stdin.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
