id: sigmahq-sigma-9c14c9fa-1a63-4a64-8e57-d19280559490
name: Invoke-Obfuscation Via Stdin
description: Detects Obfuscated Powershell via Stdin in Scripts
severity: high
enabled: false
tags:
  mitre:
  - T1027
  - T1059.001
  categories:
  - endpoint
references:
- https://github.com/SigmaHQ/sigma/issues/1009
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|re: (?i)(?:set).*&&\s?set.*(?:environment|invoke|\$\{?input).*&&.*"
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 9c14c9fa-1a63-4a64-8e57-d19280559490
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_hktl_invoke_obfuscation_via_stdin.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
