id: sigmahq-sigma-6bfb8fa7-b2e7-4f6c-8d9d-824e5d06ea9e
name: Invoke-Obfuscation VAR+ Launcher - PowerShell Module
description: Detects Obfuscated use of Environment Variables to execute PowerShell
severity: high
enabled: false
tags:
  mitre:
  - T1027
  - T1059.001
  categories:
  - endpoint
references:
- https://github.com/SigmaHQ/sigma/issues/1009
logsource:
  product: windows
  category: ps_module
  definition: 0ad03ef1-f21b-4a79-8ce8-e6900c54b65b
detection:
  selection_4103:
    Payload|re: cmd.{0,5}(?:/c|/r)(?:\s|)"set\s[a-zA-Z]{3,6}.*(?:\{\d\}){1,}\\"\s+?-f(?:.*\)){1,}.*"
  condition: selection_4103
provenance:
  source: SigmaHQ/sigma
  source_id: 6bfb8fa7-b2e7-4f6c-8d9d-824e5d06ea9e
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_module/posh_pm_invoke_obfuscation_var.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
