id: sigmahq-sigma-7eedcc9d-9fdb-4d94-9c54-474e8affc0c7
name: Invoke-Obfuscation COMPRESS OBFUSCATION
description: Detects Obfuscated Powershell via COMPRESS OBFUSCATION
severity: medium
enabled: false
tags:
  mitre:
  - T1027
  - T1059.001
  categories:
  - endpoint
references:
- https://github.com/SigmaHQ/sigma/issues/1009
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains|all:
    - new-object
    - text.encoding]::ascii
    CommandLine|contains:
    - system.io.compression.deflatestream
    - system.io.streamreader
    - readtoend(
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 7eedcc9d-9fdb-4d94-9c54-474e8affc0c7
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_hktl_invoke_obfuscation_via_compress.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
