id: sigmahq-sigma-e6cb92b4-b470-4eb8-8a9d-d63e8583aae0
name: Invoke-Obfuscation RUNDLL LAUNCHER - PowerShell
description: Detects Obfuscated Powershell via RUNDLL LAUNCHER
severity: medium
enabled: false
tags:
  mitre:
  - T1027
  - T1059.001
  categories:
  - endpoint
references:
- https://github.com/SigmaHQ/sigma/issues/1009
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection_4104:
    ScriptBlockText|contains|all:
    - rundll32.exe
    - shell32.dll
    - shellexec_rundll
    - powershell
  condition: selection_4104
provenance:
  source: SigmaHQ/sigma
  source_id: e6cb92b4-b470-4eb8-8a9d-d63e8583aae0
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_invoke_obfuscation_via_rundll.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
