id: sigmahq-sigma-ac20ae82-8758-4f38-958e-b44a3140ca88
name: Invoke-Obfuscation Via Use MSHTA
description: Detects Obfuscated Powershell via use MSHTA in Scripts
severity: high
enabled: false
tags:
  mitre:
  - T1027
  - T1059.001
  categories:
  - endpoint
references:
- https://github.com/SigmaHQ/sigma/issues/1009
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains|all:
    - set
    - '&&'
    - mshta
    - vbscript:createobject
    - .run
    - (window.close)
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: ac20ae82-8758-4f38-958e-b44a3140ca88
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_hktl_invoke_obfuscation_via_use_mhsta.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
