id: sigmahq-sigma-641a4bfb-c017-44f7-800c-2aee0184ce9b
name: Invoke-Obfuscation Via Use Rundll32 - System
description: Detects Obfuscated Powershell via use Rundll32 in Scripts
severity: high
enabled: false
tags:
  mitre:
  - T1027
  - T1059.001
  categories:
  - endpoint
references:
- https://github.com/SigmaHQ/sigma/issues/1009
logsource:
  product: windows
  service: system
detection:
  selection:
    Provider_Name: Service Control Manager
    EventID: 7045
    ImagePath|contains|all:
    - '&&'
    - rundll32
    - shell32.dll
    - shellexec_rundll
    ImagePath|contains:
    - value
    - invoke
    - comspec
    - iex
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 641a4bfb-c017-44f7-800c-2aee0184ce9b
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/system/service_control_manager/win_system_invoke_obfuscation_via_use_rundll32_services.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
