id: sigmahq-sigma-4bf943c6-5146-4273-98dd-e958fd1e3abf
name: Invoke-Obfuscation Obfuscated IEX Invocation
description: Detects all variations of obfuscated powershell IEX invocation code generated
  by Invoke-Obfuscation framework from the following code block
severity: high
enabled: false
tags:
  mitre:
  - T1027
  - T1059.001
  categories:
  - endpoint
references:
- https://github.com/danielbohannon/Invoke-Obfuscation/blob/f20e7f843edd0a3a7716736e9eddfa423395dd26/Out-ObfuscatedStringCommand.ps1#L873-L888
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - CommandLine|re: \$PSHome\[\s*\d{1,3}\s*\]\s*\+\s*\$PSHome\[
  - CommandLine|re: \$ShellId\[\s*\d{1,3}\s*\]\s*\+\s*\$ShellId\[
  - CommandLine|re: \$env:Public\[\s*\d{1,3}\s*\]\s*\+\s*\$env:Public\[
  - CommandLine|re: \$env:ComSpec\[(?:\s*\d{1,3}\s*,){2}
  - CommandLine|re: \*mdr\*\W\s*\)\.Name
  - CommandLine|re: \$VerbosePreference\.ToString\(
  - CommandLine|re: \[String\]\s*\$VerbosePreference
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 4bf943c6-5146-4273-98dd-e958fd1e3abf
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_hktl_invoke_obfuscation_obfuscated_iex_commandline.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
