id: sigmahq-sigma-0adfbc14-0ed1-11eb-adc1-0242ac120002
name: Invoke-Obfuscation VAR+ Launcher - PowerShell
description: Detects Obfuscated use of Environment Variables to execute PowerShell
severity: high
enabled: false
tags:
  mitre:
  - T1027
  - T1059.001
  categories:
  - endpoint
references:
- https://github.com/SigmaHQ/sigma/issues/1009
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection_4104:
    ScriptBlockText|re: cmd.{0,5}(?:/c|/r)(?:\s|)"set\s[a-zA-Z]{3,6}.*(?:\{\d\}){1,}\\"\s+?-f(?:.*\)){1,}.*"
  condition: selection_4104
provenance:
  source: SigmaHQ/sigma
  source_id: 0adfbc14-0ed1-11eb-adc1-0242ac120002
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_invoke_obfuscation_var.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
