id: sigmahq-sigma-11b52f18-aaec-4d60-9143-5dd8cc4706b9
name: Invoke-Obfuscation RUNDLL LAUNCHER - System
description: Detects Obfuscated Powershell via RUNDLL LAUNCHER
severity: medium
enabled: false
tags:
  mitre:
  - T1027
  - T1059.001
  categories:
  - endpoint
references:
- https://github.com/SigmaHQ/sigma/issues/1009
logsource:
  product: windows
  service: system
detection:
  selection:
    Provider_Name: Service Control Manager
    EventID: 7045
    ImagePath|contains|all:
    - rundll32.exe
    - shell32.dll
    - shellexec_rundll
    - powershell
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 11b52f18-aaec-4d60-9143-5dd8cc4706b9
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/system/service_control_manager/win_system_invoke_obfuscation_via_rundll_services.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
