id: sigmahq-sigma-f3c89218-8c3d-4ba9-9974-f1d8e6a1b4a6
name: Invoke-Obfuscation VAR++ LAUNCHER OBFUSCATION - PowerShell Module
description: Detects Obfuscated Powershell via VAR++ LAUNCHER
severity: high
enabled: false
tags:
  mitre:
  - T1027
  - T1059.001
  categories:
  - endpoint
references:
- https://github.com/SigmaHQ/sigma/issues/1009
logsource:
  product: windows
  category: ps_module
  definition: 0ad03ef1-f21b-4a79-8ce8-e6900c54b65b
detection:
  selection_4103:
    Payload|re: (?i)&&set.*(\{\d\}){2,}\\"\s+?-f.*&&.*cmd.*/c
  condition: selection_4103
provenance:
  source: SigmaHQ/sigma
  source_id: f3c89218-8c3d-4ba9-9974-f1d8e6a1b4a6
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_module/posh_pm_invoke_obfuscation_via_var.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
