id: sigmahq-sigma-779c8c12-0eb1-11eb-adc1-0242ac120002
name: Invoke-Obfuscation STDIN+ Launcher - Powershell
description: Detects Obfuscated use of stdin to execute PowerShell
severity: high
enabled: false
tags:
  mitre:
  - T1027
  - T1059.001
  categories:
  - endpoint
references:
- https://github.com/SigmaHQ/sigma/issues/1009
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection_4104:
    ScriptBlockText|re: cmd.{0,5}(?:/c|/r).+powershell.+(?:\$?\{?input\}?|noexit).+"
  condition: selection_4104
provenance:
  source: SigmaHQ/sigma
  source_id: 779c8c12-0eb1-11eb-adc1-0242ac120002
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_invoke_obfuscation_stdin.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
