id: sigmahq-sigma-9ac8b09b-45de-4a07-9da1-0de8c09304a3
name: Invoke-Obfuscation STDIN+ Launcher - PowerShell Module
description: Detects Obfuscated use of stdin to execute PowerShell
severity: high
enabled: false
tags:
  mitre:
  - T1027
  - T1059.001
  categories:
  - endpoint
references:
- https://github.com/SigmaHQ/sigma/issues/1009
logsource:
  product: windows
  category: ps_module
  definition: 0ad03ef1-f21b-4a79-8ce8-e6900c54b65b
detection:
  selection_4103:
    Payload|re: cmd.{0,5}(?:/c|/r).+powershell.+(?:\$\{?input\}?|noexit).+"
  condition: selection_4103
provenance:
  source: SigmaHQ/sigma
  source_id: 9ac8b09b-45de-4a07-9da1-0de8c09304a3
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_module/posh_pm_invoke_obfuscation_stdin.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
