id: sigmahq-sigma-f241cf1b-3a6b-4e1a-b4f9-133c00dd95ca
name: Invoke-Obfuscation RUNDLL LAUNCHER - Security
description: Detects Obfuscated Powershell via RUNDLL LAUNCHER
severity: medium
enabled: false
tags:
  mitre:
  - T1027
  - T1059.001
  categories:
  - endpoint
references:
- https://github.com/SigmaHQ/sigma/issues/1009
logsource:
  product: windows
  service: security
  definition: The 'System Security Extension' audit subcategory need to be enabled
    to log the EID 4697
detection:
  selection:
    EventID: 4697
    ServiceFileName|contains|all:
    - rundll32.exe
    - shell32.dll
    - shellexec_rundll
    - powershell
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: f241cf1b-3a6b-4e1a-b4f9-133c00dd95ca
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/security/win_security_invoke_obfuscation_via_rundll_services_security.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
