id: sigmahq-sigma-487c7524-f892-4054-b263-8a0ace63fc25
name: Invoke-Obfuscation Via Stdin - System
description: Detects Obfuscated Powershell via Stdin in Scripts
severity: high
enabled: false
tags:
  mitre:
  - T1027
  - T1059.001
  categories:
  - endpoint
references:
- https://github.com/SigmaHQ/sigma/issues/1009
logsource:
  product: windows
  service: system
detection:
  selection:
    Provider_Name: Service Control Manager
    EventID: 7045
    ImagePath|contains|all:
    - set
    - '&&'
    ImagePath|contains:
    - environment
    - invoke
    - input
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 487c7524-f892-4054-b263-8a0ace63fc25
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/system/service_control_manager/win_system_invoke_obfuscation_via_stdin_services.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
