id: sigmahq-sigma-db92dd33-a3ad-49cf-8c2c-608c3e30ace0
name: Invoke-Obfuscation Via Use Clip - Powershell
description: Detects Obfuscated Powershell via use Clip.exe in Scripts
severity: high
enabled: false
tags:
  mitre:
  - T1027
  - T1059.001
  categories:
  - endpoint
references:
- https://github.com/SigmaHQ/sigma/issues/1009
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection_4104:
    ScriptBlockText|re: (?i)echo.*clip.*&&.*(Clipboard|i`?n`?v`?o`?k`?e`?)
  condition: selection_4104
provenance:
  source: SigmaHQ/sigma
  source_id: db92dd33-a3ad-49cf-8c2c-608c3e30ace0
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_invoke_obfuscation_via_use_clip.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
