id: sigmahq-sigma-2f211361-7dce-442d-b78a-c04039677378
name: Invoke-Obfuscation Obfuscated IEX Invocation - PowerShell Module
description: Detects all variations of obfuscated powershell IEX invocation code generated
  by Invoke-Obfuscation framework from the code block cited in the reference section
  below
severity: high
enabled: false
tags:
  mitre:
  - T1027
  - T1059.001
  categories:
  - endpoint
references:
- https://github.com/danielbohannon/Invoke-Obfuscation/blob/f20e7f843edd0a3a7716736e9eddfa423395dd26/Out-ObfuscatedStringCommand.ps1#L873-L888
logsource:
  product: windows
  category: ps_module
  definition: 0ad03ef1-f21b-4a79-8ce8-e6900c54b65b
detection:
  selection_payload:
  - Payload|re: \$PSHome\[\s*\d{1,3}\s*\]\s*\+\s*\$PSHome\[
  - Payload|re: \$ShellId\[\s*\d{1,3}\s*\]\s*\+\s*\$ShellId\[
  - Payload|re: \$env:Public\[\s*\d{1,3}\s*\]\s*\+\s*\$env:Public\[
  - Payload|re: \$env:ComSpec\[(\s*\d{1,3}\s*,){2}
  - Payload|re: \*mdr\*\W\s*\)\.Name
  - Payload|re: \$VerbosePreference\.ToString\(
  - Payload|re: \[String\]\s*\$VerbosePreference
  condition: selection_payload
provenance:
  source: SigmaHQ/sigma
  source_id: 2f211361-7dce-442d-b78a-c04039677378
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_module/posh_pm_invoke_obfuscation_obfuscated_iex.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
