id: sigmahq-sigma-1b9dc62e-6e9e-42a3-8990-94d7a10007f7
name: Invoke-Obfuscation Obfuscated IEX Invocation - PowerShell
description: Detects all variations of obfuscated powershell IEX invocation code generated
  by Invoke-Obfuscation framework from the following code block \u2014
severity: high
enabled: false
tags:
  mitre:
  - T1027
  - T1059.001
  categories:
  - endpoint
references:
- https://github.com/danielbohannon/Invoke-Obfuscation/blob/f20e7f843edd0a3a7716736e9eddfa423395dd26/Out-ObfuscatedStringCommand.ps1#L873-L888
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection_iex:
  - ScriptBlockText|re: \$PSHome\[\s*\d{1,3}\s*\]\s*\+\s*\$PSHome\[
  - ScriptBlockText|re: \$ShellId\[\s*\d{1,3}\s*\]\s*\+\s*\$ShellId\[
  - ScriptBlockText|re: \$env:Public\[\s*\d{1,3}\s*\]\s*\+\s*\$env:Public\[
  - ScriptBlockText|re: \$env:ComSpec\[(\s*\d{1,3}\s*,){2}
  - ScriptBlockText|re: \*mdr\*\W\s*\)\.Name
  - ScriptBlockText|re: \$VerbosePreference\.ToString\(
  condition: selection_iex
provenance:
  source: SigmaHQ/sigma
  source_id: 1b9dc62e-6e9e-42a3-8990-94d7a10007f7
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_invoke_obfuscation_obfuscated_iex.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
