id: sigmahq-sigma-fd0f5778-d3cb-4c9a-9695-66759d04702a
name: Invoke-Obfuscation Obfuscated IEX Invocation - Security
description: Detects all variations of obfuscated powershell IEX invocation code generated
  by Invoke-Obfuscation framework from the code block linked in the references
severity: high
enabled: false
tags:
  mitre:
  - T1027
  categories:
  - endpoint
references:
- https://github.com/danielbohannon/Invoke-Obfuscation/blob/f20e7f843edd0a3a7716736e9eddfa423395dd26/Out-ObfuscatedStringCommand.ps1#L873-L888
logsource:
  product: windows
  service: security
  definition: The 'System Security Extension' audit subcategory need to be enabled
    to log the EID 4697
detection:
  selection_eid:
    EventID: 4697
  selection_servicefilename:
  - ServiceFileName|re: \$PSHome\[\s*\d{1,3}\s*\]\s*\+\s*\$PSHome\[
  - ServiceFileName|re: \$ShellId\[\s*\d{1,3}\s*\]\s*\+\s*\$ShellId\[
  - ServiceFileName|re: \$env:Public\[\s*\d{1,3}\s*\]\s*\+\s*\$env:Public\[
  - ServiceFileName|re: \$env:ComSpec\[(\s*\d{1,3}\s*,){2}
  - ServiceFileName|re: \\*mdr\*\W\s*\)\.Name
  - ServiceFileName|re: \$VerbosePreference\.ToString\(
  - ServiceFileName|re: \String\]\s*\$VerbosePreference
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: fd0f5778-d3cb-4c9a-9695-66759d04702a
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/security/win_security_invoke_obfuscation_obfuscated_iex_services_security.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
