id: sigmahq-sigma-ebdf49d8-b89c-46c9-8fdf-2c308406f6bd
name: Invoke-Obfuscation Via Use Clip - PowerShell Module
description: Detects Obfuscated Powershell via use Clip.exe in Scripts
severity: high
enabled: false
tags:
  mitre:
  - T1027
  - T1059.001
  categories:
  - endpoint
references:
- https://github.com/SigmaHQ/sigma/issues/1009
logsource:
  product: windows
  category: ps_module
  definition: 0ad03ef1-f21b-4a79-8ce8-e6900c54b65b
detection:
  selection_4103:
    Payload|re: (?i)echo.*clip.*&&.*(Clipboard|i`?n`?v`?o`?k`?e`?)
  condition: selection_4103
provenance:
  source: SigmaHQ/sigma
  source_id: ebdf49d8-b89c-46c9-8fdf-2c308406f6bd
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_module/posh_pm_invoke_obfuscation_via_use_clip.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
