id: sigmahq-sigma-73e67340-0d25-11eb-adc1-0242ac120002
name: Invoke-Obfuscation CLIP+ Launcher - PowerShell
description: Detects Obfuscated use of Clip.exe to execute PowerShell
severity: high
enabled: false
tags:
  mitre:
  - T1027
  - T1059.001
  categories:
  - endpoint
references:
- https://github.com/SigmaHQ/sigma/issues/1009
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection_4104:
    ScriptBlockText|re: cmd.{0,5}(?:/c|/r).+clip(?:\.exe)?.{0,4}&&.+clipboard]::\(\s\\"\{\d\}.+-f.+"
  condition: selection_4104
provenance:
  source: SigmaHQ/sigma
  source_id: 73e67340-0d25-11eb-adc1-0242ac120002
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_invoke_obfuscation_clip.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
