id: sigmahq-sigma-c72aca44-8d52-45ad-8f81-f96c4d3c755e
name: Invoke-Obfuscation Via Stdin - PowerShell Module
description: Detects Obfuscated Powershell via Stdin in Scripts
severity: high
enabled: false
tags:
  mitre:
  - T1027
  - T1059.001
  categories:
  - endpoint
references:
- https://github.com/SigmaHQ/sigma/issues/1009
logsource:
  product: windows
  category: ps_module
  definition: 0ad03ef1-f21b-4a79-8ce8-e6900c54b65b
detection:
  selection_4103:
    Payload|re: (?i)(set).*&&\s?set.*(environment|invoke|\$?\{?input).*&&.*"
  condition: selection_4103
provenance:
  source: SigmaHQ/sigma
  source_id: c72aca44-8d52-45ad-8f81-f96c4d3c755e
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_module/posh_pm_invoke_obfuscation_via_stdin.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
