id: sigmahq-sigma-27aec9c9-dbb0-4939-8422-1742242471d0
name: Invoke-Obfuscation VAR+ Launcher
description: Detects Obfuscated use of Environment Variables to execute PowerShell
severity: high
enabled: false
tags:
  mitre:
  - T1027
  - T1059.001
  categories:
  - endpoint
references:
- https://github.com/SigmaHQ/sigma/issues/1009
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|re: cmd.{0,5}(?:/c|/r)(?:\s|)\"set\s[a-zA-Z]{3,6}.*(?:\{\d\}){1,}\\\"\s+?\-f(?:.*\)){1,}.*\"
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 27aec9c9-dbb0-4939-8422-1742242471d0
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_hktl_invoke_obfuscation_var.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
