id: sigmahq-sigma-86b896ba-ffa1-4fea-83e3-ee28a4c915c7
name: Invoke-Obfuscation Via Stdin - Powershell
description: Detects Obfuscated Powershell via Stdin in Scripts
severity: high
enabled: false
tags:
  mitre:
  - T1027
  - T1059.001
  categories:
  - endpoint
references:
- https://github.com/SigmaHQ/sigma/issues/1009
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection_4104:
    ScriptBlockText|re: (?i)(set).*&&\s?set.*(environment|invoke|\$\{?input).*&&.*"
  condition: selection_4104
provenance:
  source: SigmaHQ/sigma
  source_id: 86b896ba-ffa1-4fea-83e3-ee28a4c915c7
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_invoke_obfuscation_via_stdin.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
