id: sigmahq-sigma-51aa9387-1c53-4153-91cc-d73c59ae1ca9
name: Invoke-Obfuscation Obfuscated IEX Invocation - System
description: Detects all variations of obfuscated powershell IEX invocation code generated
  by Invoke-Obfuscation framework from the code block linked in the references
severity: high
enabled: false
tags:
  mitre:
  - T1027
  categories:
  - endpoint
references:
- https://github.com/danielbohannon/Invoke-Obfuscation/blob/f20e7f843edd0a3a7716736e9eddfa423395dd26/Out-ObfuscatedStringCommand.ps1#L873-L888
logsource:
  product: windows
  service: system
detection:
  selection_eid:
    EventID: 7045
  selection_imagepath:
  - ImagePath|re: \$PSHome\[\s*\d{1,3}\s*\]\s*\+\s*\$PSHome\[
  - ImagePath|re: \$ShellId\[\s*\d{1,3}\s*\]\s*\+\s*\$ShellId\[
  - ImagePath|re: \$env:Public\[\s*\d{1,3}\s*\]\s*\+\s*\$env:Public\[
  - ImagePath|re: \$env:ComSpec\[(\s*\d{1,3}\s*,){2}
  - ImagePath|re: \\*mdr\*\W\s*\)\.Name
  - ImagePath|re: \$VerbosePreference\.ToString\(
  - ImagePath|re: \String\]\s*\$VerbosePreference
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 51aa9387-1c53-4153-91cc-d73c59ae1ca9
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/system/service_control_manager/win_system_invoke_obfuscation_obfuscated_iex_services.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
