id: sigmahq-sigma-a5a30a6e-75ca-4233-8b8c-42e0f2037d3b
name: Invoke-Obfuscation Via Use Rundll32 - PowerShell
description: Detects Obfuscated Powershell via use Rundll32 in Scripts
severity: high
enabled: false
tags:
  mitre:
  - T1027
  - T1059.001
  categories:
  - endpoint
references:
- https://github.com/SigmaHQ/sigma/issues/1009
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection_4104:
    ScriptBlockText|contains|all:
    - '&&'
    - rundll32
    - shell32.dll
    - shellexec_rundll
    ScriptBlockText|contains:
    - value
    - invoke
    - comspec
    - iex
  condition: selection_4104
provenance:
  source: SigmaHQ/sigma
  source_id: a5a30a6e-75ca-4233-8b8c-42e0f2037d3b
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_invoke_obfuscation_via_use_rundll32.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
