id: sigmahq-sigma-9b8d9203-4e0f-4cd9-bb06-4cc4ea6d0e9a
name: Invoke-Obfuscation Via Use MSHTA - Security
description: Detects Obfuscated Powershell via use MSHTA in Scripts
severity: high
enabled: false
tags:
  mitre:
  - T1027
  - T1059.001
  categories:
  - endpoint
references:
- https://github.com/SigmaHQ/sigma/issues/1009
logsource:
  product: windows
  service: security
  definition: The 'System Security Extension' audit subcategory need to be enabled
    to log the EID 4697
detection:
  selection:
    EventID: 4697
    ServiceFileName|contains|all:
    - mshta
    - vbscript:createobject
    - .run
    - window.close
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 9b8d9203-4e0f-4cd9-bb06-4cc4ea6d0e9a
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/security/win_security_invoke_obfuscation_via_use_mshta_services_security.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
