id: sigmahq-sigma-e1561947-b4e3-4a74-9bdd-83baed21bdb5
name: Invoke-Obfuscation Via Use Clip
description: Detects Obfuscated Powershell via use Clip.exe in Scripts
severity: high
enabled: false
tags:
  mitre:
  - T1027
  - T1059.001
  categories:
  - endpoint
references:
- https://github.com/SigmaHQ/sigma/issues/1009
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|re: (?i)echo.*clip.*&&.*(?:Clipboard|i`?n`?v`?o`?k`?e`?)
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: e1561947-b4e3-4a74-9bdd-83baed21bdb5
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_hktl_invoke_obfuscation_via_use_clip.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
