id: sigmahq-sigma-7a922f1b-2635-4d6c-91ef-af228b198ad3
name: Invoke-Obfuscation COMPRESS OBFUSCATION - Security
description: Detects Obfuscated Powershell via COMPRESS OBFUSCATION
severity: medium
enabled: false
tags:
  mitre:
  - T1027
  - T1059.001
  categories:
  - endpoint
references:
- https://github.com/SigmaHQ/sigma/issues/1009
logsource:
  product: windows
  service: security
  definition: The 'System Security Extension' audit subcategory need to be enabled
    to log the EID 4697
detection:
  selection:
    EventID: 4697
    ServiceFileName|contains|all:
    - new-object
    - text.encoding]::ascii
    - readtoend
    ServiceFileName|contains:
    - system.io.compression.deflatestream
    - system.io.streamreader
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 7a922f1b-2635-4d6c-91ef-af228b198ad3
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/security/win_security_invoke_obfuscation_via_compress_services_security.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
