id: sigmahq-sigma-80b708f3-d034-40e4-a6c8-d23b7a7db3d1
name: Invoke-Obfuscation Via Stdin - Security
description: Detects Obfuscated Powershell via Stdin in Scripts
severity: high
enabled: false
tags:
  mitre:
  - T1027
  - T1059.001
  categories:
  - endpoint
references:
- https://github.com/SigmaHQ/sigma/issues/1009
logsource:
  product: windows
  service: security
  definition: The 'System Security Extension' audit subcategory need to be enabled
    to log the EID 4697
detection:
  selection:
    EventID: 4697
    ServiceFileName|contains|all:
    - set
    - '&&'
    ServiceFileName|contains:
    - environment
    - invoke
    - ${input)
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 80b708f3-d034-40e4-a6c8-d23b7a7db3d1
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/security/win_security_invoke_obfuscation_via_stdin_services_security.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
