id: sigmahq-sigma-2f9356ae-bf43-41b8-b858-4496d83b2acb
name: ISO File Created Within Temp Folders
description: Detects the creation of a ISO file in the Outlook temp folder or in the
  Appdata temp folder. Typical of Qakbot TTP from end-July 2022.
severity: high
enabled: false
tags:
  mitre:
  - T1566.001
  categories:
  - endpoint
references:
- https://twitter.com/Sam0x90/status/1552011547974696960
- https://securityaffairs.co/wordpress/133680/malware/dll-sideloading-spread-qakbot.html
- https://github.com/redcanaryco/atomic-red-team/blob/0f229c0e42bfe7ca736a14023836d65baa941ed2/atomics/T1553.005/T1553.005.md#atomic-test-1---mount-iso-image
logsource:
  category: file_event
  product: windows
detection:
  selection_1:
    TargetFilename|contains|all:
    - \AppData\Local\Temp\
    - .zip\
    TargetFilename|endswith: .iso
  selection_2:
    TargetFilename|contains: \AppData\Local\Microsoft\Windows\INetCache\Content.Outlook\
    TargetFilename|endswith: .iso
  condition: 1 of selection*
provenance:
  source: SigmaHQ/sigma
  source_id: 2f9356ae-bf43-41b8-b858-4496d83b2acb
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_iso_file_mount.yml
falsepositives:
- Potential FP by sysadmin opening a zip file containing a legitimate ISO file
notes:
  quarantine_reason: 'upstream status: test'
