id: sigmahq-sigma-8f88e3f6-2a49-48f5-a5c4-2f7eedf78710
name: Java Running with Remote Debugging
description: Detects a JAVA process running with remote debugging allowing more than
  just localhost to connect
severity: medium
enabled: false
tags:
  mitre:
  - T1203
  categories:
  - endpoint
references:
- https://dzone.com/articles/remote-debugging-java-applications-with-jdwp
logsource:
  category: process_creation
  product: windows
detection:
  selection_jdwp_transport:
    CommandLine|contains: transport=dt_socket,address=
  selection_old_jvm_version:
    CommandLine|contains:
    - jre1.
    - jdk1.
  exclusion:
    CommandLine|contains:
    - address=127.0.0.1
    - address=localhost
  condition: all of selection_* and not exclusion
provenance:
  source: SigmaHQ/sigma
  source_id: 8f88e3f6-2a49-48f5-a5c4-2f7eedf78710
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_java_remote_debugging.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
