id: sigmahq-sigma-f7644214-0eb0-4ace-9455-331ec4c09253
name: Kerberos Manipulation
description: Detects failed Kerberos TGT issue operation. This can be a sign of manipulations
  of TGT messages by an attacker.
severity: high
enabled: false
tags:
  mitre:
  - T1212
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-10/security/threat-protection/auditing/event-4771
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID:
    - 675
    - 4768
    - 4769
    - 4771
    Status:
    - '0x9'
    - '0xA'
    - '0xB'
    - '0xF'
    - '0x10'
    - '0x11'
    - '0x13'
    - '0x14'
    - '0x1A'
    - '0x1F'
    - '0x21'
    - '0x22'
    - '0x23'
    - '0x24'
    - '0x26'
    - '0x27'
    - '0x28'
    - '0x29'
    - '0x2C'
    - '0x2D'
    - '0x2E'
    - '0x2F'
    - '0x31'
    - '0x32'
    - '0x3E'
    - '0x3F'
    - '0x40'
    - '0x41'
    - '0x43'
    - '0x44'
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: f7644214-0eb0-4ace-9455-331ec4c09253
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/security/win_security_susp_kerberos_manipulation.yml
falsepositives:
- Faulty legacy applications
notes:
  quarantine_reason: 'upstream status: test'
