id: sigmahq-sigma-e97d9903-53b2-41fc-8cb9-889ed4093e80
name: KrbRelayUp Service Installation
description: Detects service creation from KrbRelayUp tool used for privilege escalation
  in Windows domain environments where LDAP signing is not enforced (the default settings)
severity: high
enabled: false
tags:
  mitre:
  - T1543
  categories:
  - endpoint
references:
- https://github.com/Dec0ne/KrbRelayUp
logsource:
  product: windows
  service: system
detection:
  selection:
    EventID: 7045
    ServiceName: KrbSCM
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: e97d9903-53b2-41fc-8cb9-889ed4093e80
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/system/service_control_manager/win_system_krbrelayup_service_installation.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
