id: sigmahq-sigma-eeb3e9e1-b685-44e4-9232-6bb701f925b5
name: Kubernetes Secrets Enumeration
description: Detects enumeration of Kubernetes secrets.
severity: low
enabled: false
tags:
  mitre:
  - T1552.007
  categories:
  - endpoint
references:
- https://microsoft.github.io/Threat-Matrix-for-Kubernetes/techniques/List%20K8S%20secrets/
logsource:
  category: application
  product: kubernetes
  service: audit
detection:
  selection:
    verb: list
    objectRef.resource: secrets
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: eeb3e9e1-b685-44e4-9232-6bb701f925b5
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/application/kubernetes/audit/kubernetes_audit_secrets_enumeration.yml
falsepositives:
- The Kubernetes dashboard occasionally accesses the kubernetes-dashboard-key-holder
  secret
notes:
  quarantine_reason: 'upstream status: test'
