id: sigmahq-sigma-58d31a75-a4f8-4c40-985b-373d58162ca2
name: Kubernetes Secrets Modified or Deleted
description: Detects when Kubernetes Secrets are Modified or Deleted.
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://kubernetes.io/docs/reference/config-api/apiserver-audit.v1/
- https://commandk.dev/blog/guide-to-audit-k8s-secrets-for-compliance/
logsource:
  product: kubernetes
  service: audit
detection:
  selection:
    objectRef.resource: secrets
    verb:
    - create
    - delete
    - patch
    - replace
    - update
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 58d31a75-a4f8-4c40-985b-373d58162ca2
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/application/kubernetes/audit/kubernetes_audit_secrets_modified_or_deleted.yml
falsepositives:
- Secrets being modified or deleted may be performed by a system administrator.
- Automated processes may need to take these actions and may need to be filtered.
notes:
  quarantine_reason: 'upstream status: test'
