id: sigmahq-sigma-45d3a03d-f441-458c-8883-df101a3bb146
name: Launch-VsDevShell.PS1 Proxy Execution
description: Detects the use of the 'Launch-VsDevShell.ps1' Microsoft signed script
  to execute commands.
severity: medium
enabled: false
tags:
  mitre:
  - T1216.001
  categories:
  - endpoint
references:
- https://twitter.com/nas_bench/status/1535981653239255040
logsource:
  category: process_creation
  product: windows
detection:
  selection_script:
    CommandLine|contains: Launch-VsDevShell.ps1
  selection_flags:
    CommandLine|contains:
    - 'VsWherePath '
    - 'VsInstallationPath '
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 45d3a03d-f441-458c-8883-df101a3bb146
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_lolbin_launch_vsdevshell.yml
falsepositives:
- Legitimate usage of the script by a developer
notes:
  quarantine_reason: 'upstream status: test'
