id: sigmahq-sigma-f0540f7e-2db3-4432-b9e0-3965486744bc
name: Legitimate Application Dropped Executable
description: Detects programs on a Windows system that should not write executables
  to disk
severity: high
enabled: false
tags:
  mitre:
  - T1218
  categories:
  - endpoint
references:
- https://github.com/Neo23x0/sysmon-config/blob/3f808d9c022c507aae21a9346afba4a59dd533b9/sysmonconfig-export-block.xml#L1326
logsource:
  product: windows
  category: file_event
detection:
  selection:
    Image|endswith:
    - \eqnedt32.exe
    - \wordpad.exe
    - \wordview.exe
    - \certutil.exe
    - \certoc.exe
    - \CertReq.exe
    - \Desktopimgdownldr.exe
    - \esentutl.exe
    - \mshta.exe
    - \AcroRd32.exe
    - \RdrCEF.exe
    - \hh.exe
    - \finger.exe
    TargetFilename|endswith:
    - .exe
    - .dll
    - .ocx
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: f0540f7e-2db3-4432-b9e0-3965486744bc
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_susp_legitimate_app_dropping_exe.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
