id: sigmahq-sigma-1cf465a1-2609-4c15-9b66-c32dbe4bfd67
name: Legitimate Application Writing Files In Uncommon Location
description: 'Detects legitimate applications writing any type of file to uncommon
  or suspicious locations that are not typical for application data storage or execution.

  Adversaries may leverage legitimate applications (Living off the Land Binaries -
  LOLBins) to drop or download malicious files to uncommon locations on the system
  to evade detection by security solutions.'
severity: high
enabled: false
tags:
  mitre:
  - T1218
  - T1105
  categories:
  - endpoint
references:
- https://lolbas-project.github.io/#/download
logsource:
  product: windows
  category: file_event
detection:
  selection_img:
    Image|endswith:
    - \eqnedt32.exe
    - \wordpad.exe
    - \wordview.exe
    - \cmdl32.exe
    - \certutil.exe
    - \certoc.exe
    - \CertReq.exe
    - \bitsadmin.exe
    - \Desktopimgdownldr.exe
    - \esentutl.exe
    - \expand.exe
    - \extrac32.exe
    - \replace.exe
    - \mshta.exe
    - \ftp.exe
    - \Ldifde.exe
    - \RdrCEF.exe
    - \hh.exe
    - \finger.exe
    - \findstr.exe
  selection_locations:
    TargetFilename|contains:
    - :\Perflogs
    - :\ProgramData\
    - :\Temp\
    - :\Users\Public\
    - :\Windows\
    - \$Recycle.Bin\
    - \AppData\Local\
    - \AppData\Roaming\
    - \Contacts\
    - \Desktop\
    - \Favorites\
    - \Favourites\
    - \inetpub\wwwroot\
    - \Music\
    - \Pictures\
    - \Start Menu\Programs\Startup\
    - \Users\Default\
    - \Videos\
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 1cf465a1-2609-4c15-9b66-c32dbe4bfd67
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_susp_legitimate_app_dropping_in_uncommon_location.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: experimental'
