id: sigmahq-sigma-a015e032-146d-4717-8944-7a1884122111
name: Linux HackTool Execution
description: Detects known hacktool execution based on image name.
severity: high
enabled: false
tags:
  mitre:
  - T1587
  categories:
  - endpoint
references:
- https://github.com/Gui774ume/ebpfkit
- https://github.com/pathtofile/bad-bpf
- https://github.com/carlospolop/PEASS-ng
- https://github.com/t3l3machus/hoaxshell
- https://github.com/t3l3machus/Villain
- https://github.com/HavocFramework/Havoc
- https://github.com/1N3/Sn1per
- https://github.com/Ne0nd0g/merlin
- https://github.com/Pennyw0rth/NetExec/
logsource:
  product: linux
  category: process_creation
detection:
  selection_c2_frameworks:
    Image|endswith:
    - /crackmapexec
    - /havoc
    - /merlin-agent
    - /merlinServer-Linux-x64
    - /msfconsole
    - /msfvenom
    - /ps-empire server
    - /ps-empire
    - /sliver-client
    - /sliver-server
    - /Villain.py
  selection_c2_framework_cobaltstrike:
    Image|contains:
    - /cobaltstrike
    - /teamserver
  selection_scanners:
    Image|endswith:
    - /autorecon
    - /httpx
    - /legion
    - /naabu
    - /netdiscover
    - /nuclei
    - /recon-ng
  selection_scanners_sniper:
    Image|contains: /sniper
  selection_web_enum:
    Image|endswith:
    - /dirb
    - /dirbuster
    - /eyewitness
    - /feroxbuster
    - /ffuf
    - /gobuster
    - /wfuzz
    - /whatweb
  selection_web_vuln:
    Image|endswith:
    - /joomscan
    - /nikto
    - /wpscan
  selection_exploit_tools:
    Image|endswith:
    - /aircrack-ng
    - /bloodhound-python
    - /bpfdos
    - /ebpfki
    - /evil-winrm
    - /hashcat
    - /hoaxshell.py
    - /hydra
    - /john
    - /ncrack
    - /nxc-ubuntu-latest
    - /pidhide
    - /pspy32
    - /pspy32s
    - /pspy64
    - /pspy64s
    - /setoolkit
    - /sqlmap
    - /writeblocker
  selection_linpeas:
    Image|contains: /linpeas
  condition: 1 of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: a015e032-146d-4717-8944-7a1884122111
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/process_creation/proc_creation_lnx_susp_hktl_execution.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
