id: sigmahq-sigma-3e102cd9-a70d-4a7a-9508-403963092f31
name: Linux Network Service Scanning Tools Execution
description: Detects execution of network scanning and reconnaisance tools. These
  tools can be used for the enumeration of local or remote network services for example.
severity: low
enabled: false
tags:
  mitre:
  - T1046
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1046/T1046.md
- https://github.com/projectdiscovery/naabu
- https://github.com/Tib3rius/AutoRecon
logsource:
  category: process_creation
  product: linux
detection:
  selection_netcat:
    Image|endswith:
    - /nc
    - /ncat
    - /netcat
    - /socat
  selection_network_scanning_tools:
    Image|endswith:
    - /autorecon
    - /hping
    - /hping2
    - /hping3
    - /naabu
    - /nmap
    - /nping
    - /telnet
    - /zenmap
  filter_main_netcat_listen_flag:
    CommandLine|contains:
    - ' --listen '
    - ' -l '
  condition: (selection_netcat and not filter_main_netcat_listen_flag) or selection_network_scanning_tools
provenance:
  source: SigmaHQ/sigma
  source_id: 3e102cd9-a70d-4a7a-9508-403963092f31
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/process_creation/proc_creation_lnx_susp_network_utilities_execution.yml
falsepositives:
- Legitimate administration activities
notes:
  quarantine_reason: 'upstream status: test'
