id: sigmahq-sigma-ba592c6d-6888-43c3-b8c6-689b8fe47337
name: Linux Base64 Encoded Pipe to Shell
description: Detects suspicious process command line that uses base64 encoded input
  for execution with a shell
severity: medium
enabled: false
tags:
  mitre:
  - T1140
  categories:
  - endpoint
references:
- https://github.com/arget13/DDexec
- https://www.mandiant.com/resources/blog/barracuda-esg-exploited-globally
logsource:
  product: linux
  category: process_creation
detection:
  selection_base64:
    CommandLine|contains: 'base64 '
  selection_exec:
  - CommandLine|contains:
    - '| bash '
    - '| sh '
    - '|bash '
    - '|sh '
  - CommandLine|endswith:
    - ' |sh'
    - '| bash'
    - '| sh'
    - '|bash'
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: ba592c6d-6888-43c3-b8c6-689b8fe47337
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/process_creation/proc_creation_lnx_base64_execution.yml
falsepositives:
- Legitimate administration activities
notes:
  quarantine_reason: 'upstream status: test'
