id: sigmahq-sigma-b48492dc-c5ef-4572-8dff-32bc241c15c8
name: Load Of RstrtMgr.DLL By A Suspicious Process
description: 'Detects the load of RstrtMgr DLL (Restart Manager) by a suspicious process.

  This library has been used during ransomware campaigns to kill processes that would
  prevent file encryption by locking them (e.g. Conti ransomware, Cactus ransomware).
  It has also recently been seen used by the BiBi wiper for Windows.

  It could also be used for anti-analysis purposes by shut downing specific processes.'
severity: high
enabled: false
tags:
  mitre:
  - T1486
  - T1685
  categories:
  - endpoint
references:
- https://www.crowdstrike.com/blog/windows-restart-manager-part-1/
- https://www.crowdstrike.com/blog/windows-restart-manager-part-2/
- https://web.archive.org/web/20231221193106/https://www.swascan.com/cactus-ransomware-malware-analysis/
- https://taiwan.postsen.com/business/88601/Hamas-hackers-use-data-destruction-software-BiBi-which-consumes-a-lot-of-processor-resources-to-wipe-Windows-computer-data--iThome.html
logsource:
  category: image_load
  product: windows
detection:
  selection_img:
  - ImageLoaded|endswith: \RstrtMgr.dll
  - OriginalFileName: RstrtMgr.dll
  selection_folders_1:
    Image|contains:
    - :\Perflogs\
    - :\Users\Public\
    - \Temporary Internet
  selection_folders_2:
  - Image|contains|all:
    - :\Users\
    - \Favorites\
  - Image|contains|all:
    - :\Users\
    - \Favourites\
  - Image|contains|all:
    - :\Users\
    - \Contacts\
  condition: selection_img and 1 of selection_folders_*
provenance:
  source: SigmaHQ/sigma
  source_id: b48492dc-c5ef-4572-8dff-32bc241c15c8
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/image_load/image_load_dll_rstrtmgr_suspicious_load.yml
falsepositives:
- Processes related to software installation
notes:
  quarantine_reason: 'upstream status: test'
