id: sigmahq-sigma-34275eb8-fa19-436b-b959-3d9ecd53fa1f
name: Loaded Module Enumeration Via Tasklist.EXE
description: 'Detects the enumeration of a specific DLL or EXE being used by a binary
  via "tasklist.exe".

  This is often used by attackers in order to find the specific process identifier
  (PID) that is using the DLL in question.

  In order to dump the process memory or perform other nefarious actions.'
severity: medium
enabled: false
tags:
  mitre:
  - T1003
  categories:
  - endpoint
references:
- https://www.n00py.io/2021/05/dumping-plaintext-rdp-credentials-from-svchost-exe/
- https://pentestlab.blog/tag/svchost/
logsource:
  product: windows
  category: process_creation
detection:
  selection_img:
  - Image|endswith: \tasklist.exe
  - OriginalFileName: tasklist.exe
  selection_flags:
    CommandLine|contains|windash: -m
  selection_module:
    CommandLine|contains: rdpcorets.dll
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 34275eb8-fa19-436b-b959-3d9ecd53fa1f
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_tasklist_module_enumeration.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
