id: sigmahq-sigma-bc2e25ed-b92b-4daa-b074-b502bdd1982b
name: Local Privilege Escalation Indicator TabTip
description: Detects the invocation of TabTip via CLSID as seen when JuicyPotatoNG
  is used on a system in brute force mode
severity: high
enabled: false
tags:
  mitre:
  - T1557.001
  categories:
  - endpoint
references:
- https://github.com/antonioCoco/JuicyPotatoNG
logsource:
  product: windows
  service: system
detection:
  selection:
    Provider_Name: Microsoft-Windows-DistributedCOM
    EventID: 10001
    param1: C:\Program Files\Common Files\microsoft shared\ink\TabTip.exe
    param2: 2147943140
    param3: '{054AAE20-4BEA-4347-8A35-64A533254A9D}'
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: bc2e25ed-b92b-4daa-b074-b502bdd1982b
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/system/microsoft_windows_distributed_com/win_system_lpe_indicators_tabtip.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
