id: sigmahq-sigma-ddf36b67-e872-4507-ab2e-46bda21b842c
name: Local System Accounts Discovery - MacOs
description: Detects enumeration of local systeam accounts on MacOS
severity: low
enabled: false
tags:
  mitre:
  - T1087.001
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1087.001/T1087.001.md
logsource:
  category: process_creation
  product: macos
detection:
  selection_1:
    Image|endswith: /dscl
    CommandLine|contains|all:
    - list
    - /users
  selection_2:
    Image|endswith: /dscacheutil
    CommandLine|contains|all:
    - -q
    - user
  selection_3:
    CommandLine|contains: '''x:0:'''
  selection_4:
    Image|endswith: /cat
    CommandLine|contains:
    - /etc/passwd
    - /etc/sudoers
  selection_5:
    Image|endswith: /id
  selection_6:
    Image|endswith: /lsof
    CommandLine|contains: -u
  condition: 1 of selection*
provenance:
  source: SigmaHQ/sigma
  source_id: ddf36b67-e872-4507-ab2e-46bda21b842c
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/macos/process_creation/proc_creation_macos_local_account.yml
falsepositives:
- Legitimate administration activities
notes:
  quarantine_reason: 'upstream status: test'
