id: sigmahq-sigma-d4ca7c59-e9e4-42d8-bf57-91a776efcb87
name: LOLBIN Execution From Abnormal Drive
description: Detects LOLBINs executing from an abnormal or uncommon drive such as
  a mounted ISO.
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://thedfirreport.com/2021/12/13/diavol-ransomware/
- https://www.scythe.io/library/threat-emulation-qakbot
- https://sec-consult.com/blog/detail/bumblebee-hunting-with-a-velociraptor/
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Image|endswith:
    - \calc.exe
    - \certutil.exe
    - \cmstp.exe
    - \cscript.exe
    - \installutil.exe
    - \mshta.exe
    - \regsvr32.exe
    - \rundll32.exe
    - \wscript.exe
  - OriginalFileName:
    - CALC.EXE
    - CertUtil.exe
    - CMSTP.EXE
    - cscript.exe
    - installutil.exe
    - MSHTA.EXE
    - REGSVR32.EXE
    - RUNDLL32.EXE
    - wscript.exe
  filter_main_currentdirectory:
    CurrentDirectory|contains: C:\
  filter_main_empty:
    CurrentDirectory: ''
  filter_main_null:
    CurrentDirectory: null
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: d4ca7c59-e9e4-42d8-bf57-91a776efcb87
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_susp_lolbin_exec_from_non_c_drive.yml
falsepositives:
- Rare false positives could occur on servers with multiple drives.
notes:
  quarantine_reason: 'upstream status: test'
