id: sigmahq-sigma-8c0eca51-0f88-4db2-9183-fdfb10c703f9
name: LSA PPL Protection Setting Modification via CommandLine
description: 'Detects modification of LSA PPL protection settings via CommandLine.

  It may indicate an attempt to disable protection and enable credential dumping tools
  to access LSASS process memory.'
severity: medium
enabled: false
tags:
  mitre:
  - T1689
  categories:
  - endpoint
references:
- https://thedfirreport.com/2022/03/21/apt35-automates-initial-access-using-proxyshell/
- https://github.com/shoober420/windows11-scripts/blob/38d83331738cd713ccb42f2c4557d17a27aefd98/Windows11Tweaks.bat#L1825
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - \reg.exe
    - \powershell.exe
    - \pwsh.exe
  - OriginalFileName:
    - reg.exe
    - powershell.exe
    - pwsh.dll
  selection_cli_action:
    CommandLine|contains|all:
    - ControlSet
    - \Control\Lsa
    CommandLine|contains:
    - Set-ItemProperty
    - New-ItemProperty
    - ' add '
  selection_key:
    CommandLine|contains:
    - IsPplAutoEnabled
    - RunAsPPL
    - RunAsPPLBoot
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 8c0eca51-0f88-4db2-9183-fdfb10c703f9
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_lsa_ppl_protection_setting_modification_via_cli.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
