id: sigmahq-sigma-962fe167-e48d-4fd6-9974-11e5b9a5d6d1
name: LSASS Access From Non System Account
description: Detects potential mimikatz-like tools accessing LSASS from non system
  account
severity: medium
enabled: false
tags:
  mitre:
  - T1003.001
  categories:
  - endpoint
references:
- https://threathunterplaybook.com/hunts/windows/170105-LSASSMemoryReadAccess/notebook.html
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID:
    - 4663
    - 4656
    AccessMask:
    - '0x100000'
    - '0x1010'
    - '0x1400'
    - '0x1410'
    - '0x1418'
    - '0x1438'
    - '0x143a'
    - '0x1f0fff'
    - '0x1f1fff'
    - '0x1f2fff'
    - '0x1f3fff'
    - '0x40'
    - 143a
    - 1f0fff
    - 1f1fff
    - 1f2fff
    - 1f3fff
    ObjectType: Process
    ObjectName|endswith: \lsass.exe
  filter_main_service_account:
    SubjectUserName|endswith: $
  filter_main_generic:
    ProcessName|contains:
    - :\Program Files\
    - :\Program Files (x86)\
  filter_main_wmiprvse:
    ProcessName: C:\Windows\System32\wbem\WmiPrvSE.exe
    AccessMask: '0x1410'
  filter_optional_steam:
    ProcessName|contains: \SteamLibrary\steamapps\
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
provenance:
  source: SigmaHQ/sigma
  source_id: 962fe167-e48d-4fd6-9974-11e5b9a5d6d1
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/security/win_security_lsass_access_non_system_account.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
