id: sigmahq-sigma-a49fa4d5-11db-418c-8473-1e014a8dd462
name: Lsass Memory Dump via Comsvcs DLL
description: Detects adversaries leveraging the MiniDump export function from comsvcs.dll
  via rundll32 to perform a memory dump from lsass.
severity: high
enabled: false
tags:
  mitre:
  - T1003.001
  categories:
  - endpoint
references:
- https://twitter.com/shantanukhande/status/1229348874298388484
- https://modexp.wordpress.com/2019/08/30/minidumpwritedump-via-com-services-dll/
logsource:
  category: process_access
  product: windows
detection:
  selection:
    TargetImage|endswith: \lsass.exe
    SourceImage|endswith: \rundll32.exe
    CallTrace|contains: comsvcs.dll
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: a49fa4d5-11db-418c-8473-1e014a8dd462
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_access/proc_access_win_lsass_dump_comsvcs_dll.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
