id: sigmahq-sigma-fe63010f-8823-4864-a96b-a7b4a0f7b929
name: LSASS Process Reconnaissance Via Findstr.EXE
description: Detects findstring commands that include the keyword lsass, which indicates
  recon actviity for the LSASS process PID
severity: high
enabled: false
tags:
  mitre:
  - T1552.006
  categories:
  - endpoint
references:
- https://blog.talosintelligence.com/2022/08/recent-cyber-attack.html?m=1
logsource:
  category: process_creation
  product: windows
detection:
  selection_findstr_img:
  - Image|endswith:
    - \find.exe
    - \findstr.exe
  - OriginalFileName:
    - FIND.EXE
    - FINDSTR.EXE
  selection_findstr_cli:
    CommandLine|contains: lsass
  selection_special:
    CommandLine|contains|windash:
    - ' /i "lsass'
    - ' /i lsass.exe'
    - findstr "lsass
    - findstr lsass
    - findstr.exe "lsass
    - findstr.exe lsass
  condition: all of selection_findstr_* or selection_special
provenance:
  source: SigmaHQ/sigma
  source_id: fe63010f-8823-4864-a96b-a7b4a0f7b929
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_findstr_lsass.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
