id: sigmahq-sigma-6902955a-01b7-432c-b32a-6f5f81d8f625
name: LSASS Process Dump Artefact In CrashDumps Folder
description: Detects the presence of an LSASS dump file in the "CrashDumps" folder.
  This could be a sign of LSASS credential dumping. Techniques such as the LSASS Shtinkering
  have been seen abusing the Windows Error Reporting to dump said process.
severity: high
enabled: false
tags:
  mitre:
  - T1003.001
  categories:
  - endpoint
references:
- https://github.com/deepinstinct/Lsass-Shtinkering
- https://media.defcon.org/DEF%20CON%2030/DEF%20CON%2030%20presentations/Asaf%20Gilboa%20-%20LSASS%20Shtinkering%20Abusing%20Windows%20Error%20Reporting%20to%20Dump%20LSASS.pdf
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename|startswith: C:\Windows\System32\config\systemprofile\AppData\Local\CrashDumps\
    TargetFilename|contains: lsass.exe.
    TargetFilename|endswith: .dmp
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 6902955a-01b7-432c-b32a-6f5f81d8f625
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_lsass_shtinkering.yml
falsepositives:
- Rare legitimate dump of the process by the operating system due to a crash of lsass
notes:
  quarantine_reason: 'upstream status: test'
