id: sigmahq-sigma-33efc23c-6ea2-4503-8cfe-bdf82ce8f719
name: Lsass Full Dump Request Via DumpType Registry Settings
description: Detects the setting of the "DumpType" registry value to "2" which stands
  for a "Full Dump". Technique such as LSASS Shtinkering requires this value to be
  "2" in order to dump LSASS.
severity: high
enabled: false
tags:
  mitre:
  - T1003.001
  categories:
  - endpoint
references:
- https://github.com/deepinstinct/Lsass-Shtinkering
- https://learn.microsoft.com/en-us/windows/win32/wer/collecting-user-mode-dumps
- https://media.defcon.org/DEF%20CON%2030/DEF%20CON%2030%20presentations/Asaf%20Gilboa%20-%20LSASS%20Shtinkering%20Abusing%20Windows%20Error%20Reporting%20to%20Dump%20LSASS.pdf
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains:
    - \SOFTWARE\Microsoft\Windows\Windows Error Reporting\LocalDumps\DumpType
    - \SOFTWARE\Microsoft\Windows\Windows Error Reporting\LocalDumps\lsass.exe\DumpType
    Details: DWORD (0x00000002)
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 33efc23c-6ea2-4503-8cfe-bdf82ce8f719
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_lsass_usermode_dumping.yml
falsepositives:
- Legitimate application that needs to do a full dump of their process
notes:
  quarantine_reason: 'upstream status: test'
