id: sigmahq-sigma-ffa6861c-4461-4f59-8a41-578c39f3f23e
name: LSASS Dump Keyword In CommandLine
description: Detects the presence of the keywords "lsass" and ".dmp" in the commandline,
  which could indicate a potential attempt to dump or create a dump of the lsass process.
severity: high
enabled: false
tags:
  mitre:
  - T1003.001
  categories:
  - endpoint
references:
- https://github.com/Hackndo/lsassy
- https://medium.com/@markmotig/some-ways-to-dump-lsass-exe-c4a75fdc49bf
- https://github.com/elastic/detection-rules/blob/c76a39796972ecde44cb1da6df47f1b6562c9770/rules/windows/credential_access_lsass_memdump_file_created.toml
- https://www.whiteoaksecurity.com/blog/attacks-defenses-dumping-lsass-no-mimikatz/
- https://github.com/helpsystems/nanodump
- https://github.com/CCob/MirrorDump
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - CommandLine|contains:
    - lsass.dmp
    - lsass.zip
    - lsass.rar
    - Andrew.dmp
    - Coredump.dmp
    - NotLSASS.zip
    - lsass_2
    - lsassdump
    - lsassdmp
  - CommandLine|contains|all:
    - lsass
    - .dmp
  - CommandLine|contains|all:
    - SQLDmpr
    - .mdmp
  - CommandLine|contains|all:
    - nanodump
    - .dmp
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: ffa6861c-4461-4f59-8a41-578c39f3f23e
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_susp_lsass_dmp_cli_keywords.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
