id: sigmahq-sigma-69ca12af-119d-44ed-b50f-a47af0ebc364
name: LSASS Process Memory Dump Creation Via Taskmgr.EXE
description: Detects the creation of an "lsass.dmp" file by the taskmgr process. This
  indicates a manual dumping of the LSASS.exe process memory using Windows Task Manager.
severity: high
enabled: false
tags:
  mitre:
  - T1003.001
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/987e3ca988ae3cff4b9f6e388c139c05bf44bbb8/atomics/T1003.001/T1003.001.md#L1
logsource:
  category: file_event
  product: windows
detection:
  selection:
    Image|endswith:
    - :\Windows\system32\taskmgr.exe
    - :\Windows\SysWOW64\taskmgr.exe
    TargetFilename|contains|all:
    - \AppData\Local\Temp\
    - \lsass
    - .DMP
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 69ca12af-119d-44ed-b50f-a47af0ebc364
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_taskmgr_lsass_dump.yml
falsepositives:
- Rare case of troubleshooting by an administrator or support that has to be investigated
  regardless
notes:
  quarantine_reason: 'upstream status: test'
