id: sigmahq-sigma-a0a278fe-2c0e-4de2-ac3c-c68b08a9ba98
name: LSASS Access Detected via Attack Surface Reduction
description: Detects Access to LSASS Process
severity: high
enabled: false
tags:
  mitre:
  - T1003.001
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/defender-endpoint/attack-surface-reduction
logsource:
  product: windows
  service: windefend
  definition: 'Requirements:Enabled Block credential stealing from the Windows local
    security authority subsystem (lsass.exe) from Attack Surface Reduction (GUID:
    9e6c4e1f-7d60-472f-ba1a-a39ef669e4b2)'
detection:
  selection:
    EventID: 1121
    Path|endswith: \lsass.exe
  filter_thor:
    ProcessName|startswith: C:\Windows\Temp\asgard2-agent\
    ProcessName|endswith:
    - \thor64.exe
    - \thor.exe
  filter_exact:
    ProcessName:
    - C:\Windows\System32\atiesrxx.exe
    - C:\Windows\System32\CompatTelRunner.exe
    - C:\Windows\System32\msiexec.exe
    - C:\Windows\System32\nvwmi64.exe
    - C:\Windows\System32\svchost.exe
    - C:\Windows\System32\Taskmgr.exe
    - C:\Windows\System32\wbem\WmiPrvSE.exe
    - C:\Windows\SysWOW64\msiexec.exe
  filter_begins:
    ProcessName|startswith:
    - C:\Windows\System32\DriverStore\
    - C:\WINDOWS\Installer\
    - C:\Program Files\
    - C:\Program Files (x86)\
  condition: selection and not 1 of filter_*
provenance:
  source: SigmaHQ/sigma
  source_id: a0a278fe-2c0e-4de2-ac3c-c68b08a9ba98
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/windefend/win_defender_asr_lsass_access.yml
falsepositives:
- Google Chrome GoogleUpdate.exe
- Some Taskmgr.exe related activity
notes:
  quarantine_reason: 'upstream status: test'
