id: sigmahq-sigma-23c43900-e732-45a4-8354-63e4a6c187ce
name: MacOS Emond Launch Daemon
description: Detects additions to the Emond Launch Daemon that adversaries may use
  to gain persistence and elevate privileges.
severity: medium
enabled: false
tags:
  mitre:
  - T1546.014
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1546.014/T1546.014.md
- https://posts.specterops.io/leveraging-emond-on-macos-for-persistence-a040a2785124
logsource:
  category: file_event
  product: macos
detection:
  selection_1:
    TargetFilename|contains: /etc/emond.d/rules/
    TargetFilename|endswith: .plist
  selection_2:
    TargetFilename|contains: /private/var/db/emondClients/
  condition: 1 of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 23c43900-e732-45a4-8354-63e4a6c187ce
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/macos/file_event/file_event_macos_emond_launch_daemon.yml
falsepositives:
- Legitimate administration activities
notes:
  quarantine_reason: 'upstream status: test'
