id: sigmahq-sigma-352a918a-34d8-4882-8470-44830c507aa3
name: Malicious Usage Of IMDS Credentials Outside Of AWS Infrastructure
description: 'Detects when an instance identity has taken an action that isn''t inside
  SSM.

  This can indicate that a compromised EC2 instance is being used as a pivot point.'
severity: high
enabled: false
tags:
  mitre:
  - T1078
  - T1078.002
  categories:
  - cloud
references:
- https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/ec2-instance-identity-roles.html
- https://ermetic.com/blog/aws/aws-ec2-imds-what-you-need-to-know/
- https://www.packetmischief.ca/2023/07/31/amazon-ec2-credential-exfiltration-how-it-happens-and-how-to-mitigate-it/#lifting-credentials-from-imds-this-is-why-we-cant-have-nice-things
logsource:
  product: aws
  service: cloudtrail
detection:
  selection:
    userIdentity.arn|re: .+:assumed-role/aws:.+
  filter_main_generic:
  - eventSource: ssm.amazonaws.com
  - eventName: RegisterManagedInstance
  - sourceIPAddress: AWS Internal
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 352a918a-34d8-4882-8470-44830c507aa3
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/aws/cloudtrail/aws_cloudtrail_imds_malicious_usage.yml
falsepositives:
- A team has configured an EC2 instance to use instance profiles that grant the option
  for the EC2 instance to talk to other AWS Services
notes:
  quarantine_reason: 'upstream status: test'
