id: sigmahq-sigma-f772cee9-b7c2-4cb2-8f07-49870adc02e0
name: Malicious Nishang PowerShell Commandlets
description: Detects Commandlet names and arguments from the Nishang exploitation
  framework
severity: high
enabled: false
tags:
  mitre:
  - T1059.001
  categories:
  - endpoint
references:
- https://github.com/samratashok/nishang
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection:
    ScriptBlockText|contains:
    - Add-ConstrainedDelegationBackdoor
    - Copy-VSS
    - Create-MultipleSessions
    - DataToEncode
    - DNS_TXT_Pwnage
    - Do-Exfiltration-Dns
    - Download_Execute
    - Download-Execute-PS
    - DownloadAndExtractFromRemoteRegistry
    - DumpCerts
    - DumpCreds
    - DumpHashes
    - Enable-DuplicateToken
    - Enable-Duplication
    - Execute-Command-MSSQL
    - Execute-DNSTXT-Code
    - Execute-OnTime
    - ExetoText
    - exfill
    - ExfilOption
    - FakeDC
    - FireBuster
    - FireListener
    - 'Get-Information '
    - Get-PassHints
    - Get-Web-Credentials
    - Get-WebCredentials
    - Get-WLAN-Keys
    - HTTP-Backdoor
    - Invoke-AmsiBypass
    - Invoke-BruteForce
    - Invoke-CredentialsPhish
    - Invoke-Decode
    - Invoke-Encode
    - Invoke-Interceptor
    - Invoke-JSRatRegsvr
    - Invoke-JSRatRundll
    - Invoke-MimikatzWDigestDowngrade
    - Invoke-NetworkRelay
    - Invoke-PowerShellIcmp
    - Invoke-PowerShellUdp
    - Invoke-Prasadhak
    - Invoke-PSGcat
    - Invoke-PsGcatAgent
    - Invoke-SessionGopher
    - Invoke-SSIDExfil
    - LoggedKeys
    - Nishang
    - NotAllNameSpaces
    - Out-CHM
    - OUT-DNSTXT
    - Out-HTA
    - Out-RundllCommand
    - Out-SCF
    - Out-SCT
    - Out-Shortcut
    - Out-WebQuery
    - Out-Word
    - Parse_Keys
    - Password-List
    - Powerpreter
    - Remove-Persistence
    - Remove-PoshRat
    - Remove-Update
    - Run-EXEonRemote
    - Set-DCShadowPermissions
    - Set-RemotePSRemoting
    - Set-RemoteWMI
    - Shellcode32
    - Shellcode64
    - StringtoBase64
    - TexttoExe
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: f772cee9-b7c2-4cb2-8f07-49870adc02e0
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_nishang_malicious_commandlets.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
