id: sigmahq-sigma-a3f55ebd-0c01-4ed6-adc0-8fb76d8cd3cd
name: Malicious IP Address Sign-In Failure Rate
description: Indicates sign-in from a malicious IP address based on high failure rates.
severity: high
enabled: false
tags:
  mitre:
  - T1090
  categories:
  - cloud
references:
- https://learn.microsoft.com/en-us/entra/id-protection/concept-identity-protection-risks#malicious-ip-address
- https://learn.microsoft.com/en-us/entra/architecture/security-operations-user-accounts#unusual-sign-ins
logsource:
  product: azure
  service: riskdetection
detection:
  selection:
    riskEventType: maliciousIPAddress
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: a3f55ebd-0c01-4ed6-adc0-8fb76d8cd3cd
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/azure/identity_protection/azure_identity_protection_malicious_ip_address.yml
falsepositives:
- We recommend investigating the sessions flagged by this detection in the context
  of other sign-ins from the user.
notes:
  quarantine_reason: 'upstream status: test'
