id: sigmahq-sigma-b29a93fb-087c-4b5b-a84d-ee3309e69d08
name: Manipulation of User Computer or Group Security Principals Across AD
description: 'Adversaries may create a domain account to maintain access to victim
  systems.

  Domain accounts are those managed by Active Directory Domain Services where access
  and permissions are configured across systems and services that are part of that
  domain..'
severity: medium
enabled: false
tags:
  mitre:
  - T1136.002
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1136.002/T1136.002.md#atomic-test-3---create-a-new-domain-account-using-powershell
- https://learn.microsoft.com/en-us/dotnet/api/system.directoryservices.accountmanagement?view=net-8.0
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection:
    ScriptBlockText|contains: System.DirectoryServices.AccountManagement
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: b29a93fb-087c-4b5b-a84d-ee3309e69d08
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_directoryservices_accountmanagement.yml
falsepositives:
- Legitimate administrative script
notes:
  quarantine_reason: 'upstream status: test'
