id: sigmahq-sigma-9d4548fa-bba0-4e88-bd66-5d5bf516cda0
name: Masquerading as Linux Crond Process
description: 'Masquerading occurs when the name or location of an executable, legitimate
  or malicious, is manipulated or abused for the sake of evading defenses and observation.

  Several different variations of this technique have been observed.'
severity: medium
enabled: false
tags:
  mitre:
  - T1036.003
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/8a82e9b66a5b4f4bc5b91089e9f24e0544f20ad7/atomics/T1036.003/T1036.003.md#atomic-test-2---masquerading-as-linux-crond-process
logsource:
  product: linux
  service: auditd
detection:
  selection:
    type: execve
    a0: cp
    a1: /bin/sh
    a2|endswith: /crond
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 9d4548fa-bba0-4e88-bd66-5d5bf516cda0
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/auditd/execve/lnx_auditd_masquerading_crond.yml
notes:
  quarantine_reason: 'upstream status: test'
