id: sigmahq-sigma-4f73421b-5a0b-4bbf-a892-5a7fb99bea66
name: Mavinject Inject DLL Into Running Process
description: Detects process injection using the signed Windows tool "Mavinject" via
  the "INJECTRUNNING" flag
severity: high
enabled: false
tags:
  mitre:
  - T1055.001
  - T1218.013
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218/T1218.md
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1056.004/T1056.004.md
- https://posts.specterops.io/mavinject-exe-functionality-deconstructed-c29ab2cf5c0e
- https://twitter.com/gN3mes1s/status/941315826107510784
- https://reaqta.com/2017/12/mavinject-microsoft-injector/
- https://twitter.com/Hexacorn/status/776122138063409152
- https://github.com/SigmaHQ/sigma/issues/3742
- https://github.com/keyboardcrunch/SentinelOne-ATTACK-Queries/blob/6a228d23eefe963ca81f2d52f94b815f61ef5ee0/Tactics/DefenseEvasion.md#t1055-process-injection
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains: ' /INJECTRUNNING '
  filter:
    ParentImage: C:\Windows\System32\AppVClient.exe
  condition: selection and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: 4f73421b-5a0b-4bbf-a892-5a7fb99bea66
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_lolbin_mavinject_process_injection.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
