id: sigmahq-sigma-0e6a9e62-627e-496c-aef5-bfa39da29b5e
name: MaxMpxCt Registry Value Changed
description: 'Detects changes to the "MaxMpxCt" registry value.

  MaxMpxCt specifies the maximum outstanding network requests for the server per client,
  which is used when negotiating a Server Message Block (SMB) connection with a client.
  Note if the value is set beyond 125 older Windows 9x clients will fail to negotiate.

  Ransomware threat actors and operators (specifically BlackCat) were seen increasing
  this value in order to handle a higher volume of traffic.'
severity: low
enabled: false
tags:
  mitre:
  - T1070.005
  categories:
  - endpoint
references:
- https://www.huntress.com/blog/blackcat-ransomware-affiliate-ttps
- https://securityscorecard.com/research/deep-dive-into-alphv-blackcat-ransomware
- https://www.intrinsec.com/alphv-ransomware-gang-analysis/?cn-reloaded=1
- https://www.sentinelone.com/labs/blackcat-ransomware-highly-configurable-rust-driven-raas-on-the-prowl-for-victims/
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|endswith: \Services\LanmanServer\Parameters\MaxMpxCt
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 0e6a9e62-627e-496c-aef5-bfa39da29b5e
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_optimize_file_sharing_network.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
