id: sigmahq-sigma-9a0b8719-cd3c-4f0a-90de-765a4cb3f5ed
name: Microsoft VBA For Outlook Addin Loaded Via Outlook
description: Detects outlvba (Microsoft VBA for Outlook Addin) DLL being loaded by
  the outlook process
severity: medium
enabled: false
tags:
  mitre:
  - T1204.002
  categories:
  - endpoint
references:
- https://speakerdeck.com/heirhabarov/hunting-for-persistence-via-microsoft-exchange-server-or-outlook?slide=58
logsource:
  category: image_load
  product: windows
detection:
  selection:
    Image|endswith: \outlook.exe
    ImageLoaded|endswith: \outlvba.dll
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 9a0b8719-cd3c-4f0a-90de-765a4cb3f5ed
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/image_load/image_load_office_outlook_outlvba_load.yml
falsepositives:
- Legitimate macro usage. Add the appropriate filter according to your environment
notes:
  quarantine_reason: 'upstream status: test'
