id: sigmahq-sigma-65744385-8541-44a6-8630-ffc824d7d4cc
name: Microsoft Teams Sensitive File Access By Uncommon Applications
description: Detects file access attempts to sensitive Microsoft teams files (leveldb,
  cookies) by an uncommon process.
severity: medium
enabled: false
tags:
  mitre:
  - T1528
  categories:
  - endpoint
references:
- https://www.bleepingcomputer.com/news/security/microsoft-teams-stores-auth-tokens-as-cleartext-in-windows-linux-macs/
- https://www.vectra.ai/blog/undermining-microsoft-teams-security-by-mining-tokens
logsource:
  product: windows
  category: file_access
  definition: 'Requirements: Microsoft-Windows-Kernel-File ETW provider'
detection:
  selection:
    FileName|contains:
    - \Microsoft\Teams\Cookies
    - \Microsoft\Teams\Local Storage\leveldb
  filter_main_legit_location:
    Image|endswith: \Microsoft\Teams\current\Teams.exe
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 65744385-8541-44a6-8630-ffc824d7d4cc
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_access/file_access_win_teams_sensitive_files.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
