id: sigmahq-sigma-78a34b67-3c39-4886-8fb4-61c46dc18ecd
name: Microsoft 365 - Unusual Volume of File Deletion
description: Detects when a Microsoft Cloud App Security reported a user has deleted
  a unusual a large volume of files.
severity: medium
enabled: false
tags:
  mitre:
  - T1485
  categories:
  - cloud
references:
- https://learn.microsoft.com/en-us/defender-cloud-apps/anomaly-detection-policy
- https://learn.microsoft.com/en-us/defender-cloud-apps/policy-template-reference
logsource:
  service: threat_management
  product: m365
detection:
  selection:
    eventSource: SecurityComplianceCenter
    eventName: Unusual volume of file deletion
    status: success
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 78a34b67-3c39-4886-8fb4-61c46dc18ecd
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/m365/threat_management/microsoft365_unusual_volume_of_file_deletion.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
