id: sigmahq-sigma-a5c7a43f-6009-4a8c-80c5-32abf1c53ecc
name: Microsoft Office Protected View Disabled
description: Detects changes to Microsoft Office protected view registry keys with
  which the attacker disables this feature.
severity: high
enabled: false
tags:
  mitre:
  - T1685
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md
- https://unit42.paloaltonetworks.com/unit42-gorgon-group-slithering-nation-state-cybercrime/
- https://yoroi.company/research/cyber-criminal-espionage-operation-insists-on-italian-manufacturing/
- https://admx.help/HKCU/software/policies/microsoft/office/16.0/excel/security/protectedview
logsource:
  product: windows
  category: registry_set
detection:
  selection_path:
    TargetObject|contains|all:
    - \SOFTWARE\Microsoft\Office\
    - \Security\ProtectedView\
  selection_values_1:
    Details: DWORD (0x00000001)
    TargetObject|endswith:
    - \DisableAttachementsInPV
    - \DisableInternetFilesInPV
    - \DisableIntranetCheck
    - \DisableUnsafeLocationsInPV
  selection_values_0:
    Details: DWORD (0x00000000)
    TargetObject|endswith:
    - \enabledatabasefileprotectedview
    - \enableforeigntextfileprotectedview
  condition: selection_path and 1 of selection_values_*
provenance:
  source: SigmaHQ/sigma
  source_id: a5c7a43f-6009-4a8c-80c5-32abf1c53ecc
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_office_disable_protected_view_features.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
