id: sigmahq-sigma-ff246f56-7f24-402a-baca-b86540e3925c
name: Microsoft 365 - User Restricted from Sending Email
description: Detects when a Security Compliance Center reported a user who exceeded
  sending limits of the service policies and because of this has been restricted from
  sending email.
severity: medium
enabled: false
tags:
  mitre:
  - T1199
  categories:
  - cloud
references:
- https://learn.microsoft.com/en-us/defender-cloud-apps/anomaly-detection-policy
- https://learn.microsoft.com/en-us/defender-cloud-apps/policy-template-reference
logsource:
  service: threat_management
  product: m365
detection:
  selection:
    eventSource: SecurityComplianceCenter
    eventName: User restricted from sending email
    status: success
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: ff246f56-7f24-402a-baca-b86540e3925c
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/m365/threat_management/microsoft365_user_restricted_from_sending_email.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
