id: sigmahq-sigma-611eab06-a145-4dfa-a295-3ccc5c20f59a
name: Mimikatz DC Sync
description: Detects Mimikatz DC sync security events
severity: high
enabled: false
tags:
  mitre:
  - T1003.006
  categories:
  - endpoint
references:
- https://twitter.com/gentilkiwi/status/1003236624925413376
- https://gist.github.com/gentilkiwi/dcc132457408cf11ad2061340dcb53c2
- https://blog.blacklanternsecurity.com/p/detecting-dcsync?s=r
- https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-10/security/threat-protection/auditing/event-4662
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4662
    Properties|contains:
    - Replicating Directory Changes All
    - 1131f6ad-9c07-11d1-f79f-00c04fc2dcd2
    - 1131f6aa-9c07-11d1-f79f-00c04fc2dcd2
    - 9923a32a-3607-11d2-b9be-0000f87a36b2
    - 89e95b76-444d-4c62-991a-0facbeda640c
    AccessMask: '0x100'
  filter1:
    SubjectDomainName: Window Manager
  filter2:
    SubjectUserName|startswith:
    - NT AUT
    - MSOL_
  filter3:
    SubjectUserName|endswith: $
  condition: selection and not 1 of filter*
provenance:
  source: SigmaHQ/sigma
  source_id: 611eab06-a145-4dfa-a295-3ccc5c20f59a
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/security/win_security_dcsync.yml
falsepositives:
- Valid DC Sync that is not covered by the filters; please report
- Local Domain Admin account used for Azure AD Connect
notes:
  quarantine_reason: 'upstream status: test'
