id: sigmahq-sigma-457cc9ac-d8e6-4d1d-8c0e-251d0f11a74c
name: Modification or Deletion of an AWS RDS Cluster
description: Detects modifications to an RDS cluster or its deletion, which may indicate
  potential data exfiltration attempts, unauthorized access, or exposure of sensitive
  information.
severity: high
enabled: false
tags:
  mitre:
  - T1020
  categories:
  - cloud
references:
- https://docs.aws.amazon.com/AmazonRDS/latest/APIReference/API_ModifyDBCluster.html
- https://docs.aws.amazon.com/AmazonRDS/latest/APIReference/API_DeleteDBCluster.html
- https://cloud.hacktricks.xyz/pentesting-cloud/aws-security/aws-privilege-escalation/aws-rds-privesc#rds-modifydbinstance
logsource:
  product: aws
  service: cloudtrail
detection:
  selection:
    eventSource: rds.amazonaws.com
    eventName:
    - ModifyDBCluster
    - DeleteDBCluster
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 457cc9ac-d8e6-4d1d-8c0e-251d0f11a74c
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/aws/cloudtrail/aws_rds_dbcluster_actions.yml
falsepositives:
- Verify if the modification or deletion was performed by an authorized administrator.
- Confirm if the modification or deletion was part of a planned change or maintenance
  activity.
notes:
  quarantine_reason: 'upstream status: experimental'
