id: sigmahq-sigma-b7216a7d-687e-4c8d-82b1-3080b2ad961f
name: Modify Group Policy Settings - ScriptBlockLogging
description: Detect malicious GPO modifications can be used to implement many other
  malicious behaviors.
severity: medium
enabled: false
tags:
  mitre:
  - T1484.001
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1484.001/T1484.001.md
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection_path:
    ScriptBlockText|contains: \SOFTWARE\Policies\Microsoft\Windows\System
  selection_key:
    ScriptBlockText|contains:
    - GroupPolicyRefreshTimeDC
    - GroupPolicyRefreshTimeOffsetDC
    - GroupPolicyRefreshTime
    - GroupPolicyRefreshTimeOffset
    - EnableSmartScreen
    - ShellSmartScreenLevel
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: b7216a7d-687e-4c8d-82b1-3080b2ad961f
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_modify_group_policy_settings.yml
falsepositives:
- Legitimate use
notes:
  quarantine_reason: 'upstream status: test'
