id: sigmahq-sigma-d88d0ab2-e696-4d40-a2ed-9790064e66b3
name: Modification of IE Registry Settings
description: Detects modification of the registry settings used for Internet Explorer
  and other Windows components that use these settings. An attacker can abuse this
  registry key to add a domain to the trusted sites Zone or insert JavaScript for
  persistence
severity: low
enabled: false
tags:
  mitre:
  - T1112
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1112/T1112.md#atomic-test-4---add-domain-to-trusted-sites-zone
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1112/T1112.md#atomic-test-5---javascript-in-registry
logsource:
  category: registry_set
  product: windows
detection:
  selection_domains:
    TargetObject|contains: \Software\Microsoft\Windows\CurrentVersion\Internet Settings
  filter_main_dword:
    Details|startswith: DWORD
  filter_main_null:
    Details: null
  filter_main_office:
    Details:
    - 'Cookie:'
    - 'Visited:'
    - (Empty)
  filter_main_path:
    TargetObject|contains:
    - \Cache
    - \ZoneMap
    - \WpadDecision
  filter_main_binary:
    Details: Binary Data
  filter_optional_accepted_documents:
    TargetObject|contains: \Software\Microsoft\Windows\CurrentVersion\Internet Settings\Accepted
      Documents
  condition: selection_domains and not 1 of filter_main_* and not 1 of filter_optional_*
provenance:
  source: SigmaHQ/sigma
  source_id: d88d0ab2-e696-4d40-a2ed-9790064e66b3
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_persistence_ie.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
