id: sigmahq-sigma-729ce0ea-5d8f-4769-9762-e35de441586d
name: MpiExec Lolbin
description: Detects a certain command line flag combination used by mpiexec.exe LOLBIN
  from HPC pack that can be used to execute any other binary
severity: high
enabled: false
tags:
  mitre:
  - T1218
  categories:
  - endpoint
references:
- https://twitter.com/mrd0x/status/1465058133303246867
- https://learn.microsoft.com/en-us/powershell/high-performance-computing/mpiexec?view=hpc19-ps
logsource:
  category: process_creation
  product: windows
detection:
  selection_binary:
  - Image|endswith: \mpiexec.exe
  - Hashes|contains: IMPHASH=d8b52ef6aaa3a81501bdfff9dbb96217
  selection_flags:
    CommandLine|contains:
    - ' /n 1 '
    - ' -n 1 '
  condition: all of selection*
provenance:
  source: SigmaHQ/sigma
  source_id: 729ce0ea-5d8f-4769-9762-e35de441586d
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_lolbin_mpiexec.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
