id: sigmahq-sigma-4782eb5a-a513-4523-a0ac-f3082b26ac5c
name: Mshtml.DLL RunHTMLApplication Suspicious Usage
description: Detects execution of commands that leverage the "mshtml.dll" RunHTMLApplication
  export to run arbitrary code via different protocol handlers (vbscript, javascript,
  file, http...)
severity: high
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://twitter.com/n1nj4sec/status/1421190238081277959
- https://hyp3rlinx.altervista.org/advisories/MICROSOFT_WINDOWS_DEFENDER_TROJAN.WIN32.POWESSERE.G_MITIGATION_BYPASS_PART2.txt
- http://hyp3rlinx.altervista.org/advisories/MICROSOFT_WINDOWS_DEFENDER_DETECTION_BYPASS.txt
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains|all:
    - \..\
    - mshtml
    CommandLine|contains:
    - '#135'
    - RunHTMLApplication
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 4782eb5a-a513-4523-a0ac-f3082b26ac5c
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_rundll32_mshtml_runhtmlapplication.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
