id: sigmahq-sigma-cc7abbd0-762b-41e3-8a26-57ad50d2eea3
name: MSHTA Execution with Suspicious File Extensions
description: 'Detects execution of mshta.exe with file types that looks like they
  do not typically represent HTA (HTML Application) content,

  such as .png, .jpg, .zip, .pdf, and others, which are often polyglots. MSHTA is
  a legitimate Windows utility for executing HTML Applications

  containing VBScript or JScript. Threat actors often abuse this lolbin utility to
  download and

  execute malicious scripts disguised as benign files or hosted under misleading extensions
  to evade detection.'
severity: high
enabled: false
tags:
  mitre:
  - T1140
  - T1218.005
  - T1059.007
  categories:
  - endpoint
references:
- http://blog.sevagas.com/?Hacking-around-HTA-files
- https://0x00sec.org/t/clientside-exploitation-in-2018-how-pentesting-has-changed/7356
- https://learn.microsoft.com/en-us/previous-versions/dotnet/framework/data/xml/xslt/xslt-stylesheet-scripting-using-msxsl-script
- https://medium.com/tsscyber/pentesting-and-hta-bypassing-powershell-constrained-language-mode-53a42856c997
- https://twitter.com/mattifestation/status/1326228491302563846
- https://www.virustotal.com/gui/file/c1f27d9795a2eba630db8a043580a0761798f06370fb1317067805f8a845b00c
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \mshta.exe
  - OriginalFileName: mshta.exe
  selection_cli:
    CommandLine|contains:
    - .7z
    - .avi
    - .bat
    - .bmp
    - .conf
    - .csv
    - .dll
    - .doc
    - .gif
    - .gz
    - .ini
    - .jpe
    - .jpg
    - .json
    - .lnk
    - .log
    - .mkv
    - .mp3
    - .mp4
    - .pdf
    - .png
    - .ppt
    - .rar
    - .rtf
    - .svg
    - .tar
    - .tmp
    - .txt
    - .xls
    - .xml
    - .yaml
    - .yml
    - .zip
    - vbscript
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: cc7abbd0-762b-41e3-8a26-57ad50d2eea3
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_mshta_susp_execution.yml
falsepositives:
- False positives depend on scripts and administrative tools used in the monitored
  environment
notes:
  quarantine_reason: 'upstream status: test'
