id: sigmahq-sigma-c7c8aa1c-5aff-408e-828b-998e3620b341
name: MSI Installation From Suspicious Locations
description: Detects MSI package installation from suspicious locations
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://www.trendmicro.com/en_us/research/22/h/ransomware-actor-abuses-genshin-impact-anti-cheat-driver-to-kill-antivirus.html
logsource:
  product: windows
  service: application
detection:
  selection:
    Provider_Name: MsiInstaller
    EventID:
    - 1040
    - 1042
    Data|contains:
    - :\Windows\TEMP\
    - \\\\
    - \Desktop\
    - \PerfLogs\
    - \Users\Public\
  filter_winget:
    Data|contains: \AppData\Local\Temp\WinGet\
  filter_updhealthtools:
    Data|contains: C:\Windows\TEMP\UpdHealthTools.msi
  condition: selection and not 1 of filter_*
provenance:
  source: SigmaHQ/sigma
  source_id: c7c8aa1c-5aff-408e-828b-998e3620b341
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/application/msiinstaller/win_msi_install_from_susp_locations.yml
falsepositives:
- False positives may occur if you allow installation from folders such as the desktop,
  the public folder or remote shares. A baseline is required before production use.
notes:
  quarantine_reason: 'upstream status: test'
