id: sigmahq-sigma-79a87aa6-e4bd-42fc-a5bb-5e6fbdcd62f5
name: Msiexec Quiet Installation
description: 'Adversaries may abuse msiexec.exe to proxy execution of malicious payloads.

  Msiexec.exe is the command-line utility for the Windows Installer and is thus commonly
  associated with executing installation packages (.msi)'
severity: medium
enabled: false
tags:
  mitre:
  - T1218.007
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/msiexec
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218.007/T1218.007.md
- https://twitter.com/_st0pp3r_/status/1583914244344799235
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \msiexec.exe
  - OriginalFileName: msiexec.exe
  selection_cli:
    CommandLine|contains|windash:
    - -i
    - -package
    - -a
    - -j
  selection_quiet:
    CommandLine|contains|windash: -q
  filter_user_temp:
    ParentImage|startswith: C:\Users\
    ParentImage|contains: \AppData\Local\Temp\
  filter_system_temp:
    ParentImage|startswith: C:\Windows\Temp\
  filter_ccm:
    ParentImage: C:\Windows\CCM\Ccm32BitLauncher.exe
    IntegrityLevel:
    - System
    - S-1-16-16384
  condition: all of selection_* and not 1 of filter_*
provenance:
  source: SigmaHQ/sigma
  source_id: 79a87aa6-e4bd-42fc-a5bb-5e6fbdcd62f5
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_msiexec_install_quiet.yml
falsepositives:
- WindowsApps installing updates via the quiet flag
notes:
  quarantine_reason: 'upstream status: test'
