id: sigmahq-sigma-08200f85-2678-463e-9c32-88dce2f073d1
name: MSSQL Add Account To Sysadmin Role
description: Detects when an attacker tries to backdoor the MSSQL server by adding
  a backdoor account to the sysadmin fixed server role
severity: high
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://www.netspi.com/blog/technical/network-penetration-testing/sql-server-persistence-part-1-startup-stored-procedures/
logsource:
  product: windows
  service: application
  definition: 'Requirements: MSSQL audit policy must be enabled in order to receive
    this event in the application log'
detection:
  selection:
    Provider_Name|contains: MSSQL
    EventID: 33205
    Data|contains|all:
    - object_name:sysadmin
    - 'statement:alter server role [sysadmin] add member '
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 08200f85-2678-463e-9c32-88dce2f073d1
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/application/mssqlserver/win_mssql_add_sysadmin_account.yml
falsepositives:
- Rare legitimate administrative activity
notes:
  quarantine_reason: 'upstream status: test'
