id: sigmahq-sigma-b3d57a5c-c92e-4b48-9a79-5f124b7cf964
name: MSSQL SPProcoption Set
description: Detects when the a stored procedure is set or cleared for automatic execution
  in MSSQL. A stored procedure that is set to automatic execution runs every time
  an instance of SQL Server is started
severity: high
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://www.netspi.com/blog/technical/network-penetration-testing/sql-server-persistence-part-1-startup-stored-procedures/
- https://learn.microsoft.com/en-us/sql/relational-databases/system-stored-procedures/sp-procoption-transact-sql?view=sql-server-ver16
logsource:
  product: windows
  service: application
  definition: 'Requirements: MSSQL audit policy to monitor for "sp_procoption" must
    be enabled in order to receive this event in the application log'
detection:
  selection:
    Provider_Name|contains: MSSQL
    EventID: 33205
    Data|contains|all:
    - object_name:sp_procoption
    - statement:EXEC
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: b3d57a5c-c92e-4b48-9a79-5f124b7cf964
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/application/mssqlserver/win_mssql_sp_procoption_set.yml
falsepositives:
- Legitimate use of the feature by administrators (rare)
notes:
  quarantine_reason: 'upstream status: test'
