id: sigmahq-sigma-ebfe73c2-5bc9-4ed9-aaa8-8b54b2b4777d
name: MSSQL Server Failed Logon From External Network
description: Detects failed logon attempts from clients with external network IP to
  an MSSQL server. This can be a sign of a bruteforce attack.
severity: medium
enabled: false
tags:
  mitre:
  - T1110
  categories:
  - endpoint
references:
- https://cybersecthreat.com/2020/07/08/enable-mssql-authentication-log-to-eventlog/
- https://www.experts-exchange.com/questions/27800944/EventID-18456-Failed-to-open-the-explicitly-specified-database.html
logsource:
  product: windows
  service: application
  definition: 'Requirements: Must enable MSSQL authentication.'
detection:
  selection:
    Provider_Name|contains: MSSQL
    EventID: 18456
  filter_main_local_ips:
    Data|contains:
    - 'CLIENT: 10.'
    - 'CLIENT: 172.16.'
    - 'CLIENT: 172.17.'
    - 'CLIENT: 172.18.'
    - 'CLIENT: 172.19.'
    - 'CLIENT: 172.20.'
    - 'CLIENT: 172.21.'
    - 'CLIENT: 172.22.'
    - 'CLIENT: 172.23.'
    - 'CLIENT: 172.24.'
    - 'CLIENT: 172.25.'
    - 'CLIENT: 172.26.'
    - 'CLIENT: 172.27.'
    - 'CLIENT: 172.28.'
    - 'CLIENT: 172.29.'
    - 'CLIENT: 172.30.'
    - 'CLIENT: 172.31.'
    - 'CLIENT: 192.168.'
    - 'CLIENT: 127.'
    - 'CLIENT: 169.254.'
    - 'CLIENT: <local machine>'
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: ebfe73c2-5bc9-4ed9-aaa8-8b54b2b4777d
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/application/mssqlserver/win_mssql_failed_logon_from_external_network.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
