id: sigmahq-sigma-7f103213-a04e-4d59-8261-213dddf22314
name: MSSQL XPCmdshell Suspicious Execution
description: Detects when the MSSQL "xp_cmdshell" stored procedure is used to execute
  commands
severity: high
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://www.netspi.com/blog/technical/network-penetration-testing/sql-server-persistence-part-1-startup-stored-procedures/
- https://thedfirreport.com/2022/07/11/select-xmrig-from-sqlserver/
logsource:
  product: windows
  service: application
  definition: 'Requirements: MSSQL audit policy to monitor for "xp_cmdshell" must
    be enabled in order to receive this event in the application log (Follow this
    tutorial https://dba.stackexchange.com/questions/103183/is-there-any-way-to-monitor-execution-of-xp-cmdshell-in-sql-server-2012)'
detection:
  selection:
    Provider_Name|contains: MSSQL
    EventID: 33205
    Data|contains|all:
    - object_name:xp_cmdshell
    - statement:EXEC
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 7f103213-a04e-4d59-8261-213dddf22314
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/application/mssqlserver/win_mssql_xp_cmdshell_audit_log.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
