id: sigmahq-sigma-218d2855-2bba-4f61-9c85-81d0ea63ac71
name: MSSQL Server Failed Logon
description: Detects failed logon attempts from clients to MSSQL server.
severity: low
enabled: false
tags:
  mitre:
  - T1110
  categories:
  - endpoint
references:
- https://cybersecthreat.com/2020/07/08/enable-mssql-authentication-log-to-eventlog/
- https://www.experts-exchange.com/questions/27800944/EventID-18456-Failed-to-open-the-explicitly-specified-database.html
logsource:
  product: windows
  service: application
  definition: 'Requirements: Must enable MSSQL authentication.'
detection:
  selection:
    Provider_Name|contains: MSSQL
    EventID: 18456
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 218d2855-2bba-4f61-9c85-81d0ea63ac71
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/application/mssqlserver/win_mssql_failed_logon.yml
falsepositives:
- This event could stem from users changing an account's password that's used to authenticate
  via a job or an automated process. Investigate the source of such events and mitigate
  them
notes:
  quarantine_reason: 'upstream status: test'
