id: sigmahq-sigma-5fdce3ac-e7f9-4ecd-a3aa-a4d78ebbf0af
name: Mstsc.EXE Execution With Local RDP File
description: Detects potential RDP connection via Mstsc using a local ".rdp" file
severity: low
enabled: false
tags:
  mitre:
  - T1219.002
  categories:
  - endpoint
references:
- https://www.blackhillsinfosec.com/rogue-rdp-revisiting-initial-access-methods/
- https://web.archive.org/web/20230726144748/https://blog.thickmints.dev/mintsights/detecting-rogue-rdp/
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \mstsc.exe
  - OriginalFileName: mstsc.exe
  selection_cli:
    CommandLine|endswith:
    - .rdp
    - .rdp"
  filter_optional_wsl:
    ParentImage: C:\Windows\System32\lxss\wslhost.exe
    CommandLine|contains: C:\ProgramData\Microsoft\WSL\wslg.rdp
  condition: all of selection_* and not 1 of filter_optional_*
provenance:
  source: SigmaHQ/sigma
  source_id: 5fdce3ac-e7f9-4ecd-a3aa-a4d78ebbf0af
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_mstsc_run_local_rdp_file.yml
falsepositives:
- Likely with legitimate usage of ".rdp" files
notes:
  quarantine_reason: 'upstream status: test'
