id: sigmahq-sigma-ff3b6b39-e765-42f9-bb2c-ea6761e0e0f6
name: Mstsc.EXE Execution From Uncommon Parent
description: Detects potential RDP connection via Mstsc using a local ".rdp" file
  located in suspicious locations.
severity: high
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://www.blackhillsinfosec.com/rogue-rdp-revisiting-initial-access-methods/
- https://web.archive.org/web/20230726144748/https://blog.thickmints.dev/mintsights/detecting-rogue-rdp/
logsource:
  category: process_creation
  product: windows
detection:
  selection_parent:
    ParentImage|endswith:
    - \brave.exe
    - \CCleanerBrowser.exe
    - \chrome.exe
    - \chromium.exe
    - \firefox.exe
    - \iexplore.exe
    - \microsoftedge.exe
    - \msedge.exe
    - \opera.exe
    - \vivaldi.exe
    - \whale.exe
    - \outlook.exe
  selection_img:
  - Image|endswith: \mstsc.exe
  - OriginalFileName: mstsc.exe
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: ff3b6b39-e765-42f9-bb2c-ea6761e0e0f6
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_mstsc_run_local_rpd_file_susp_parent.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
