id: sigmahq-sigma-9e50a8b3-dd05-4eb8-9153-bdb6b79d50b0
name: Msxsl.EXE Execution
description: 'Detects the execution of the MSXSL utility. This can be used to execute
  Extensible Stylesheet Language (XSL) files. These files are commonly used to describe
  the processing and rendering of data within XML files.

  Adversaries can abuse this functionality to execute arbitrary files while potentially
  bypassing application whitelisting defenses.'
severity: medium
enabled: false
tags:
  mitre:
  - T1220
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1220/T1220.md
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Msxsl/
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: \msxsl.exe
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 9e50a8b3-dd05-4eb8-9153-bdb6b79d50b0
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_msxsl_execution.yml
falsepositives:
- Msxsl is not installed by default and is deprecated, so unlikely on most systems.
notes:
  quarantine_reason: 'upstream status: test'
