id: sigmahq-sigma-9501f8e6-8e3d-48fc-a8a6-1089dd5d7ef4
name: Network Connection Initiated To DevTunnels Domain
description: Detects network connections to Devtunnels domains initiated by a process
  on a system. Attackers can abuse that feature to establish a reverse shell or persistence
  on a machine.
severity: medium
enabled: false
tags:
  mitre:
  - T1567.001
  - T1572
  categories:
  - endpoint
references:
- https://blueteamops.medium.com/detecting-dev-tunnels-16f0994dc3e2
- https://learn.microsoft.com/en-us/azure/developer/dev-tunnels/security
- https://cydefops.com/devtunnels-unleashed
logsource:
  category: network_connection
  product: windows
detection:
  selection:
    Initiated: 'true'
    DestinationHostname|endswith: .devtunnels.ms
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 9501f8e6-8e3d-48fc-a8a6-1089dd5d7ef4
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/network_connection/net_connection_win_domain_devtunnels.yml
falsepositives:
- Legitimate use of Devtunnels will also trigger this.
notes:
  quarantine_reason: 'upstream status: test'
