id: sigmahq-sigma-c7e91a02-d771-4a6d-a700-42587e0b1095
name: Network Connection Initiated By Regsvr32.EXE
description: Detects a network connection initiated by "Regsvr32.exe"
severity: medium
enabled: false
tags:
  mitre:
  - T1559.001
  - T1218.010
  categories:
  - endpoint
references:
- https://pentestlab.blog/2017/05/11/applocker-bypass-regsvr32/
- https://oddvar.moe/2017/12/13/applocker-case-study-how-insecure-is-it-really-part-1/
logsource:
  category: network_connection
  product: windows
detection:
  selection:
    Initiated: 'true'
    Image|endswith: \regsvr32.exe
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: c7e91a02-d771-4a6d-a700-42587e0b1095
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/network_connection/net_connection_win_regsvr32_network_activity.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
