id: sigmahq-sigma-e0f8ab85-0ac9-423b-a73a-81b3c7b1aa97
name: Network Communication Initiated To File Sharing Domains From Process Located
  In Suspicious Folder
description: Detects executables located in potentially suspicious directories initiating
  network connections towards file sharing domains.
severity: high
enabled: false
tags:
  mitre:
  - T1105
  categories:
  - endpoint
references:
- https://twitter.com/M_haggis/status/900741347035889665
- https://twitter.com/M_haggis/status/1032799638213066752
- https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/ransomware-hive-conti-avoslocker
- https://www.cisa.gov/uscert/ncas/alerts/aa22-321a
- https://github.com/EmpireProject/Empire/blob/e37fb2eef8ff8f5a0a689f1589f424906fe13055/data/module_source/exfil/Invoke-ExfilDataToGitHub.ps1
logsource:
  category: network_connection
  product: windows
detection:
  selection_paths:
    Image|contains:
    - :\$Recycle.bin
    - :\Perflogs\
    - :\Temp\
    - :\Users\Default\
    - :\Users\Public\
    - :\Windows\Fonts\
    - :\Windows\IME\
    - :\Windows\System32\Tasks\
    - :\Windows\Tasks\
    - :\Windows\Temp\
    - \AppData\Temp\
    - \config\systemprofile\
    - \Windows\addins\
  selection_domains:
    Initiated: 'true'
    DestinationHostname|endswith:
    - .githubusercontent.com
    - anonfiles.com
    - cdn.discordapp.com
    - ddns.net
    - dl.dropboxusercontent.com
    - ghostbin.co
    - github.com
    - glitch.me
    - gofile.io
    - hastebin.com
    - mediafire.com
    - mega.co.nz
    - mega.nz
    - onrender.com
    - pages.dev
    - paste.ee
    - pastebin.com
    - pastebin.pl
    - pastetext.net
    - pixeldrain.com
    - privatlab.com
    - privatlab.net
    - send.exploit.in
    - sendspace.com
    - storage.googleapis.com
    - storjshare.io
    - supabase.co
    - temp.sh
    - transfer.sh
    - trycloudflare.com
    - ufile.io
    - w3spaces.com
    - workers.dev
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: e0f8ab85-0ac9-423b-a73a-81b3c7b1aa97
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/network_connection/net_connection_win_susp_file_sharing_domains_susp_folders.yml
falsepositives:
- Some installers located in the temp directory might communicate with the Github
  domains in order to download additional software. Baseline these cases or move the
  github domain to a lower level hunting rule.
notes:
  quarantine_reason: 'upstream status: test'
