id: sigmahq-sigma-f4d3748a-65d1-4806-bd23-e25728081d01
name: Network Sniffing - Linux
description: 'Network sniffing refers to using the network interface on a system to
  monitor or capture information sent over a wired or wireless connection.

  An adversary may place a network interface into promiscuous mode to passively access
  data in transit over the network, or use span ports to capture a larger amount of
  data.'
severity: low
enabled: false
tags:
  mitre:
  - T1040
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1040/T1040.md
logsource:
  product: linux
  service: auditd
detection:
  selection_1:
    type: execve
    a0: tcpdump
    a1: -c
    a3|contains: -i
  selection_2:
    type: execve
    a0: tshark
    a1: -c
    a3: -i
  condition: 1 of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: f4d3748a-65d1-4806-bd23-e25728081d01
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/auditd/execve/lnx_auditd_network_sniffing.yml
falsepositives:
- Legitimate administrator or user uses network sniffing tool for legitimate reasons.
notes:
  quarantine_reason: 'upstream status: test'
