id: sigmahq-sigma-e6313acd-208c-44fc-a0ff-db85d572e90e
name: Network Reconnaissance Activity
description: Detects a set of suspicious network related commands often used in recon
  stages
severity: high
enabled: false
tags:
  mitre:
  - T1087
  - T1082
  categories:
  - endpoint
references:
- https://thedfirreport.com/2022/02/07/qbot-likes-to-move-it-move-it/
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains|all:
    - nslookup
    - _ldap._tcp.dc._msdcs.
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: e6313acd-208c-44fc-a0ff-db85d572e90e
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_nslookup_domain_discovery.yml
falsepositives:
- False positives depend on scripts and administrative tools used in the monitored
  environment
notes:
  quarantine_reason: 'upstream status: test'
