id: sigmahq-sigma-4b657234-038e-4ad5-997c-4be42340bce4
name: Network Connection Initiated To Visual Studio Code Tunnels Domain
description: Detects network connections to Visual Studio Code tunnel domains initiated
  by a process on a system. Attackers can abuse that feature to establish a reverse
  shell or persistence on a machine.
severity: medium
enabled: false
tags:
  mitre:
  - T1567
  - T1572
  categories:
  - endpoint
references:
- https://ipfyx.fr/post/visual-studio-code-tunnel/
- https://badoption.eu/blog/2023/01/31/code_c2.html
- https://cydefops.com/vscode-data-exfiltration
logsource:
  category: network_connection
  product: windows
detection:
  selection:
    Initiated: 'true'
    DestinationHostname|endswith: .tunnels.api.visualstudio.com
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 4b657234-038e-4ad5-997c-4be42340bce4
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/network_connection/net_connection_win_domain_vscode_tunnel_connection.yml
falsepositives:
- Legitimate use of Visual Studio Code tunnel will also trigger this.
notes:
  quarantine_reason: 'upstream status: test'
