id: sigmahq-sigma-fdeebdf0-9f3f-4d08-84a6-4c4d13e39fe4
name: Network Connection Initiated To Mega.nz
description: 'Detects a network connection initiated by a binary to "api.mega.co.nz".

  Attackers were seen abusing file sharing websites similar to "mega.nz" in order
  to upload/download additional payloads.'
severity: low
enabled: false
tags:
  mitre:
  - T1567.002
  categories:
  - endpoint
references:
- https://megatools.megous.com/
- https://www.mandiant.com/resources/russian-targeting-gov-business
logsource:
  category: network_connection
  product: windows
detection:
  selection:
    Initiated: 'true'
    DestinationHostname|endswith:
    - mega.co.nz
    - mega.nz
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: fdeebdf0-9f3f-4d08-84a6-4c4d13e39fe4
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/network_connection/net_connection_win_domain_mega_nz.yml
falsepositives:
- Legitimate MEGA installers and utilities are expected to communicate with this domain.
  Exclude hosts that are known to be allowed to use this tool.
notes:
  quarantine_reason: 'upstream status: test'
