id: sigmahq-sigma-5205613d-2a63-4412-a895-3a2458b587b3
name: Network Connection Initiated By AddinUtil.EXE
description: 'Detects a network connection initiated by the Add-In deployment cache
  updating utility "AddInutil.exe".

  This could indicate a potential command and control communication as this tool doesn''t
  usually initiate network activity.'
severity: high
enabled: false
tags:
  mitre:
  - T1218
  categories:
  - endpoint
references:
- https://www.blue-prints.blog/content/blog/posts/lolbin/addinutil-lolbas.html
logsource:
  category: network_connection
  product: windows
detection:
  selection:
    Initiated: 'true'
    Image|endswith: \addinutil.exe
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 5205613d-2a63-4412-a895-3a2458b587b3
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/network_connection/net_connection_win_addinutil_initiated.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
