id: sigmahq-sigma-7b434893-c57d-4f41-908d-6a17bf1ae98f
name: Network Connection Initiated From Process Located In Potentially Suspicious
  Or Uncommon Location
description: Detects a network connection initiated by programs or processes running
  from suspicious or uncommon files system locations.
severity: high
enabled: false
tags:
  mitre:
  - T1105
  categories:
  - endpoint
references:
- https://docs.google.com/spreadsheets/d/17pSTDNpa0sf6pHeRhusvWG6rThciE8CsXTSlDUAZDyo
logsource:
  category: network_connection
  product: windows
detection:
  selection:
    Initiated: 'true'
    Image|contains:
    - :\$Recycle.bin
    - :\Perflogs\
    - :\Temp\
    - :\Users\Default\
    - :\Users\Public\
    - :\Windows\Fonts\
    - :\Windows\IME\
    - :\Windows\System32\Tasks\
    - :\Windows\Tasks\
    - \config\systemprofile\
    - \Contacts\
    - \Favorites\
    - \Favourites\
    - \Music\
    - \Pictures\
    - \Videos\
    - \Windows\addins\
  filter_main_domains:
    DestinationHostname|endswith:
    - .githubusercontent.com
    - anonfiles.com
    - cdn.discordapp.com
    - ddns.net
    - dl.dropboxusercontent.com
    - ghostbin.co
    - github.com
    - glitch.me
    - gofile.io
    - hastebin.com
    - mediafire.com
    - mega.co.nz
    - mega.nz
    - onrender.com
    - pages.dev
    - paste.ee
    - pastebin.com
    - pastebin.pl
    - pastetext.net
    - portmap.io
    - privatlab.com
    - privatlab.net
    - send.exploit.in
    - sendspace.com
    - storage.googleapis.com
    - storjshare.io
    - supabase.co
    - temp.sh
    - transfer.sh
    - trycloudflare.com
    - ufile.io
    - w3spaces.com
    - workers.dev
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 7b434893-c57d-4f41-908d-6a17bf1ae98f
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/network_connection/net_connection_win_susp_initiated_uncommon_or_suspicious_locations.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
