id: sigmahq-sigma-adc9bcc4-c39c-4f6b-a711-1884017bf043
name: Network Sniffing - MacOs
description: 'Detects the usage of tooling to sniff network traffic.

  An adversary may place a network interface into promiscuous mode to passively access
  data in transit over the network, or use span ports to capture a larger amount of
  data.'
severity: low
enabled: false
tags:
  mitre:
  - T1040
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1040/T1040.md
logsource:
  category: process_creation
  product: macos
detection:
  selection:
    Image|endswith:
    - /tcpdump
    - /tshark
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: adc9bcc4-c39c-4f6b-a711-1884017bf043
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/macos/process_creation/proc_creation_macos_network_sniffing.yml
falsepositives:
- Legitimate administration activities
notes:
  quarantine_reason: 'upstream status: test'
