id: sigmahq-sigma-6aa1d992-5925-4e9f-a49b-845e51d1de01
name: New DLL Added to AppCertDlls Registry Key
description: 'Dynamic-link libraries (DLLs) that are specified in the AppCertDLLs
  value in the Registry key can be abused to obtain persistence and privilege escalation

  by causing a malicious DLL to be loaded and run in the context of separate processes
  on the computer.'
severity: medium
enabled: false
tags:
  mitre:
  - T1546.009
  categories:
  - endpoint
references:
- http://www.hexacorn.com/blog/2013/01/19/beyond-good-ol-run-key-part-3/
- https://eqllib.readthedocs.io/en/latest/analytics/14f90406-10a0-4d36-a672-31cabe149f2f.html
logsource:
  category: registry_event
  product: windows
detection:
  selection:
  - TargetObject: HKLM\SYSTEM\CurrentControlSet\Control\Session Manager\AppCertDlls
  - NewName: HKLM\SYSTEM\CurentControlSet\Control\Session Manager\AppCertDlls
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 6aa1d992-5925-4e9f-a49b-845e51d1de01
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_event/registry_event_new_dll_added_to_appcertdlls_registry_key.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
