id: sigmahq-sigma-58f88172-a73d-442b-94c9-95eaed3cbb36
name: New Federated Domain Added
description: Detects the addition of a new Federated Domain.
severity: medium
enabled: false
tags:
  mitre:
  - T1484.002
  categories:
  - cloud
references:
- https://research.splunk.com/cloud/e155876a-6048-11eb-ae93-0242ac130002/
- https://o365blog.com/post/aadbackdoor/
logsource:
  service: audit
  product: m365
detection:
  selection_domain:
    Operation|contains: domain
  selection_operation:
    Operation|contains:
    - add
    - new
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 58f88172-a73d-442b-94c9-95eaed3cbb36
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/m365/audit/microsoft365_new_federated_domain_added_audit.yml
falsepositives:
- The creation of a new Federated domain is not necessarily malicious, however these
  events need to be followed closely, as it may indicate federated credential abuse
  or backdoor via federated identities at a similar or different cloud provider.
notes:
  quarantine_reason: 'upstream status: test'
