id: sigmahq-sigma-60936b49-fca0-4f32-993d-7415edcf9a5d
name: New Application in AppCompat
description: A General detection for a new application in AppCompat. This indicates
  an application executing for the first time on an endpoint.
severity: low
enabled: false
tags:
  mitre:
  - T1204.002
  categories:
  - endpoint
references:
- https://github.com/OTRF/detection-hackathon-apt29/issues/1
- https://github.com/OTRF/ThreatHunter-Playbook/blob/2d4257f630f4c9770f78d0c1df059f891ffc3fec/docs/evals/apt29/detections/1.A.1_DFD6A782-9BDB-4550-AB6B-525E825B095E.md
logsource:
  product: windows
  category: registry_set
detection:
  selection:
    TargetObject|contains: \AppCompatFlags\Compatibility Assistant\Store\
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 60936b49-fca0-4f32-993d-7415edcf9a5d
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_new_application_appcompat.yml
falsepositives:
- This rule is to explore new applications on an endpoint. False positives depends
  on the organization.
- Newly setup system.
- Legitimate installation of new application.
notes:
  quarantine_reason: 'upstream status: test'
