id: sigmahq-sigma-e1f7febb-7b94-4234-b5c6-00fb8500f5dd
name: New Network ACL Entry Added
description: Detects that network ACL entries have been added to a route table which
  could indicate that new attack vectors have been opened up in the AWS account.
severity: low
enabled: false
tags:
  mitre:
  - T1686.001
  categories:
  - cloud
references:
- https://www.gorillastack.com/blog/real-time-events/important-aws-cloudtrail-security-events-tracking/
logsource:
  product: aws
  service: cloudtrail
detection:
  selection:
    eventSource: ec2.amazonaws.com
    eventName: CreateNetworkAclEntry
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: e1f7febb-7b94-4234-b5c6-00fb8500f5dd
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/aws/cloudtrail/aws_cloudtrail_new_acl_entries.yml
falsepositives:
- Legitimate use of ACLs to enable customer and staff access from the public internet
  into a public VPC
notes:
  quarantine_reason: 'upstream status: test'
