id: sigmahq-sigma-60f16a96-db70-42eb-8f76-16763e333590
name: New Capture Session Launched Via DXCap.EXE
description: Detects the execution of "DXCap.EXE" with the "-c" flag, which allows
  a user to launch any arbitrary binary or windows package through DXCap itself. This
  can be abused to potentially bypass application whitelisting.
severity: medium
enabled: false
tags:
  mitre:
  - T1218
  categories:
  - endpoint
references:
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Dxcap/
- https://twitter.com/harr0ey/status/992008180904419328
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \DXCap.exe
  - OriginalFileName: DXCap.exe
  selection_cli:
    CommandLine|contains: ' -c '
  condition: all of selection*
provenance:
  source: SigmaHQ/sigma
  source_id: 60f16a96-db70-42eb-8f76-16763e333590
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_dxcap_arbitrary_binary_execution.yml
falsepositives:
- Legitimate execution of dxcap.exe by legitimate user
notes:
  quarantine_reason: 'upstream status: test'
