id: sigmahq-sigma-d223b46b-5621-4037-88fe-fda32eead684
name: New Root or CA or AuthRoot Certificate to Store
description: Detects the addition of new root, CA or AuthRoot certificates to the
  Windows registry
severity: medium
enabled: false
tags:
  mitre:
  - T1490
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1553.004/T1553.004.md#atomic-test-6---add-root-certificate-to-currentuser-certificate-store
- https://posts.specterops.io/code-signing-certificate-cloning-attacks-and-defenses-6f98657fc6ec
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains:
    - \SOFTWARE\Microsoft\SystemCertificates\Root\Certificates\
    - \SOFTWARE\Policies\Microsoft\SystemCertificates\Root\Certificates\
    - \SOFTWARE\Microsoft\EnterpriseCertificates\Root\Certificates\
    - \SOFTWARE\Microsoft\SystemCertificates\CA\Certificates\
    - \SOFTWARE\Policies\Microsoft\SystemCertificates\CA\Certificates\
    - \SOFTWARE\Microsoft\EnterpriseCertificates\CA\Certificates\
    - \SOFTWARE\Microsoft\SystemCertificates\AuthRoot\Certificates\
    - \SOFTWARE\Policies\Microsoft\SystemCertificates\AuthRoot\Certificates\
    - \SOFTWARE\Microsoft\EnterpriseCertificates\AuthRoot\Certificates\
    TargetObject|endswith: \Blob
    Details: Binary Data
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: d223b46b-5621-4037-88fe-fda32eead684
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_install_root_or_ca_certificat.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
