id: sigmahq-sigma-322ed9ec-fcab-4f67-9a34-e7c6aef43614
name: New Port Forwarding Rule Added Via Netsh.EXE
description: Detects the execution of netsh commands that configure a new port forwarding
  (PortProxy) rule
severity: medium
enabled: false
tags:
  mitre:
  - T1090
  categories:
  - endpoint
references:
- https://www.fireeye.com/blog/threat-research/2019/01/bypassing-network-restrictions-through-rdp-tunneling.html
- https://adepts.of0x.cc/netsh-portproxy-code/
- https://www.dfirnotes.net/portproxy_detection/
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \netsh.exe
  - OriginalFileName: netsh.exe
  selection_cli_1:
    CommandLine|contains|all:
    - interface
    - portproxy
    - add
    - v4tov4
  selection_cli_2:
    CommandLine|contains|all:
    - 'i '
    - 'p '
    - 'a '
    - 'v '
  selection_cli_3:
    CommandLine|contains|all:
    - connectp
    - listena
    - c=
  condition: selection_img and 1 of selection_cli_*
provenance:
  source: SigmaHQ/sigma
  source_id: 322ed9ec-fcab-4f67-9a34-e7c6aef43614
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_netsh_port_forwarding.yml
falsepositives:
- Legitimate administration activity
- WSL2 network bridge PowerShell script used for WSL/Kubernetes/Docker (e.g. https://github.com/microsoft/WSL/issues/4150#issuecomment-504209723)
notes:
  quarantine_reason: 'upstream status: test'
