id: sigmahq-sigma-ebef4391-1a81-4761-a40a-1db446c0e625
name: New ActiveScriptEventConsumer Created Via Wmic.EXE
description: Detects WMIC executions in which an event consumer gets created. This
  could be used to establish persistence
severity: high
enabled: false
tags:
  mitre:
  - T1546.003
  categories:
  - endpoint
references:
- https://twitter.com/johnlatwc/status/1408062131321270282?s=12
- https://www.fireeye.com/content/dam/fireeye-www/global/en/current-threats/pdfs/wp-windows-management-instrumentation.pdf
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains|all:
    - ActiveScriptEventConsumer
    - ' CREATE '
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: ebef4391-1a81-4761-a40a-1db446c0e625
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_wmic_eventconsumer_creation.yml
falsepositives:
- Legitimate software creating script event consumers
notes:
  quarantine_reason: 'upstream status: test'
