id: sigmahq-sigma-e7b18879-676e-4a0e-ae18-27039185a8e7
name: New Netsh Helper DLL Registered From A Suspicious Location
description: Detects changes to the Netsh registry key to add a new DLL value that
  is located on a suspicious location. This change might be an indication of a potential
  persistence attempt by adding a malicious Netsh helper
severity: high
enabled: false
tags:
  mitre:
  - T1546.007
  categories:
  - endpoint
references:
- https://www.ired.team/offensive-security/persistence/t1128-netsh-helper-dll
- https://pentestlab.blog/2019/10/29/persistence-netsh-helper-dll/
logsource:
  category: registry_set
  product: windows
detection:
  selection_target:
    TargetObject|contains: \SOFTWARE\Microsoft\NetSh
  selection_folders_1:
    Details|contains:
    - :\Perflogs\
    - :\Users\Public\
    - :\Windows\Temp\
    - \AppData\Local\Temp\
    - \Temporary Internet
  selection_folders_2:
  - Details|contains|all:
    - :\Users\
    - \Favorites\
  - Details|contains|all:
    - :\Users\
    - \Favourites\
  - Details|contains|all:
    - :\Users\
    - \Contacts\
  - Details|contains|all:
    - :\Users\
    - \Pictures\
  condition: selection_target and 1 of selection_folders_*
provenance:
  source: SigmaHQ/sigma
  source_id: e7b18879-676e-4a0e-ae18-27039185a8e7
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_netsh_help_dll_persistence_susp_location.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
