id: sigmahq-sigma-3d7679bd-0c00-440c-97b0-3f204273e6c7
name: New Process Created Via Taskmgr.EXE
description: Detects the creation of a process via the Windows task manager. This
  might be an attempt to bypass UAC
severity: low
enabled: false
tags:
  mitre:
  - T1036
  categories:
  - endpoint
references:
- https://twitter.com/ReneFreingruber/status/1172244989335810049
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage|endswith: \taskmgr.exe
  filter_main_generic:
    Image|endswith:
    - :\Windows\System32\mmc.exe
    - :\Windows\System32\resmon.exe
    - :\Windows\System32\Taskmgr.exe
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 3d7679bd-0c00-440c-97b0-3f204273e6c7
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_taskmgr_susp_child_process.yml
falsepositives:
- Administrative activity
notes:
  quarantine_reason: 'upstream status: test'
