id: sigmahq-sigma-b98a10af-1e1e-44a7-bab2-4cc026917648
name: New PDQDeploy Service - Client Side
description: 'Detects PDQDeploy service installation on the target system.

  When a package is deployed via PDQDeploy it installs a remote service on the target
  machine with the name "PDQDeployRunner-X" where "X" is an integer starting from
  1'
severity: medium
enabled: false
tags:
  mitre:
  - T1543.003
  categories:
  - endpoint
references:
- https://documentation.pdq.com/PDQDeploy/13.0.3.0/index.html?windows-services.htm
logsource:
  product: windows
  service: system
detection:
  selection_root:
    Provider_Name: Service Control Manager
    EventID: 7045
  selection_service:
  - ImagePath|contains: PDQDeployRunner-
  - ServiceName|startswith: PDQDeployRunner-
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: b98a10af-1e1e-44a7-bab2-4cc026917648
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/system/service_control_manager/win_system_service_install_pdqdeploy_runner.yml
falsepositives:
- Legitimate use of the tool
notes:
  quarantine_reason: 'upstream status: test'
