id: sigmahq-sigma-cfeed607-6aa4-4bbd-9627-b637deb723c8
name: New or Renamed User Account with '$' Character
description: Detects the creation of a user with the "$" character. This can be used
  by attackers to hide a user or trick detection systems that lack the parsing mechanisms.
severity: medium
enabled: false
tags:
  mitre:
  - T1036
  categories:
  - endpoint
references:
- https://twitter.com/SBousseaden/status/1387743867663958021
logsource:
  product: windows
  service: security
detection:
  selection_create:
    EventID: 4720
    SamAccountName|contains: $
  selection_rename:
    EventID: 4781
    NewTargetUserName|contains: $
  filter_main_homegroup:
    EventID: 4720
    TargetUserName: HomeGroupUser$
  condition: 1 of selection_* and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: cfeed607-6aa4-4bbd-9627-b637deb723c8
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/security/win_security_new_or_renamed_user_account_with_dollar_sign.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
