id: sigmahq-sigma-ee9ca27c-9bd7-4cee-9b01-6e906be7cae3
name: New PDQDeploy Service - Server Side
description: 'Detects a PDQDeploy service installation which indicates that PDQDeploy
  was installed on the machines.

  PDQDeploy can be abused by attackers to remotely install packages or execute commands
  on target machines'
severity: medium
enabled: false
tags:
  mitre:
  - T1543.003
  categories:
  - endpoint
references:
- https://documentation.pdq.com/PDQDeploy/13.0.3.0/index.html?windows-services.htm
logsource:
  product: windows
  service: system
detection:
  selection_root:
    Provider_Name: Service Control Manager
    EventID: 7045
  selection_service:
  - ImagePath|contains: PDQDeployService.exe
  - ServiceName:
    - PDQDeploy
    - PDQ Deploy
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: ee9ca27c-9bd7-4cee-9b01-6e906be7cae3
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/system/service_control_manager/win_system_service_install_pdqdeploy.yml
falsepositives:
- Legitimate use of the tool
notes:
  quarantine_reason: 'upstream status: test'
