id: sigmahq-sigma-a54f842a-3713-4b45-8c84-5f136fdebd3c
name: New PortProxy Registry Entry Added
description: Detects the modification of the PortProxy registry key which is used
  for port forwarding.
severity: medium
enabled: false
tags:
  mitre:
  - T1090
  categories:
  - endpoint
references:
- https://www.fireeye.com/blog/threat-research/2019/01/bypassing-network-restrictions-through-rdp-tunneling.html
- https://adepts.of0x.cc/netsh-portproxy-code/
- https://www.dfirnotes.net/portproxy_detection/
logsource:
  category: registry_event
  product: windows
detection:
  selection:
    TargetObject|contains: \Services\PortProxy\v4tov4\tcp\
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: a54f842a-3713-4b45-8c84-5f136fdebd3c
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_event/registry_event_portproxy_registry_key.yml
falsepositives:
- WSL2 network bridge PowerShell script used for WSL/Kubernetes/Docker (e.g. https://github.com/microsoft/WSL/issues/4150#issuecomment-504209723)
- Synergy Software KVM (https://symless.com/synergy)
notes:
  quarantine_reason: 'upstream status: test'
