id: sigmahq-sigma-3390fbef-c98d-4bdd-a863-d65ed7c610dd
name: New ODBC Driver Registered
description: Detects the registration of a new ODBC driver.
severity: low
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://www.hexacorn.com/blog/2020/08/23/odbcconf-lolbin-trifecta/
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains: \SOFTWARE\ODBC\ODBCINST.INI\
    TargetObject|endswith: \Driver
  filter_main_sqlserver:
    TargetObject|contains: \SQL Server\
    Details: '%WINDIR%\System32\SQLSRV32.dll'
  filter_optional_office_access:
    TargetObject|contains: '\Microsoft Access '
    Details|startswith: C:\Progra
    Details|endswith: \ACEODBC.DLL
  filter_optional_office_excel:
    TargetObject|contains: \Microsoft Excel Driver
    Details|startswith: C:\Progra
    Details|endswith: \ACEODBC.DLL
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
provenance:
  source: SigmaHQ/sigma
  source_id: 3390fbef-c98d-4bdd-a863-d65ed7c610dd
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_odbc_driver_registered.yml
falsepositives:
- Likely
notes:
  quarantine_reason: 'upstream status: test'
