id: sigmahq-sigma-cd277474-5c52-4423-a52b-ac2d7969902f
name: New BgInfo.EXE Custom WMI Query Registry Configuration
description: Detects setting of a new registry value related to BgInfo configuration,
  which can be abused to execute custom WMI query via "BgInfo.exe"
severity: medium
enabled: false
tags:
  mitre:
  - T1112
  categories:
  - endpoint
references:
- Internal Research
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains: \Software\Winternals\BGInfo\UserFields\
    Details|startswith: '6'
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: cd277474-5c52-4423-a52b-ac2d7969902f
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_bginfo_custom_wmi_query.yml
falsepositives:
- Legitimate WMI query
notes:
  quarantine_reason: 'upstream status: test'
