id: sigmahq-sigma-0ea8db81-2ff6-4525-9448-33bbe7effc13
name: New DMSA Service Account Created in Specific OUs
description: 'Detects the creation of a dMSASvc account using the New-ADServiceAccount
  cmdlet in certain OUs.

  The fact that the Cmdlet is used to create a dMSASvc account in a specific OU is
  highly suspicious.

  It is a pattern trying to exploit the BadSuccessor privilege escalation vulnerability
  in Windows Server 2025.

  On top of that, if the user that is creating the dMSASvc account is not a legitimate
  administrator or does not have the necessary permissions,

  it is a strong signal of an attempted or successful abuse of the BaDSuccessor vulnerability
  for privilege escalation within the Windows Server 2025 Active Directory environment.'
severity: medium
enabled: false
tags:
  mitre:
  - T1078.002
  - T1098
  categories:
  - endpoint
references:
- https://www.akamai.com/blog/security-research/abusing-bad-successor-for-privilege-escalation-in-active-directory
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - \powershell.exe
    - \pwsh.exe
    - \powershell_ise.exe
  - OriginalFileName:
    - powershell.exe
    - pwsh.dll
    - powershell_ise.exe
  selection_cli:
    CommandLine|contains|all:
    - New-ADServiceAccount
    - -CreateDelegatedServiceAccount
    - -path
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 0ea8db81-2ff6-4525-9448-33bbe7effc13
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_create_new_dmsasvc_account.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: experimental'
