id: sigmahq-sigma-f63b56ee-3f79-4b8a-97fb-5c48007e8573
name: New DNS ServerLevelPluginDll Installed Via Dnscmd.EXE
description: Detects the installation of a DNS plugin DLL via ServerLevelPluginDll
  parameter in registry, which can be used to execute code in context of the DNS server
  (restart required)
severity: high
enabled: false
tags:
  mitre:
  - T1574.001
  - T1112
  categories:
  - endpoint
references:
- https://medium.com/@esnesenon/feature-not-bug-dnsadmin-to-dc-compromise-in-one-line-a0f779b8dc83
- https://blog.3or.de/hunting-dns-server-level-plugin-dll-injection.html
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: \dnscmd.exe
    CommandLine|contains|all:
    - /config
    - /serverlevelplugindll
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: f63b56ee-3f79-4b8a-97fb-5c48007e8573
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_dnscmd_install_new_server_level_plugin_dll.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
