id: sigmahq-sigma-b1ec66c6-f4d1-4b5c-96dd-af28ccae7727
name: New Generic Credentials Added Via Cmdkey.EXE
description: 'Detects usage of "cmdkey.exe" to add generic credentials.

  As an example, this can be used before connecting to an RDP session via command
  line interface.'
severity: medium
enabled: false
tags:
  mitre:
  - T1003.005
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1021.001/T1021.001.md#t1021001---remote-desktop-protocol
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \cmdkey.exe
  - OriginalFileName: cmdkey.exe
  selection_cli_generic:
    CommandLine|contains|windash: ' -g'
  selection_cli_user:
    CommandLine|contains|windash: ' -u'
  selection_cli_password:
    CommandLine|contains|windash: ' -p'
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: b1ec66c6-f4d1-4b5c-96dd-af28ccae7727
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_cmdkey_adding_generic_creds.yml
falsepositives:
- Legitimate usage for administration purposes
notes:
  quarantine_reason: 'upstream status: test'
