id: sigmahq-sigma-eca81e8d-09e1-4d04-8614-c91f44fd0519
name: New Firewall Rule Added In Windows Firewall Exception List Via WmiPrvSE.EXE
description: 'Detects the addition of a new "Allow" firewall rule by the WMI process
  (WmiPrvSE.EXE).

  This can occur if an attacker leverages PowerShell cmdlets such as "New-NetFirewallRule",
  or directly uses WMI CIM classes such as "MSFT_NetFirewallRule".'
severity: medium
enabled: false
tags:
  mitre:
  - T1686.003
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1562.004/T1562.004.md#atomic-test-24---set-a-firewall-rule-using-new-netfirewallrule
- https://malware.news/t/the-rhysida-ransomware-activity-analysis-and-ties-to-vice-society/72170
- https://cybersecuritynews.com/rhysida-ransomware-attacking-windows/
logsource:
  product: windows
  service: firewall-as
detection:
  selection:
    EventID:
    - 2004
    - 2071
    - 2097
    Action: 3
    ModifyingApplication|endswith: :\Windows\System32\wbem\WmiPrvSE.exe
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: eca81e8d-09e1-4d04-8614-c91f44fd0519
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/firewall_as/win_firewall_as_add_rule_wmiprvse.yml
falsepositives:
- Administrator scripts or activity.
notes:
  quarantine_reason: 'upstream status: test'
