id: sigmahq-sigma-992dd79f-dde8-4bb0-9085-6350ba97cfb3
name: New BgInfo.EXE Custom VBScript Registry Configuration
description: Detects setting of a new registry value related to BgInfo configuration,
  which can be abused to execute custom VBScript via "BgInfo.exe"
severity: medium
enabled: false
tags:
  mitre:
  - T1112
  categories:
  - endpoint
references:
- Internal Research
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains: \Software\Winternals\BGInfo\UserFields\
    Details|startswith: '4'
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 992dd79f-dde8-4bb0-9085-6350ba97cfb3
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_bginfo_custom_vbscript.yml
falsepositives:
- Legitimate VBScript
notes:
  quarantine_reason: 'upstream status: test'
