id: sigmahq-sigma-ac7102b4-9e1e-4802-9b4f-17c5524c015c
name: New PowerShell Instance Created
description: Detects the execution of PowerShell via the creation of a named pipe
  starting with PSHost
severity: low
enabled: false
tags:
  mitre:
  - T1059.001
  categories:
  - endpoint
references:
- https://threathunterplaybook.com/hunts/windows/190610-PwshAlternateHosts/notebook.html
- https://threathunterplaybook.com/hunts/windows/190410-LocalPwshExecution/notebook.html
logsource:
  product: windows
  category: pipe_created
  definition: Note that you have to configure logging for Named Pipe Events in Sysmon
    config (Event ID 17 and Event ID 18). The basic configuration is in popular sysmon
    configuration (https://github.com/SwiftOnSecurity/sysmon-config), but it is worth
    verifying. You can also use other repo, e.g. https://github.com/Neo23x0/sysmon-config,
    https://github.com/olafhartong/sysmon-modular. How to test detection? You can
    check powershell script from this site https://svch0st.medium.com/guide-to-named-pipes-and-hunting-for-cobalt-strike-pipes-dc46b2c5f575
detection:
  selection:
    PipeName|startswith: \PSHost
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: ac7102b4-9e1e-4802-9b4f-17c5524c015c
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/pipe_created/pipe_created_powershell_execution_pipe.yml
falsepositives:
- Likely
notes:
  quarantine_reason: 'upstream status: test'
