id: sigmahq-sigma-e31bae15-83ed-473e-bf31-faf4f8a17d36
name: New Kubernetes Service Account Created
description: Detects creation of new Kubernetes service account, which could indicate
  an attacker's attempt to persist within a cluster.
severity: low
enabled: false
tags:
  mitre:
  - T1136
  categories:
  - endpoint
references:
- https://microsoft.github.io/Threat-Matrix-for-Kubernetes/techniques/container%20service%20account/
logsource:
  category: application
  product: kubernetes
  service: audit
detection:
  selection:
    verb: create
    objectRef.resource: serviceaccounts
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: e31bae15-83ed-473e-bf31-faf4f8a17d36
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/application/kubernetes/audit/kubernetes_audit_serviceaccount_creation.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
