id: sigmahq-sigma-fa7703d6-0ee8-4949-889c-48c84bc15b6f
name: New Kind of Network (NKN) Detection
description: NKN is a networking service using blockchain technology to support a
  decentralized network of peers. While there are legitimate uses for it, it can also
  be used as a C2 channel. This rule looks for a DNS request to the ma>
severity: low
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://github.com/nknorg/nkn-sdk-go
- https://unit42.paloaltonetworks.com/manageengine-godzilla-nglite-kdcsponge/
- https://github.com/Maka8ka/NGLite
logsource:
  product: zeek
  service: dns
detection:
  selection:
    query|contains|all:
    - seed
    - .nkn.org
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: fa7703d6-0ee8-4949-889c-48c84bc15b6f
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/network/zeek/zeek_dns_nkn.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
