id: sigmahq-sigma-64d51a51-32a6-49f0-9f3d-17e34d640272
name: Ngrok Usage with Remote Desktop Service
description: Detects cases in which ngrok, a reverse proxy tool, forwards events to
  the local RDP port, which could be a sign of malicious behaviour
severity: high
enabled: false
tags:
  mitre:
  - T1090
  categories:
  - endpoint
references:
- https://twitter.com/tekdefense/status/1519711183162556416?s=12&t=OTsHCBkQOTNs1k3USz65Zg
- https://ngrok.com/
logsource:
  product: windows
  service: terminalservices-localsessionmanager
detection:
  selection:
    EventID: 21
    Address|contains: '16777216'
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 64d51a51-32a6-49f0-9f3d-17e34d640272
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/terminalservices/win_terminalservices_rdp_ngrok.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
