id: sigmahq-sigma-df1f26d3-bea7-4700-9ea2-ad3e990cf90e
name: Node Process Executions
description: Detects the execution of other scripts using the Node executable packaged
  with Adobe Creative Cloud
severity: medium
enabled: false
tags:
  mitre:
  - T1127
  - T1059.007
  categories:
  - endpoint
references:
- https://twitter.com/mttaggart/status/1511804863293784064
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: \Adobe Creative Cloud Experience\libs\node.exe
  filter:
    CommandLine|contains: Adobe Creative Cloud Experience\js
  condition: selection and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: df1f26d3-bea7-4700-9ea2-ad3e990cf90e
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_node_adobe_creative_cloud_abuse.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
