id: sigmahq-sigma-e4ffe466-6ff8-48d4-94bd-e32d1a6061e2
name: Nohup Execution
description: Detects usage of nohup which could be leveraged by an attacker to keep
  a process running or break out from restricted environments
severity: medium
enabled: false
tags:
  mitre:
  - T1059.004
  categories:
  - endpoint
references:
- https://gtfobins.github.io/gtfobins/nohup/
- https://en.wikipedia.org/wiki/Nohup
- https://www.computerhope.com/unix/unohup.htm
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    Image|endswith: /nohup
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: e4ffe466-6ff8-48d4-94bd-e32d1a6061e2
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/process_creation/proc_creation_lnx_nohup.yml
falsepositives:
- Administrators or installed processes that leverage nohup
notes:
  quarantine_reason: 'upstream status: test'
