id: sigmahq-sigma-8f02c935-effe-45b3-8fc9-ef8696a9e41d
name: Non-privileged Usage of Reg or Powershell
description: Search for usage of reg or Powershell by non-privileged users to modify
  service configuration in registry
severity: high
enabled: false
tags:
  mitre:
  - T1112
  categories:
  - endpoint
references:
- https://image.slidesharecdn.com/kheirkhabarovoffzonefinal-181117201458/95/hunting-for-privilege-escalation-in-windows-environment-20-638.jpg
logsource:
  category: process_creation
  product: windows
detection:
  selection_cli:
  - CommandLine|contains|all:
    - 'reg '
    - add
  - CommandLine|contains:
    - powershell
    - set-itemproperty
    - ' sp '
    - new-itemproperty
  selection_data:
    IntegrityLevel:
    - Medium
    - S-1-16-8192
    CommandLine|contains|all:
    - ControlSet
    - Services
    CommandLine|contains:
    - ImagePath
    - FailureCommand
    - ServiceDLL
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 8f02c935-effe-45b3-8fc9-ef8696a9e41d
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_susp_non_priv_reg_or_ps.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
