id: sigmahq-sigma-3b4e950b-a3ea-44d3-877e-432071990709
name: Notepad Password Files Discovery
description: Detects the execution of Notepad to open a file that has the string "password"
  which may indicate unauthorized access to credentials or suspicious activity.
severity: low
enabled: false
tags:
  mitre:
  - T1083
  categories:
  - endpoint
references:
- https://thedfirreport.com/2025/02/24/confluence-exploit-leads-to-lockbit-ransomware/
- https://intel.thedfirreport.com/eventReports/view/57
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    ParentImage|endswith: \explorer.exe
    Image|endswith: \notepad.exe
    CommandLine|endswith:
    - password*.txt
    - password*.csv
    - password*.doc
    - password*.xls
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 3b4e950b-a3ea-44d3-877e-432071990709
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_notepad_local_passwd_discovery.yml
falsepositives:
- Legitimate use of opening files from remote hosts by administrators or users. However,
  storing passwords in text readable format could potentially be a violation of the
  organization's policy. Any match should be investigated further.
notes:
  quarantine_reason: 'upstream status: experimental'
