id: sigmahq-sigma-1b3b01c7-84e9-4072-86e5-fc285a41ff23
name: Nslookup PowerShell Download Cradle - ProcessCreation
description: Detects suspicious powershell download cradle using nslookup. This cradle
  uses nslookup to extract payloads from DNS records
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://twitter.com/Alh4zr3d/status/1566489367232651264
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|contains: \nslookup.exe
  - OriginalFileName: \nslookup.exe
  selection_cmd:
    ParentImage|endswith:
    - \powershell.exe
    - \pwsh.exe
    CommandLine|contains:
    - ' -q=txt '
    - ' -querytype=txt '
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 1b3b01c7-84e9-4072-86e5-fc285a41ff23
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_nslookup_poweshell_download.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
