id: sigmahq-sigma-3a8da4e0-36c1-40d2-8b29-b3e890d5172a
name: NTDS Exfiltration Filename Patterns
description: Detects creation of files with specific name patterns seen used in various
  tools that export the NTDS.DIT for exfiltration.
severity: high
enabled: false
tags:
  mitre:
  - T1003.003
  categories:
  - endpoint
references:
- https://github.com/rapid7/metasploit-framework/blob/eb6535009f5fdafa954525687f09294918b5398d/modules/post/windows/gather/ntds_grabber.rb
- https://github.com/rapid7/metasploit-framework/blob/eb6535009f5fdafa954525687f09294918b5398d/data/post/powershell/NTDSgrab.ps1
- https://github.com/SecureAuthCorp/impacket/blob/7d2991d78836b376452ca58b3d14daa61b67cb40/impacket/examples/secretsdump.py#L2405
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename|endswith:
    - \All.cab
    - .ntds.cleartext
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 3a8da4e0-36c1-40d2-8b29-b3e890d5172a
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_ntds_exfil_tools.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
