id: sigmahq-sigma-98c3bcf1-56f2-49dc-9d8d-c66cf190238b
name: NTLM Logon
description: Detects logons using NTLM, which could be caused by a legacy source or
  attackers
severity: low
enabled: false
tags:
  mitre:
  - T1550.002
  categories:
  - endpoint
references:
- https://twitter.com/JohnLaTwC/status/1004895028995477505
logsource:
  product: windows
  service: ntlm
  definition: Requires events from Microsoft-Windows-NTLM/Operational
detection:
  selection:
    EventID: 8002
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 98c3bcf1-56f2-49dc-9d8d-c66cf190238b
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/ntlm/win_susp_ntlm_auth.yml
falsepositives:
- Legacy hosts
notes:
  quarantine_reason: 'upstream status: test'
