id: sigmahq-sigma-e9d4ab66-a532-4ef7-a502-66a9e4a34f5d
name: NTLMv1 Logon Between Client and Server
description: Detects the reporting of NTLMv1 being used between a client and server.
  NTLMv1 is insecure as the underlying encryption algorithms can be brute-forced by
  modern hardware.
severity: medium
enabled: false
tags:
  mitre:
  - T1550.002
  categories:
  - endpoint
references:
- https://github.com/nasbench/EVTX-ETW-Resources/blob/f1b010ce0ee1b71e3024180de1a3e67f99701fe4/ETWProvidersManifests/Windows10/22H2/W10_22H2_Pro_20230321_19045.2728/WEPExplorer/LsaSrv.xml
logsource:
  product: windows
  service: system
detection:
  selection:
    Provider_Name: LsaSrv
    EventID:
    - 6038
    - 6039
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: e9d4ab66-a532-4ef7-a502-66a9e4a34f5d
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/system/lsasrv/win_system_lsasrv_ntlmv1.yml
falsepositives:
- Environments that use NTLMv1
notes:
  quarantine_reason: 'upstream status: test'
