id: sigmahq-sigma-44e24481-6202-4c62-9127-5a0ae8e3fe3d
name: Obfuscated PowerShell OneLiner Execution
description: Detects the execution of a specific OneLiner to download and execute
  powershell modules in memory.
severity: high
enabled: false
tags:
  mitre:
  - T1059.001
  - T1685
  categories:
  - endpoint
references:
- https://thedfirreport.com/2022/05/09/seo-poisoning-a-gootloader-story/
- https://gist.github.com/mgeeky/3b11169ab77a7de354f4111aa2f0df38
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image|endswith: \powershell.exe
    CommandLine|contains|all:
    - http://127.0.0.1
    - '%{(IRM $_)}'
    - Invoke
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 44e24481-6202-4c62-9127-5a0ae8e3fe3d
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_powershell_download_cradle_obfuscated.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
