id: sigmahq-sigma-7b6a7418-3afc-11f0-aff4-000d3abf478c
name: Obfuscated PowerShell MSI Install via WindowsInstaller COM
description: 'Detects the execution of obfuscated PowerShell commands that attempt
  to install MSI packages via the Windows Installer COM object (`WindowsInstaller.Installer`).

  The technique involves manipulating strings to hide functionality, such as constructing
  class names using string insertion (e.g., ''indowsInstaller.Installer''.Insert(0,''W''))
  and correcting

  malformed URLs (e.g., converting ''htps://'' to ''https://'') at runtime. This behavior
  is commonly associated with malware loaders or droppers that aim to bypass static
  detection

  by hiding intent in runtime-generated strings and using legitimate tools for code
  execution. The use of `InstallProduct` and COM object creation, particularly combined
  with

  hidden window execution and suppressed UI, indicates an attempt to install software
  (likely malicious) without user interaction.'
severity: high
enabled: false
tags:
  mitre:
  - T1027.010
  - T1218.007
  - T1059.001
  categories:
  - endpoint
references:
- https://informationsecuritybuzz.com/the-real-danger-behind-a-simple-windows-shortcut/
- https://redcanary.com/blog/threat-intelligence/intelligence-insights-may-2025/
- https://www.virustotal.com/gui/file/f9710b0ba4de5fa0e7ec27da462d4d2fc6838eba83a19f23f6617a466bbad457
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - \powershell_ise.exe
    - \powershell.exe
    - \pwsh.exe
  - OriginalFileName:
    - PowerShell_ISE.EXE
    - PowerShell.EXE
    - pwsh.dll
  selection_cli:
    CommandLine|contains|all:
    - -ComObject
    - InstallProduct(
    - .Insert(
    - UILevel
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 7b6a7418-3afc-11f0-aff4-000d3abf478c
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_powershell_comobject_msi.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: experimental'
