id: sigmahq-sigma-91239011-fe3c-4b54-9f24-15c86bb65913
name: Office Macros Warning Disabled
description: Detects registry changes to Microsoft Office "VBAWarning" to a value
  of "1" which enables the execution of all macros, whether signed or unsigned.
severity: high
enabled: false
tags:
  mitre:
  - T1112
  categories:
  - endpoint
references:
- https://twitter.com/inversecos/status/1494174785621819397
- https://www.mcafee.com/blogs/other-blogs/mcafee-labs/zloader-with-a-new-infection-technique/
- https://securelist.com/scarcruft-surveilling-north-korean-defectors-and-human-rights-activists/105074/
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|endswith: \Security\VBAWarnings
    Details: DWORD (0x00000001)
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 91239011-fe3c-4b54-9f24-15c86bb65913
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_office_vba_warnings_tamper.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
