id: sigmahq-sigma-3b5ba899-9842-4bc2-acc2-12308498bf42
name: Office Application Initiated Network Connection Over Uncommon Ports
description: Detects an office suit application (Word, Excel, PowerPoint, Outlook)
  communicating to target systems over uncommon ports.
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://blogs.blackberry.com/en/2023/07/romcom-targets-ukraine-nato-membership-talks-at-nato-summit
logsource:
  category: network_connection
  product: windows
detection:
  selection:
    Initiated: 'true'
    Image|endswith:
    - \excel.exe
    - \outlook.exe
    - \powerpnt.exe
    - \winword.exe
    - \wordview.exe
  filter_main_common_ports:
    DestinationPort:
    - 53
    - 80
    - 139
    - 389
    - 443
    - 445
    - 3268
  filter_main_outlook_ports:
    Image|contains: :\Program Files\Microsoft Office\
    Image|endswith: \OUTLOOK.EXE
    DestinationPort:
    - 143
    - 465
    - 587
    - 993
    - 995
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 3b5ba899-9842-4bc2-acc2-12308498bf42
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/network_connection/net_connection_win_office_uncommon_ports.yml
falsepositives:
- Other ports can be used, apply additional filters accordingly
notes:
  quarantine_reason: 'upstream status: test'
