id: sigmahq-sigma-0c97c1d3-4057-45c9-b148-1de94b631931
name: Okta Policy Rule Modified or Deleted
description: Detects when an Policy Rule is Modified or Deleted.
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - identity
references:
- https://developer.okta.com/docs/reference/api/system-log/
- https://developer.okta.com/docs/reference/api/event-types/
logsource:
  product: okta
  service: okta
detection:
  selection:
    eventType:
    - policy.rule.update
    - policy.rule.delete
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 0c97c1d3-4057-45c9-b148-1de94b631931
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/identity/okta/okta_policy_rule_modified_or_deleted.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
