id: sigmahq-sigma-a0b38b70-3cb5-484b-a4eb-c4d8e7bcc0a9
name: Okta New Admin Console Behaviours
description: Detects when Okta identifies new activity in the Admin Console.
severity: high
enabled: false
tags:
  mitre:
  - T1078.004
  categories:
  - identity
references:
- https://developer.okta.com/docs/reference/api/system-log/
- https://sec.okta.com/articles/2023/08/cross-tenant-impersonation-prevention-and-detection
logsource:
  product: okta
  service: okta
detection:
  selection_event:
    eventType: policy.evaluate_sign_on
    target.displayName: Okta Admin Console
  selection_positive:
  - debugContext.debugData.behaviors|contains: POSITIVE
  - debugContext.debugData.logOnlySecurityData|contains: POSITIVE
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: a0b38b70-3cb5-484b-a4eb-c4d8e7bcc0a9
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/identity/okta/okta_new_behaviours_admin_console.yml
falsepositives:
- When an admin begins using the Admin Console and one of Okta's heuristics incorrectly
  identifies the behavior as being unusual.
notes:
  quarantine_reason: 'upstream status: test'
