id: sigmahq-sigma-ee39a9f7-5a79-4b0a-9815-d36b3cf28d3e
name: Okta FastPass Phishing Detection
description: Detects when Okta FastPass prevents a known phishing site.
severity: high
enabled: false
tags:
  mitre:
  - T1566
  categories:
  - identity
references:
- https://sec.okta.com/fastpassphishingdetection
- https://developer.okta.com/docs/reference/api/system-log/
- https://developer.okta.com/docs/reference/api/event-types/
logsource:
  product: okta
  service: okta
detection:
  selection:
    outcome.reason: FastPass declined phishing attempt
    outcome.result: FAILURE
    eventType: user.authentication.auth_via_mfa
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: ee39a9f7-5a79-4b0a-9815-d36b3cf28d3e
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/identity/okta/okta_fastpass_phishing_detection.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
