id: sigmahq-sigma-7899144b-e416-4c28-b0b5-ab8f9e0a541d
name: Okta Application Modified or Deleted
description: Detects when an application is modified or deleted.
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - identity
references:
- https://developer.okta.com/docs/reference/api/system-log/
- https://developer.okta.com/docs/reference/api/event-types/
logsource:
  product: okta
  service: okta
detection:
  selection:
    eventType:
    - application.lifecycle.update
    - application.lifecycle.delete
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 7899144b-e416-4c28-b0b5-ab8f9e0a541d
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/identity/okta/okta_application_modified_or_deleted.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
