id: sigmahq-sigma-969c7590-8c19-4797-8c1b-23155de6e7ac
name: Okta Identity Provider Created
description: Detects when a new identity provider is created for Okta.
severity: medium
enabled: false
tags:
  mitre:
  - T1098.001
  categories:
  - identity
references:
- https://developer.okta.com/docs/reference/api/system-log/
- https://sec.okta.com/articles/2023/08/cross-tenant-impersonation-prevention-and-detection
logsource:
  product: okta
  service: okta
detection:
  selection:
    eventType: system.idp.lifecycle.create
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 969c7590-8c19-4797-8c1b-23155de6e7ac
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/identity/okta/okta_identity_provider_created.yml
falsepositives:
- When an admin creates a new, authorised identity provider.
notes:
  quarantine_reason: 'upstream status: test'
