id: sigmahq-sigma-439957a7-ad86-4a8f-9705-a28131c6821b
name: Old TLS1.0/TLS1.1 Protocol Version Enabled
description: Detects applications or users re-enabling old TLS versions by setting
  the "Enabled" value to "1" for the "Protocols" registry key.
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://techcommunity.microsoft.com/t5/windows-it-pro-blog/tls-1-0-and-tls-1-1-soon-to-be-disabled-in-windows/ba-p/3887947
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains:
    - \Control\SecurityProviders\SCHANNEL\Protocols\TLS 1.0\
    - \Control\SecurityProviders\SCHANNEL\Protocols\TLS 1.1\
    TargetObject|endswith: \Enabled
    Details: DWORD (0x00000001)
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 439957a7-ad86-4a8f-9705-a28131c6821b
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_tls_protocol_old_version_enabled.yml
falsepositives:
- Legitimate enabling of the old tls versions due to incompatibility
notes:
  quarantine_reason: 'upstream status: test'
