id: sigmahq-sigma-21541900-27a9-4454-9c4c-3f0a4240344a
name: OMIGOD SCX RunAsProvider ExecuteShellCommand
description: 'Rule to detect the use of the SCX RunAsProvider Invoke_ExecuteShellCommand
  to execute any UNIX/Linux command using the /bin/sh shell.

  SCXcore, started as the Microsoft Operations Manager UNIX/Linux Agent, is now used
  in a host of products including

  Microsoft Operations Manager, Microsoft Azure, and Microsoft Operations Management
  Suite.'
severity: high
enabled: false
tags:
  mitre:
  - T1068
  - T1190
  - T1203
  categories:
  - endpoint
references:
- https://www.wiz.io/blog/omigod-critical-vulnerabilities-in-omi-azure
- https://github.com/Azure/Azure-Sentinel/pull/3059
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    User: root
    LogonId: 0
    CurrentDirectory: /var/opt/microsoft/scx/tmp
    CommandLine|contains: /bin/sh
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 21541900-27a9-4454-9c4c-3f0a4240344a
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/process_creation/proc_creation_lnx_omigod_scx_runasprovider_executeshellcommand.yml
falsepositives:
- Legitimate use of SCX RunAsProvider Invoke_ExecuteShellCommand.
notes:
  quarantine_reason: 'upstream status: test'
