id: sigmahq-sigma-6eea1bf6-f8d2-488a-a742-e6ef6c1b67db
name: OMIGOD SCX RunAsProvider ExecuteScript
description: 'Rule to detect the use of the SCX RunAsProvider ExecuteScript to execute
  any UNIX/Linux script using the /bin/sh shell.

  Script being executed gets created as a temp file in /tmp folder with a scx* prefix.

  Then it is invoked from the following directory /etc/opt/microsoft/scx/conf/tmpdir/.

  The file in that directory has the same prefix scx*. SCXcore, started as the Microsoft
  Operations Manager UNIX/Linux Agent, is now used in a host of products including

  Microsoft Operations Manager, Microsoft Azure, and Microsoft Operations Management
  Suite.'
severity: high
enabled: false
tags:
  mitre:
  - T1068
  - T1190
  - T1203
  categories:
  - endpoint
references:
- https://www.wiz.io/blog/omigod-critical-vulnerabilities-in-omi-azure
- https://github.com/Azure/Azure-Sentinel/pull/3059
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    User: root
    LogonId: 0
    CurrentDirectory: /var/opt/microsoft/scx/tmp
    CommandLine|contains: /etc/opt/microsoft/scx/conf/tmpdir/scx
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 6eea1bf6-f8d2-488a-a742-e6ef6c1b67db
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/process_creation/proc_creation_lnx_omigod_scx_runasprovider_executescript.yml
falsepositives:
- Legitimate use of SCX RunAsProvider ExecuteScript.
notes:
  quarantine_reason: 'upstream status: test'
