id: sigmahq-sigma-7cded4b3-f09e-405a-b96f-24248433ba44
name: OpenCanary - NTP Monlist Request
description: Detects instances where an NTP service on an OpenCanary node has had
  a NTP monlist request.
severity: high
enabled: false
tags:
  mitre:
  - T1498
  categories:
  - endpoint
references:
- https://opencanary.readthedocs.io/en/latest/starting/configuration.html#services-configuration
- https://github.com/thinkst/opencanary/blob/a0896adfcaf0328cfd5829fe10d2878c7445138e/opencanary/logger.py#L52
logsource:
  category: application
  product: opencanary
detection:
  selection:
    logtype: 11001
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 7cded4b3-f09e-405a-b96f-24248433ba44
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/application/opencanary/opencanary_ntp_monlist.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
