id: sigmahq-sigma-e30de276-68ec-435c-ab99-ef3befec6c61
name: OpenCanary - SIP Request
description: Detects instances where an SIP service on an OpenCanary node has had
  a SIP request.
severity: high
enabled: false
tags:
  mitre:
  - T1123
  categories:
  - endpoint
references:
- https://opencanary.readthedocs.io/en/latest/starting/configuration.html#services-configuration
- https://github.com/thinkst/opencanary/blob/a0896adfcaf0328cfd5829fe10d2878c7445138e/opencanary/logger.py#L52
logsource:
  category: application
  product: opencanary
detection:
  selection:
    logtype: 15001
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: e30de276-68ec-435c-ab99-ef3befec6c61
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/application/opencanary/opencanary_sip_request.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
