id: sigmahq-sigma-22777c9e-873a-4b49-855f-6072ab861a52
name: OpenCanary - SMB File Open Request
description: Detects instances where an SMB service on an OpenCanary node has had
  a file open request.
severity: high
enabled: false
tags:
  mitre:
  - T1021
  - T1005
  categories:
  - endpoint
references:
- https://opencanary.readthedocs.io/en/latest/starting/configuration.html#services-configuration
- https://github.com/thinkst/opencanary/blob/a0896adfcaf0328cfd5829fe10d2878c7445138e/opencanary/logger.py#L52
logsource:
  category: application
  product: opencanary
detection:
  selection:
    logtype: 5000
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 22777c9e-873a-4b49-855f-6072ab861a52
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/application/opencanary/opencanary_smb_file_open.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
