id: sigmahq-sigma-af1ac430-df6b-4b38-b976-0b52f07a0252
name: OpenCanary - HTTP POST Login Attempt
description: Detects instances where an HTTP service on an OpenCanary node has had
  login attempt via Form POST.
severity: high
enabled: false
tags:
  mitre:
  - T1190
  categories:
  - endpoint
references:
- https://opencanary.readthedocs.io/en/latest/starting/configuration.html#services-configuration
- https://github.com/thinkst/opencanary/blob/a0896adfcaf0328cfd5829fe10d2878c7445138e/opencanary/logger.py#L52
logsource:
  category: application
  product: opencanary
detection:
  selection:
    logtype: 3001
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: af1ac430-df6b-4b38-b976-0b52f07a0252
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/application/opencanary/opencanary_http_post_login_attempt.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
