id: sigmahq-sigma-5498fc09-adc6-4804-b9d9-5cca1f0b8760
name: OpenCanary - HTTPPROXY Login Attempt
description: Detects instances where an HTTPPROXY service on an OpenCanary node has
  had an attempt to proxy another page.
severity: high
enabled: false
tags:
  mitre:
  - T1090
  categories:
  - endpoint
references:
- https://opencanary.readthedocs.io/en/latest/starting/configuration.html#services-configuration
- https://github.com/thinkst/opencanary/blob/a0896adfcaf0328cfd5829fe10d2878c7445138e/opencanary/logger.py#L52
logsource:
  category: application
  product: opencanary
detection:
  selection:
    logtype: 7001
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 5498fc09-adc6-4804-b9d9-5cca1f0b8760
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/application/opencanary/opencanary_httpproxy_login_attempt.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
