id: sigmahq-sigma-4fe17521-aef3-4e6a-9d6b-4a7c8de155a8
name: OpenCanary - GIT Clone Request
description: Detects instances where a GIT service on an OpenCanary node has had Git
  Clone request.
severity: high
enabled: false
tags:
  mitre:
  - T1213
  categories:
  - endpoint
references:
- https://opencanary.readthedocs.io/en/latest/starting/configuration.html#services-configuration
- https://github.com/thinkst/opencanary/blob/a0896adfcaf0328cfd5829fe10d2878c7445138e/opencanary/logger.py#L52
logsource:
  category: application
  product: opencanary
detection:
  selection:
    logtype: 16001
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 4fe17521-aef3-4e6a-9d6b-4a7c8de155a8
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/application/opencanary/opencanary_git_clone_request.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
