id: sigmahq-sigma-d7553d7b-f485-479c-b192-cdac6edd83a4
name: OpenCanary - NMAP XMAS Scan
description: Detects instances where an OpenCanary node has been targeted by a NMAP
  XMAS Scan
severity: high
enabled: false
tags:
  mitre:
  - T1046
  categories:
  - endpoint
references:
- https://opencanary.readthedocs.io/en/latest/starting/configuration.html#services-configuration
- https://github.com/thinkst/opencanary/blob/a0896adfcaf0328cfd5829fe10d2878c7445138e/opencanary/logger.py#L52
logsource:
  category: application
  product: opencanary
detection:
  selection:
    logtype: 5004
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: d7553d7b-f485-479c-b192-cdac6edd83a4
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/application/opencanary/opencanary_portscan_nmap_xmas_scan.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: experimental'
