id: sigmahq-sigma-6e78f90f-0043-4a01-ac41-f97681613a66
name: OpenCanary - MSSQL Login Attempt Via Windows Authentication
description: Detects instances where an MSSQL service on an OpenCanary node has had
  a login attempt using Windows Authentication.
severity: high
enabled: false
tags:
  mitre:
  - T1003
  - T1213
  categories:
  - endpoint
references:
- https://opencanary.readthedocs.io/en/latest/starting/configuration.html#services-configuration
- https://github.com/thinkst/opencanary/blob/a0896adfcaf0328cfd5829fe10d2878c7445138e/opencanary/logger.py#L52
logsource:
  category: application
  product: opencanary
detection:
  selection:
    logtype: 9002
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 6e78f90f-0043-4a01-ac41-f97681613a66
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/application/opencanary/opencanary_mssql_login_winauth.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
