id: sigmahq-sigma-598290cf-5932-45cd-9123-be1e05ab4f2e
name: OpenCanary - RDP New Connection Attempt
description: Detects instances where an RDP service on an OpenCanary node has had
  a connection attempt.
severity: high
enabled: false
tags:
  mitre:
  - T1133
  - T1021.001
  categories:
  - endpoint
references:
- https://opencanary.readthedocs.io/en/latest/starting/configuration.html#services-configuration
- https://github.com/thinkst/opencanary/blob/a0896adfcaf0328cfd5829fe10d2878c7445138e/opencanary/logger.py#L52
logsource:
  category: application
  product: opencanary
detection:
  selection:
    logtype: 14001
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 598290cf-5932-45cd-9123-be1e05ab4f2e
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/application/opencanary/opencanary_rdp_connection_attempt.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: experimental'
