id: sigmahq-sigma-974be8d2-283e-4033-ab08-7505b84204d0
name: OpenCanary - Host Port Scan (SYN Scan)
description: Detects instances where an OpenCanary node has been targeted by a SYN
  port scan.
severity: high
enabled: false
tags:
  mitre:
  - T1046
  categories:
  - endpoint
references:
- https://opencanary.readthedocs.io/en/latest/starting/configuration.html#services-configuration
- https://github.com/thinkst/opencanary/blob/a0896adfcaf0328cfd5829fe10d2878c7445138e/opencanary/logger.py#L52
logsource:
  category: application
  product: opencanary
detection:
  selection:
    logtype: 5001
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 974be8d2-283e-4033-ab08-7505b84204d0
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/application/opencanary/opencanary_portscan_syn_scan.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: experimental'
