id: sigmahq-sigma-b9d9b652-d8ed-4697-89a2-a1186ee680ac
name: OSACompile Run-Only Execution
description: Detects potential suspicious run-only executions compiled using OSACompile
severity: high
enabled: false
tags:
  mitre:
  - T1059.002
  categories:
  - endpoint
references:
- https://redcanary.com/blog/applescript/
- https://ss64.com/osx/osacompile.html
logsource:
  product: macos
  category: process_creation
detection:
  selection:
    CommandLine|contains|all:
    - osacompile
    - ' -x '
    - ' -e '
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: b9d9b652-d8ed-4697-89a2-a1186ee680ac
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/macos/process_creation/proc_creation_macos_osacompile_runonly_execution.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
