id: sigmahq-sigma-7610a4ea-c06d-495f-a2ac-0a696abcfd3b
name: Outbound Network Connection To Public IP Via Winlogon
description: Detects a "winlogon.exe" process that initiate network communications
  with public IP addresses
severity: medium
enabled: false
tags:
  mitre:
  - T1218.011
  categories:
  - endpoint
references:
- https://www.microsoft.com/en-us/security/blog/2023/04/11/guidance-for-investigating-attacks-using-cve-2022-21894-the-blacklotus-campaign/
logsource:
  category: network_connection
  product: windows
detection:
  selection:
    Image|endswith: \winlogon.exe
    Initiated: 'true'
  filter_main_local_ranges:
    DestinationIp|cidr:
    - 127.0.0.0/8
    - 10.0.0.0/8
    - 172.16.0.0/12
    - 192.168.0.0/16
    - 169.254.0.0/16
    - ::1/128
    - fe80::/10
    - fc00::/7
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 7610a4ea-c06d-495f-a2ac-0a696abcfd3b
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/network_connection/net_connection_win_winlogon_net_connections.yml
falsepositives:
- Communication to other corporate systems that use IP addresses from public address
  spaces
notes:
  quarantine_reason: 'upstream status: test'
