id: sigmahq-sigma-ed74fe75-7594-4b4b-ae38-e38e3fd2eb23
name: Outbound RDP Connections Over Non-Standard Tools
description: 'Detects Non-Standard tools initiating a connection over port 3389 indicating
  possible lateral movement.

  An initial baseline is required before using this utility to exclude third party
  RDP tooling that you might use.'
severity: high
enabled: false
tags:
  mitre:
  - T1021.001
  categories:
  - endpoint
references:
- https://portal.msrc.microsoft.com/en-US/security-guidance/advisory/CVE-2019-0708
logsource:
  category: network_connection
  product: windows
detection:
  selection:
    DestinationPort: 3389
    Initiated: 'true'
  filter_main_mstsc:
    Image:
    - C:\Windows\System32\mstsc.exe
    - C:\Windows\SysWOW64\mstsc.exe
  filter_optional_dns:
    Image: C:\Windows\System32\dns.exe
    SourcePort: 53
    Protocol: udp
  filter_optional_avast:
    Image|endswith:
    - \Avast Software\Avast\AvastSvc.exe
    - \Avast\AvastSvc.exe
  filter_optional_sysinternals_rdcman:
    Image|endswith: \RDCMan.exe
  filter_optional_chrome:
    Image: C:\Program Files\Google\Chrome\Application\chrome.exe
  filter_optional_third_party:
    Image|endswith:
    - \FSAssessment.exe
    - \FSDiscovery.exe
    - \MobaRTE.exe
    - \mRemote.exe
    - \mRemoteNG.exe
    - \Passwordstate.exe
    - \RemoteDesktopManager.exe
    - \RemoteDesktopManager64.exe
    - \RemoteDesktopManagerFree.exe
    - \RSSensor.exe
    - \RTS2App.exe
    - \RTSApp.exe
    - \spiceworks-finder.exe
    - \Terminals.exe
    - \ws_TunnelService.exe
  filter_optional_thor:
    Image|endswith:
    - \thor.exe
    - \thor64.exe
  filter_optional_splunk:
    Image|startswith: C:\Program Files\SplunkUniversalForwarder\bin\
  filter_optional_sentinel_one:
    Image|endswith: \Ranger\SentinelRanger.exe
  filter_optional_firefox:
    Image: C:\Program Files\Mozilla Firefox\firefox.exe
  filter_optional_tsplus:
    Image:
    - C:\Program Files\TSplus\Java\bin\HTML5service.exe
    - C:\Program Files (x86)\TSplus\Java\bin\HTML5service.exe
  filter_optional_null:
    Image: null
  filter_optional_empty:
    Image: ''
  filter_optional_unknown:
    Image: <unknown process>
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
provenance:
  source: SigmaHQ/sigma
  source_id: ed74fe75-7594-4b4b-ae38-e38e3fd2eb23
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/network_connection/net_connection_win_rdp_outbound_over_non_standard_tools.yml
falsepositives:
- Third party RDP tools
notes:
  quarantine_reason: 'upstream status: test'
