id: sigmahq-sigma-def8b624-e08f-4ae1-8612-1ba21190da6b
name: Outgoing Logon with New Credentials
description: Detects logon events that specify new credentials
severity: low
enabled: false
tags:
  mitre:
  - T1550
  categories:
  - endpoint
references:
- https://go.recordedfuture.com/hubfs/reports/mtp-2021-0914.pdf
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4624
    LogonType: 9
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: def8b624-e08f-4ae1-8612-1ba21190da6b
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/security/account_management/win_security_susp_logon_newcredentials.yml
falsepositives:
- Legitimate remote administration activity
notes:
  quarantine_reason: 'upstream status: test'
