id: sigmahq-sigma-55f0a3a1-846e-40eb-8273-677371b8d912
name: Outlook EnableUnsafeClientMailRules Setting Enabled
description: Detects an attacker trying to enable the outlook security setting "EnableUnsafeClientMailRules"
  which allows outlook to run applications or execute macros
severity: high
enabled: false
tags:
  mitre:
  - T1059
  - T1202
  categories:
  - endpoint
references:
- https://www.fireeye.com/blog/threat-research/2018/12/overruled-containing-a-potentially-destructive-adversary.html
- https://speakerdeck.com/heirhabarov/hunting-for-persistence-via-microsoft-exchange-server-or-outlook?slide=44
- https://support.microsoft.com/en-us/topic/how-to-control-the-rule-actions-to-start-an-application-or-run-a-macro-in-outlook-2016-and-outlook-2013-e4964b72-173c-959d-5d7b-ead562979048
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains: \Outlook\Security\EnableUnsafeClientMailRules
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 55f0a3a1-846e-40eb-8273-677371b8d912
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_office_outlook_enable_unsafe_client_mail_rules.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
