id: sigmahq-sigma-de7ce410-b3fb-4e8a-b38c-3b999e2c3420
name: PAExec Service Installation
description: Detects PAExec service installation
severity: medium
enabled: false
tags:
  mitre:
  - T1569.002
  categories:
  - endpoint
references:
- https://www.poweradmin.com/paexec/
logsource:
  product: windows
  service: system
detection:
  selection_eid:
    Provider_Name: Service Control Manager
    EventID: 7045
  selection_image:
  - ServiceName|startswith: PAExec-
  - ImagePath|startswith: C:\WINDOWS\PAExec-
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: de7ce410-b3fb-4e8a-b38c-3b999e2c3420
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/system/service_control_manager/win_system_service_install_paexec.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
