id: sigmahq-sigma-aa1697b7-d611-4f9a-9cb2-5125b4ccfd5c
name: Password Dumper Activity on LSASS
description: Detects process handle on LSASS process with certain access mask and
  object type SAM_DOMAIN
severity: high
enabled: false
tags:
  mitre:
  - T1003.001
  categories:
  - endpoint
references:
- https://twitter.com/jackcr/status/807385668833968128
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4656
    ProcessName|endswith: \lsass.exe
    AccessMask: '0x705'
    ObjectType: SAM_DOMAIN
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: aa1697b7-d611-4f9a-9cb2-5125b4ccfd5c
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/security/win_security_susp_lsass_dump.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
