id: sigmahq-sigma-340ee172-4b67-4fb4-832f-f961bdc1f3aa
name: Password Reset By User Account
description: Detect when a user has reset their password in Azure AD
severity: medium
enabled: false
tags:
  mitre:
  - T1078.004
  categories:
  - cloud
references:
- https://learn.microsoft.com/en-us/entra/architecture/security-operations-privileged-accounts
logsource:
  product: azure
  service: auditlogs
detection:
  selection:
    Category: UserManagement
    Status: Success
    Initiatedby: UPN
  filter:
    Target|contains: UPN
    ActivityType|contains: Password reset
  condition: selection and filter
provenance:
  source: SigmaHQ/sigma
  source_id: 340ee172-4b67-4fb4-832f-f961bdc1f3aa
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/azure/audit_logs/azure_user_password_change.yml
falsepositives:
- If this was approved by System Administrator or confirmed user action.
notes:
  quarantine_reason: 'upstream status: test'
