id: sigmahq-sigma-54f0434b-726f-48a1-b2aa-067df14516e4
name: Password Protected ZIP File Opened (Suspicious Filenames)
description: Detects the extraction of password protected ZIP archives with suspicious
  file names. See the filename variable for more details on which file has been opened.
severity: high
enabled: false
tags:
  mitre:
  - T1027
  - T1105
  - T1036
  categories:
  - endpoint
references:
- https://twitter.com/sbousseaden/status/1523383197513379841
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 5379
    TargetName|contains: Microsoft_Windows_Shell_ZipFolder:filename
  selection_filename:
    TargetName|contains:
    - invoice
    - new order
    - rechnung
    - factura
    - delivery
    - purchase
    - order
    - payment
  condition: selection and selection_filename
provenance:
  source: SigmaHQ/sigma
  source_id: 54f0434b-726f-48a1-b2aa-067df14516e4
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/security/win_security_susp_opened_encrypted_zip_filename.yml
falsepositives:
- Legitimate used of encrypted ZIP files
notes:
  quarantine_reason: 'upstream status: test'
