id: sigmahq-sigma-571498c8-908e-40b4-910b-d2369159a3da
name: Password Protected ZIP File Opened (Email Attachment)
description: Detects the extraction of password protected ZIP archives. See the filename
  variable for more details on which file has been opened.
severity: high
enabled: false
tags:
  mitre:
  - T1027
  - T1566.001
  categories:
  - endpoint
references:
- https://twitter.com/sbousseaden/status/1523383197513379841
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 5379
    TargetName|contains|all:
    - Microsoft_Windows_Shell_ZipFolder:filename
    - \Temporary Internet Files\Content.Outlook
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 571498c8-908e-40b4-910b-d2369159a3da
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/security/win_security_susp_opened_encrypted_zip_outlook.yml
falsepositives:
- Legitimate used of encrypted ZIP files
notes:
  quarantine_reason: 'upstream status: test'
