id: sigmahq-sigma-00ba9da1-b510-4f6b-b258-8d338836180f
name: Password Protected ZIP File Opened
description: Detects the extraction of password protected ZIP archives. See the filename
  variable for more details on which file has been opened.
severity: medium
enabled: false
tags:
  mitre:
  - T1027
  categories:
  - endpoint
references:
- https://twitter.com/sbousseaden/status/1523383197513379841
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 5379
    TargetName|contains: Microsoft_Windows_Shell_ZipFolder:filename
  filter:
    TargetName|contains: \Temporary Internet Files\Content.Outlook
  condition: selection and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: 00ba9da1-b510-4f6b-b258-8d338836180f
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/security/win_security_susp_opened_encrypted_zip.yml
falsepositives:
- Legitimate used of encrypted ZIP files
notes:
  quarantine_reason: 'upstream status: test'
