id: sigmahq-sigma-d4498716-1d52-438f-8084-4a603157d131
name: Password Provided In Command Line Of Net.EXE
description: Detects a when net.exe is called with a password in the command line
severity: medium
enabled: false
tags:
  mitre:
  - T1021.002
  - T1078
  categories:
  - endpoint
references:
- Internal Research
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - \net.exe
    - \net1.exe
  - OriginalFileName:
    - net.exe
    - net1.exe
  selection_cli:
    CommandLine|contains|all:
    - ' use '
    - :*\\
    - /USER:* *
  filter_main_empty:
    CommandLine|endswith: ' '
  condition: all of selection_* and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: d4498716-1d52-438f-8084-4a603157d131
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_net_use_password_plaintext.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
