id: sigmahq-sigma-7864a175-3654-4824-9f0d-f0da18ab27c0
name: Password Set to Never Expire via WMI
description: Detects the use of wmic.exe to modify user account settings and explicitly
  disable password expiration.
severity: medium
enabled: false
tags:
  mitre:
  - T1047
  - T1098
  categories:
  - endpoint
references:
- https://www.huntress.com/blog/the-unwanted-guest
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \wmic.exe
  - OriginalFileName: wmic.exe
  selection_cli:
    CommandLine|contains|all:
    - useraccount
    - ' set '
    - passwordexpires
    - 'false'
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 7864a175-3654-4824-9f0d-f0da18ab27c0
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_wmi_password_never_expire.yml
falsepositives:
- Legitimate administrative activity
notes:
  quarantine_reason: 'upstream status: experimental'
