id: sigmahq-sigma-12ba6a38-adb3-4d6b-91ba-a7fb248e3199
name: Password Policy Enumerated
description: Detects when the password policy is enumerated.
severity: medium
enabled: false
tags:
  mitre:
  - T1201
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-10/security/threat-protection/auditing/event-4661
- https://github.com/jpalanco/alienvault-ossim/blob/f74359c0c027e42560924b5cff25cdf121e5505a/os-sim/agent/src/ParserUtil.py#L951
logsource:
  product: windows
  service: security
  definition: dfd8c0f4-e6ad-4e07-b91b-f2fca0ddef64
detection:
  selection:
    EventID: 4661
    AccessList|contains: '%%5392'
    ObjectServer: Security Account Manager
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 12ba6a38-adb3-4d6b-91ba-a7fb248e3199
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/security/win_security_password_policy_enumerated.yml
notes:
  quarantine_reason: 'upstream status: test'
