id: sigmahq-sigma-6e90ae7a-7cd3-473f-a035-4ebb72d961da
name: PCRE.NET Package Temp Files
description: Detects processes creating temp files related to PCRE.NET package
severity: high
enabled: false
tags:
  mitre:
  - T1059
  categories:
  - endpoint
references:
- https://twitter.com/rbmaslen/status/1321859647091970051
- https://twitter.com/tifkin_/status/1321916444557365248
logsource:
  category: file_event
  product: windows
detection:
  selection:
    TargetFilename|contains: \AppData\Local\Temp\ba9ea7344a4a5f591d6e5dc32a13494b\
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 6e90ae7a-7cd3-473f-a035-4ebb72d961da
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_pcre_net_temp_file.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
