id: sigmahq-sigma-145095eb-e273-443b-83d0-f9b519b7867b
name: PDF File Created By RegEdit.EXE
description: 'Detects the creation of a file with the ".pdf" extension by the "RegEdit.exe"
  process.

  This indicates that a user is trying to print/save a registry key as a PDF in order
  to potentially extract sensitive information and bypass defenses.'
severity: high
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://sensepost.com/blog/2024/dumping-lsa-secrets-a-story-about-task-decorrelation/
logsource:
  category: file_event
  product: windows
detection:
  selection:
    Image|endswith: \regedit.exe
    TargetFilename|endswith: .pdf
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 145095eb-e273-443b-83d0-f9b519b7867b
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_regedit_print_as_pdf.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
