id: sigmahq-sigma-d679950c-abb7-43a6-80fb-2a480c4fc450
name: PDQ Deploy Remote Adminstartion Tool Execution
description: Detect use of PDQ Deploy remote admin tool
severity: medium
enabled: false
tags:
  mitre:
  - T1072
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/9e5b12c4912c07562aec7500447b11fa3e17e254/atomics/T1072/T1072.md
- https://www.pdq.com/pdq-deploy/
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Description: PDQ Deploy Console
  - Product: PDQ Deploy
  - Company: PDQ.com
  - OriginalFileName: PDQDeployConsole.exe
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: d679950c-abb7-43a6-80fb-2a480c4fc450
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_pdqdeploy_execution.yml
falsepositives:
- Legitimate use
notes:
  quarantine_reason: 'upstream status: test'
