id: sigmahq-sigma-c625d754-6a3d-4f65-9c9a-536aea960d37
name: Permission Check Via Accesschk.EXE
description: Detects the usage of the "Accesschk" utility, an access and privilege
  audit tool developed by SysInternal and often being abused by attacker to verify
  process privileges
severity: medium
enabled: false
tags:
  mitre:
  - T1069.001
  categories:
  - endpoint
references:
- https://speakerdeck.com/heirhabarov/hunting-for-privilege-escalation-in-windows-environment?slide=43
- https://www.youtube.com/watch?v=JGs-aKf2OtU&ab_channel=OFFZONEMOSCOW
- https://github.com/carlospolop/PEASS-ng/blob/fa0f2e17fbc1d86f1fd66338a40e665e7182501d/winPEAS/winPEASbat/winPEAS.bat
- https://github.com/gladiatx0r/Powerless/blob/04f553bbc0c65baf4e57344deff84e3f016e6b51/Powerless.bat
logsource:
  product: windows
  category: process_creation
detection:
  selection_img:
  - Product|endswith: AccessChk
  - Description|contains: Reports effective permissions
  - Image|endswith:
    - \accesschk.exe
    - \accesschk64.exe
  - OriginalFileName: accesschk.exe
  selection_cli:
    CommandLine|contains:
    - 'uwcqv '
    - 'kwsu '
    - 'qwsu '
    - 'uwdqs '
  condition: all of selection*
provenance:
  source: SigmaHQ/sigma
  source_id: c625d754-6a3d-4f65-9c9a-536aea960d37
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_sysinternals_accesschk_check_permissions.yml
falsepositives:
- System administrator Usage
notes:
  quarantine_reason: 'upstream status: test'
