id: sigmahq-sigma-f10ed525-97fe-4fed-be7c-2feecca941b1
name: Persistence Via Hhctrl.ocx
description: Detects when an attacker modifies the registry value of the "hhctrl"
  to point to a custom binary
severity: high
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://persistence-info.github.io/Data/hhctrl.html
- https://www.hexacorn.com/blog/2018/04/23/beyond-good-ol-run-key-part-77/
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains: \CLSID\{52A2AAAE-085D-4187-97EA-8C30DB990436}\InprocServer32\(Default)
  filter:
    Details: C:\Windows\System32\hhctrl.ocx
  condition: selection and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: f10ed525-97fe-4fed-be7c-2feecca941b1
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_hhctrl_persistence.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
