id: sigmahq-sigma-1070db9a-3e5d-412e-8e7b-7183b616e1b3
name: Persistence Via Sticky Key Backdoor
description: 'By replacing the sticky keys executable with the local admins CMD executable,
  an attacker is able to access a privileged windows console session without authenticating
  to the system.

  When the sticky keys are "activated" the privilleged shell is launched.'
severity: critical
enabled: false
tags:
  mitre:
  - T1546.008
  categories:
  - endpoint
references:
- https://www.fireeye.com/blog/threat-research/2017/03/apt29_domain_frontin.html
- https://www.clearskysec.com/wp-content/uploads/2020/02/ClearSky-Fox-Kitten-Campaign-v1.pdf
- https://learn.microsoft.com/en-us/archive/blogs/jonathantrull/detecting-sticky-key-backdoors
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    CommandLine|contains|all:
    - 'copy '
    - '/y '
    - C:\windows\system32\cmd.exe C:\windows\system32\sethc.exe
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 1070db9a-3e5d-412e-8e7b-7183b616e1b3
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_cmd_sticky_keys_replace.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
