id: sigmahq-sigma-5a2b21ee-6aaa-4234-ac9d-59a59edf90a1
name: Persistence Via New SIP Provider
description: Detects when an attacker register a new SIP provider for persistence
  and defense evasion
severity: medium
enabled: false
tags:
  mitre:
  - T1553.003
  categories:
  - endpoint
references:
- https://persistence-info.github.io/Data/codesigning.html
- https://github.com/gtworek/PSBits/tree/master/SIP
- https://specterops.io/assets/resources/SpecterOps_Subverting_Trust_in_Windows.pdf
logsource:
  category: registry_set
  product: windows
detection:
  selection_root:
    TargetObject|contains:
    - \SOFTWARE\Microsoft\Cryptography\Providers\
    - \SOFTWARE\Microsoft\Cryptography\OID\EncodingType
    - \SOFTWARE\WOW6432Node\Microsoft\Cryptography\Providers\
    - \SOFTWARE\WOW6432Node\Microsoft\Cryptography\OID\EncodingType
  selection_dll:
    TargetObject|contains:
    - \Dll
    - \$DLL
  filter:
    Details:
    - WINTRUST.DLL
    - mso.dll
  filter_poqexec:
    Image: C:\Windows\System32\poqexec.exe
    TargetObject|contains: \CryptSIPDll
    Details: C:\Windows\System32\PsfSip.dll
  condition: all of selection_* and not 1 of filter*
provenance:
  source: SigmaHQ/sigma
  source_id: 5a2b21ee-6aaa-4234-ac9d-59a59edf90a1
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_sip_persistence.yml
falsepositives:
- Legitimate SIP being registered by the OS or different software.
notes:
  quarantine_reason: 'upstream status: test'
