id: sigmahq-sigma-fcdf69e5-a3d3-452a-9724-26f2308bf2b1
name: Phishing Pattern ISO in Archive
description: Detects cases in which an ISO files is opend within an archiver like
  7Zip or Winrar, which is a sign of phishing as threat actors put small ISO files
  in archives as email attachments to bypass certain filters and protective measures
  (mark of web)
severity: high
enabled: false
tags:
  mitre:
  - T1566
  categories:
  - endpoint
references:
- https://twitter.com/1ZRR4H/status/1534259727059787783
- https://app.any.run/tasks/e1fe6a62-bce8-4323-a49a-63795d9afd5d/
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage|endswith:
    - \Winrar.exe
    - \7zFM.exe
    - \peazip.exe
    Image|endswith:
    - \isoburn.exe
    - \PowerISO.exe
    - \ImgBurn.exe
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: fcdf69e5-a3d3-452a-9724-26f2308bf2b1
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_susp_archiver_iso_phishing.yml
falsepositives:
- Legitimate cases in which archives contain ISO or IMG files and the user opens the
  archive and the image via clicking and not extraction
notes:
  quarantine_reason: 'upstream status: test'
