id: sigmahq-sigma-1a0d4aba-7668-4365-9ce4-6d79ab088dfd
name: Ping Hex IP
description: Detects a ping command that uses a hex encoded IP address
severity: high
enabled: false
tags:
  mitre:
  - T1140
  - T1027
  categories:
  - endpoint
references:
- https://github.com/vysecurity/Aggressor-VYSEC/blob/0d61c80387b9432dab64b8b8a9fb52d20cfef80e/ping.cna
- https://twitter.com/vysecurity/status/977198418354491392
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: \ping.exe
    CommandLine|re: 0x[a-fA-F0-9]{8}
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 1a0d4aba-7668-4365-9ce4-6d79ab088dfd
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_ping_hex_ip.yml
falsepositives:
- Unlikely, because no sane admin pings IP addresses in a hexadecimal form
notes:
  quarantine_reason: 'upstream status: test'
