id: sigmahq-sigma-97de11cd-4b67-4abf-9a8b-1020e670aa9e
name: Pnscan Binary Data Transmission Activity
description: 'Detects command line patterns associated with the use of Pnscan for
  sending and receiving binary data across the network.

  This behavior has been identified in a Linux malware campaign targeting Docker,
  Apache Hadoop, Redis, and Confluence and was previously used by the threat actor
  known as TeamTNT'
severity: medium
enabled: false
tags:
  mitre:
  - T1046
  categories:
  - endpoint
references:
- https://www.cadosecurity.com/blog/spinning-yarn-a-new-linux-malware-campaign-targets-docker-apache-hadoop-redis-and-confluence
- https://intezer.com/wp-content/uploads/2021/09/TeamTNT-Cryptomining-Explosion.pdf
- https://regex101.com/r/RugQYK/1
- https://www.virustotal.com/gui/file/beddf70a7bab805f0c0b69ac0989db6755949f9f68525c08cb874988353f78a9/content
logsource:
  category: process_creation
  product: linux
detection:
  selection:
    CommandLine|re: -(W|R)\s?(\s|"|')([0-9a-fA-F]{2}\s?){2,20}(\s|"|')
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 97de11cd-4b67-4abf-9a8b-1020e670aa9e
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/process_creation/proc_creation_lnx_pnscan_binary_cli_pattern.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
