id: sigmahq-sigma-77df53a5-1d78-4f32-bc5a-0e7465bd8f41
name: Portable Gpg.EXE Execution
description: Detects the execution of "gpg.exe" from uncommon location. Often used
  by ransomware and loaders to decrypt/encrypt data.
severity: medium
enabled: false
tags:
  mitre:
  - T1486
  categories:
  - endpoint
references:
- https://www.trendmicro.com/vinfo/vn/threat-encyclopedia/malware/ransom.bat.zarlock.a
- https://securelist.com/locked-out/68960/
- https://github.com/redcanaryco/atomic-red-team/blob/c4097dc7ed14d7f7d08c89d148c4307097e8c294/atomics/T1486/T1486.md
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Image|endswith:
    - \gpg.exe
    - \gpg2.exe
  - OriginalFileName: gpg.exe
  - Description: GnuPG’s OpenPGP tool
  filter_main_legit_location:
    Image|contains:
    - :\Program Files (x86)\GNU\GnuPG\bin\
    - :\Program Files (x86)\GnuPG VS-Desktop\
    - :\Program Files (x86)\GnuPG\bin\
    - :\Program Files (x86)\Gpg4win\bin\
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 77df53a5-1d78-4f32-bc5a-0e7465bd8f41
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_gpg4win_portable_execution.yml
notes:
  quarantine_reason: 'upstream status: test'
