id: sigmahq-sigma-56fda488-113e-4ce9-8076-afc2457922c3
name: Possible DCSync Attack
description: Detects remote RPC calls to MS-DRSR from non DC hosts, which could indicate
  DCSync / DCShadow attacks.
severity: high
enabled: false
tags:
  mitre:
  - T1033
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-drsr/f977faaa-673e-4f66-b9bf-48c640241d47?redirectedfrom=MSDN
- https://github.com/jsecurity101/MSRPC-to-ATTACK/blob/ddd4608fe8684fcf2fcf9b48c5f0b3c28097f8a3/documents/MS-DRSR.md
- https://github.com/zeronetworks/rpcfirewall
- https://zeronetworks.com/blog/stopping-lateral-movement-via-the-rpc-firewall/
logsource:
  product: rpc_firewall
  category: application
  definition: 'Requirements: install and apply the RPC Firewall to all processes,
    enable DRSR UUID (e3514235-4b06-11d1-ab04-00c04fc2dcd2) for "dangerous" opcodes
    (not 0,1 or 12) only from trusted IPs (DCs)'
detection:
  selection:
    EventLog: RPCFW
    EventID: 3
    InterfaceUuid: e3514235-4b06-11d1-ab04-00c04fc2dcd2
  filter:
    OpNum:
    - 0
    - 1
    - 12
  condition: selection and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: 56fda488-113e-4ce9-8076-afc2457922c3
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/application/rpc_firewall/rpc_firewall_dcsync_attack.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
