id: sigmahq-sigma-252902e3-5830-4cf6-bf21-c22083dfd5cf
name: Possible Impacket SecretDump Remote Activity
description: Detect AD credential dumping using impacket secretdump HKTL
severity: high
enabled: false
tags:
  mitre:
  - T1003.002
  - T1003.004
  - T1003.003
  categories:
  - endpoint
references:
- https://web.archive.org/web/20230329153811/https://blog.menasec.net/2019/02/threat-huting-10-impacketsecretdump.html
logsource:
  product: windows
  service: security
  definition: The advanced audit policy setting "Object Access > Audit Detailed File
    Share" must be configured for Success/Failure
detection:
  selection:
    EventID: 5145
    ShareName: \\\\\*\\ADMIN$
    RelativeTargetName|contains|all:
    - SYSTEM32\
    - .tmp
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 252902e3-5830-4cf6-bf21-c22083dfd5cf
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/security/win_security_impacket_secretdump.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
