id: sigmahq-sigma-92dae1ed-1c9d-4eff-a567-33acbd95b00e
name: Possible Impacket SecretDump Remote Activity - Zeek
description: Detect AD credential dumping using impacket secretdump HKTL. Based on
  the SIGMA rules/windows/builtin/win_impacket_secretdump.yml
severity: high
enabled: false
tags:
  mitre:
  - T1003.002
  - T1003.004
  - T1003.003
  categories:
  - endpoint
references:
- https://web.archive.org/web/20230329153811/https://blog.menasec.net/2019/02/threat-huting-10-impacketsecretdump.html
logsource:
  product: zeek
  service: smb_files
detection:
  selection:
    path|contains|all:
    - \
    - ADMIN$
    name|contains: SYSTEM32\
    name|endswith: .tmp
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 92dae1ed-1c9d-4eff-a567-33acbd95b00e
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/network/zeek/zeek_smb_converted_win_impacket_secretdump.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
