id: sigmahq-sigma-071d5e5a-9cef-47ec-bc4e-a42e34d8d0ed
name: Possible Coin Miner CPU Priority Param
description: Detects command line parameter very often used with coin miners
severity: critical
enabled: false
tags:
  mitre:
  - T1068
  categories:
  - endpoint
references:
- https://xmrig.com/docs/miner/command-line-options
logsource:
  product: linux
  service: auditd
detection:
  cmd1:
    a1|startswith: --cpu-priority
  cmd2:
    a2|startswith: --cpu-priority
  cmd3:
    a3|startswith: --cpu-priority
  cmd4:
    a4|startswith: --cpu-priority
  cmd5:
    a5|startswith: --cpu-priority
  cmd6:
    a6|startswith: --cpu-priority
  cmd7:
    a7|startswith: --cpu-priority
  condition: 1 of cmd*
provenance:
  source: SigmaHQ/sigma
  source_id: 071d5e5a-9cef-47ec-bc4e-a42e34d8d0ed
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/auditd/execve/lnx_auditd_coinminer.yml
falsepositives:
- Other tools that use a --cpu-priority flag
notes:
  quarantine_reason: 'upstream status: test'
