id: sigmahq-sigma-f598ea0c-c25a-4f72-a219-50c44411c791
name: Possible Shadow Credentials Added
description: Detects possible addition of shadow credentials to an active directory
  object.
severity: high
enabled: false
tags:
  mitre:
  - T1556
  categories:
  - endpoint
references:
- https://www.elastic.co/guide/en/security/8.4/potential-shadow-credentials-added-to-ad-object.html
- https://cyberstoph.org/posts/2022/03/detecting-shadow-credentials/
- https://twitter.com/SBousseaden/status/1581300963650187264?
logsource:
  product: windows
  service: security
  definition: The "Audit Directory Service Changes" logging policy must be configured
    in order to receive events. Audit events are generated only for objects with configured
    system access control lists (SACLs). Audit events are generated only for objects
    with configured system access control lists (SACLs) and only when accessed in
    a manner that matches their SACL settings. This policy covers the following events
    ids - 5136, 5137, 5138, 5139, 5141. Note that the default policy does not cover
    User objects. For that a custom AuditRule need to be setup (See https://github.com/OTRF/Set-AuditRule)
detection:
  selection:
    EventID: 5136
    AttributeLDAPDisplayName: msDS-KeyCredentialLink
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: f598ea0c-c25a-4f72-a219-50c44411c791
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/security/win_security_susp_possible_shadow_credentials_added.yml
falsepositives:
- Modifications in the msDS-KeyCredentialLink attribute can be done legitimately by
  the Azure AD Connect synchronization account or the ADFS service account. These
  accounts can be added as Exceptions. (From elastic FP section)
notes:
  quarantine_reason: 'upstream status: test'
