id: sigmahq-sigma-f9578658-9e71-4711-b634-3f9b50cd3c06
name: Potential Defense Evasion Activity Via Emoji Usage In CommandLine - 3
description: Detects the usage of emojis in the command line, this could be a sign
  of potential defense evasion activity.
severity: high
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- Internal Research
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    CommandLine|contains:
    - 🦆
    - 🦅
    - 🦉
    - 🦇
    - 🐺
    - 🐗
    - 🐴
    - 🦄
    - 🐝
    - 🪱
    - 🐛
    - 🦋
    - 🐌
    - 🐞
    - 🐜
    - 🪰
    - 🪲
    - 🪳
    - 🦟
    - 🦗
    - 🕷
    - 🕸
    - 🦂
    - 🐢
    - 🐍
    - 🦎
    - 🦖
    - 🦕
    - 🐙
    - 🦑
    - 🦐
    - 🦞
    - 🦀
    - 🪸
    - 🐡
    - 🐠
    - 🐟
    - 🐬
    - 🐳
    - 🐋
    - 🦈
    - 🐊
    - 🐅
    - 🐆
    - 🦓
    - 🦍
    - 🦧
    - 🦣
    - 🐘
    - 🦛
    - 🦏
    - 🐪
    - 🐫
    - 🦒
    - 🦘
    - 🦬
    - 🐃
    - 🐂
    - 🐄
    - 🐎
    - 🐖
    - 🐏
    - 🐑
    - 🦙
    - 🐐
    - 🦌
    - 🐕
    - 🐩
    - 🦮
    - 🐕‍🦺
    - 🐈
    - 🐈‍⬛
    - 🪶
    - 🐓
    - 🦃
    - 🦤
    - 🦚
    - 🦜
    - 🦢
    - 🦩
    - 🕊
    - 🐇
    - 🦝
    - 🦨
    - 🦡
    - 🦫
    - 🦦
    - 🦥
    - 🐁
    - 🐀
    - 🐿
    - 🦔
    - 🐾
    - 🐉
    - 🐲
    - 🌵
    - 🎄
    - 🌲
    - 🌳
    - 🌴
    - 🪹
    - 🪺
    - 🪵
    - 🌱
    - 🌿
    - ☘️
    - 🍀
    - 🎍
    - 🪴
    - 🎋
    - 🍃
    - 🍂
    - 🍁
    - 🍄
    - 🐚
    - 🪨
    - 🌾
    - 💐
    - 🌷
    - 🪷
    - 🌹
    - 🥀
    - 🌺
    - 🌸
    - 🌼
    - 🌻
    - 🌞
    - 🌝
    - 🌛
    - 🌜
    - 🌚
    - 🌕
    - 🌖
    - 🌗
    - 🌘
    - 🌑
    - 🌒
    - 🌓
    - 🌔
    - 🌙
    - 🌎
    - 🌍
    - 🌏
    - 🪐
    - 💫
    - ⭐️
    - 🌟
    - ✨
    - ⚡️
    - ☄️
    - 💥
    - 🔥
    - 🌪
    - 🌈
    - ☀️
    - 🌤
    - ⛅️
    - 🌥
    - ☁️
    - 🌦
    - 🌧
    - ⛈
    - 🌩
    - 🌨
    - ❄️
    - ☃️
    - ⛄️
    - 🌬
    - 💨
    - 💧
    - 💦
    - 🫧
    - ☔️
    - ☂️
    - 🌊
    - 🌫🍏
    - 🍎
    - 🍐
    - 🍊
    - 🍋
    - 🍌
    - 🍉
    - 🍇
    - 🍓
    - 🫐
    - 🍈
    - 🍒
    - 🍑
    - 🥭
    - 🍍
    - 🥥
    - 🥝
    - 🍅
    - 🍆
    - 🥑
    - 🥦
    - 🥬
    - 🥒
    - 🌶
    - 🫑
    - 🌽
    - 🥕
    - 🫒
    - 🧄
    - 🧅
    - 🥔
    - 🍠
    - 🫘
    - 🥐
    - 🥯
    - 🍞
    - 🥖
    - 🥨
    - 🧀
    - 🥚
    - 🍳
    - 🧈
    - 🥞
    - 🧇
    - 🥓
    - 🥩
    - 🍗
    - 🍖
    - 🦴
    - 🌭
    - 🍔
    - 🍟
    - 🍕
    - 🫓
    - 🥪
    - 🥙
    - 🧆
    - 🌮
    - 🌯
    - 🫔
    - 🥗
    - 🥘
    - 🫕
    - 🥫
    - 🍝
    - 🍜
    - 🍲
    - 🍛
    - 🍣
    - 🍱
    - 🥟
    - 🦪
    - 🍤
    - 🍙
    - 🍚
    - 🍘
    - 🍥
    - 🥠
    - 🥮
    - 🍢
    - 🍡
    - 🍧
    - 🍨
    - 🍦
    - 🥧
    - 🧁
    - 🍰
    - 🎂
    - 🍮
    - 🍭
    - 🍬
    - 🍫
    - 🍿
    - 🍩
    - 🍪
    - 🌰
    - 🥜
    - 🍯
    - 🥛
    - 🍼
    - 🫖
    - ☕️
    - 🍵
    - 🧃
    - 🥤
    - 🧋
    - 🫙
    - 🍶
    - 🍺
    - 🍻
    - 🥂
    - 🍷
    - 🫗
    - 🥃
    - 🍸
    - 🍹
    - 🧉
    - 🍾
    - 🧊
    - 🥄
    - 🍴
    - 🍽
    - 🥣
    - 🥡
    - 🥢
    - 🧂
    - ⚽️
    - 🏀
    - 🏈
    - ⚾️
    - 🥎
    - 🎾
    - 🏐
    - 🏉
    - 🥏
    - 🎱
    - 🪀
    - 🏓
    - 🏸
    - 🏒
    - 🏑
    - 🥍
    - 🏏
    - 🪃
    - 🥅
    - ⛳️
    - 🪁
    - 🏹
    - 🎣
    - 🤿
    - 🥊
    - 🥋
    - 🎽
    - 🛹
    - 🛼
    - 🛷
    - ⛸
    - 🥌
    - 🎿
    - ⛷
    - 🏂
    - 🪂
    - 🏋️‍♀️
    - 🏋️
    - 🏋️‍♂️
    - 🤼‍♀️
    - 🤼
    - 🤼‍♂️
    - 🤸‍♀️
    - 🤸
    - 🤸‍♂️
    - ⛹️‍♀️
    - ⛹️
    - ⛹️‍♂️
    - 🤺
    - 🤾‍♀️
    - 🤾
    - 🤾‍♂️
    - 🏌️‍♀️
    - 🏌️
    - 🏌️‍♂️
    - 🏇
    - 🧘‍♀️
    - 🧘
    - 🧘‍♂️
    - 🏄‍♀️
    - 🏄
    - 🏄‍♂️
    - 🏊‍♀️
    - 🏊
    - 🏊‍♂️
    - 🤽‍♀️
    - 🤽
    - 🤽‍♂️
    - 🚣‍♀️
    - 🚣
    - 🚣‍♂️
    - 🧗‍♀️
    - 🧗
    - 🧗‍♂️
    - 🚵‍♀️
    - 🚵
    - 🚵‍♂️
    - 🚴‍♀️
    - 🚴
    - 🚴‍♂️
    - 🏆
    - 🥇
    - 🥈
    - 🥉
    - 🏅
    - 🎖
    - 🏵
    - 🎗
    - 🎫
    - 🎟
    - 🎪
    - 🤹
    - 🤹‍♂️
    - 🤹‍♀️
    - 🎭
    - 🩰
    - 🎨
    - 🎬
    - 🎤
    - 🎧
    - 🎼
    - 🎹
    - 🥁
    - 🪘
    - 🎷
    - 🎺
    - 🪗
    - 🎸
    - 🪕
    - 🎻
    - 🎲
    - ♟
    - 🎯
    - 🎳
    - 🎮
    - 🎰
    - 🧩
    - 🚗
    - 🚕
    - 🚙
    - 🚌
    - 🚎
    - 🏎
    - 🚓
    - 🚑
    - 🚒
    - 🚐
    - 🛻
    - 🚚
    - 🚛
    - 🚜
    - 🦯
    - 🦽
    - 🦼
    - 🛴
    - 🚲
    - 🛵
    - 🏍
    - 🛺
    - 🚨
    - 🚔
    - 🚍
    - 🚘
    - 🚖
    - 🛞
    - 🚡
    - 🚠
    - 🚟
    - 🚃
    - 🚋
    - 🚞
    - 🚝
    - 🚄
    - 🚅
    - 🚈
    - 🚂
    - 🚆
    - 🚇
    - 🚊
    - 🚉
    - ✈️
    - 🛫
    - 🛬
    - 🛩
    - 💺
    - 🛰
    - 🚀
    - 🛸
    - 🚁
    - 🛶
    - ⛵️
    - 🚤
    - 🛥
    - 🛳
    - ⛴
    - 🚢
    - ⚓️
    - 🛟
    - 🪝
    - ⛽️
    - 🚧
    - 🚦
    - 🚥
    - 🚏
    - 🗺
    - 🗿
    - 🗽
    - 🗼
    - 🏰
    - 🏯
    - 🏟
    - 🎡
    - 🎢
    - 🛝
    - 🎠
    - ⛲️
    - ⛱
    - 🏖
    - 🏝
    - 🏜
    - 🌋
    - ⛰
    - 🏔
    - 🗻
    - 🏕
    - ⛺️
    - 🛖
    - 🏠
    - 🏡
    - 🏘
    - 🏚
    - 🏗
    - 🏭
    - 🏢
    - 🏬
    - 🏣
    - 🏤
    - 🏥
    - 🏦
    - 🏨
    - 🏪
    - 🏫
    - 🏩
    - 💒
    - 🏛
    - ⛪️
    - 🕌
    - 🕍
    - 🛕
    - 🕋
    - ⛩
    - 🛤
    - 🛣
    - 🗾
    - 🎑
    - 🏞
    - 🌅
    - 🌄
    - 🌠
    - 🎇
    - 🎆
    - 🌇
    - 🌆
    - 🏙
    - 🌃
    - 🌌
    - 🌉
    - 🌁
    - ⌚️
    - 📱
    - 📲
    - 💻
    - ⌨️
    - 🖥
    - 🖨
    - 🖱
    - 🖲
    - 🕹
    - 🗜
    - 💽
    - 💾
    - 💿
    - 📀
    - 📼
    - 📷
    - 📸
    - 📹
    - 🎥
    - 📽
    - 🎞
    - 📞
    - ☎️
    - 📟
    - 📠
    - 📺
    - 📻
    - 🎙
    - 🎚
    - 🎛
    - 🧭
    - ⏱
    - ⏲
    - ⏰
    - 🕰
    - ⌛️
    - ⏳
    - 📡
    - 🔋
    - 🪫
    - 🔌
    - 💡
    - 🔦
    - 🕯
    - 🪔
    - 🧯
    - 🛢
    - 💸
    - 💵
    - 💴
    - 💶
    - 💷
    - 🪙
    - 💰
    - 💳
    - 💎
    - ⚖️
    - 🪜
    - 🧰
    - 🪛
    - 🔧
    - 🔨
    - ⚒
    - 🛠
    - ⛏
    - 🪚
    - 🔩
    - ⚙️
    - 🪤
    - 🧱
    - ⛓
    - 🧲
    - 🔫
    - 💣
    - 🧨
    - 🪓
    - 🔪
    - 🗡
    - ⚔️
    - 🛡
    - 🚬
    - ⚰️
    - 🪦
    - ⚱️
    - 🏺
    - 🔮
    - 📿
    - 🧿
    - 🪬
    - 💈
    - ⚗️
    - 🔭
    - 🔬
    - 🕳
    - 🩹
    - 🩺
    - 🩻
    - 🩼
    - 💊
    - 💉
    - 🩸
    - 🧬
    - 🦠
    - 🧫
    - 🧪
    - 🌡
    - 🧹
    - 🪠
    - 🧺
    - 🧻
    - 🚽
    - 🚰
    - 🚿
    - 🛁
    - 🛀
    - 🧼
    - 🪥
    - 🪒
    - 🧽
    - 🪣
    - 🧴
    - 🛎
    - 🔑
    - 🗝
    - 🚪
    - 🪑
    - 🛋
    - 🛏
    - 🛌
    - 🧸
    - 🪆
    - 🖼
    - 🪞
    - 🪟
    - 🛍
    - 🛒
    - 🎁
    - 🎈
    - 🎏
    - 🎀
    - 🪄
    - 🪅
    - 🎊
    - 🎉
    - 🪩
    - 🎎
    - 🏮
    - 🎐
    - 🧧
    - ✉️
    - 📩
    - 📨
    - 📧
    - 💌
    - 📥
    - 📤
    - 📦
    - 🏷
    - 🪧
    - 📪
    - 📫
    - 📬
    - 📭
    - 📮
    - 📯
    - 📜
    - 📃
    - 📄
    - 📑
    - 🧾
    - 📊
    - 📈
    - 📉
    - 🗒
    - 🗓
    - 📆
    - 📅
    - 🗑
    - 🪪
    - 📇
    - 🗃
    - 🗳
    - 🗄
    - 📋
    - 📁
    - 📂
    - 🗂
    - 🗞
    - 📰
    - 📓
    - 📔
    - 📒
    - 📕
    - 📗
    - 📘
    - 📙
    - 📚
    - 📖
    - 🔖
    - 🧷
    - 🔗
    - 📎
    - 🖇
    - 📐
    - 📏
    - 🧮
    - 📌
    - 📍
    - ✂️
    - 🖊
    - 🖋
    - ✒️
    - 🖌
    - 🖍
    - 📝
    - ✏️
    - 🔍
    - 🔎
    - 🔏
    - 🔐
    - 🔒
    - 🔓❤️
    - 🧡
    - 💛
    - 💚
    - 💙
    - 💜
    - 🖤
    - 🤍
    - 🤎
    - ❤️‍🔥
    - ❤️‍🩹
    - 💔
    - ❣️
    - 💕
    - 💞
    - 💓
    - 💗
    - 💖
    - 💘
    - 💝
    - 💟
    - ☮️
    - ✝️
    - ☪️
    - 🕉
    - ☸️
    - ✡️
    - 🔯
    - 🕎
    - ☯️
    - ☦️
    - 🛐
    - ⛎
    - ♈️
    - ♉️
    - ♊️
    - ♋️
    - ♌️
    - ♍️
    - ♎️
    - ♏️
    - ♐️
    - ♑️
    - ♒️
    - ♓️
    - 🆔
    - ⚛️
    - 🉑
    - ☢️
    - ☣️
    - 📴
    - 📳
    - 🈶
    - 🈚️
    - 🈸
    - 🈺
    - 🈷️
    - ✴️
    - 🆚
    - 💮
    - 🉐
    - ㊙️
    - ㊗️
    - 🈴
    - 🈵
    - 🈹
    - 🈲
    - 🅰️
    - 🅱️
    - 🆎
    - 🆑
    - 🅾️
    - 🆘
    - ❌
    - ⭕️
    - 🛑
    - ⛔️
    - 📛
    - 🚫
    - 💯
    - 💢
    - ♨️
    - 🚷
    - 🚯
    - 🚳
    - 🚱
    - 🔞
    - 📵
    - 🚭
    - ❗️
    - ❕
    - ❓
    - ❔
    - ‼️
    - ⁉️
    - 🔅
    - 🔆
    - 〽️
    - ⚠️
    - 🚸
    - 🔱
    - ⚜️
    - 🔰
    - ♻️
    - ✅
    - 🈯️
    - 💹
    - ❇️
    - ✳️
    - ❎
    - 🌐
    - 💠
    - Ⓜ️
    - 🌀
    - 💤
    - 🏧
    - 🚾
    - ♿️
    - 🅿️
    - 🛗
    - 🈳
    - 🈂️
    - 🛂
    - 🛃
    - 🛄
    - 🛅
    - 🚹
    - 🚺
    - 🚼
    - ⚧
    - 🚻
    - 🚮
    - 🎦
    - 📶
    - 🈁
    - 🔣
    - ℹ️
    - 🔤
    - 🔡
    - 🔠
    - 🆖
    - 🆗
    - 🆙
    - 🆒
    - 🆕
    - 🆓
    - 0️⃣
    - 1️⃣
    - 2️⃣
    - 3️⃣
    - 4️⃣
    - 5️⃣
    - 6️⃣
    - 7️⃣
    - 8️⃣
    - 9️⃣
    - 🔟
    - 🔢
    - '#️⃣'
    - '*️⃣'
    - ⏏️
    - ▶️
    - ⏸
    - ⏯
    - ⏹
    - ⏺
    - ⏭
    - ⏮
    - ⏩
    - ⏪
    - ⏫
    - ⏬
    - ◀️
    - 🔼
    - 🔽
    - ➡️
    - ⬅️
    - ⬆️
    - ⬇️
    - ↗️
    - ↘️
    - ↙️
    - ↖️
    - ↕️
    - ↔️
    - ↪️
    - ↩️
    - ⤴️
    - ⤵️
    - 🔀
    - 🔁
    - 🔂
    - 🔄
    - 🔃
    - 🎵
    - 🎶
    - ➕
    - ➖
    - ➗
    - ✖️
    - 🟰
    - ♾
    - 💲
    - 💱
    - ™️
    - ©️
    - ®️
    - 〰️
    - ➰
    - ➿
    - 🔚
    - 🔙
    - 🔛
    - 🔝
    - 🔜
    - ✔️
    - ☑️
    - 🔘
    - 🔴
    - 🟠
    - 🟡
    - 🟢
    - 🔵
    - 🟣
    - ⚫️
    - ⚪️
    - 🟤
    - 🔺
    - 🔻
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: f9578658-9e71-4711-b634-3f9b50cd3c06
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_susp_emoji_usage_in_cli_3.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
