id: sigmahq-sigma-d2605a99-2218-4894-8fd3-2afb7946514d
name: Potential Mfdetours.DLL Sideloading
description: Detects potential DLL sideloading of "mfdetours.dll". While using "mftrace.exe"
  it can be abused to attach to an arbitrary process and force load any DLL named
  "mfdetours.dll" from the current directory of execution.
severity: medium
enabled: false
tags:
  mitre:
  - T1574.001
  categories:
  - endpoint
references:
- Internal Research
logsource:
  category: image_load
  product: windows
detection:
  selection:
    ImageLoaded|endswith: \mfdetours.dll
  filter_main_legit_path:
    ImageLoaded|contains: :\Program Files (x86)\Windows Kits\10\bin\
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: d2605a99-2218-4894-8fd3-2afb7946514d
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/image_load/image_load_side_load_mfdetours.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
