id: sigmahq-sigma-09d3b48b-be17-47f5-bf4e-94e7e75d09ce
name: Potential Malicious AppX Package Installation Attempts
description: Detects potential installation or installation attempts of known malicious
  appx packages
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://www.sentinelone.com/labs/inside-malicious-windows-apps-for-malware-deployment/
- https://news.sophos.com/en-us/2021/11/11/bazarloader-call-me-back-attack-abuses-windows-10-apps-mechanism/
- https://forensicitguy.github.io/analyzing-magnitude-magniber-appx/
logsource:
  product: windows
  service: appxdeployment-server
detection:
  selection:
    EventID:
    - 400
    - 401
    PackageFullName|contains: 3669e262-ec02-4e9d-bcb4-3d008b4afac9
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 09d3b48b-be17-47f5-bf4e-94e7e75d09ce
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/appxdeployment_server/win_appxdeployment_server_mal_appx_names.yml
falsepositives:
- Rare occasions where a malicious package uses the exact same name and version as
  a legitimate application.
notes:
  quarantine_reason: 'upstream status: test'
