id: sigmahq-sigma-df4dc653-1029-47ba-8231-3c44238cc0ae
name: Potential Persistence Using DebugPath
description: Detects potential persistence using Appx DebugPath
severity: medium
enabled: false
tags:
  mitre:
  - T1546.015
  categories:
  - endpoint
references:
- https://oddvar.moe/2018/09/06/persistence-using-universal-windows-platform-apps-appx/
- https://github.com/rootm0s/WinPwnage
logsource:
  category: registry_set
  product: windows
detection:
  selection_debug:
    TargetObject|contains: Classes\ActivatableClasses\Package\Microsoft.
    TargetObject|endswith: \DebugPath
  selection_default:
    TargetObject|contains: \Software\Microsoft\Windows\CurrentVersion\PackagedAppXDebug\Microsoft.
    TargetObject|endswith: \(Default)
  condition: 1 of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: df4dc653-1029-47ba-8231-3c44238cc0ae
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_persistence_appx_debugger.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
