id: sigmahq-sigma-8537c866-072e-460d-bfff-aaf39cbd73d3
name: Potentially Suspicious Inline JavaScript Execution via NodeJS Binary
description: Detects potentially suspicious inline JavaScript execution using Node.js
  with specific keywords in the command line.
severity: medium
enabled: false
tags:
  mitre:
  - T1059.007
  categories:
  - endpoint
references:
- https://www.microsoft.com/en-us/security/blog/2025/04/15/threat-actors-misuse-node-js-to-deliver-malware-and-other-malicious-payloads/
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \node.exe
  - OriginalFileName: node.exe
  - Product: Node.js
  selection_cmd:
    CommandLine|contains|all:
    - http
    - execSync
    - spawn
    - fs
    - path
    - zlib
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 8537c866-072e-460d-bfff-aaf39cbd73d3
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_susp_inline_node_js_execution.yml
falsepositives:
- Legitimate scripts using Node.js with these modules
notes:
  quarantine_reason: 'upstream status: experimental'
