id: sigmahq-sigma-92772523-d9c1-4c93-9547-b0ca500baba3
name: Potential Persistence Via Mpnotify
description: Detects when an attacker register a new SIP provider for persistence
  and defense evasion
severity: high
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://persistence-info.github.io/Data/mpnotify.html
- https://www.youtube.com/watch?v=ggY3srD9dYs&ab_channel=GrzegorzTworek
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains: \SOFTWARE\Microsoft\Windows NT\CurrentVersion\Winlogon\mpnotify
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 92772523-d9c1-4c93-9547-b0ca500baba3
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_persistence_mpnotify.yml
falsepositives:
- Might trigger if a legitimate new SIP provider is registered. But this is not a
  common occurrence in an environment and should be investigated either way
notes:
  quarantine_reason: 'upstream status: test'
