id: sigmahq-sigma-c2c76b77-32be-4d1f-82c9-7e544bdfe0eb
name: Potential Suspicious Activity Using SeCEdit
description: Detects potential suspicious behaviour using secedit.exe. Such as exporting
  or modifying the security policy
severity: medium
enabled: false
tags:
  mitre:
  - T1685.001
  - T1547.001
  - T1505.005
  - T1556.002
  - T1685
  - T1574.007
  - T1564.002
  - T1546.008
  - T1546.007
  - T1547.014
  - T1547.010
  - T1547.002
  - T1557
  - T1082
  categories:
  - endpoint
references:
- https://blueteamops.medium.com/secedit-and-i-know-it-595056dee53d
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/secedit
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \secedit.exe
  - OriginalFileName: SeCEdit
  selection_flags_discovery:
    CommandLine|contains|all:
    - /export
    - /cfg
  selection_flags_configure:
    CommandLine|contains|all:
    - /configure
    - /db
  condition: selection_img and (1 of selection_flags_*)
provenance:
  source: SigmaHQ/sigma
  source_id: c2c76b77-32be-4d1f-82c9-7e544bdfe0eb
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_secedit_execution.yml
falsepositives:
- Legitimate administrative use
notes:
  quarantine_reason: 'upstream status: test'
