id: sigmahq-sigma-0ba1da6d-b6ce-4366-828c-18826c9de23e
name: Potential Defense Evasion Via Rename Of Highly Relevant Binaries
description: Detects the execution of a renamed binary often used by attackers or
  malware leveraging new Sysmon OriginalFileName datapoint.
severity: high
enabled: false
tags:
  mitre:
  - T1036.003
  categories:
  - endpoint
references:
- https://mgreen27.github.io/posts/2019/05/12/BinaryRename.html
- https://mgreen27.github.io/posts/2019/05/29/BinaryRename2.html
- https://www.trendmicro.com/vinfo/hk-en/security/news/cybercrime-and-digital-threats/megacortex-ransomware-spotted-attacking-enterprise-networks
- https://twitter.com/christophetd/status/1164506034720952320
- https://threatresearch.ext.hp.com/svcready-a-new-loader-reveals-itself/
- https://www.huntress.com/blog/malicious-browser-extention-crashfix-kongtuke
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Description: Execute processes remotely
  - Product: Sysinternals PsExec
  - Description|startswith:
    - Windows PowerShell
    - pwsh
  - OriginalFileName:
    - certutil.exe
    - cmstp.exe
    - cscript.exe
    - IE4UINIT.EXE
    - finger.exe
    - mshta.exe
    - msiexec.exe
    - msxsl.exe
    - powershell_ise.exe
    - powershell.exe
    - psexec.c
    - psexec.exe
    - psexesvc.exe
    - pwsh.dll
    - reg.exe
    - regsvr32.exe
    - rundll32.exe
    - WerMgr
    - wmic.exe
    - wscript.exe
  filter:
    Image|endswith:
    - \certutil.exe
    - \cmstp.exe
    - \cscript.exe
    - \ie4uinit.exe
    - \finger.exe
    - \mshta.exe
    - \msiexec.exe
    - \msxsl.exe
    - \powershell_ise.exe
    - \powershell.exe
    - \psexec.exe
    - \psexec64.exe
    - \PSEXESVC.exe
    - \pwsh.exe
    - \reg.exe
    - \regsvr32.exe
    - \rundll32.exe
    - \wermgr.exe
    - \wmic.exe
    - \wscript.exe
  condition: selection and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: 0ba1da6d-b6ce-4366-828c-18826c9de23e
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_renamed_binary_highly_relevant.yml
falsepositives:
- Custom applications use renamed binaries adding slight change to binary name. Typically
  this is easy to spot and add to whitelist
- PsExec installed via Windows Store doesn't contain original filename field (False
  negative)
notes:
  quarantine_reason: 'upstream status: test'
