id: sigmahq-sigma-16c86189-b556-4ee8-b4c7-7e350a195a4f
name: Potential Server Side Template Injection In Velocity
description: Detects exceptions in velocity template renderer, this most likely happens
  due to dynamic rendering of user input and may lead to RCE.
severity: high
enabled: false
tags:
  mitre:
  - T1190
  categories:
  - endpoint
references:
- https://antgarsil.github.io/posts/velocity/
- https://www.wix.engineering/post/threat-and-vulnerability-hunting-with-application-server-error-logs
logsource:
  category: application
  product: velocity
  definition: 'Requirements: application error logs must be collected (with LOG_LEVEL=ERROR
    and above)'
detection:
  keywords:
  - ParseErrorException
  - VelocityException
  - TemplateInitException
  condition: keywords
provenance:
  source: SigmaHQ/sigma
  source_id: 16c86189-b556-4ee8-b4c7-7e350a195a4f
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/application/velocity/velocity_ssti_injection.yml
falsepositives:
- Application bugs
- Missing .vm files
notes:
  quarantine_reason: 'upstream status: test'
