id: sigmahq-sigma-9a4ccd1a-3526-4d99-b980-9f9c5d3a6ff3
name: Potential Credential Dumping Via WER
description: Detects potential credential dumping via Windows Error Reporting LSASS
  Shtinkering technique which uses the Windows Error Reporting to dump lsass
severity: high
enabled: false
tags:
  mitre:
  - T1003.001
  categories:
  - endpoint
references:
- https://github.com/deepinstinct/Lsass-Shtinkering
- https://media.defcon.org/DEF%20CON%2030/DEF%20CON%2030%20presentations/Asaf%20Gilboa%20-%20LSASS%20Shtinkering%20Abusing%20Windows%20Error%20Reporting%20to%20Dump%20LSASS.pdf
logsource:
  product: windows
  category: process_creation
detection:
  selection_img:
  - Image|endswith: \Werfault.exe
  - OriginalFileName: WerFault.exe
  selection_cli:
    ParentUser|contains:
    - AUTHORI
    - AUTORI
    User|contains:
    - AUTHORI
    - AUTORI
    CommandLine|contains|all:
    - ' -u -p '
    - ' -ip '
    - ' -s '
  filter_lsass:
    ParentImage: C:\Windows\System32\lsass.exe
  condition: all of selection_* and not 1 of filter_*
provenance:
  source: SigmaHQ/sigma
  source_id: 9a4ccd1a-3526-4d99-b980-9f9c5d3a6ff3
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_werfault_lsass_shtinkering.yml
falsepositives:
- Windows Error Reporting might produce similar behavior. In that case, check the
  PID associated with the "-p" parameter in the CommandLine.
notes:
  quarantine_reason: 'upstream status: test'
