id: sigmahq-sigma-36480ae1-a1cb-4eaa-a0d6-29801d7e9142
name: Potential Defense Evasion Via Binary Rename
description: Detects the execution of a renamed binary often used by attackers or
  malware leveraging new Sysmon OriginalFileName datapoint.
severity: medium
enabled: false
tags:
  mitre:
  - T1036.003
  categories:
  - endpoint
references:
- https://mgreen27.github.io/posts/2019/05/12/BinaryRename.html
- https://mgreen27.github.io/posts/2019/05/29/BinaryRename2.html
- https://github.com/redcanaryco/atomic-red-team/blob/0f229c0e42bfe7ca736a14023836d65baa941ed2/atomics/T1036.003/T1036.003.md#atomic-test-1---masquerading-as-windows-lsass-process
- https://www.splunk.com/en_us/blog/security/inno-setup-malware-redline-stealer-campaign.html
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    OriginalFileName:
    - Cmd.Exe
    - CONHOST.EXE
    - 7z.exe
    - 7za.exe
    - WinRAR.exe
    - wevtutil.exe
    - net.exe
    - net1.exe
    - netsh.exe
    - InstallUtil.exe
  filter:
    Image|endswith:
    - \cmd.exe
    - \conhost.exe
    - \7z.exe
    - \7za.exe
    - \WinRAR.exe
    - \wevtutil.exe
    - \net.exe
    - \net1.exe
    - \netsh.exe
    - \InstallUtil.exe
  condition: selection and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: 36480ae1-a1cb-4eaa-a0d6-29801d7e9142
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_renamed_binary.yml
falsepositives:
- Custom applications use renamed binaries adding slight change to binary name. Typically
  this is easy to spot and add to whitelist
notes:
  quarantine_reason: 'upstream status: test'
