id: sigmahq-sigma-fef394cd-f44d-4040-9b18-95d92fe278c0
name: Potential DLL Sideloading Of DbgModel.DLL
description: Detects potential DLL sideloading of "DbgModel.dll"
severity: medium
enabled: false
tags:
  mitre:
  - T1574.001
  categories:
  - endpoint
references:
- https://hijacklibs.net/entries/microsoft/built-in/dbgmodel.html
logsource:
  product: windows
  category: image_load
detection:
  selection:
    ImageLoaded|endswith: \dbgmodel.dll
  filter_main_generic:
    ImageLoaded|startswith:
    - C:\Windows\System32\
    - C:\Windows\SysWOW64\
    - C:\Windows\WinSxS\
  filter_optional_windbg:
    ImageLoaded|startswith: C:\Program Files\WindowsApps\Microsoft.WinDbg_
  filter_optional_windows_kits:
    ImageLoaded|startswith:
    - C:\Program Files (x86)\Windows Kits\
    - C:\Program Files\Windows Kits\
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
provenance:
  source: SigmaHQ/sigma
  source_id: fef394cd-f44d-4040-9b18-95d92fe278c0
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/image_load/image_load_side_load_dbgmodel.yml
falsepositives:
- Legitimate applications loading their own versions of the DLL mentioned in this
  rule
notes:
  quarantine_reason: 'upstream status: test'
