id: sigmahq-sigma-312b42b1-bded-4441-8b58-163a3af58775
name: Potentially Suspicious Execution From Tmp Folder
description: Detects a potentially suspicious execution of a process located in the
  '/tmp/' folder
severity: medium
enabled: false
tags:
  mitre:
  - T1036
  categories:
  - endpoint
references:
- https://blogs.jpcert.or.jp/en/2023/05/gobrat.html
- https://jstnk9.github.io/jstnk9/research/GobRAT-Malware/
- https://www.virustotal.com/gui/file/60bcd645450e4c846238cf0e7226dc40c84c96eba99f6b2cffcd0ab4a391c8b3/detection
- https://www.virustotal.com/gui/file/3e44c807a25a56f4068b5b8186eee5002eed6f26d665a8b791c472ad154585d1/detection
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    Image|startswith: /tmp/
  filter_optional_nextcloud:
    Image|endswith: /usr/bin/nextcloud
  condition: selection and not 1 of filter_optional_*
provenance:
  source: SigmaHQ/sigma
  source_id: 312b42b1-bded-4441-8b58-163a3af58775
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/process_creation/proc_creation_lnx_susp_execution_tmp_folder.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
