id: sigmahq-sigma-c6714a24-d7d5-4283-a36b-3ffd091d5f7e
name: Potential PHP Reverse Shell
description: 'Detects usage of the PHP CLI with the "-r" flag which allows it to run
  inline PHP code. The rule looks for calls to the "fsockopen" function which allows
  the creation of sockets.

  Attackers often leverage this in combination with functions such as "exec" or "fopen"
  to initiate a reverse shell connection.'
severity: high
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://pentestmonkey.net/cheat-sheet/shells/reverse-shell-cheat-sheet
- https://www.revshells.com/
logsource:
  category: process_creation
  product: linux
detection:
  selection:
    Image|contains: /php
    CommandLine|contains|all:
    - ' -r '
    - fsockopen
    CommandLine|contains:
    - ash
    - bash
    - bsh
    - csh
    - ksh
    - pdksh
    - sh
    - tcsh
    - zsh
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: c6714a24-d7d5-4283-a36b-3ffd091d5f7e
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/process_creation/proc_creation_lnx_php_reverse_shell.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
