id: sigmahq-sigma-f99abdf0-6283-4e71-bd2b-b5c048a94743
name: Potentially Suspicious Office Document Executed From Trusted Location
description: Detects the execution of an Office application that points to a document
  that is located in a trusted location. Attackers often used this to avoid macro
  security and execute their malicious code.
severity: high
enabled: false
tags:
  mitre:
  - T1202
  categories:
  - endpoint
references:
- Internal Research
- https://twitter.com/Max_Mal_/status/1633863678909874176
- https://techcommunity.microsoft.com/t5/microsoft-365-blog/new-security-hardening-policies-for-trusted-documents/ba-p/3023465
- https://twitter.com/_JohnHammond/status/1588155401752788994
logsource:
  category: process_creation
  product: windows
detection:
  selection_parent:
    ParentImage|endswith:
    - \explorer.exe
    - \dopus.exe
  selection_img:
  - Image|endswith:
    - \EXCEL.EXE
    - \POWERPNT.EXE
    - \WINWORD.exe
  - OriginalFileName:
    - Excel.exe
    - POWERPNT.EXE
    - WinWord.exe
  selection_trusted_location:
    CommandLine|contains:
    - \AppData\Roaming\Microsoft\Templates
    - \AppData\Roaming\Microsoft\Word\Startup\
    - \Microsoft Office\root\Templates\
    - \Microsoft Office\Templates\
  filter_main_dotx:
    CommandLine|endswith:
    - .dotx
    - .xltx
    - .potx
  condition: all of selection_* and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: f99abdf0-6283-4e71-bd2b-b5c048a94743
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_office_exec_from_trusted_locations.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
