id: sigmahq-sigma-1327381e-6ab0-4f38-b583-4c1b8346a56b
name: Potential Command Line Path Traversal Evasion Attempt
description: Detects potential evasion or obfuscation attempts using bogus path traversal
  via the commandline
severity: medium
enabled: false
tags:
  mitre:
  - T1036
  categories:
  - endpoint
references:
- https://twitter.com/hexacorn/status/1448037865435320323
- https://twitter.com/Gal_B1t/status/1062971006078345217
logsource:
  category: process_creation
  product: windows
detection:
  selection_1:
    Image|contains: \Windows\
    CommandLine|contains:
    - \..\Windows\
    - \..\System32\
    - \..\..\
  selection_2:
    CommandLine|contains: .exe\..\
  filter_optional_google_drive:
    CommandLine|contains: \Google\Drive\googledrivesync.exe\..\
  filter_optional_citrix:
    CommandLine|contains: \Citrix\Virtual Smart Card\Citrix.Authentication.VirtualSmartcard.Launcher.exe\..\
  condition: 1 of selection_* and not 1 of filter_optional_*
provenance:
  source: SigmaHQ/sigma
  source_id: 1327381e-6ab0-4f38-b583-4c1b8346a56b
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_susp_commandline_path_traversal_evasion.yml
falsepositives:
- Google Drive
- Citrix
notes:
  quarantine_reason: 'upstream status: test'
