id: sigmahq-sigma-e8314f79-564d-4f79-bc13-fbc0bf2660d8
name: Potential PowerShell Obfuscation Using Character Join
description: Detects specific techniques often seen used inside of PowerShell scripts
  to obfscuate Alias creation
severity: low
enabled: false
tags:
  mitre:
  - T1027
  - T1059.001
  categories:
  - endpoint
references:
- Internal Research
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection:
    ScriptBlockText|contains|all:
    - -Alias
    - ' -Value (-join('
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: e8314f79-564d-4f79-bc13-fbc0bf2660d8
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_susp_alias_obfscuation.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
