id: sigmahq-sigma-09a910bf-f71f-4737-9c40-88880ba5913d
name: Potential Base64 Decoded From Images
description: Detects the use of tail to extract bytes at an offset from an image and
  then decode the base64 value to create a new file with the decoded content. The
  detected execution is a bash one-liner.
severity: high
enabled: false
tags:
  mitre:
  - T1140
  categories:
  - endpoint
references:
- https://www.virustotal.com/gui/file/16bafdf741e7a13137c489f3c8db1334f171c7cb13b62617d691b0a64783cc48/behavior
- https://www.virustotal.com/gui/file/483fafc64a2b84197e1ef6a3f51e443f84dc5742602e08b9e8ec6ad690b34ed0/behavior
logsource:
  product: macos
  category: process_creation
detection:
  selection_image:
    Image|endswith: /bash
  selection_view:
    CommandLine|contains|all:
    - tail
    - -c
  selection_b64:
    CommandLine|contains|all:
    - base64
    - -d
    - '>'
  selection_files:
    CommandLine|contains:
    - .avif
    - .gif
    - .jfif
    - .jpeg
    - .jpg
    - .pjp
    - .pjpeg
    - .png
    - .svg
    - .webp
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 09a910bf-f71f-4737-9c40-88880ba5913d
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/macos/process_creation/proc_creation_macos_tail_base64_decode_from_image.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
