id: sigmahq-sigma-62e0298b-e994-4189-bc87-bc699aa62d97
name: Potential Suspicious Registry File Imported Via Reg.EXE
description: Detects the import of '.reg' files from suspicious paths using the 'reg.exe'
  utility
severity: medium
enabled: false
tags:
  mitre:
  - T1112
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/reg-import
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \reg.exe
  - OriginalFileName: reg.exe
  selection_cli:
    CommandLine|contains: ' import '
  selection_paths:
    CommandLine|contains:
    - C:\Users\
    - '%temp%'
    - '%tmp%'
    - '%appdata%'
    - \AppData\Local\Temp\
    - C:\Windows\Temp\
    - C:\ProgramData\
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 62e0298b-e994-4189-bc87-bc699aa62d97
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_reg_import_from_suspicious_paths.yml
falsepositives:
- Legitimate import of keys
notes:
  quarantine_reason: 'upstream status: test'
