id: sigmahq-sigma-8b9606c9-28be-4a38-b146-0e313cc232c1
name: Potential Ransomware Activity Using LegalNotice Message
description: Detect changes to the "LegalNoticeCaption" or "LegalNoticeText" registry
  values where the message set contains keywords often used in ransomware ransom messages
severity: high
enabled: false
tags:
  mitre:
  - T1491.001
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/5c1e6f1b4fafd01c8d1ece85f510160fc1275fbf/atomics/T1491.001/T1491.001.md
logsource:
  product: windows
  category: registry_set
detection:
  selection:
    TargetObject|contains:
    - \SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\System\LegalNoticeCaption
    - \SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\System\LegalNoticeText
    Details|contains:
    - encrypted
    - Unlock-Password
    - paying
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 8b9606c9-28be-4a38-b146-0e313cc232c1
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_legalnotice_susp_message.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
