id: sigmahq-sigma-189e3b02-82b2-4b90-9662-411eb64486d4
name: Potential Invoke-Mimikatz PowerShell Script
description: Detects Invoke-Mimikatz PowerShell script and alike. Mimikatz is a credential
  dumper capable of obtaining plaintext Windows account logins and passwords.
severity: high
enabled: false
tags:
  mitre:
  - T1003
  categories:
  - endpoint
references:
- https://www.elastic.co/guide/en/security/current/potential-invoke-mimikatz-powershell-script.html#potential-invoke-mimikatz-powershell-script
logsource:
  category: ps_script
  product: windows
detection:
  selection_1:
    ScriptBlockText|contains|all:
    - DumpCreds
    - DumpCerts
  selection_2:
    ScriptBlockText|contains: sekurlsa::logonpasswords
  selection_3:
    ScriptBlockText|contains|all:
    - crypto::certificates
    - CERT_SYSTEM_STORE_LOCAL_MACHINE
  condition: 1 of selection*
provenance:
  source: SigmaHQ/sigma
  source_id: 189e3b02-82b2-4b90-9662-411eb64486d4
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_potential_invoke_mimikatz.yml
falsepositives:
- Mimikatz can be useful for testing the security of networks
notes:
  quarantine_reason: 'upstream status: test'
