id: sigmahq-sigma-a77c1610-fc73-4019-8e29-0f51efc04a51
name: Potential Dosfuscation Activity
description: Detects possible payload obfuscation via the commandline
severity: medium
enabled: false
tags:
  mitre:
  - T1059
  categories:
  - endpoint
references:
- https://www.fireeye.com/content/dam/fireeye-www/blog/pdfs/dosfuscation-report.pdf
- https://github.com/danielbohannon/Invoke-DOSfuscation
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains:
    - ^^
    - ^|^
    - ',;,'
    - ;;;;
    - ;; ;;
    - (,(,
    - '%COMSPEC:~'
    - ' c^m^d'
    - ^c^m^d
    - ' c^md'
    - ' cm^d'
    - ^cm^d
    - ' s^et '
    - ' s^e^t '
    - ' se^t '
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: a77c1610-fc73-4019-8e29-0f51efc04a51
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_cmd_dosfuscation.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
