id: sigmahq-sigma-844f8eb2-610b-42c8-89a4-47596e089663
name: Potential ShellDispatch.DLL Sideloading
description: Detects potential DLL sideloading of "ShellDispatch.dll"
severity: medium
enabled: false
tags:
  mitre:
  - T1574.001
  categories:
  - endpoint
references:
- https://www.hexacorn.com/blog/2023/06/07/this-lolbin-doesnt-exist/
logsource:
  category: image_load
  product: windows
detection:
  selection:
    ImageLoaded|endswith: \ShellDispatch.dll
  filter_main_legit_path:
  - ImageLoaded|contains|all:
    - :\Users\
    - \AppData\Local\Temp\
  - ImageLoaded|contains: :\Windows\Temp\
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 844f8eb2-610b-42c8-89a4-47596e089663
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/image_load/image_load_side_load_shelldispatch.yml
falsepositives:
- Some installers may trigger some false positives
notes:
  quarantine_reason: 'upstream status: test'
