id: sigmahq-sigma-0cb8d736-995d-4ce7-a31e-1e8d452a1459
name: Potential EventLog File Location Tampering
description: Detects tampering with EventLog service "file" key. In order to change
  the default location of an Evtx file. This technique is used to tamper with log
  collection and alerting
severity: high
enabled: false
tags:
  mitre:
  - T1685.001
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/windows/win32/eventlog/eventlog-key
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains: \SYSTEM\CurrentControlSet\Services\EventLog\
    TargetObject|endswith: \File
  filter:
    Details|contains: \System32\Winevt\Logs\
  condition: selection and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: 0cb8d736-995d-4ce7-a31e-1e8d452a1459
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_evtx_file_key_tamper.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
