id: sigmahq-sigma-dfb5b4e8-91d0-4291-b40a-e3b0d3942c45
name: Potential Persistence Via Shim Database Modification
description: 'Adversaries may establish persistence and/or elevate privileges by executing
  malicious content triggered by application shims.

  The Microsoft Windows Application Compatibility Infrastructure/Framework (Application
  Shim) was created to allow for backward compatibility of software as the operating
  system codebase changes over time'
severity: medium
enabled: false
tags:
  mitre:
  - T1546.011
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1546.011/T1546.011.md#atomic-test-3---registry-key-creation-andor-modification-events-for-sdb
- https://www.fireeye.com/blog/threat-research/2017/05/fin7-shim-databases-persistence.html
- https://andreafortuna.org/2018/11/12/process-injection-and-persistence-using-application-shimming/
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains:
    - \SOFTWARE\Microsoft\Windows NT\CurrentVersion\AppCompatFlags\InstalledSDB\
    - \SOFTWARE\Microsoft\Windows NT\CurrentVersion\AppCompatFlags\Custom\
  filter_main_empty_string:
    Details: ''
  filter_main_empty_value:
    Details: (Empty)
  filter_main_null:
    Details: null
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: dfb5b4e8-91d0-4291-b40a-e3b0d3942c45
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_persistence_shim_database.yml
falsepositives:
- Legitimate custom SHIM installations will also trigger this rule
notes:
  quarantine_reason: 'upstream status: test'
