id: sigmahq-sigma-e22a6eb2-f8a5-44b5-8b44-a2dbd47b1144
name: Potential MsiExec Masquerading
description: Detects the execution of msiexec.exe from an uncommon directory
severity: high
enabled: false
tags:
  mitre:
  - T1036.005
  categories:
  - endpoint
references:
- https://twitter.com/200_okay_/status/1194765831911215104
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Image|endswith: \msiexec.exe
  - OriginalFileName: \msiexec.exe
  filter:
    Image|startswith:
    - C:\Windows\System32\
    - C:\Windows\SysWOW64\
    - C:\Windows\WinSxS\
  condition: selection and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: e22a6eb2-f8a5-44b5-8b44-a2dbd47b1144
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_msiexec_masquerading.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
