id: sigmahq-sigma-0ea52357-cd59-4340-9981-c46c7e900428
name: Potentially Suspicious Rundll32.EXE Execution of UDL File
description: 'Detects the execution of rundll32.exe with the oledb32.dll library to
  open a UDL file.

  Threat actors can abuse this technique as a phishing vector to capture authentication
  credentials or other sensitive data.'
severity: medium
enabled: false
tags:
  mitre:
  - T1218.011
  - T1071
  categories:
  - endpoint
references:
- https://trustedsec.com/blog/oops-i-udld-it-again
logsource:
  category: process_creation
  product: windows
detection:
  selection_parent:
    ParentImage|endswith: \explorer.exe
  selection_img:
  - Image|endswith: \rundll32.exe
  - OriginalFileName: RUNDLL32.EXE
  selection_cli:
    CommandLine|contains|all:
    - oledb32.dll
    - ',OpenDSLFile '
    - \\Users\\*\\Downloads\\
    CommandLine|endswith: .udl
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 0ea52357-cd59-4340-9981-c46c7e900428
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_rundll32_udl_exec.yml
falsepositives:
- UDL files serve as a convenient and flexible tool for managing and testing database
  connections in various development and administrative scenarios.
notes:
  quarantine_reason: 'upstream status: test'
