id: sigmahq-sigma-3e8207c5-fcd2-4ea6-9418-15d45b4890e4
name: Potential Data Stealing Via Chromium Headless Debugging
description: Detects chromium based browsers starting in headless and debugging mode
  and pointing to a user profile. This could be a sign of data stealing or remote
  control
severity: high
enabled: false
tags:
  mitre:
  - T1185
  - T1564.003
  categories:
  - endpoint
references:
- https://github.com/defaultnamehere/cookie_crimes/
- https://mango.pdf.zone/stealing-chrome-cookies-without-a-password
- https://embracethered.com/blog/posts/2020/cookie-crimes-on-mirosoft-edge/
- https://embracethered.com/blog/posts/2020/chrome-spy-remote-control/
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains|all:
    - --remote-debugging-
    - --user-data-dir
    - --headless
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 3e8207c5-fcd2-4ea6-9418-15d45b4890e4
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_browsers_chromium_headless_debugging.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
