id: sigmahq-sigma-2f77047c-e6e9-4c11-b088-a3de399524cd
name: Potential Persistence Via Security Descriptors - ScriptBlock
description: Detects usage of certain functions and keywords that are used to manipulate
  security descriptors in order to potentially set a backdoor. As seen used in the
  DAMP project.
severity: high
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://github.com/HarmJ0y/DAMP
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection:
    ScriptBlockText|contains|all:
    - win32_Trustee
    - win32_Ace
    - .AccessMask
    - .AceType
    - .SetSecurityDescriptor
    ScriptBlockText|contains:
    - \Lsa\JD
    - \Lsa\Skew1
    - \Lsa\Data
    - \Lsa\GBG
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 2f77047c-e6e9-4c11-b088-a3de399524cd
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_susp_ace_tampering.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
