id: sigmahq-sigma-55c925c1-7195-426b-a136-a9396800e29b
name: Potential Suspicious Windows Feature Enabled
description: 'Detects usage of the built-in PowerShell cmdlet "Enable-WindowsOptionalFeature"
  used as a Deployment Image Servicing and Management tool.

  Similar to DISM.exe, this cmdlet is used to enumerate, install, uninstall, configure,
  and update features and packages in Windows images'
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/powershell/module/dism/enable-windowsoptionalfeature?view=windowsserver2022-ps
- https://learn.microsoft.com/en-us/windows/win32/projfs/enabling-windows-projected-file-system
- https://learn.microsoft.com/en-us/windows/wsl/install-on-server
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection_cmd:
    ScriptBlockText|contains|all:
    - Enable-WindowsOptionalFeature
    - -Online
    - -FeatureName
  selection_feature:
    ScriptBlockText|contains:
    - TelnetServer
    - Internet-Explorer-Optional-amd64
    - TFTP
    - SMB1Protocol
    - Client-ProjFS
    - Microsoft-Windows-Subsystem-Linux
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 55c925c1-7195-426b-a136-a9396800e29b
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_enable_susp_windows_optional_feature.yml
falsepositives:
- Legitimate usage of the features listed in the rule.
notes:
  quarantine_reason: 'upstream status: test'
