id: sigmahq-sigma-4c21b805-4dd7-469f-b47d-7383a8fcb437
name: Potential Iviewers.DLL Sideloading
description: Detects potential DLL sideloading of "iviewers.dll" (OLE/COM Object Interface
  Viewer)
severity: high
enabled: false
tags:
  mitre:
  - T1574.001
  categories:
  - endpoint
references:
- https://www.secureworks.com/research/shadowpad-malware-analysis
logsource:
  category: image_load
  product: windows
detection:
  selection:
    ImageLoaded|endswith: \iviewers.dll
  filter:
    ImageLoaded|startswith:
    - C:\Program Files (x86)\Windows Kits\
    - C:\Program Files\Windows Kits\
  condition: selection and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: 4c21b805-4dd7-469f-b47d-7383a8fcb437
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/image_load/image_load_side_load_iviewers.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
