id: sigmahq-sigma-e173ad47-4388-4012-ae62-bd13f71c18a8
name: Potential DLL Sideloading Via DeviceEnroller.EXE
description: 'Detects the use of the PhoneDeepLink parameter to potentially sideload
  a DLL file that does not exist. This non-existent DLL file is named "ShellChromeAPI.dll".

  Adversaries can drop their own renamed DLL and execute it via DeviceEnroller.exe
  using this parameter'
severity: medium
enabled: false
tags:
  mitre:
  - T1574.001
  categories:
  - endpoint
references:
- https://mobile.twitter.com/0gtweet/status/1564131230941122561
- https://strontic.github.io/xcyclopedia/library/DeviceEnroller.exe-24BEF0D6B0ECED36BB41831759FDE18D.html
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \deviceenroller.exe
  - OriginalFileName: deviceenroller.exe
  selection_cli:
    CommandLine|contains: /PhoneDeepLink
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: e173ad47-4388-4012-ae62-bd13f71c18a8
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_deviceenroller_dll_sideloading.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
