id: sigmahq-sigma-ba1f7802-adc7-48b4-9ecb-81e227fddfd5
name: Potential Network Sniffing Activity Using Network Tools
description: 'Detects potential network sniffing via use of network tools such as
  "tshark", "windump".

  Network sniffing refers to using the network interface on a system to monitor or
  capture information sent over a wired or wireless connection.

  An adversary may place a network interface into promiscuous mode to passively access
  data in transit over the network, or use span ports to capture a larger amount of
  data.'
severity: medium
enabled: false
tags:
  mitre:
  - T1040
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1040/T1040.md
logsource:
  category: process_creation
  product: windows
detection:
  selection_tshark:
    Image|endswith: \tshark.exe
    CommandLine|contains: -i
  selection_windump:
    Image|endswith: \windump.exe
  condition: 1 of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: ba1f7802-adc7-48b4-9ecb-81e227fddfd5
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_susp_network_sniffing.yml
falsepositives:
- Legitimate administration activity to troubleshoot network issues
notes:
  quarantine_reason: 'upstream status: test'
