id: sigmahq-sigma-6b6976a3-b0e6-4723-ac24-ae38a737af41
name: Potential Persistence Via Shim Database In Uncommon Location
description: Detects the installation of a new shim database where the file is located
  in a non-default location
severity: high
enabled: false
tags:
  mitre:
  - T1546.011
  categories:
  - endpoint
references:
- https://www.fireeye.com/blog/threat-research/2017/05/fin7-shim-databases-persistence.html
- https://andreafortuna.org/2018/11/12/process-injection-and-persistence-using-application-shimming/
- https://www.blackhat.com/docs/asia-14/materials/Erickson/Asia-14-Erickson-Persist-It-Using-And-Abusing-Microsofts-Fix-It-Patches.pdf
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains|all:
    - \SOFTWARE\Microsoft\Windows NT\CurrentVersion\AppCompatFlags\InstalledSDB\
    - \DatabasePath
  filter_main_known_locations:
    Details|contains: :\Windows\AppPatch\Custom
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 6b6976a3-b0e6-4723-ac24-ae38a737af41
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_persistence_shim_database_uncommon_location.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
