id: sigmahq-sigma-fe20dda1-6f37-4379-bbe0-a98d400cae90
name: Potential Persistence Via Scrobj.dll COM Hijacking
description: Detect use of scrobj.dll as this DLL looks for the ScriptletURL key to
  get the location of the script to execute
severity: medium
enabled: false
tags:
  mitre:
  - T1546.015
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1546.015/T1546.015.md
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|endswith: InprocServer32\(Default)
    Details: C:\WINDOWS\system32\scrobj.dll
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: fe20dda1-6f37-4379-bbe0-a98d400cae90
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_persistence_scrobj_dll.yml
falsepositives:
- Legitimate use of the dll.
notes:
  quarantine_reason: 'upstream status: test'
