id: sigmahq-sigma-f7375e28-5c14-432f-b8d1-1db26c832df3
name: Potential Arbitrary DLL Load Using Winword
description: Detects potential DLL sideloading using the Microsoft Office winword
  process via the '/l' flag.
severity: medium
enabled: false
tags:
  mitre:
  - T1202
  categories:
  - endpoint
references:
- https://github.com/D4Vinci/One-Lin3r/blob/9fdfa5f0b9c698dfbd4cdfe7d2473192777ae1c6/one_lin3r/core/liners/windows/cmd/dll_loader_word.py
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \WINWORD.exe
  - OriginalFileName: WinWord.exe
  selection_dll:
    CommandLine|contains|all:
    - '/l '
    - .dll
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: f7375e28-5c14-432f-b8d1-1db26c832df3
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_office_winword_dll_load.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
