id: sigmahq-sigma-07f8bdc2-c9b3-472a-9817-5a670b872f53
name: Potential Reconnaissance For Cached Credentials Via Cmdkey.EXE
description: Detects usage of cmdkey to look for cached credentials on the system
severity: high
enabled: false
tags:
  mitre:
  - T1003.005
  categories:
  - endpoint
references:
- https://www.peew.pw/blog/2017/11/26/exploring-cmdkey-an-edge-case-for-privilege-escalation
- https://technet.microsoft.com/en-us/library/cc754243(v=ws.11).aspx
- https://github.com/redcanaryco/atomic-red-team/blob/b27a3cb25025161d49ac861cb216db68c46a3537/atomics/T1003.005/T1003.005.md#atomic-test-1---cached-credential-dump-via-cmdkey
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \cmdkey.exe
  - OriginalFileName: cmdkey.exe
  selection_cli:
    CommandLine|contains|windash: ' -l'
  condition: all of selection*
provenance:
  source: SigmaHQ/sigma
  source_id: 07f8bdc2-c9b3-472a-9817-5a670b872f53
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_cmdkey_recon.yml
falsepositives:
- Legitimate administrative tasks
notes:
  quarantine_reason: 'upstream status: test'
