id: sigmahq-sigma-fdbf0b9d-0182-4c43-893b-a1eaab92d085
name: Potential Persistence Via Custom Protocol Handler
description: Detects potential persistence activity via the registering of a new custom
  protocole handlers. While legitimate applications register protocole handlers often
  times during installation. And attacker can abuse this by setting a custom handler
  to be used as a persistence mechanism.
severity: medium
enabled: false
tags:
  mitre:
  - T1112
  categories:
  - endpoint
references:
- https://ladydebug.com/blog/2019/06/21/custom-protocol-handler-cph/
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|startswith: HKCR\
    Details|startswith: 'URL:'
  filter_main_ms_trusted:
    Details|startswith: URL:ms-
  filter_main_generic_locations:
    Image|startswith:
    - C:\Program Files (x86)
    - C:\Program Files\
    - C:\Windows\System32\
    - C:\Windows\SysWOW64\
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: fdbf0b9d-0182-4c43-893b-a1eaab92d085
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_persistence_custom_protocol_handler.yml
falsepositives:
- Many legitimate applications can register a new custom protocol handler. Additional
  filters needs to applied according to your environment.
notes:
  quarantine_reason: 'upstream status: test'
