id: sigmahq-sigma-259dda31-b7a3-444f-b7d8-17f96e8a7d0d
name: Potential RjvPlatform.DLL Sideloading From Default Location
description: Detects loading of "RjvPlatform.dll" by the "SystemResetPlatform.exe"
  binary which can be abused as a method of DLL side loading since the "$SysReset"
  directory isn't created by default.
severity: medium
enabled: false
tags:
  mitre:
  - T1574.001
  categories:
  - endpoint
references:
- https://twitter.com/0gtweet/status/1666716511988330499
logsource:
  category: image_load
  product: windows
detection:
  selection:
    Image: C:\Windows\System32\SystemResetPlatform\SystemResetPlatform.exe
    ImageLoaded: C:\$SysReset\Framework\Stack\RjvPlatform.dll
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 259dda31-b7a3-444f-b7d8-17f96e8a7d0d
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/image_load/image_load_side_load_rjvplatform_default_location.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
