id: sigmahq-sigma-2dd2c217-bf68-437a-b57c-fe9fd01d5de8
name: Potentially Suspicious Regsvr32 HTTP IP Pattern
description: Detects regsvr32 execution to download and install DLLs located remotely
  where the address is an IP address.
severity: high
enabled: false
tags:
  mitre:
  - T1218.010
  categories:
  - endpoint
references:
- https://twitter.com/mrd0x/status/1461041276514623491
- https://twitter.com/tccontre18/status/1480950986650832903
- https://lolbas-project.github.io/lolbas/Binaries/Regsvr32/
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \regsvr32.exe
  - OriginalFileName: REGSVR32.EXE
  selection_ip:
    CommandLine|contains:
    - ' /i:http://1'
    - ' /i:http://2'
    - ' /i:http://3'
    - ' /i:http://4'
    - ' /i:http://5'
    - ' /i:http://6'
    - ' /i:http://7'
    - ' /i:http://8'
    - ' /i:http://9'
    - ' /i:https://1'
    - ' /i:https://2'
    - ' /i:https://3'
    - ' /i:https://4'
    - ' /i:https://5'
    - ' /i:https://6'
    - ' /i:https://7'
    - ' /i:https://8'
    - ' /i:https://9'
    - ' -i:http://1'
    - ' -i:http://2'
    - ' -i:http://3'
    - ' -i:http://4'
    - ' -i:http://5'
    - ' -i:http://6'
    - ' -i:http://7'
    - ' -i:http://8'
    - ' -i:http://9'
    - ' -i:https://1'
    - ' -i:https://2'
    - ' -i:https://3'
    - ' -i:https://4'
    - ' -i:https://5'
    - ' -i:https://6'
    - ' -i:https://7'
    - ' -i:https://8'
    - ' -i:https://9'
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 2dd2c217-bf68-437a-b57c-fe9fd01d5de8
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_regsvr32_http_ip_pattern.yml
falsepositives:
- FQDNs that start with a number such as "7-Zip"
notes:
  quarantine_reason: 'upstream status: test'
