id: sigmahq-sigma-225274c4-8dd1-40db-9e09-71dff4f6fb3c
name: Potential Defense Evasion Activity Via Emoji Usage In CommandLine - 4
description: Detects the usage of emojis in the command line, this could be a sign
  of potential defense evasion activity.
severity: high
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- Internal Research
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    CommandLine|contains:
    - 🔸
    - 🔹
    - 🔶
    - 🔷
    - 🔳
    - 🔲
    - ▪️
    - ▫️
    - ◾️
    - ◽️
    - ◼️
    - ◻️
    - 🟥
    - 🟧
    - 🟨
    - 🟩
    - 🟦
    - 🟪
    - ⬛️
    - ⬜️
    - 🟫
    - 🔈
    - 🔇
    - 🔉
    - 🔊
    - 🔔
    - 🔕
    - 📣
    - 📢
    - 👁‍🗨
    - 💬
    - 💭
    - 🗯
    - ♠️
    - ♣️
    - ♥️
    - ♦️
    - 🃏
    - 🎴
    - 🀄️
    - 🕐
    - 🕑
    - 🕒
    - 🕓
    - 🕔
    - 🕕
    - 🕖
    - 🕗
    - 🕘
    - 🕙
    - 🕚
    - 🕛
    - 🕜
    - 🕝
    - 🕞
    - 🕟
    - 🕠
    - 🕡
    - 🕢
    - 🕣
    - 🕤
    - 🕥
    - 🕦
    - 🕧✢
    - ✣
    - ✤
    - ✥
    - ✦
    - ✧
    - ★
    - ☆
    - ✯
    - ✡︎
    - ✩
    - ✪
    - ✫
    - ✬
    - ✭
    - ✮
    - ✶
    - ✷
    - ✵
    - ✸
    - ✹
    - →
    - ⇒
    - ⟹
    - ⇨
    - ⇾
    - ➾
    - ⇢
    - ☛
    - ☞
    - ➔
    - ➜
    - ➙
    - ➛
    - ➝
    - ➞
    - ♠︎
    - ♣︎
    - ♥︎
    - ♦︎
    - ♤
    - ♧
    - ♡
    - ♢
    - ♚
    - ♛
    - ♜
    - ♝
    - ♞
    - ♟
    - ♔
    - ♕
    - ♖
    - ♗
    - ♘
    - ♙
    - ⚀
    - ⚁
    - ⚂
    - ⚃
    - ⚄
    - ⚅
    - 🂠
    - ⚈
    - ⚉
    - ⚆
    - ⚇
    - 𓀀
    - 𓀁
    - 𓀂
    - 𓀃
    - 𓀄
    - 𓀅
    - 𓀆
    - 𓀇
    - 𓀈
    - 𓀉
    - 𓀊
    - 𓀋
    - 𓀌
    - 𓀍
    - 𓀎
    - 𓀏
    - 𓀐
    - 𓀑
    - 𓀒
    - 𓀓
    - 𓀔
    - 𓀕
    - 𓀖
    - 𓀗
    - 𓀘
    - 𓀙
    - 𓀚
    - 𓀛
    - 𓀜
    - 𓀝🏳️
    - 🏴
    - 🏁
    - 🚩
    - 🏳️‍🌈
    - 🏳️‍⚧️
    - 🏴‍☠️
    - 🇦🇫
    - 🇦🇽
    - 🇦🇱
    - 🇩🇿
    - 🇦🇸
    - 🇦🇩
    - 🇦🇴
    - 🇦🇮
    - 🇦🇶
    - 🇦🇬
    - 🇦🇷
    - 🇦🇲
    - 🇦🇼
    - 🇦🇺
    - 🇦🇹
    - 🇦🇿
    - 🇧🇸
    - 🇧🇭
    - 🇧🇩
    - 🇧🇧
    - 🇧🇾
    - 🇧🇪
    - 🇧🇿
    - 🇧🇯
    - 🇧🇲
    - 🇧🇹
    - 🇧🇴
    - 🇧🇦
    - 🇧🇼
    - 🇧🇷
    - 🇮🇴
    - 🇻🇬
    - 🇧🇳
    - 🇧🇬
    - 🇧🇫
    - 🇧🇮
    - 🇰🇭
    - 🇨🇲
    - 🇨🇦
    - 🇮🇨
    - 🇨🇻
    - 🇧🇶
    - 🇰🇾
    - 🇨🇫
    - 🇹🇩
    - 🇨🇱
    - 🇨🇳
    - 🇨🇽
    - 🇨🇨
    - 🇨🇴
    - 🇰🇲
    - 🇨🇬
    - 🇨🇩
    - 🇨🇰
    - 🇨🇷
    - 🇨🇮
    - 🇭🇷
    - 🇨🇺
    - 🇨🇼
    - 🇨🇾
    - 🇨🇿
    - 🇩🇰
    - 🇩🇯
    - 🇩🇲
    - 🇩🇴
    - 🇪🇨
    - 🇪🇬
    - 🇸🇻
    - 🇬🇶
    - 🇪🇷
    - 🇪🇪
    - 🇪🇹
    - 🇪🇺
    - 🇫🇰
    - 🇫🇴
    - 🇫🇯
    - 🇫🇮
    - 🇫🇷
    - 🇬🇫
    - 🇵🇫
    - 🇹🇫
    - 🇬🇦
    - 🇬🇲
    - 🇬🇪
    - 🇩🇪
    - 🇬🇭
    - 🇬🇮
    - 🇬🇷
    - 🇬🇱
    - 🇬🇩
    - 🇬🇵
    - 🇬🇺
    - 🇬🇹
    - 🇬🇬
    - 🇬🇳
    - 🇬🇼
    - 🇬🇾
    - 🇭🇹
    - 🇭🇳
    - 🇭🇰
    - 🇭🇺
    - 🇮🇸
    - 🇮🇳
    - 🇮🇩
    - 🇮🇷
    - 🇮🇶
    - 🇮🇪
    - 🇮🇲
    - 🇮🇱
    - 🇮🇹
    - 🇯🇲
    - 🇯🇵
    - 🎌
    - 🇯🇪
    - 🇯🇴
    - 🇰🇿
    - 🇰🇪
    - 🇰🇮
    - 🇽🇰
    - 🇰🇼
    - 🇰🇬
    - 🇱🇦
    - 🇱🇻
    - 🇱🇧
    - 🇱🇸
    - 🇱🇷
    - 🇱🇾
    - 🇱🇮
    - 🇱🇹
    - 🇱🇺
    - 🇲🇴
    - 🇲🇰
    - 🇲🇬
    - 🇲🇼
    - 🇲🇾
    - 🇲🇻
    - 🇲🇱
    - 🇲🇹
    - 🇲🇭
    - 🇲🇶
    - 🇲🇷
    - 🇲🇺
    - 🇾🇹
    - 🇲🇽
    - 🇫🇲
    - 🇲🇩
    - 🇲🇨
    - 🇲🇳
    - 🇲🇪
    - 🇲🇸
    - 🇲🇦
    - 🇲🇿
    - 🇲🇲
    - 🇳🇦
    - 🇳🇷
    - 🇳🇵
    - 🇳🇱
    - 🇳🇨
    - 🇳🇿
    - 🇳🇮
    - 🇳🇪
    - 🇳🇬
    - 🇳🇺
    - 🇳🇫
    - 🇰🇵
    - 🇲🇵
    - 🇳🇴
    - 🇴🇲
    - 🇵🇰
    - 🇵🇼
    - 🇵🇸
    - 🇵🇦
    - 🇵🇬
    - 🇵🇾
    - 🇵🇪
    - 🇵🇭
    - 🇵🇳
    - 🇵🇱
    - 🇵🇹
    - 🇵🇷
    - 🇶🇦
    - 🇷🇪
    - 🇷🇴
    - 🇷🇺
    - 🇷🇼
    - 🇼🇸
    - 🇸🇲
    - 🇸🇦
    - 🇸🇳
    - 🇷🇸
    - 🇸🇨
    - 🇸🇱
    - 🇸🇬
    - 🇸🇽
    - 🇸🇰
    - 🇸🇮
    - 🇬🇸
    - 🇸🇧
    - 🇸🇴
    - 🇿🇦
    - 🇰🇷
    - 🇸🇸
    - 🇪🇸
    - 🇱🇰
    - 🇧🇱
    - 🇸🇭
    - 🇰🇳
    - 🇱🇨
    - 🇵🇲
    - 🇻🇨
    - 🇸🇩
    - 🇸🇷
    - 🇸🇿
    - 🇸🇪
    - 🇨🇭
    - 🇸🇾
    - 🇹🇼
    - 🇹🇯
    - 🇹🇿
    - 🇹🇭
    - 🇹🇱
    - 🇹🇬
    - 🇹🇰
    - 🇹🇴
    - 🇹🇹
    - 🇹🇳
    - 🇹🇷
    - 🇹🇲
    - 🇹🇨
    - 🇹🇻
    - 🇻🇮
    - 🇺🇬
    - 🇺🇦
    - 🇦🇪
    - 🇬🇧
    - 🏴󠁧󠁢󠁥󠁮󠁧󠁿
    - 🏴󠁧󠁢󠁳󠁣󠁴󠁿
    - 🏴󠁧󠁢󠁷󠁬󠁳󠁿
    - 🇺🇳
    - 🇺🇸
    - 🇺🇾
    - 🇺🇿
    - 🇻🇺
    - 🇻🇦
    - 🇻🇪
    - 🇻🇳
    - 🇼🇫
    - 🇪🇭
    - 🇾🇪
    - 🇿🇲
    - 🇿🇼🫠
    - 🫢
    - 🫣
    - 🫡
    - 🫥
    - 🫤
    - 🥹
    - 🫱
    - 🫱🏻
    - 🫱🏼
    - 🫱🏽
    - 🫱🏾
    - 🫱🏿
    - 🫲
    - 🫲🏻
    - 🫲🏼
    - 🫲🏽
    - 🫲🏾
    - 🫲🏿
    - 🫳
    - 🫳🏻
    - 🫳🏼
    - 🫳🏽
    - 🫳🏾
    - 🫳🏿
    - 🫴
    - 🫴🏻
    - 🫴🏼
    - 🫴🏽
    - 🫴🏾
    - 🫴🏿
    - 🫰
    - 🫰🏻
    - 🫰🏼
    - 🫰🏽
    - 🫰🏾
    - 🫰🏿
    - 🫵
    - 🫵🏻
    - 🫵🏼
    - 🫵🏽
    - 🫵🏾
    - 🫵🏿
    - 🫶
    - 🫶🏻
    - 🫶🏼
    - 🫶🏽
    - 🫶🏾
    - 🫶🏿
    - 🤝🏻
    - 🤝🏼
    - 🤝🏽
    - 🤝🏾
    - 🤝🏿
    - 🫱🏻‍🫲🏼
    - 🫱🏻‍🫲🏽
    - 🫱🏻‍🫲🏾
    - 🫱🏻‍🫲🏿
    - 🫱🏼‍🫲🏻
    - 🫱🏼‍🫲🏽
    - 🫱🏼‍🫲🏾
    - 🫱🏼‍🫲🏿
    - 🫱🏽‍🫲🏻
    - 🫱🏽‍🫲🏼
    - 🫱🏽‍🫲🏾
    - 🫱🏽‍🫲🏿
    - 🫱🏾‍🫲🏻
    - 🫱🏾‍🫲🏼
    - 🫱🏾‍🫲🏽
    - 🫱🏾‍🫲🏿
    - 🫱🏿‍🫲🏻
    - 🫱🏿‍🫲🏼
    - 🫱🏿‍🫲🏽
    - 🫱🏿‍🫲🏾
    - 🫦
    - 🫅
    - 🫅🏻
    - 🫅🏼
    - 🫅🏽
    - 🫅🏾
    - 🫅🏿
    - 🫃
    - 🫃🏻
    - 🫃🏼
    - 🫃🏽
    - 🫃🏾
    - 🫃🏿
    - 🫄
    - 🫄🏻
    - 🫄🏼
    - 🫄🏽
    - 🫄🏾
    - 🫄🏿
    - 🧌
    - 🪸
    - 🪷
    - 🪹
    - 🪺
    - 🫘
    - 🫗
    - 🫙
    - 🛝
    - 🛞
    - 🛟
    - 🪬
    - 🪩
    - 🪫
    - 🩼
    - 🩻
    - 🫧
    - 🪪
    - 🟰
    - 😮‍💨
    - 😵‍💫
    - 😶‍🌫️
    - ❤️‍🔥
    - ❤️‍🩹
    - 🧔‍♀️
    - 🧔🏻‍♀️
    - 🧔🏼‍♀️
    - 🧔🏽‍♀️
    - 🧔🏾‍♀️
    - 🧔🏿‍♀️
    - 🧔‍♂️
    - 🧔🏻‍♂️
    - 🧔🏼‍♂️
    - 🧔🏽‍♂️
    - 🧔🏾‍♂️
    - 🧔🏿‍♂️
    - 💑🏻
    - 💑🏼
    - 💑🏽
    - 💑🏾
    - 💑🏿
    - 💏🏻
    - 💏🏼
    - 💏🏽
    - 💏🏾
    - 💏🏿
    - 👨🏻‍❤️‍👨🏻
    - 👨🏻‍❤️‍👨🏼
    - 👨🏻‍❤️‍👨🏽
    - 👨🏻‍❤️‍👨🏾
    - 👨🏻‍❤️‍👨🏿
    - 👨🏼‍❤️‍👨🏻
    - 👨🏼‍❤️‍👨🏼
    - 👨🏼‍❤️‍👨🏽
    - 👨🏼‍❤️‍👨🏾
    - 👨🏼‍❤️‍👨🏿
    - 👨🏽‍❤️‍👨🏻
    - 👨🏽‍❤️‍👨🏼
    - 👨🏽‍❤️‍👨🏽
    - 👨🏽‍❤️‍👨🏾
    - 👨🏽‍❤️‍👨🏿
    - 👨🏾‍❤️‍👨🏻
    - 👨🏾‍❤️‍👨🏼
    - 👨🏾‍❤️‍👨🏽
    - 👨🏾‍❤️‍👨🏾
    - 👨🏾‍❤️‍👨🏿
    - 👨🏿‍❤️‍👨🏻
    - 👨🏿‍❤️‍👨🏼
    - 👨🏿‍❤️‍👨🏽
    - 👨🏿‍❤️‍👨🏾
    - 👨🏿‍❤️‍👨🏿
    - 👩🏻‍❤️‍👨🏻
    - 👩🏻‍❤️‍👨🏼
    - 👩🏻‍❤️‍👨🏽
    - 👩🏻‍❤️‍👨🏾
    - 👩🏻‍❤️‍👨🏿
    - 👩🏻‍❤️‍👩🏻
    - 👩🏻‍❤️‍👩🏼
    - 👩🏻‍❤️‍👩🏽
    - 👩🏻‍❤️‍👩🏾
    - 👩🏻‍❤️‍👩🏿
    - 👩🏼‍❤️‍👨🏻
    - 👩🏼‍❤️‍👨🏼
    - 👩🏼‍❤️‍👨🏽
    - 👩🏼‍❤️‍👨🏾
    - 👩🏼‍❤️‍👨🏿
    - 👩🏼‍❤️‍👩🏻
    - 👩🏼‍❤️‍👩🏼
    - 👩🏼‍❤️‍👩🏽
    - 👩🏼‍❤️‍👩🏾
    - 👩🏼‍❤️‍👩🏿
    - 👩🏽‍❤️‍👨🏻
    - 👩🏽‍❤️‍👨🏼
    - 👩🏽‍❤️‍👨🏽
    - 👩🏽‍❤️‍👨🏾
    - 👩🏽‍❤️‍👨🏿
    - 👩🏽‍❤️‍👩🏻
    - 👩🏽‍❤️‍👩🏼
    - 👩🏽‍❤️‍👩🏽
    - 👩🏽‍❤️‍👩🏾
    - 👩🏽‍❤️‍👩🏿
    - 👩🏾‍❤️‍👨🏻
    - 👩🏾‍❤️‍👨🏼
    - 👩🏾‍❤️‍👨🏽
    - 👩🏾‍❤️‍👨🏾
    - 👩🏾‍❤️‍👨🏿
    - 👩🏾‍❤️‍👩🏻
    - 👩🏾‍❤️‍👩🏼
    - 👩🏾‍❤️‍👩🏽
    - 👩🏾‍❤️‍👩🏾
    - 👩🏾‍❤️‍👩🏿
    - 👩🏿‍❤️‍👨🏻
    - 👩🏿‍❤️‍👨🏼
    - 👩🏿‍❤️‍👨🏽
    - 👩🏿‍❤️‍👨🏾
    - 👩🏿‍❤️‍👨🏿
    - 👩🏿‍❤️‍👩🏻
    - 👩🏿‍❤️‍👩🏼
    - 👩🏿‍❤️‍👩🏽
    - 👩🏿‍❤️‍👩🏾
    - 👩🏿‍❤️‍👩🏿
    - 🧑🏻‍❤️‍🧑🏼
    - 🧑🏻‍❤️‍🧑🏽
    - 🧑🏻‍❤️‍🧑🏾
    - 🧑🏻‍❤️‍🧑🏿
    - 🧑🏼‍❤️‍🧑🏻
    - 🧑🏼‍❤️‍🧑🏽
    - 🧑🏼‍❤️‍🧑🏾
    - 🧑🏼‍❤️‍🧑🏿
    - 🧑🏽‍❤️‍🧑🏻
    - 🧑🏽‍❤️‍🧑🏼
    - 🧑🏽‍❤️‍🧑🏾
    - 🧑🏽‍❤️‍🧑🏿
    - 🧑🏾‍❤️‍🧑🏻
    - 🧑🏾‍❤️‍🧑🏼
    - 🧑🏾‍❤️‍🧑🏽
    - 🧑🏾‍❤️‍🧑🏿
    - 🧑🏿‍❤️‍🧑🏻
    - 🧑🏿‍❤️‍🧑🏼
    - 🧑🏿‍❤️‍🧑🏽
    - 🧑🏿‍❤️‍🧑🏾
    - 👨🏻‍❤️‍💋‍👨🏻
    - 👨🏻‍❤️‍💋‍👨🏼
    - 👨🏻‍❤️‍💋‍👨🏽
    - 👨🏻‍❤️‍💋‍👨🏾
    - 👨🏻‍❤️‍💋‍👨🏿
    - 👨🏼‍❤️‍💋‍👨🏻
    - 👨🏼‍❤️‍💋‍👨🏼
    - 👨🏼‍❤️‍💋‍👨🏽
    - 👨🏼‍❤️‍💋‍👨🏾
    - 👨🏼‍❤️‍💋‍👨🏿
    - 👨🏽‍❤️‍💋‍👨🏻
    - 👨🏽‍❤️‍💋‍👨🏼
    - 👨🏽‍❤️‍💋‍👨🏽
    - 👨🏽‍❤️‍💋‍👨🏾
    - 👨🏽‍❤️‍💋‍👨🏿
    - 👨🏾‍❤️‍💋‍👨🏻
    - 👨🏾‍❤️‍💋‍👨🏼
    - 👨🏾‍❤️‍💋‍👨🏽
    - 👨🏾‍❤️‍💋‍👨🏾
    - 👨🏾‍❤️‍💋‍👨🏿
    - 👨🏿‍❤️‍💋‍👨🏻
    - 👨🏿‍❤️‍💋‍👨🏼
    - 👨🏿‍❤️‍💋‍👨🏽
    - 👨🏿‍❤️‍💋‍👨🏾
    - 👨🏿‍❤️‍💋‍👨🏿
    - 👩🏻‍❤️‍💋‍👨🏻
    - 👩🏻‍❤️‍💋‍👨🏼
    - 👩🏻‍❤️‍💋‍👨🏽
    - 👩🏻‍❤️‍💋‍👨🏾
    - 👩🏻‍❤️‍💋‍👨🏿
    - 👩🏻‍❤️‍💋‍👩🏻
    - 👩🏻‍❤️‍💋‍👩🏼
    - 👩🏻‍❤️‍💋‍👩🏽
    - 👩🏻‍❤️‍💋‍👩🏾
    - 👩🏻‍❤️‍💋‍👩🏿
    - 👩🏼‍❤️‍💋‍👨🏻
    - 👩🏼‍❤️‍💋‍👨🏼
    - 👩🏼‍❤️‍💋‍👨🏽
    - 👩🏼‍❤️‍💋‍👨🏾
    - 👩🏼‍❤️‍💋‍👨🏿
    - 👩🏼‍❤️‍💋‍👩🏻
    - 👩🏼‍❤️‍💋‍👩🏼
    - 👩🏼‍❤️‍💋‍👩🏽
    - 👩🏼‍❤️‍💋‍👩🏾
    - 👩🏼‍❤️‍💋‍👩🏿
    - 👩🏽‍❤️‍💋‍👨🏻
    - 👩🏽‍❤️‍💋‍👨🏼
    - 👩🏽‍❤️‍💋‍👨🏽
    - 👩🏽‍❤️‍💋‍👨🏾
    - 👩🏽‍❤️‍💋‍👨🏿
    - 👩🏽‍❤️‍💋‍👩🏻
    - 👩🏽‍❤️‍💋‍👩🏼
    - 👩🏽‍❤️‍💋‍👩🏽
    - 👩🏽‍❤️‍💋‍👩🏾
    - 👩🏽‍❤️‍💋‍👩🏿
    - 👩🏾‍❤️‍💋‍👨🏻
    - 👩🏾‍❤️‍💋‍👨🏼
    - 👩🏾‍❤️‍💋‍👨🏽
    - 👩🏾‍❤️‍💋‍👨🏾
    - 👩🏾‍❤️‍💋‍👨🏿
    - 👩🏾‍❤️‍💋‍👩🏻
    - 👩🏾‍❤️‍💋‍👩🏼
    - 👩🏾‍❤️‍💋‍👩🏽
    - 👩🏾‍❤️‍💋‍👩🏾
    - 👩🏾‍❤️‍💋‍👩🏿
    - 👩🏿‍❤️‍💋‍👨🏻
    - 👩🏿‍❤️‍💋‍👨🏼
    - 👩🏿‍❤️‍💋‍👨🏽
    - 👩🏿‍❤️‍💋‍👨🏾
    - 👩🏿‍❤️‍💋‍👨🏿
    - 👩🏿‍❤️‍💋‍👩🏻
    - 👩🏿‍❤️‍💋‍👩🏼
    - 👩🏿‍❤️‍💋‍👩🏽
    - 👩🏿‍❤️‍💋‍👩🏾
    - 👩🏿‍❤️‍💋‍👩🏿
    - 🧑🏻‍❤️‍💋‍🧑🏼
    - 🧑🏻‍❤️‍💋‍🧑🏽
    - 🧑🏻‍❤️‍💋‍🧑🏾
    - 🧑🏻‍❤️‍💋‍🧑🏿
    - 🧑🏼‍❤️‍💋‍🧑🏻
    - 🧑🏼‍❤️‍💋‍🧑🏽
    - 🧑🏼‍❤️‍💋‍🧑🏾
    - 🧑🏼‍❤️‍💋‍🧑🏿
    - 🧑🏽‍❤️‍💋‍🧑🏻
    - 🧑🏽‍❤️‍💋‍🧑🏼
    - 🧑🏽‍❤️‍💋‍🧑🏾
    - 🧑🏽‍❤️‍💋‍🧑🏿
    - 🧑🏾‍❤️‍💋‍🧑🏻
    - 🧑🏾‍❤️‍💋‍🧑🏼
    - 🧑🏾‍❤️‍💋‍🧑🏽
    - 🧑🏾‍❤️‍💋‍🧑🏿
    - 🧑🏿‍❤️‍💋‍🧑🏻
    - 🧑🏿‍❤️‍💋‍🧑🏼
    - 🧑🏿‍❤️‍💋‍🧑🏽
    - 🧑🏿‍❤️‍💋‍🧑🏾
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 225274c4-8dd1-40db-9e09-71dff4f6fb3c
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_susp_emoji_usage_in_cli_4.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
