id: sigmahq-sigma-7f734ed0-4f47-46c0-837f-6ee62505abd9
name: Potential Netcat Reverse Shell Execution
description: Detects execution of netcat with the "-e" flag followed by common shells.
  This could be a sign of a potential reverse shell setup.
severity: high
enabled: false
tags:
  mitre:
  - T1059
  categories:
  - endpoint
references:
- https://pentestmonkey.net/cheat-sheet/shells/reverse-shell-cheat-sheet
- https://www.revshells.com/
- https://www.hackingtutorials.org/networking/hacking-netcat-part-2-bind-reverse-shells/
- https://www.infosecademy.com/netcat-reverse-shells/
- https://man7.org/linux/man-pages/man1/ncat.1.html
logsource:
  category: process_creation
  product: linux
detection:
  selection_nc:
    Image|endswith:
    - /nc
    - /ncat
  selection_flags:
    CommandLine|contains:
    - ' -c '
    - ' -e '
  selection_shell:
    CommandLine|contains:
    - ' ash'
    - ' bash'
    - ' bsh'
    - ' csh'
    - ' ksh'
    - ' pdksh'
    - ' sh'
    - ' tcsh'
    - /bin/ash
    - /bin/bash
    - /bin/bsh
    - /bin/csh
    - /bin/ksh
    - /bin/pdksh
    - /bin/sh
    - /bin/tcsh
    - /bin/zsh
    - $IFSash
    - $IFSbash
    - $IFSbsh
    - $IFScsh
    - $IFSksh
    - $IFSpdksh
    - $IFSsh
    - $IFStcsh
    - $IFSzsh
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 7f734ed0-4f47-46c0-837f-6ee62505abd9
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/process_creation/proc_creation_lnx_netcat_reverse_shell.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
