id: sigmahq-sigma-ca5583e9-8f80-46ac-ab91-7f314d13b984
name: Potentially Suspicious Child Process of KeyScrambler.exe
description: Detects potentially suspicious child processes of KeyScrambler.exe
severity: medium
enabled: false
tags:
  mitre:
  - T1203
  - T1574.001
  categories:
  - endpoint
references:
- https://twitter.com/DTCERT/status/1712785421845790799
logsource:
  category: process_creation
  product: windows
detection:
  selection_parent:
    ParentImage|endswith: \KeyScrambler.exe
  selection_binaries:
  - Image|endswith:
    - \cmd.exe
    - \cscript.exe
    - \mshta.exe
    - \powershell.exe
    - \pwsh.exe
    - \regsvr32.exe
    - \rundll32.exe
    - \wscript.exe
  - OriginalFileName:
    - Cmd.Exe
    - cscript.exe
    - mshta.exe
    - PowerShell.EXE
    - pwsh.dll
    - regsvr32.exe
    - RUNDLL32.EXE
    - wscript.exe
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: ca5583e9-8f80-46ac-ab91-7f314d13b984
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_keyscrambler_susp_child_process.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
