id: sigmahq-sigma-a7df0e9e-91a5-459a-a003-4cde67c2ff5d
name: Potentially Suspicious Command Executed Via Run Dialog Box - Registry
description: 'Detects execution of commands via the run dialog box on Windows by checking
  values of the "RunMRU" registry key.

  This technique was seen being abused by threat actors to deceive users into pasting
  and executing malicious commands, often disguised as CAPTCHA verification steps.'
severity: high
enabled: false
tags:
  mitre:
  - T1059.001
  categories:
  - endpoint
references:
- https://medium.com/@ahmed.moh.farou2/fake-captcha-campaign-on-arabic-pirated-movie-sites-delivers-lumma-stealer-4f203f7adabf
- https://medium.com/@shaherzakaria8/downloading-trojan-lumma-infostealer-through-capatcha-1f25255a0e71
- https://www.forensafe.com/blogs/runmrukey.html
- https://redcanary.com/blog/threat-intelligence/intelligence-insights-october-2024/
logsource:
  product: windows
  category: registry_set
detection:
  selection_key:
    TargetObject|contains: \Microsoft\Windows\CurrentVersion\Explorer\RunMRU
  selection_powershell_command:
    Details|contains:
    - powershell
    - pwsh
  selection_powershell_susp_keywords:
    Details|contains:
    - ' -e '
    - ' -ec '
    - ' -en '
    - ' -enc '
    - ' -enco'
    - ftp
    - Hidden
    - http
    - iex
    - Invoke-
  selection_wmic_command:
    Details|contains: wmic
  selection_wmic_susp_keywords:
    Details|contains:
    - shadowcopy
    - process call create
  condition: selection_key and (all of selection_powershell_* or all of selection_wmic_*)
provenance:
  source: SigmaHQ/sigma
  source_id: a7df0e9e-91a5-459a-a003-4cde67c2ff5d
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_runmru_susp_command_execution.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
