id: sigmahq-sigma-4f6edb78-5c21-42ab-a558-fd2a6fc1fd57
name: Potential 7za.DLL Sideloading
description: Detects potential DLL sideloading of "7za.dll"
severity: low
enabled: false
tags:
  mitre:
  - T1574.001
  categories:
  - endpoint
references:
- https://www.gov.pl/attachment/ee91f24d-3e67-436d-aa50-7fa56acf789d
logsource:
  category: image_load
  product: windows
detection:
  selection:
    ImageLoaded|endswith: \7za.dll
  filter_main_legit_path:
    Image|startswith:
    - C:\Program Files (x86)\
    - C:\Program Files\
    ImageLoaded|startswith:
    - C:\Program Files (x86)\
    - C:\Program Files\
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 4f6edb78-5c21-42ab-a558-fd2a6fc1fd57
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/image_load/image_load_side_load_7za.yml
falsepositives:
- Legitimate third party application located in "AppData" may leverage this DLL to
  offer 7z compression functionality and may generate false positives. Apply additional
  filters as needed.
notes:
  quarantine_reason: 'upstream status: test'
