id: sigmahq-sigma-707e097c-e20f-4f67-8807-1f72ff4500d6
name: Potential Persistence Via App Paths Default Property
description: 'Detects changes to the "Default" property for keys located in the \Software\Microsoft\Windows\CurrentVersion\App
  Paths\ registry. Which might be used as a method of persistence

  The entries found under App Paths are used primarily for the following purposes.

  First, to map an application''s executable file name to that file''s fully qualified
  path.

  Second, to prepend information to the PATH environment variable on a per-application,
  per-process basis.'
severity: high
enabled: false
tags:
  mitre:
  - T1546.012
  categories:
  - endpoint
references:
- https://www.hexacorn.com/blog/2013/01/19/beyond-good-ol-run-key-part-3/
- https://learn.microsoft.com/en-us/windows/win32/shell/app-registration
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains: \SOFTWARE\Microsoft\Windows\CurrentVersion\App Paths
    TargetObject|endswith:
    - (Default)
    - Path
    Details|contains:
    - \Users\Public
    - \AppData\Local\Temp\
    - \Windows\Temp\
    - \Desktop\
    - \Downloads\
    - '%temp%'
    - '%tmp%'
    - iex
    - Invoke-
    - rundll32
    - regsvr32
    - mshta
    - cscript
    - wscript
    - .bat
    - .hta
    - .dll
    - .ps1
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 707e097c-e20f-4f67-8807-1f72ff4500d6
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_persistence_app_paths.yml
falsepositives:
- Legitimate applications registering their binary from on of the suspicious locations
  mentioned above (tune it)
notes:
  quarantine_reason: 'upstream status: test'
