id: sigmahq-sigma-9313dc13-d04c-46d8-af4a-a930cc55d93b
name: Potential DLL Sideloading Via VMware Xfer
description: Detects loading of a DLL by the VMware Xfer utility from the non-default
  directory which may be an attempt to sideload arbitrary DLL
severity: high
enabled: false
tags:
  mitre:
  - T1574.001
  categories:
  - endpoint
references:
- https://www.sentinelone.com/labs/lockbit-ransomware-side-loads-cobalt-strike-beacon-with-legitimate-vmware-utility/
logsource:
  product: windows
  category: image_load
detection:
  selection:
    Image|endswith: \VMwareXferlogs.exe
    ImageLoaded|endswith: \glib-2.0.dll
  filter:
    ImageLoaded|startswith: C:\Program Files\VMware\
  condition: selection and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: 9313dc13-d04c-46d8-af4a-a930cc55d93b
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/image_load/image_load_side_load_vmware_xfer.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
