id: sigmahq-sigma-f38ce0b9-5e97-4b47-a211-7dc8d8b871da
name: Potential RDP Tunneling Via Plink
description: Execution of plink to perform data exfiltration and tunneling
severity: high
enabled: false
tags:
  mitre:
  - T1572
  categories:
  - endpoint
references:
- https://www.microsoft.com/security/blog/2022/07/26/malicious-iis-extensions-quietly-open-persistent-backdoors-into-servers/
logsource:
  category: process_creation
  product: windows
detection:
  selection_a:
    Image|endswith: \plink.exe
    CommandLine|contains: :127.0.0.1:3389
  selection_b1:
    Image|endswith: \plink.exe
    CommandLine|contains: :3389
  selection_b2:
    CommandLine|contains:
    - ' -P 443'
    - ' -P 22'
  condition: selection_a or all of selection_b*
provenance:
  source: SigmaHQ/sigma
  source_id: f38ce0b9-5e97-4b47-a211-7dc8d8b871da
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_plink_susp_tunneling.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
