id: sigmahq-sigma-8e1cb247-6cf6-42fa-b440-3f27d57e9936
name: Potential Persistence Via Microsoft Office Add-In
description: Detects potential persistence activity via startup add-ins that load
  when Microsoft Office starts (.wll/.xll are simply .dll fit for Word or Excel).
severity: high
enabled: false
tags:
  mitre:
  - T1137.006
  categories:
  - endpoint
references:
- Internal Research
- https://labs.withsecure.com/publications/add-in-opportunities-for-office-persistence
- https://github.com/redcanaryco/atomic-red-team/blob/4ae9580a1a8772db87a1b6cdb0d03e5af231e966/atomics/T1137.006/T1137.006.md
logsource:
  category: file_event
  product: windows
detection:
  selection_wlldropped:
    TargetFilename|contains: \Microsoft\Word\Startup\
    TargetFilename|endswith: .wll
  selection_xlldropped:
    TargetFilename|contains: \Microsoft\Excel\Startup\
    TargetFilename|endswith: .xll
  selection_xladropped:
    TargetFilename|contains: Microsoft\Excel\XLSTART\
    TargetFilename|endswith: .xlam
  selection_generic:
    TargetFilename|contains: \Microsoft\Addins\
    TargetFilename|endswith:
    - .xlam
    - .xla
    - .ppam
  condition: 1 of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 8e1cb247-6cf6-42fa-b440-3f27d57e9936
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_office_addin_persistence.yml
falsepositives:
- Legitimate add-ins
notes:
  quarantine_reason: 'upstream status: test'
