id: sigmahq-sigma-01c42d3c-242d-4655-85b2-34f1739632f7
name: Potentially Over Permissive Permissions Granted Using Dsacls.EXE
description: Detects usage of Dsacls to grant over permissive permissions
severity: medium
enabled: false
tags:
  mitre:
  - T1218
  categories:
  - endpoint
references:
- https://ss64.com/nt/dsacls.html
- https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/cc771151(v=ws.11)
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \dsacls.exe
  - OriginalFileName: DSACLS.EXE
  selection_flag:
    CommandLine|contains: ' /G '
  selection_permissions:
    CommandLine|contains:
    - GR
    - GE
    - GW
    - GA
    - WP
    - WD
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 01c42d3c-242d-4655-85b2-34f1739632f7
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_dsacls_abuse_permissions.yml
falsepositives:
- Legitimate administrators granting over permissive permissions to users
notes:
  quarantine_reason: 'upstream status: test'
