id: sigmahq-sigma-96cd126d-f970-49c4-848a-da3a09f55c55
name: Potential PowerShell Obfuscation Using Alias Cmdlets
description: Detects Set-Alias or New-Alias cmdlet usage. Which can be use as a mean
  to obfuscate PowerShell scripts
severity: low
enabled: false
tags:
  mitre:
  - T1027
  - T1059.001
  categories:
  - endpoint
references:
- https://github.com/1337Rin/Swag-PSO
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection:
    ScriptBlockText|contains:
    - 'Set-Alias '
    - 'New-Alias '
  filter_main_cim:
    ScriptBlockText:
    - Set-Alias -Name ncms -Value New-CimSession -Option ReadOnly, AllScope -ErrorAction
      SilentlyContinue
    - Set-Alias -Name gcls -Value Get-CimClass -Option ReadOnly, AllScope -ErrorAction
      SilentlyContinue
    - Set-Alias -Name ncso -Value New-CimSessionOption -Option ReadOnly, AllScope
      -ErrorAction SilentlyContinue
    - Set-Alias -Name gcms -Value Get-CimSession -Option ReadOnly, AllScope -ErrorAction
      SilentlyContinue
    - Set-Alias -Name rcms -Value Remove-cimSession -Option ReadOnly, AllScope -ErrorAction
      SilentlyContinue
    - Set-Alias -Name rcie -Value Register-CimIndicationEvent -Option ReadOnly, AllScope
      -ErrorAction SilentlyContinue
    - Set-Alias -Name gcai -Value Get-CimAssociatedInstance -Option ReadOnly, AllScope
      -ErrorAction SilentlyContinue
    - Set-Alias -Name gcim -Value Get-CimInstance -Option ReadOnly, AllScope -ErrorAction
      SilentlyContinue
    - Set-Alias -Name scim -Value Set-CimInstance -Option ReadOnly, AllScope -ErrorAction
      SilentlyContinue
    - Set-Alias -Name ncim -Value New-CimInstance -Option ReadOnly, AllScope -ErrorAction
      SilentlyContinue
    - Set-Alias -Name rcim -Value Remove-cimInstance -Option ReadOnly, AllScope -ErrorAction
      SilentlyContinue
    - Set-Alias -Name icim -Value Invoke-CimMethod -Option ReadOnly, AllScope -ErrorAction
      SilentlyContinue
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 96cd126d-f970-49c4-848a-da3a09f55c55
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_susp_set_alias.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
