id: sigmahq-sigma-a6a39bdb-935c-4f0a-ab77-35f4bbf44d33
name: Potentially Suspicious Powershell Script Execution From Temp Folder
description: Detects a potentially suspicious powershell script executions from temporary
  folder
severity: medium
enabled: false
tags:
  mitre:
  - T1059.001
  categories:
  - endpoint
references:
- https://www.microsoft.com/security/blog/2021/07/13/microsoft-discovers-threat-actor-targeting-solarwinds-serv-u-software-with-0-day-exploit/
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith:
    - \powershell.exe
    - \pwsh.exe
    CommandLine|contains:
    - \Windows\Temp
    - \Temporary Internet
    - \AppData\Local\Temp
    - \AppData\Roaming\Temp
    - '%TEMP%'
    - '%TMP%'
    - '%LocalAppData%\Temp'
  filter_optional_vscode:
    CommandLine|contains: -WindowStyle hidden -Verb runAs
  filter_optional_amazon_ec2:
    CommandLine|contains: \Windows\system32\config\systemprofile\AppData\Local\Temp\Amazon\EC2-Windows\
  filter_optional_generic:
    CommandLine|contains:
    - ' >'
    - Out-File
    - ConvertTo-Json
  filter_optional_chocolatey_installer:
    ParentImage:
    - C:\Windows\System32\Msiexec.exe
    - C:\Windows\SysWOW64\Msiexec.exe
    Image|endswith: \powershell.exe
    CommandLine|contains|all:
    - -NoProfile -ExecutionPolicy Bypass -Command
    - AppData\Local\Temp\
    - Install-Chocolatey.ps1
  condition: selection and not 1 of filter_optional_*
provenance:
  source: SigmaHQ/sigma
  source_id: a6a39bdb-935c-4f0a-ab77-35f4bbf44d33
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_powershell_script_exec_from_temp_folder.yml
falsepositives:
- Administrative scripts
notes:
  quarantine_reason: 'upstream status: test'
