id: sigmahq-sigma-5a6e1e16-07de-48d8-8aae-faa766c05e88
name: Potential Cookies Session Hijacking
description: Detects execution of "curl.exe" with the "-c" flag in order to save cookie
  data.
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://curl.se/docs/manpage.html
logsource:
  product: windows
  category: process_creation
detection:
  selection_img:
  - Image|endswith: \curl.exe
  - OriginalFileName: curl.exe
  selection_cli:
  - CommandLine|re: \s-c\s
  - CommandLine|contains: --cookie-jar
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 5a6e1e16-07de-48d8-8aae-faa766c05e88
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_curl_cookie_hijacking.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
