id: sigmahq-sigma-5cc90652-4cbd-4241-aa3b-4b462fa5a248
name: Potential Recon Activity Via Nltest.EXE
description: Detects nltest commands that can be used for information discovery
severity: medium
enabled: false
tags:
  mitre:
  - T1016
  - T1482
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/cc731935(v=ws.11)
- https://thedfirreport.com/2021/08/16/trickbot-leads-up-to-fake-1password-installation/
- https://thedfirreport.com/2020/10/18/ryuk-in-5-hours/
- https://book.hacktricks.xyz/windows/basic-cmd-for-pentesters
- https://research.nccgroup.com/2022/08/19/back-in-black-unlocking-a-lockbit-3-0-ransomware-attack/
- https://eqllib.readthedocs.io/en/latest/analytics/03e231a6-74bc-467a-acb1-e5676b0fb55e.html
- https://redcanary.com/blog/how-one-hospital-thwarted-a-ryuk-ransomware-outbreak/
- https://github.com/redcanaryco/atomic-red-team/blob/5360c9d9ffa3b25f6495f7a16e267b719eba2c37/atomics/T1482/T1482.md#atomic-test-2---windows---discover-domain-trusts-with-nltest
logsource:
  category: process_creation
  product: windows
detection:
  selection_nltest:
  - Image|endswith: \nltest.exe
  - OriginalFileName: nltestrk.exe
  selection_recon:
  - CommandLine|contains|all:
    - server
    - query
  - CommandLine|contains:
    - /user
    - all_trusts
    - 'dclist:'
    - 'dnsgetdc:'
    - domain_trusts
    - 'dsgetdc:'
    - parentdomain
    - trusted_domains
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 5cc90652-4cbd-4241-aa3b-4b462fa5a248
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_nltest_recon.yml
falsepositives:
- Legitimate administration use but user and host must be investigated
notes:
  quarantine_reason: 'upstream status: test'
