id: sigmahq-sigma-9f546b25-5f12-4c8d-8532-5893dcb1e4b8
name: Potentially Suspicious Child Process Of DiskShadow.EXE
description: Detects potentially suspicious child processes of "Diskshadow.exe". This
  could be an attempt to bypass parent/child relationship detection or application
  whitelisting rules.
severity: medium
enabled: false
tags:
  mitre:
  - T1218
  categories:
  - endpoint
references:
- https://bohops.com/2018/03/26/diskshadow-the-return-of-vss-evasion-persistence-and-active-directory-database-extraction/
- https://www.ired.team/offensive-security/credential-access-and-credential-dumping/ntds.dit-enumeration
- https://medium.com/@cyberjyot/lolbin-execution-via-diskshadow-f6ff681a27a4
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/diskshadow
- https://www.lifars.com/wp-content/uploads/2022/01/GriefRansomware_Whitepaper-2.pdf
- https://www.zscaler.com/blogs/security-research/technical-analysis-crytox-ransomware
- https://research.checkpoint.com/2022/evilplayout-attack-against-irans-state-broadcaster/
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage|endswith: \diskshadow.exe
    Image|endswith:
    - \certutil.exe
    - \cscript.exe
    - \mshta.exe
    - \powershell.exe
    - \pwsh.exe
    - \regsvr32.exe
    - \rundll32.exe
    - \wscript.exe
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 9f546b25-5f12-4c8d-8532-5893dcb1e4b8
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_diskshadow_child_process_susp.yml
falsepositives:
- False postitve can occur in cases where admin scripts levreage the "exec" flag to
  execute applications
notes:
  quarantine_reason: 'upstream status: test'
