id: sigmahq-sigma-087790e3-3287-436c-bccf-cbd0184a7db1
name: Potential CommandLine Path Traversal Via Cmd.EXE
description: Detects potential path traversal attempt via cmd.exe. Could indicate
  possible command/argument confusion/hijacking
severity: high
enabled: false
tags:
  mitre:
  - T1059.003
  categories:
  - endpoint
references:
- https://hackingiscool.pl/cmdhijack-command-argument-confusion-with-path-traversal-in-cmd-exe/
- https://twitter.com/Oddvarmoe/status/1270633613449723905
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - ParentImage|endswith: \cmd.exe
  - Image|endswith: \cmd.exe
  - OriginalFileName: cmd.exe
  selection_flags:
  - ParentCommandLine|contains:
    - /c
    - /k
    - /r
  - CommandLine|contains:
    - /c
    - /k
    - /r
  selection_path_traversal:
  - ParentCommandLine: /../../
  - CommandLine|contains: /../../
  filter_java:
    CommandLine|contains: \Tasktop\keycloak\bin\/../../jre\bin\java
  condition: all of selection_* and not 1 of filter_*
provenance:
  source: SigmaHQ/sigma
  source_id: 087790e3-3287-436c-bccf-cbd0184a7db1
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_cmd_path_traversal.yml
falsepositives:
- Java tools are known to produce false-positive when loading libraries
notes:
  quarantine_reason: 'upstream status: test'
