id: sigmahq-sigma-5589ab4f-a767-433c-961d-c91f3f704db1
name: Potential SMB Relay Attack Tool Execution
description: Detects different hacktools used for relay attacks on Windows for privilege
  escalation
severity: critical
enabled: false
tags:
  mitre:
  - T1557.001
  categories:
  - endpoint
references:
- https://foxglovesecurity.com/2016/09/26/rotten-potato-privilege-escalation-from-service-accounts-to-system/
- https://pentestlab.blog/2017/04/13/hot-potato/
- https://github.com/ohpe/juicy-potato
- https://hunter2.gitbook.io/darthsidious/other/war-stories/domain-admin-in-30-minutes
- https://hunter2.gitbook.io/darthsidious/execution/responder-with-ntlm-relay-and-empire
- https://www.localpotato.com/
logsource:
  category: process_creation
  product: windows
detection:
  selection_pe:
    Image|contains:
    - PetitPotam
    - RottenPotato
    - HotPotato
    - JuicyPotato
    - \just_dce_
    - Juicy Potato
    - \temp\rot.exe
    - \Potato.exe
    - \SpoolSample.exe
    - \Responder.exe
    - \smbrelayx
    - \ntlmrelayx
    - \LocalPotato
  selection_script:
    CommandLine|contains:
    - Invoke-Tater
    - ' smbrelay'
    - ' ntlmrelay'
    - 'cme smb '
    - ' /ntlm:NTLMhash '
    - Invoke-PetitPotam
    - '.exe -t * -p '
  selection_juicypotato_enum:
    CommandLine|contains: .exe -c "{
    CommandLine|endswith: '}" -z'
  filter_hotpotatoes:
    Image|contains:
    - HotPotatoes6
    - HotPotatoes7
    - 'HotPotatoes '
  condition: 1 of selection_* and not 1 of filter_*
provenance:
  source: SigmaHQ/sigma
  source_id: 5589ab4f-a767-433c-961d-c91f3f704db1
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_hktl_relay_attacks_tools.yml
falsepositives:
- Legitimate files with these rare hacktool names
notes:
  quarantine_reason: 'upstream status: test'
