id: sigmahq-sigma-c539afac-c12a-46ed-b1bd-5a5567c9f045
name: Potential Remote PowerShell Session Initiated
description: 'Detects a process that initiated a network connection over ports 5985
  or 5986 from a non-network service account.

  This could potentially indicates a remote PowerShell connection.'
severity: high
enabled: false
tags:
  mitre:
  - T1059.001
  - T1021.006
  categories:
  - endpoint
references:
- https://threathunterplaybook.com/hunts/windows/190511-RemotePwshExecution/notebook.html
logsource:
  category: network_connection
  product: windows
detection:
  selection:
    DestinationPort:
    - 5985
    - 5986
    Initiated: 'true'
    SourceIsIpv6: 'false'
  filter_main_service_users:
  - User|contains:
    - NETWORK SERVICE
    - NETZWERKDIENST
    - SERVICIO DE RED
    - SERVIZIO DI RETE
  - User|contains|all:
    - SERVICE R
    - SEAU
  filter_main_localhost:
    SourceIp:
    - ::1
    - 127.0.0.1
    DestinationIp:
    - ::1
    - 127.0.0.1
  filter_optional_avast:
    Image:
    - C:\Program Files\Avast Software\Avast\AvastSvc.exe
    - C:\Program Files (x86)\Avast Software\Avast\AvastSvc.exe
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
provenance:
  source: SigmaHQ/sigma
  source_id: c539afac-c12a-46ed-b1bd-5a5567c9f045
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/network_connection/net_connection_win_susp_remote_powershell_session.yml
falsepositives:
- Legitimate usage of remote PowerShell, e.g. remote administration and monitoring.
- Network Service user name of a not-covered localization
notes:
  quarantine_reason: 'upstream status: test'
