id: sigmahq-sigma-a1b1fd53-9c4a-444c-bae0-34a330fc7aa8
name: Potential Persistence Via DLLPathOverride
description: Detects when an attacker adds a new "DLLPathOverride" value to the "Natural
  Language" key in order to achieve persistence which will get invoked by "SearchIndexer.exe"
  process
severity: high
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://persistence-info.github.io/Data/naturallanguage6.html
- https://www.hexacorn.com/blog/2018/12/30/beyond-good-ol-run-key-part-98/
logsource:
  category: registry_set
  product: windows
detection:
  selection_root:
    TargetObject|contains: \SYSTEM\CurrentControlSet\Control\ContentIndex\Language\
  selection_values:
    TargetObject|contains:
    - \StemmerDLLPathOverride
    - \WBDLLPathOverride
    - \StemmerClass
    - \WBreakerClass
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: a1b1fd53-9c4a-444c-bae0-34a330fc7aa8
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_persistence_natural_language.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
