id: sigmahq-sigma-7047d730-036f-4f40-b9d8-1c63e36d5e62
name: Potential Binary Or Script Dropper Via PowerShell
description: Detects PowerShell creating a binary executable or a script file.
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://www.zscaler.com/blogs/security-research/onenote-growing-threat-malware-distribution
logsource:
  product: windows
  category: file_event
detection:
  selection:
    Image|endswith:
    - \powershell.exe
    - \powershell_ise.exe
    - \pwsh.exe
    TargetFilename|endswith:
    - .bat
    - .chm
    - .cmd
    - .com
    - .dll
    - .exe
    - .hta
    - .jar
    - .js
    - .ocx
    - .scr
    - .sys
    - .vbe
    - .vbs
    - .wsf
  filter_main_user_temp:
    TargetFilename|startswith: C:\Users\
    TargetFilename|contains: \AppData\Local\Temp\
    TargetFilename|endswith:
    - .dll
    - .exe
  filter_main_other_temp:
    TargetFilename|startswith:
    - C:\Windows\Temp\
    - C:\Windows\SystemTemp\
    TargetFilename|endswith:
    - .dll
    - .exe
  filter_main_powershell_module:
    TargetFilename|startswith: C:\Users\
    TargetFilename|contains: \WindowsPowerShell\Modules\
    TargetFilename|endswith: .dll
  filter_main_nuget:
    TargetFilename|startswith: C:\Program Files\PackageManagement\ProviderAssemblies\nuget\
    TargetFilename|endswith: \Microsoft.PackageManagement.NuGetProvider.dll
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 7047d730-036f-4f40-b9d8-1c63e36d5e62
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_powershell_drop_binary_or_script.yml
falsepositives:
- False positives will differ depending on the environment and scripts used. Apply
  additional filters accordingly.
notes:
  quarantine_reason: 'upstream status: test'
