id: sigmahq-sigma-e568650b-5dcd-4658-8f34-ded0b1e13992
name: Potential Product Class Reconnaissance Via Wmic.EXE
description: 'Detects the execution of WMIC in order to get a list of firewall, antivirus
  and antispywware products.

  Adversaries often enumerate security products installed on a system to identify
  security controls and potential ways to evade detection or disable protection mechanisms.

  This information helps them plan their next attack steps and choose appropriate
  techniques to bypass security measures.'
severity: medium
enabled: false
tags:
  mitre:
  - T1047
  - T1082
  categories:
  - endpoint
references:
- https://github.com/albertzsigovits/malware-notes/blob/c820c7fea76cf76a861b28ebc77e06100e20ec29/Ransomware/Maze.md
- https://www.hybrid-analysis.com/sample/4be06ecd234e2110bd615649fe4a6fa95403979acf889d7e45a78985eb50acf9?environmentId=1
- https://www.trendmicro.com/en_us/research/25/c/socgholishs-intrusion-techniques-facilitate-distribution-of-rans.html
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \wmic.exe
  - OriginalFileName: wmic.exe
  selection_cli:
    CommandLine|contains:
    - AntiVirusProduct
    - AntiSpywareProduct
    - FirewallProduct
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: e568650b-5dcd-4658-8f34-ded0b1e13992
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_wmic_recon_product_class.yml
falsepositives:
- Legitimate use of wmic.exe for reconnaissance of firewall, antivirus and antispywware
  products.
notes:
  quarantine_reason: 'upstream status: test'
