id: sigmahq-sigma-d7bcd677-645d-4691-a8d4-7a5602b780d1
name: Potential PowerShell Command Line Obfuscation
description: Detects the PowerShell command lines with special characters
severity: high
enabled: false
tags:
  mitre:
  - T1027
  - T1059.001
  categories:
  - endpoint
references:
- https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=64
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - \powershell.exe
    - \pwsh.exe
  - OriginalFileName:
    - PowerShell.EXE
    - pwsh.dll
  selection_re:
  - CommandLine|re: \+.*\+.*\+.*\+.*\+.*\+.*\+.*\+.*\+.*\+.*\+.*\+.*\+.*\+
  - CommandLine|re: \{.*\{.*\{.*\{.*\{.*\{.*\{.*\{.*\{.*\{
  - CommandLine|re: \^.*\^.*\^.*\^.*\^
  - CommandLine|re: '`.*`.*`.*`.*`'
  filter_optional_amazonSSM:
    ParentImage: C:\Program Files\Amazon\SSM\ssm-document-worker.exe
  filter_optional_defender_atp:
    CommandLine|contains:
    - new EventSource("Microsoft.Windows.Sense.Client.Management"
    - public static extern bool InstallELAMCertificateInfo(SafeFileHandle handle);
  condition: all of selection_* and not 1 of filter_optional_*
provenance:
  source: SigmaHQ/sigma
  source_id: d7bcd677-645d-4691-a8d4-7a5602b780d1
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_powershell_cmdline_special_characters.yml
falsepositives:
- Amazon SSM Document Worker
- Windows Defender ATP
notes:
  quarantine_reason: 'upstream status: test'
