id: sigmahq-sigma-fa2559c8-1197-471d-9cdd-05a0273d4522
name: Potential AMSI Bypass Script Using NULL Bits
description: Detects usage of special strings/null bits in order to potentially bypass
  AMSI functionalities
severity: medium
enabled: false
tags:
  mitre:
  - T1685
  categories:
  - endpoint
references:
- https://github.com/r00t-3xp10it/hacking-material-books/blob/43cb1e1932c16ff1f58b755bc9ab6b096046853f/obfuscation/simple_obfuscation.md#amsi-bypass-using-null-bits-satoshi
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection:
    ScriptBlockText|contains:
    - if(0){{{0}}}' -f $(0 -as [char]) +
    - '#<NULL>'
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: fa2559c8-1197-471d-9cdd-05a0273d4522
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_amsi_null_bits_bypass.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
