id: sigmahq-sigma-e4903324-1a10-4ed3-981b-f6fe3be3a2c2
name: Potential Edputil.DLL Sideloading
description: Detects potential DLL sideloading of "edputil.dll"
severity: high
enabled: false
tags:
  mitre:
  - T1574.001
  categories:
  - endpoint
references:
- https://alternativeto.net/news/2023/5/cybercriminals-use-wordpad-vulnerability-to-spread-qbot-malware/
logsource:
  category: image_load
  product: windows
detection:
  selection:
    ImageLoaded|endswith: \edputil.dll
  filter_main_generic:
    ImageLoaded|startswith:
    - C:\Windows\System32\
    - C:\Windows\SysWOW64\
    - C\Windows\WinSxS\
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: e4903324-1a10-4ed3-981b-f6fe3be3a2c2
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/image_load/image_load_side_load_edputil.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
