id: sigmahq-sigma-9ace0707-b560-49b8-b6ca-5148b42f39fb
name: Potential Persistence Via Logon Scripts - Registry
description: Detects creation of "UserInitMprLogonScript" registry value which can
  be used as a persistence method by malicious actors
severity: medium
enabled: false
tags:
  mitre:
  - T1037.001
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1037.001/T1037.001.md
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains: UserInitMprLogonScript
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 9ace0707-b560-49b8-b6ca-5148b42f39fb
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_persistence_logon_scripts_userinitmprlogonscript.yml
falsepositives:
- Investigate the contents of the "UserInitMprLogonScript" value to determine of the
  added script is legitimate
notes:
  quarantine_reason: 'upstream status: test'
