id: sigmahq-sigma-13db8d2e-7723-4c2c-93c1-a4d36994f7ef
name: Potential In-Memory Download And Compile Of Payloads
description: Detects potential in-memory downloading and compiling of applets using
  curl and osacompile as seen used by XCSSET malware
severity: medium
enabled: false
tags:
  mitre:
  - T1059.007
  - T1105
  categories:
  - endpoint
references:
- https://redcanary.com/blog/mac-application-bundles/
logsource:
  category: process_creation
  product: macos
detection:
  selection:
    CommandLine|contains|all:
    - osacompile
    - curl
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 13db8d2e-7723-4c2c-93c1-a4d36994f7ef
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/macos/process_creation/proc_creation_macos_susp_in_memory_download_and_compile.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
