id: sigmahq-sigma-744a188b-0415-4792-896f-11ddb0588dbc
name: Potential Process Injection Via Msra.EXE
description: Detects potential process injection via Microsoft Remote Asssistance
  (Msra.exe) by looking at suspicious child processes spawned from the aforementioned
  process. It has been a target used by many threat actors and used for discovery
  and persistence tactics
severity: high
enabled: false
tags:
  mitre:
  - T1055
  categories:
  - endpoint
references:
- https://www.microsoft.com/security/blog/2021/12/09/a-closer-look-at-qakbots-latest-building-blocks-and-how-to-knock-them-down/
- https://www.fortinet.com/content/dam/fortinet/assets/analyst-reports/ar-qakbot.pdf
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage|endswith: \msra.exe
    ParentCommandLine|endswith: msra.exe
    Image|endswith:
    - \arp.exe
    - \cmd.exe
    - \net.exe
    - \netstat.exe
    - \nslookup.exe
    - \route.exe
    - \schtasks.exe
    - \whoami.exe
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 744a188b-0415-4792-896f-11ddb0588dbc
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_msra_process_injection.yml
falsepositives:
- Legitimate use of Msra.exe
notes:
  quarantine_reason: 'upstream status: test'
