id: sigmahq-sigma-0bb4bbeb-fe52-4044-b40c-430a04577ebe
name: Potentially Suspicious File Download From ZIP TLD
description: Detects the download of a file with a potentially suspicious extension
  from a .zip top level domain.
severity: high
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://twitter.com/cyb3rops/status/1659175181695287297
- https://fabian-voith.de/2020/06/25/sysmon-v11-1-reads-alternate-data-streams/
logsource:
  product: windows
  category: create_stream_hash
detection:
  selection:
    Contents|contains: .zip/
    TargetFilename|contains:
    - .bat:Zone
    - .dat:Zone
    - .dll:Zone
    - .doc:Zone
    - .docm:Zone
    - .exe:Zone
    - .hta:Zone
    - .pptm:Zone
    - .ps1:Zone
    - .rar:Zone
    - .rtf:Zone
    - .sct:Zone
    - .vbe:Zone
    - .vbs:Zone
    - .ws:Zone
    - .wsf:Zone
    - .xll:Zone
    - .xls:Zone
    - .xlsm:Zone
    - .zip:Zone
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 0bb4bbeb-fe52-4044-b40c-430a04577ebe
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/create_stream_hash/create_stream_hash_zip_tld_download.yml
falsepositives:
- Legitimate file downloads from a websites and web services that uses the ".zip"
  top level domain.
notes:
  quarantine_reason: 'upstream status: test'
