id: sigmahq-sigma-a6976974-ea6f-4e97-818e-ea08625c52cb
name: Potential RipZip Attack on Startup Folder
description: 'Detects a phishing attack which expands a ZIP file containing a malicious
  shortcut.

  If the victim expands the ZIP file via the explorer process, then the explorer process
  expands the malicious ZIP file and drops a malicious shortcut redirected to a backdoor
  into the Startup folder.

  Additionally, the file name of the malicious shortcut in Startup folder contains
  {0AFACED1-E828-11D1-9187-B532F1E9575D} meaning the folder shortcut operation.'
severity: high
enabled: false
tags:
  mitre:
  - T1547
  categories:
  - endpoint
references:
- https://twitter.com/jonasLyk/status/1549338335243534336?t=CrmPocBGLbDyE4p6zTX1cg&s=19
logsource:
  category: file_event
  product: windows
detection:
  selection:
    TargetFilename|contains|all:
    - \Microsoft\Windows\Start Menu\Programs\Startup
    - .lnk.{0AFACED1-E828-11D1-9187-B532F1E9575D}
    Image|endswith: \explorer.exe
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: a6976974-ea6f-4e97-818e-ea08625c52cb
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_ripzip_attack.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
