id: sigmahq-sigma-3e2f1b2c-4d5e-11ee-be56-0242ac120002
name: Potential AS-REP Roasting via Kerberos TGT Requests
description: 'Detects suspicious Kerberos TGT requests with pre-authentication disabled
  (Pre-Authentication Type = 0) and Ticket Encryption Type (0x17) i.e, RC4-HMAC.

  This may indicate an AS-REP Roasting attack, where attackers request AS-REP messages
  for accounts without pre-authentication and attempt to crack the encrypted ticket
  offline to recover user passwords.'
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://medium.com/system-weakness/detecting-as-rep-roasting-attacks-b5b3965f9714
- https://www.picussecurity.com/resource/blog/as-rep-roasting-attack-explained-mitre-attack-t1558.004
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4768
    TicketEncryptionType: '0x17'
    ServiceName: krbtgt
    PreAuthType: 0
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 3e2f1b2c-4d5e-11ee-be56-0242ac120002
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/security/win_security_kerberos_asrep_roasting.yml
falsepositives:
- Legacy systems or applications that legitimately use RC4 encryption
- Misconfigured accounts with pre-authentication disabled
notes:
  quarantine_reason: 'upstream status: experimental'
