id: sigmahq-sigma-ac1c92b4-ac81-405a-9978-4604d78cc47e
name: Potential Binary Proxy Execution Via VSDiagnostics.EXE
description: Detects execution of "VSDiagnostics.exe" with the "start" command in
  order to launch and proxy arbitrary binaries.
severity: medium
enabled: false
tags:
  mitre:
  - T1218
  categories:
  - endpoint
references:
- https://twitter.com/0xBoku/status/1679200664013135872
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \VSDiagnostics.exe
  - OriginalFileName: VSDiagnostics.exe
  selection_cli_start:
    CommandLine|contains: start
  selection_cli_launch:
    CommandLine|contains:
    - ' /launch:'
    - ' -launch:'
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: ac1c92b4-ac81-405a-9978-4604d78cc47e
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_vsdiagnostics_execution_proxy.yml
falsepositives:
- Legitimate usage for tracing and diagnostics purposes
notes:
  quarantine_reason: 'upstream status: test'
