id: sigmahq-sigma-05b3e303-faf0-4f4a-9b30-46cc13e69152
name: Potential Persistence Via PowerShell User Profile Using Add-Content
description: Detects calls to "Add-Content" cmdlet in order to modify the content
  of the user profile and potentially adding suspicious commands for persistence
severity: medium
enabled: false
tags:
  mitre:
  - T1546.013
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1546.013/T1546.013.md
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection_add:
    ScriptBlockText|contains: Add-Content $profile
  selection_options:
    ScriptBlockText|contains:
    - '-Value "IEX '
    - -Value "Invoke-Expression
    - -Value "Invoke-WebRequest
    - -Value "Start-Process
    - '-Value ''IEX '
    - -Value 'Invoke-Expression
    - -Value 'Invoke-WebRequest
    - -Value 'Start-Process
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 05b3e303-faf0-4f4a-9b30-46cc13e69152
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_user_profile_tampering.yml
falsepositives:
- Legitimate administration and tuning scripts that aim to add functionality to a
  user PowerShell session
notes:
  quarantine_reason: 'upstream status: test'
