id: sigmahq-sigma-b6457d63-d2a2-4e29-859d-4e7affc153d1
name: Potential Discovery Activity Via Dnscmd.EXE
description: Detects an attempt to leverage dnscmd.exe to enumerate the DNS zones
  of a domain. DNS zones used to host the DNS records for a particular domain.
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/dnscmd
- https://learn.microsoft.com/en-us/azure/dns/dns-zones-records
- https://lolbas-project.github.io/lolbas/Binaries/Dnscmd/
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
    Image|endswith: \dnscmd.exe
  selection_cli:
    CommandLine|contains:
    - /enumrecords
    - /enumzones
    - /ZonePrint
    - /info
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: b6457d63-d2a2-4e29-859d-4e7affc153d1
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_dnscmd_discovery.yml
falsepositives:
- Legitimate administration use
notes:
  quarantine_reason: 'upstream status: test'
