id: sigmahq-sigma-487bb375-12ef-41f6-baae-c6a1572b4dd1
name: Potential Persistence Via Outlook Today Page
description: 'Detects potential persistence activity via outlook today page.

  An attacker can set a custom page to execute arbitrary code and link to it via the
  registry values "URL" and "UserDefinedUrl".'
severity: high
enabled: false
tags:
  mitre:
  - T1112
  categories:
  - endpoint
references:
- https://speakerdeck.com/heirhabarov/hunting-for-persistence-via-microsoft-exchange-server-or-outlook?slide=74
- https://trustedsec.com/blog/specula-turning-outlook-into-a-c2-with-one-registry-change
logsource:
  product: windows
  category: registry_set
detection:
  selection_main:
    TargetObject|contains|all:
    - Software\Microsoft\Office\
    - \Outlook\Today\
  selection_value_stamp:
    TargetObject|endswith: \Stamp
    Details: DWORD (0x00000001)
  selection_value_url:
    TargetObject|endswith:
    - \URL
    - \UserDefinedUrl
  filter_main_office:
    Image|startswith:
    - C:\Program Files\Common Files\Microsoft Shared\ClickToRun\
    - C:\Program Files\Common Files\Microsoft Shared\ClickToRun\Updates\
    Image|endswith: \OfficeClickToRun.exe
  condition: selection_main and 1 of selection_value_* and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 487bb375-12ef-41f6-baae-c6a1572b4dd1
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_persistence_outlook_todaypage.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
