id: sigmahq-sigma-c98f2a0d-e1b8-4f76-90d3-359caf88d6b9
name: Potential Defense Evasion Activity Via Emoji Usage In CommandLine - 2
description: Detects the usage of emojis in the command line, this could be a sign
  of potential defense evasion activity.
severity: high
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- Internal Research
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    CommandLine|contains:
    - 🤷🏼
    - 🤷🏼‍♂️
    - 🙎🏼‍♀️
    - 🙎🏼
    - 🙎🏼‍♂️
    - 🙍🏼‍♀️
    - 🙍🏼
    - 🙍🏼‍♂️
    - 💇🏼‍♀️
    - 💇🏼
    - 💇🏼‍♂️
    - 💆🏼‍♀️
    - 💆🏼
    - 💆🏼‍♂️
    - 🧖🏼‍♀️
    - 🧖🏼
    - 🧖🏼‍♂️
    - 💃🏼
    - 🕺🏼
    - 🕴🏼
    - 👩🏼‍🦽
    - 🧑🏼‍🦽
    - 👨🏼‍🦽
    - 👩🏼‍🦼
    - 🧑🏼‍🦼
    - 👨🏼‍🦼
    - 🚶🏼‍♀️
    - 🚶🏼
    - 🚶🏼‍♂️
    - 👩🏼‍🦯
    - 🧑🏼‍🦯
    - 👨🏼‍🦯
    - 🧎🏼‍♀️
    - 🧎🏼
    - 🧎🏼‍♂️
    - 🏃🏼‍♀️
    - 🏃🏼
    - 🏃🏼‍♂️
    - 🧍🏼‍♀️
    - 🧍🏼
    - 🧍🏼‍♂️
    - 👭🏼
    - 🧑🏼‍🤝‍🧑🏼
    - 👬🏼
    - 👫🏼
    - 🧗🏼‍♀️
    - 🧗🏼
    - 🧗🏼‍♂️
    - 🏇🏼
    - 🏂🏼
    - 🏌🏼‍♀️
    - 🏌🏼
    - 🏌🏼‍♂️
    - 🏄🏼‍♀️
    - 🏄🏼
    - 🏄🏼‍♂️
    - 🚣🏼‍♀️
    - 🚣🏼
    - 🚣🏼‍♂️
    - 🏊🏼‍♀️
    - 🏊🏼
    - 🏊🏼‍♂️
    - ⛹🏼‍♀️
    - ⛹🏼
    - ⛹🏼‍♂️
    - 🏋🏼‍♀️
    - 🏋🏼
    - 🏋🏼‍♂️
    - 🚴🏼‍♀️
    - 🚴🏼
    - 🚴🏼‍♂️
    - 🚵🏼‍♀️
    - 🚵🏼
    - 🚵🏼‍♂️
    - 🤸🏼‍♀️
    - 🤸🏼
    - 🤸🏼‍♂️
    - 🤽🏼‍♀️
    - 🤽🏼
    - 🤽🏼‍♂️
    - 🤾🏼‍♀️
    - 🤾🏼
    - 🤾🏼‍♂️
    - 🤹🏼‍♀️
    - 🤹🏼
    - 🤹🏼‍♂️
    - 🧘🏼‍♀️
    - 🧘🏼
    - 🧘🏼‍♂️
    - 🛀🏼
    - 🛌🏼
    - 👋🏽
    - 🤚🏽
    - 🖐🏽
    - ✋🏽
    - 🖖🏽
    - 👌🏽
    - 🤌🏽
    - 🤏🏽
    - ✌🏽
    - 🤞🏽
    - 🫰🏽
    - 🤟🏽
    - 🤘🏽
    - 🤙🏽
    - 🫵🏽
    - 🫱🏽
    - 🫲🏽
    - 🫳🏽
    - 🫴🏽
    - 👈🏽
    - 👉🏽
    - 👆🏽
    - 🖕🏽
    - 👇🏽
    - ☝🏽
    - 👍🏽
    - 👎🏽
    - ✊🏽
    - 👊🏽
    - 🤛🏽
    - 🤜🏽
    - 👏🏽
    - 🫶🏽
    - 🙌🏽
    - 👐🏽
    - 🤲🏽
    - 🙏🏽
    - ✍🏽
    - 💪🏽
    - 🦵🏽
    - 🦶🏽
    - 👂🏽
    - 🦻🏽
    - 👃🏽
    - 👶🏽
    - 👧🏽
    - 🧒🏽
    - 👦🏽
    - 👩🏽
    - 🧑🏽
    - 👨🏽
    - 👩🏽‍🦱
    - 🧑🏽‍🦱
    - 👨🏽‍🦱
    - 👩🏽‍🦰
    - 🧑🏽‍🦰
    - 👨🏽‍🦰
    - 👱🏽‍♀️
    - 👱🏽
    - 👱🏽‍♂️
    - 👩🏽‍🦳
    - 🧑🏽‍🦳
    - 👨🏽‍🦳
    - 👩🏽‍🦲
    - 🧑🏽‍🦲
    - 👨🏽‍🦲
    - 🧔🏽‍♀️
    - 🧔🏽
    - 🧔🏽‍♂️
    - 👵🏽
    - 🧓🏽
    - 👴🏽
    - 👲🏽
    - 👳🏽‍♀️
    - 👳🏽
    - 👳🏽‍♂️
    - 🧕🏽
    - 👮🏽‍♀️
    - 👮🏽
    - 👮🏽‍♂️
    - 👷🏽‍♀️
    - 👷🏽
    - 👷🏽‍♂️
    - 💂🏽‍♀️
    - 💂🏽
    - 💂🏽‍♂️
    - 🕵🏽‍♀️
    - 🕵🏽
    - 🕵🏽‍♂️
    - 👩🏽‍⚕️
    - 🧑🏽‍⚕️
    - 👨🏽‍⚕️
    - 👩🏽‍🌾
    - 🧑🏽‍🌾
    - 👨🏽‍🌾
    - 👩🏽‍🍳
    - 🧑🏽‍🍳
    - 👨🏽‍🍳
    - 👩🏽‍🎓
    - 🧑🏽‍🎓
    - 👨🏽‍🎓
    - 👩🏽‍🎤
    - 🧑🏽‍🎤
    - 👨🏽‍🎤
    - 👩🏽‍🏫
    - 🧑🏽‍🏫
    - 👨🏽‍🏫
    - 👩🏽‍🏭
    - 🧑🏽‍🏭
    - 👨🏽‍🏭
    - 👩🏽‍💻
    - 🧑🏽‍💻
    - 👨🏽‍💻
    - 👩🏽‍💼
    - 🧑🏽‍💼
    - 👨🏽‍💼
    - 👩🏽‍🔧
    - 🧑🏽‍🔧
    - 👨🏽‍🔧
    - 👩🏽‍🔬
    - 🧑🏽‍🔬
    - 👨🏽‍🔬
    - 👩🏽‍🎨
    - 🧑🏽‍🎨
    - 👨🏽‍🎨
    - 👩🏽‍🚒
    - 🧑🏽‍🚒
    - 👨🏽‍🚒
    - 👩🏽‍✈️
    - 🧑🏽‍✈️
    - 👨🏽‍✈️
    - 👩🏽‍🚀
    - 🧑🏽‍🚀
    - 👨🏽‍🚀
    - 👩🏽‍⚖️
    - 🧑🏽‍⚖️
    - 👨🏽‍⚖️
    - 👰🏽‍♀️
    - 👰🏽
    - 👰🏽‍♂️
    - 🤵🏽‍♀️
    - 🤵🏽
    - 🤵🏽‍♂️
    - 👸🏽
    - 🫅🏽
    - 🤴🏽
    - 🥷🏽
    - 🦸🏽‍♀️
    - 🦸🏽
    - 🦸🏽‍♂️
    - 🦹🏽‍♀️
    - 🦹🏽
    - 🦹🏽‍♂️
    - 🤶🏽
    - 🧑🏽‍🎄
    - 🎅🏽
    - 🧙🏽‍♀️
    - 🧙🏽
    - 🧙🏽‍♂️
    - 🧝🏽‍♀️
    - 🧝🏽
    - 🧝🏽‍♂️
    - 🧛🏽‍♀️
    - 🧛🏽
    - 🧛🏽‍♂️
    - 🧜🏽‍♀️
    - 🧜🏽
    - 🧜🏽‍♂️
    - 🧚🏽‍♀️
    - 🧚🏽
    - 🧚🏽‍♂️
    - 👼🏽
    - 🤰🏽
    - 🫄🏽
    - 🫃🏽
    - 🤱🏽
    - 👩🏽‍🍼
    - 🧑🏽‍🍼
    - 👨🏽‍🍼
    - 🙇🏽‍♀️
    - 🙇🏽
    - 🙇🏽‍♂️
    - 💁🏽‍♀️
    - 💁🏽
    - 💁🏽‍♂️
    - 🙅🏽‍♀️
    - 🙅🏽
    - 🙅🏽‍♂️
    - 🙆🏽‍♀️
    - 🙆🏽
    - 🙆🏽‍♂️
    - 🙋🏽‍♀️
    - 🙋🏽
    - 🙋🏽‍♂️
    - 🧏🏽‍♀️
    - 🧏🏽
    - 🧏🏽‍♂️
    - 🤦🏽‍♀️
    - 🤦🏽
    - 🤦🏽‍♂️
    - 🤷🏽‍♀️
    - 🤷🏽
    - 🤷🏽‍♂️
    - 🙎🏽‍♀️
    - 🙎🏽
    - 🙎🏽‍♂️
    - 🙍🏽‍♀️
    - 🙍🏽
    - 🙍🏽‍♂️
    - 💇🏽‍♀️
    - 💇🏽
    - 💇🏽‍♂️
    - 💆🏽‍♀️
    - 💆🏽
    - 💆🏽‍♂️
    - 🧖🏽‍♀️
    - 🧖🏽
    - 🧖🏽‍♂️
    - 💃🏽
    - 🕺🏽
    - 🕴🏽
    - 👩🏽‍🦽
    - 🧑🏽‍🦽
    - 👨🏽‍🦽
    - 👩🏽‍🦼
    - 🧑🏽‍🦼
    - 👨🏽‍🦼
    - 🚶🏽‍♀️
    - 🚶🏽
    - 🚶🏽‍♂️
    - 👩🏽‍🦯
    - 🧑🏽‍🦯
    - 👨🏽‍🦯
    - 🧎🏽‍♀️
    - 🧎🏽
    - 🧎🏽‍♂️
    - 🏃🏽‍♀️
    - 🏃🏽
    - 🏃🏽‍♂️
    - 🧍🏽‍♀️
    - 🧍🏽
    - 🧍🏽‍♂️
    - 👭🏽
    - 🧑🏽‍🤝‍🧑🏽
    - 👬🏽
    - 👫🏽
    - 🧗🏽‍♀️
    - 🧗🏽
    - 🧗🏽‍♂️
    - 🏇🏽
    - 🏂🏽
    - 🏌🏽‍♀️
    - 🏌🏽
    - 🏌🏽‍♂️
    - 🏄🏽‍♀️
    - 🏄🏽
    - 🏄🏽‍♂️
    - 🚣🏽‍♀️
    - 🚣🏽
    - 🚣🏽‍♂️
    - 🏊🏽‍♀️
    - 🏊🏽
    - 🏊🏽‍♂️
    - ⛹🏽‍♀️
    - ⛹🏽
    - ⛹🏽‍♂️
    - 🏋🏽‍♀️
    - 🏋🏽
    - 🏋🏽‍♂️
    - 🚴🏽‍♀️
    - 🚴🏽
    - 🚴🏽‍♂️
    - 🚵🏽‍♀️
    - 🚵🏽
    - 🚵🏽‍♂️
    - 🤸🏽‍♀️
    - 🤸🏽
    - 🤸🏽‍♂️
    - 🤽🏽‍♀️
    - 🤽🏽
    - 🤽🏽‍♂️
    - 🤾🏽‍♀️
    - 🤾🏽
    - 🤾🏽‍♂️
    - 🤹🏽‍♀️
    - 🤹🏽
    - 🤹🏽‍♂️
    - 🧘🏽‍♀️
    - 🧘🏽
    - 🧘🏽‍♂️
    - 🛀🏽
    - 🛌🏽
    - 👋🏾
    - 🤚🏾
    - 🖐🏾
    - ✋🏾
    - 🖖🏾
    - 👌🏾
    - 🤌🏾
    - 🤏🏾
    - ✌🏾
    - 🤞🏾
    - 🫰🏾
    - 🤟🏾
    - 🤘🏾
    - 🤙🏾
    - 🫵🏾
    - 🫱🏾
    - 🫲🏾
    - 🫳🏾
    - 🫴🏾
    - 👈🏾
    - 👉🏾
    - 👆🏾
    - 🖕🏾
    - 👇🏾
    - ☝🏾
    - 👍🏾
    - 👎🏾
    - ✊🏾
    - 👊🏾
    - 🤛🏾
    - 🤜🏾
    - 👏🏾
    - 🫶🏾
    - 🙌🏾
    - 👐🏾
    - 🤲🏾
    - 🙏🏾
    - ✍🏾
    - 💪🏾
    - 🦵🏾
    - 🦶🏾
    - 👂🏾
    - 🦻🏾
    - 👃🏾
    - 👶🏾
    - 👧🏾
    - 🧒🏾
    - 👦🏾
    - 👩🏾
    - 🧑🏾
    - 👨🏾
    - 👩🏾‍🦱
    - 🧑🏾‍🦱
    - 👨🏾‍🦱
    - 👩🏾‍🦰
    - 🧑🏾‍🦰
    - 👨🏾‍🦰
    - 👱🏾‍♀️
    - 👱🏾
    - 👱🏾‍♂️
    - 👩🏾‍🦳
    - 🧑🏾‍🦳
    - 👨🏾‍🦳
    - 👩🏾‍🦲
    - 🧑🏾‍🦲
    - 👨🏾‍🦲
    - 🧔🏾‍♀️
    - 🧔🏾
    - 🧔🏾‍♂️
    - 👵🏾
    - 🧓🏾
    - 👴🏾
    - 👲🏾
    - 👳🏾‍♀️
    - 👳🏾
    - 👳🏾‍♂️
    - 🧕🏾
    - 👮🏾‍♀️
    - 👮🏾
    - 👮🏾‍♂️
    - 👷🏾‍♀️
    - 👷🏾
    - 👷🏾‍♂️
    - 💂🏾‍♀️
    - 💂🏾
    - 💂🏾‍♂️
    - 🕵🏾‍♀️
    - 🕵🏾
    - 🕵🏾‍♂️
    - 👩🏾‍⚕️
    - 🧑🏾‍⚕️
    - 👨🏾‍⚕️
    - 👩🏾‍🌾
    - 🧑🏾‍🌾
    - 👨🏾‍🌾
    - 👩🏾‍🍳
    - 🧑🏾‍🍳
    - 👨🏾‍🍳
    - 👩🏾‍🎓
    - 🧑🏾‍🎓
    - 👨🏾‍🎓
    - 👩🏾‍🎤
    - 🧑🏾‍🎤
    - 👨🏾‍🎤
    - 👩🏾‍🏫
    - 🧑🏾‍🏫
    - 👨🏾‍🏫
    - 👩🏾‍🏭
    - 🧑🏾‍🏭
    - 👨🏾‍🏭
    - 👩🏾‍💻
    - 🧑🏾‍💻
    - 👨🏾‍💻
    - 👩🏾‍💼
    - 🧑🏾‍💼
    - 👨🏾‍💼
    - 👩🏾‍🔧
    - 🧑🏾‍🔧
    - 👨🏾‍🔧
    - 👩🏾‍🔬
    - 🧑🏾‍🔬
    - 👨🏾‍🔬
    - 👩🏾‍🎨
    - 🧑🏾‍🎨
    - 👨🏾‍🎨
    - 👩🏾‍🚒
    - 🧑🏾‍🚒
    - 👨🏾‍🚒
    - 👩🏾‍✈️
    - 🧑🏾‍✈️
    - 👨🏾‍✈️
    - 👩🏾‍🚀
    - 🧑🏾‍🚀
    - 👨🏾‍🚀
    - 👩🏾‍⚖️
    - 🧑🏾‍⚖️
    - 👨🏾‍⚖️
    - 👰🏾‍♀️
    - 👰🏾
    - 👰🏾‍♂️
    - 🤵🏾‍♀️
    - 🤵🏾
    - 🤵🏾‍♂️
    - 👸🏾
    - 🫅🏾
    - 🤴🏾
    - 🥷🏾
    - 🦸🏾‍♀️
    - 🦸🏾
    - 🦸🏾‍♂️
    - 🦹🏾‍♀️
    - 🦹🏾
    - 🦹🏾‍♂️
    - 🤶🏾
    - 🧑🏾‍🎄
    - 🎅🏾
    - 🧙🏾‍♀️
    - 🧙🏾
    - 🧙🏾‍♂️
    - 🧝🏾‍♀️
    - 🧝🏾
    - 🧝🏾‍♂️
    - 🧛🏾‍♀️
    - 🧛🏾
    - 🧛🏾‍♂️
    - 🧜🏾‍♀️
    - 🧜🏾
    - 🧜🏾‍♂️
    - 🧚🏾‍♀️
    - 🧚🏾
    - 🧚🏾‍♂️
    - 👼🏾
    - 🤰🏾
    - 🫄🏾
    - 🫃🏾
    - 🤱🏾
    - 👩🏾‍🍼
    - 🧑🏾‍🍼
    - 👨🏾‍🍼
    - 🙇🏾‍♀️
    - 🙇🏾
    - 🙇🏾‍♂️
    - 💁🏾‍♀️
    - 💁🏾
    - 💁🏾‍♂️
    - 🙅🏾‍♀️
    - 🙅🏾
    - 🙅🏾‍♂️
    - 🙆🏾‍♀️
    - 🙆🏾
    - 🙆🏾‍♂️
    - 🙋🏾‍♀️
    - 🙋🏾
    - 🙋🏾‍♂️
    - 🧏🏾‍♀️
    - 🧏🏾
    - 🧏🏾‍♂️
    - 🤦🏾‍♀️
    - 🤦🏾
    - 🤦🏾‍♂️
    - 🤷🏾‍♀️
    - 🤷🏾
    - 🤷🏾‍♂️
    - 🙎🏾‍♀️
    - 🙎🏾
    - 🙎🏾‍♂️
    - 🙍🏾‍♀️
    - 🙍🏾
    - 🙍🏾‍♂️
    - 💇🏾‍♀️
    - 💇🏾
    - 💇🏾‍♂️
    - 💆🏾‍♀️
    - 💆🏾
    - 💆🏾‍♂️
    - 🧖🏾‍♀️
    - 🧖🏾
    - 🧖🏾‍♂️
    - 💃🏾
    - 🕺🏾
    - 👩🏾‍🦽
    - 🧑🏾‍🦽
    - 👨🏾‍🦽
    - 👩🏾‍🦼
    - 🧑🏾‍🦼
    - 👨🏾‍🦼
    - 🚶🏾‍♀️
    - 🚶🏾
    - 🚶🏾‍♂️
    - 👩🏾‍🦯
    - 🧑🏾‍🦯
    - 👨🏾‍🦯
    - 🧎🏾‍♀️
    - 🧎🏾
    - 🧎🏾‍♂️
    - 🏃🏾‍♀️
    - 🏃🏾
    - 🏃🏾‍♂️
    - 🧍🏾‍♀️
    - 🧍🏾
    - 🧍🏾‍♂️
    - 👭🏾
    - 🧑🏾‍🤝‍🧑🏾
    - 👬🏾
    - 👫🏾
    - 🧗🏾‍♀️
    - 🧗🏾
    - 🧗🏾‍♂️
    - 🏇🏾
    - 🏂🏾
    - 🏌🏾‍♀️
    - 🏌🏾
    - 🏌🏾‍♂️
    - 🏄🏾‍♀️
    - 🏄🏾
    - 🏄🏾‍♂️
    - 🚣🏾‍♀️
    - 🚣🏾
    - 🚣🏾‍♂️
    - 🏊🏾‍♀️
    - 🏊🏾
    - 🏊🏾‍♂️
    - ⛹🏾‍♀️
    - ⛹🏾
    - ⛹🏾‍♂️
    - 🏋🏾‍♀️
    - 🏋🏾
    - 🏋🏾‍♂️
    - 🚴🏾‍♀️
    - 🚴🏾
    - 🚴🏾‍♂️
    - 🚵🏾‍♀️
    - 🚵🏾
    - 🚵🏾‍♂️
    - 🤸🏾‍♀️
    - 🤸🏾
    - 🤸🏾‍♂️
    - 🤽🏾‍♀️
    - 🤽🏾
    - 🤽🏾‍♂️
    - 🤾🏾‍♀️
    - 🤾🏾
    - 🤾🏾‍♂️
    - 🤹🏾‍♀️
    - 🤹🏾
    - 🤹🏾‍♂️
    - 🧘🏾‍♀️
    - 🧘🏾
    - 🧘🏾‍♂️
    - 🛀🏾
    - 🛌🏾
    - 👋🏿
    - 🤚🏿
    - 🖐🏿
    - ✋🏿
    - 🖖🏿
    - 👌🏿
    - 🤌🏿
    - 🤏🏿
    - ✌🏿
    - 🤞🏿
    - 🫰🏿
    - 🤟🏿
    - 🤘🏿
    - 🤙🏿
    - 🫵🏿
    - 🫱🏿
    - 🫲🏿
    - 🫳🏿
    - 🫴🏿
    - 👈🏿
    - 👉🏿
    - 👆🏿
    - 🖕🏿
    - 👇🏿
    - ☝🏿
    - 👍🏿
    - 👎🏿
    - ✊🏿
    - 👊🏿
    - 🤛🏿
    - 🤜🏿
    - 👏🏿
    - 🫶🏿
    - 🙌🏿
    - 👐🏿
    - 🤲🏿
    - 🙏🏿
    - ✍🏿
    - 🤳🏿
    - 💪🏿
    - 🦵🏿
    - 🦶🏿
    - 👂🏿
    - 🦻🏿
    - 👃🏿
    - 👶🏿
    - 👧🏿
    - 🧒🏿
    - 👦🏿
    - 👩🏿
    - 🧑🏿
    - 👨🏿
    - 👩🏿‍🦱
    - 🧑🏿‍🦱
    - 👨🏿‍🦱
    - 👩🏿‍🦰
    - 🧑🏿‍🦰
    - 👨🏿‍🦰
    - 👱🏿‍♀️
    - 👱🏿
    - 👱🏿‍♂️
    - 👩🏿‍🦳
    - 🧑🏿‍🦳
    - 👨🏿‍🦳
    - 👩🏿‍🦲
    - 🧑🏿‍🦲
    - 👨🏿‍🦲
    - 🧔🏿‍♀️
    - 🧔🏿
    - 🧔🏿‍♂️
    - 👵🏿
    - 🧓🏿
    - 👴🏿
    - 👲🏿
    - 👳🏿‍♀️
    - 👳🏿
    - 👳🏿‍♂️
    - 🧕🏿
    - 👮🏿‍♀️
    - 👮🏿
    - 👮🏿‍♂️
    - 👷🏿‍♀️
    - 👷🏿
    - 👷🏿‍♂️
    - 💂🏿‍♀️
    - 💂🏿
    - 💂🏿‍♂️
    - 🕵🏿‍♀️
    - 🕵🏿
    - 🕵🏿‍♂️
    - 👩🏿‍⚕️
    - 🧑🏿‍⚕️
    - 👨🏿‍⚕️
    - 👩🏿‍🌾
    - 🧑🏿‍🌾
    - 👨🏿‍🌾
    - 👩🏿‍🍳
    - 🧑🏿‍🍳
    - 👨🏿‍🍳
    - 👩🏿‍🎓
    - 🧑🏿‍🎓
    - 👨🏿‍🎓
    - 👩🏿‍🎤
    - 🧑🏿‍🎤
    - 👨🏿‍🎤
    - 👩🏿‍🏫
    - 🧑🏿‍🏫
    - 👨🏿‍🏫
    - 👩🏿‍🏭
    - 🧑🏿‍🏭
    - 👨🏿‍🏭
    - 👩🏿‍💻
    - 🧑🏿‍💻
    - 👨🏿‍💻
    - 👩🏿‍💼
    - 🧑🏿‍💼
    - 👨🏿‍💼
    - 👩🏿‍🔧
    - 🧑🏿‍🔧
    - 👨🏿‍🔧
    - 👩🏿‍🔬
    - 🧑🏿‍🔬
    - 👨🏿‍🔬
    - 👩🏿‍🎨
    - 🧑🏿‍🎨
    - 👨🏿‍🎨
    - 👩🏿‍🚒
    - 🧑🏿‍🚒
    - 👨🏿‍🚒
    - 👩🏿‍✈️
    - 🧑🏿‍✈️
    - 👨🏿‍✈️
    - 👩🏿‍🚀
    - 🧑🏿‍🚀
    - 👨🏿‍🚀
    - 👩🏿‍⚖️
    - 🧑🏿‍⚖️
    - 👨🏿‍⚖️
    - 👰🏿‍♀️
    - 👰🏿
    - 👰🏿‍♂️
    - 🤵🏿‍♀️
    - 🤵🏿
    - 🤵🏿‍♂️
    - 👸🏿
    - 🫅🏿
    - 🤴🏿
    - 🥷🏿
    - 🦸🏿‍♀️
    - 🦸🏿
    - 🦸🏿‍♂️
    - 🦹🏿‍♀️
    - 🦹🏿
    - 🦹🏿‍♂️
    - 🤶🏿
    - 🧑🏿‍🎄
    - 🎅🏿
    - 🧙🏿‍♀️
    - 🧙🏿
    - 🧙🏿‍♂️
    - 🧝🏿‍♀️
    - 🧝🏿
    - 🧝🏿‍♂️
    - 🧛🏿‍♀️
    - 🧛🏿
    - 🧛🏿‍♂️
    - 🧜🏿‍♀️
    - 🧜🏿
    - 🧜🏿‍♂️
    - 🧚🏿‍♀️
    - 🧚🏿
    - 🧚🏿‍♂️
    - 👼🏿
    - 🤰🏿
    - 🫄🏿
    - 🫃🏿
    - 🤱🏿
    - 👩🏿‍🍼
    - 🧑🏿‍🍼
    - 👨🏿‍🍼
    - 🙇🏿‍♀️
    - 🙇🏿
    - 🙇🏿‍♂️
    - 💁🏿‍♀️
    - 💁🏿
    - 💁🏿‍♂️
    - 🙅🏿‍♀️
    - 🙅🏿
    - 🙅🏿‍♂️
    - 🙆🏿‍♀️
    - 🙆🏿
    - 🙆🏿‍♂️
    - 🙋🏿‍♀️
    - 🙋🏿
    - 🙋🏿‍♂️
    - 🧏🏿‍♀️
    - 🧏🏿
    - 🧏🏿‍♂️
    - 🤦🏿‍♀️
    - 🤦🏿
    - 🤦🏿‍♂️
    - 🤷🏿‍♀️
    - 🤷🏿
    - 🤷🏿‍♂️
    - 🙎🏿‍♀️
    - 🙎🏿
    - 🙎🏿‍♂️
    - 🙍🏿‍♀️
    - 🙍🏿
    - 🙍🏿‍♂️
    - 💇🏿‍♀️
    - 💇🏿
    - 💇🏿‍♂️
    - 💆🏿‍♀️
    - 💆🏿
    - 💆🏿‍♂️
    - 🧖🏿‍♀️
    - 🧖🏿
    - 🧖🏿‍♂️
    - 💃🏿
    - 🕺🏿
    - 🕴🏿
    - 👩🏿‍🦽
    - 🧑🏿‍🦽
    - 👨🏿‍🦽
    - 👩🏿‍🦼
    - 🧑🏿‍🦼
    - 👨🏿‍🦼
    - 🚶🏿‍♀️
    - 🚶🏿
    - 🚶🏿‍♂️
    - 👩🏿‍🦯
    - 🧑🏿‍🦯
    - 👨🏿‍🦯
    - 🧎🏿‍♀️
    - 🧎🏿
    - 🧎🏿‍♂️
    - 🏃🏿‍♀️
    - 🏃🏿
    - 🏃🏿‍♂️
    - 🧍🏿‍♀️
    - 🧍🏿
    - 🧍🏿‍♂️
    - 👭🏿
    - 🧑🏿‍🤝‍🧑🏿
    - 👬🏿
    - 👫🏿
    - 🧗🏿‍♀️
    - 🧗🏿
    - 🧗🏿‍♂️
    - 🏇🏿
    - 🏂🏿
    - 🏌🏿‍♀️
    - 🏌🏿
    - 🏌🏿‍♂️
    - 🏄🏿‍♀️
    - 🏄🏿
    - 🏄🏿‍♂️
    - 🚣🏿‍♀️
    - 🚣🏿
    - 🚣🏿‍♂️
    - 🏊🏿‍♀️
    - 🏊🏿
    - 🏊🏿‍♂️
    - ⛹🏿‍♀️
    - ⛹🏿
    - ⛹🏿‍♂️
    - 🏋🏿‍♀️
    - 🏋🏿
    - 🏋🏿‍♂️
    - 🚴🏿‍♀️
    - 🚴🏿
    - 🚴🏿‍♂️
    - 🚵🏿‍♀️
    - 🚵🏿
    - 🚵🏿‍♂️
    - 🤸🏿‍♀️
    - 🤸🏿
    - 🤸🏿‍♂️
    - 🤽🏿‍♀️
    - 🤽🏿
    - 🤽🏿‍♂️
    - 🤾🏿‍♀️
    - 🤾🏿
    - 🤾🏿‍♂️
    - 🤹🏿‍♀️
    - 🤹🏿
    - 🤹🏿‍♂️
    - 🧘🏿‍♀️
    - 🧘🏿
    - 🧘🏿‍♂️
    - 🛀🏿
    - 🛌🏿
    - 🐶
    - 🐱
    - 🐭
    - 🐹
    - 🐰
    - 🦊
    - 🐻
    - 🐼
    - 🐻‍❄️
    - 🐨
    - 🐯
    - 🦁
    - 🐮
    - 🐷
    - 🐽
    - 🐸
    - 🐵
    - 🙈
    - 🙉
    - 🙊
    - 🐒
    - 🐔
    - 🐧
    - 🐦
    - 🐤
    - 🐣
    - 🐥
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: c98f2a0d-e1b8-4f76-90d3-359caf88d6b9
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_susp_emoji_usage_in_cli_2.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
