id: sigmahq-sigma-160d2780-31f7-4922-8b3a-efce30e63e96
name: Potential AMSI COM Server Hijacking
description: Detects changes to the AMSI come server registry key in order disable
  AMSI scanning functionalities. When AMSI attempts to starts its COM component, it
  will query its registered CLSID and return a non-existent COM server. This causes
  a load failure and prevents any scanning methods from being accessed, ultimately
  rendering AMSI useless
severity: high
enabled: false
tags:
  mitre:
  - T1685
  categories:
  - endpoint
references:
- https://enigma0x3.net/2017/07/19/bypassing-amsi-via-com-server-hijacking/
- https://github.com/r00t-3xp10it/hacking-material-books/blob/43cb1e1932c16ff1f58b755bc9ab6b096046853f/obfuscation/simple_obfuscation.md#amsi-comreg-bypass
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|endswith: \CLSID\{fdb00e52-a214-4aa1-8fba-4357bb0072ec}\InProcServer32\(Default)
  filter:
    Details: '%windir%\system32\amsi.dll'
  condition: selection and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: 160d2780-31f7-4922-8b3a-efce30e63e96
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_amsi_com_hijack.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
