id: sigmahq-sigma-fad91067-08c5-4d1a-8d8c-d96a21b37814
name: Potential PowerShell Execution Policy Tampering
description: Detects changes to the PowerShell execution policy in order to bypass
  signing requirements for script execution
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/powershell/module/microsoft.powershell.security/set-executionpolicy?view=powershell-7.3
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|endswith:
    - \ShellIds\Microsoft.PowerShell\ExecutionPolicy
    - \Policies\Microsoft\Windows\PowerShell\ExecutionPolicy
    Details|contains:
    - Bypass
    - Unrestricted
  filter_main_svchost:
    Image|contains:
    - :\Windows\System32\
    - :\Windows\SysWOW64\
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: fad91067-08c5-4d1a-8d8c-d96a21b37814
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_powershell_execution_policy.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
