id: sigmahq-sigma-a9b6c011-ab69-4ddb-bc0a-c4f21c80ec47
name: Potential Attachment Manager Settings Associations Tamper
description: Detects tampering with attachment manager settings policies associations
  to lower the default file type risks (See reference for more information)
severity: high
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://support.microsoft.com/en-us/topic/information-about-the-attachment-manager-in-microsoft-windows-c48a4dcd-8de5-2af5-ee9b-cd795ae42738
- https://www.virustotal.com/gui/file/2bcd5702a7565952c44075ac6fb946c7780526640d1264f692c7664c02c68465
logsource:
  category: registry_set
  product: windows
detection:
  selection_main:
    TargetObject|contains: \SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Associations\
  selection_value_default_file_type_rsik:
    TargetObject|endswith: \DefaultFileTypeRisk
    Details: DWORD (0x00006152)
  selection_value_low_risk_filetypes:
    TargetObject|endswith: \LowRiskFileTypes
    Details|contains:
    - .zip;
    - .rar;
    - .exe;
    - .bat;
    - .com;
    - .cmd;
    - .reg;
    - .msi;
    - .htm;
    - .html;
  condition: selection_main and 1 of selection_value_*
provenance:
  source: SigmaHQ/sigma
  source_id: a9b6c011-ab69-4ddb-bc0a-c4f21c80ec47
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_policies_associations_tamper.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
