id: sigmahq-sigma-7a3b6d1f-4a2b-4f8c-9d7e-e9f8cbf21a35
name: Potential JLI.dll Side-Loading
description: 'Detects potential DLL side-loading of jli.dll.

  JLI.dll has been observed being side-loaded by Java processes by various threat
  actors, including APT41, XWorm,

  and others in order to load malicious payloads in context of legitimate Java processes.'
severity: high
enabled: false
tags:
  mitre:
  - T1574.001
  categories:
  - endpoint
references:
- https://securelist.com/apt41-in-africa/116986/
- https://lab52.io/blog/snake-keylogger-in-geopolitical-affairs-abuse-of-trusted-java-utilities-in-cybercrime-operations/
- https://hijacklibs.net/entries/3rd_party/oracle/jli.html
- https://www.proofpoint.com/us/blog/threat-insight/phish-china-aligned-espionage-actors-ramp-up-taiwan-semiconductor-targeting
logsource:
  category: image_load
  product: windows
detection:
  selection:
    ImageLoaded|endswith: \jli.dll
  filter_main_legitimate_install_paths:
    ImageLoaded|startswith:
    - C:\Program Files\
    - C:\Program Files (x86)\
    Description: OpenJDK Platform binary
    OriginalFileName: jli.dll
    Product|startswith: OpenJDK Platform
    Signed: 'true'
  filter_optional_eclipse:
    ImageLoaded|startswith: C:\eclipse\plugins\
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
provenance:
  source: SigmaHQ/sigma
  source_id: 7a3b6d1f-4a2b-4f8c-9d7e-e9f8cbf21a35
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/image_load/image_load_side_load_jli.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: experimental'
