id: sigmahq-sigma-8e0bb260-d4b2-4fff-bb8d-3f82118e6892
name: Potentially Suspicious CMD Shell Output Redirect
description: 'Detects inline Windows shell commands redirecting output via the ">"
  symbol to a suspicious location.

  This technique is sometimes used by malicious actors in order to redirect the output
  of reconnaissance commands such as "hostname" and "dir" to files for future exfiltration.'
severity: medium
enabled: false
tags:
  mitre:
  - T1218
  categories:
  - endpoint
references:
- https://thedfirreport.com/2022/07/11/select-xmrig-from-sqlserver/
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \cmd.exe
  - OriginalFileName: Cmd.Exe
  selection_cli_1:
    CommandLine|contains:
    - '>?%APPDATA%\'
    - '>?%TEMP%\'
    - '>?%TMP%\'
    - '>?%USERPROFILE%\'
    - '>?C:\ProgramData\'
    - '>?C:\Temp\'
    - '>?C:\Users\Public\'
    - '>?C:\Windows\Temp\'
  selection_cli_2:
    CommandLine|contains:
    - ' >'
    - '">'
    - '''>'
    CommandLine|contains|all:
    - C:\Users\
    - \AppData\Local\
  condition: selection_img and 1 of selection_cli_*
provenance:
  source: SigmaHQ/sigma
  source_id: 8e0bb260-d4b2-4fff-bb8d-3f82118e6892
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_cmd_redirection_susp_folder.yml
falsepositives:
- Legitimate admin or third party scripts used for diagnostic collection might generate
  some false positives
notes:
  quarantine_reason: 'upstream status: test'
