id: sigmahq-sigma-3735d5ac-d770-4da0-99ff-156b180bc600
name: Potential CCleanerReactivator.DLL Sideloading
description: Detects potential DLL sideloading of "CCleanerReactivator.dll"
severity: medium
enabled: false
tags:
  mitre:
  - T1574.001
  categories:
  - endpoint
references:
- https://lab52.io/blog/2344-2/
logsource:
  category: image_load
  product: windows
detection:
  selection:
    ImageLoaded|endswith: \CCleanerReactivator.dll
  filter_main_path:
    Image|startswith:
    - C:\Program Files\CCleaner\
    - C:\Program Files (x86)\CCleaner\
    Image|endswith: \CCleanerReactivator.exe
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 3735d5ac-d770-4da0-99ff-156b180bc600
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/image_load/image_load_side_load_ccleaner_reactivator.yml
falsepositives:
- False positives could occur from other custom installation paths. Apply additional
  filters accordingly.
notes:
  quarantine_reason: 'upstream status: test'
