id: sigmahq-sigma-b66474aa-bd92-4333-a16c-298155b120df
name: Potential Persistence Via Powershell Search Order Hijacking - Task
description: Detects suspicious powershell execution via a schedule task where the
  command ends with an suspicious flags to hide the powershell instance instead of
  executeing scripts or commands. This could be a sign of persistence via PowerShell
  "Get-Variable" technique as seen being used in Colibri Loader
severity: high
enabled: false
tags:
  mitre:
  - T1053.005
  - T1059.001
  categories:
  - endpoint
references:
- https://blog.malwarebytes.com/threat-intelligence/2022/04/colibri-loader-combines-task-scheduler-and-powershell-in-clever-persistence-technique/
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    ParentImage: C:\WINDOWS\System32\svchost.exe
    ParentCommandLine|contains|all:
    - -k netsvcs
    - -s Schedule
    CommandLine|endswith:
    - ' -windowstyle hidden'
    - ' -w hidden'
    - ' -ep bypass'
    - ' -noni'
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: b66474aa-bd92-4333-a16c-298155b120df
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_schtasks_powershell_persistence.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
