id: sigmahq-sigma-47147b5b-9e17-4d76-b8d2-7bac24c5ce1b
name: Potential Browser Data Stealing
description: 'Adversaries may acquire credentials from web browsers by reading files
  specific to the target browser.

  Web browsers commonly save credentials such as website usernames and passwords so
  that they do not need to be entered manually in the future.

  Web browsers typically store the credentials in an encrypted format within a credential
  store.'
severity: medium
enabled: false
tags:
  mitre:
  - T1555.003
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1555.003/T1555.003.md
- https://www.cisa.gov/sites/default/files/2024-04/aa24-109a-stopransomware-akira-ransomware_2.pdf
logsource:
  category: process_creation
  product: windows
detection:
  selection_cmd:
  - CommandLine|contains:
    - copy-item
    - 'copy '
    - 'cpi '
    - ' cp '
    - 'move '
    - move-item
    - ' mi '
    - ' mv '
  - Image|endswith:
    - \esentutl.exe
    - \xcopy.exe
    - \robocopy.exe
  - OriginalFileName:
    - esentutl.exe
    - XCOPY.EXE
    - robocopy.exe
  selection_path:
    CommandLine|contains:
    - \Amigo\User Data
    - \BraveSoftware\Brave-Browser\User Data
    - \CentBrowser\User Data
    - \Chromium\User Data
    - \CocCoc\Browser\User Data
    - \Comodo\Dragon\User Data
    - \Elements Browser\User Data
    - \Epic Privacy Browser\User Data
    - \Google\Chrome Beta\User Data
    - \Google\Chrome SxS\User Data
    - \Google\Chrome\User Data\
    - \Kometa\User Data
    - \Maxthon5\Users
    - \Microsoft\Edge\User Data
    - \Mozilla\Firefox\Profiles
    - \Nichrome\User Data
    - \Opera Software\Opera GX Stable\
    - \Opera Software\Opera Neon\User Data
    - \Opera Software\Opera Stable\
    - \Orbitum\User Data
    - \QIP Surf\User Data
    - \Sputnik\User Data
    - \Torch\User Data
    - \uCozMedia\Uran\User Data
    - \Vivaldi\User Data
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 47147b5b-9e17-4d76-b8d2-7bac24c5ce1b
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_susp_copy_browser_data.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
