id: sigmahq-sigma-8cbc9475-8d05-4e27-9c32-df960716c701
name: Potentially Suspicious Desktop Background Change Using Reg.EXE
description: 'Detects the execution of "reg.exe" to alter registry keys that would
  replace the user''s desktop background.

  This is a common technique used by malware to change the desktop background to a
  ransom note or other image.'
severity: medium
enabled: false
tags:
  mitre:
  - T1112
  - T1491.001
  categories:
  - endpoint
references:
- https://www.attackiq.com/2023/09/20/emulating-rhysida/
- https://research.checkpoint.com/2023/the-rhysida-ransomware-activity-analysis-and-ties-to-vice-society/
- https://www.trendmicro.com/en_us/research/23/h/an-overview-of-the-new-rhysida-ransomware.html
- https://www.virustotal.com/gui/file/a864282fea5a536510ae86c77ce46f7827687783628e4f2ceb5bf2c41b8cd3c6/behavior
- https://admx.help/?Category=Windows_10_2016&Policy=Microsoft.Policies.WindowsDesktop::Wallpaper
- https://admx.help/?Category=Windows_10_2016&Policy=Microsoft.Policies.ControlPanelDisplay::CPL_Personalization_NoDesktopBackgroundUI
logsource:
  product: windows
  category: process_creation
detection:
  selection_reg_img:
  - Image|endswith: \reg.exe
  - OriginalFileName: reg.exe
  selection_reg_flag:
    CommandLine|contains: add
  selection_keys:
    CommandLine|contains:
    - Control Panel\Desktop
    - CurrentVersion\Policies\ActiveDesktop
    - CurrentVersion\Policies\System
  selection_cli_reg_1:
    CommandLine|contains|all:
    - /v NoChangingWallpaper
    - /d 1
  selection_cli_reg_2:
    CommandLine|contains|all:
    - /v Wallpaper
    - /t REG_SZ
  selection_cli_reg_3:
    CommandLine|contains|all:
    - /v WallpaperStyle
    - /d 2
  condition: all of selection_reg_* and selection_keys and 1 of selection_cli_reg_*
provenance:
  source: SigmaHQ/sigma
  source_id: 8cbc9475-8d05-4e27-9c32-df960716c701
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_reg_desktop_background_change.yml
falsepositives:
- Administrative scripts that change the desktop background to a company logo or other
  image.
notes:
  quarantine_reason: 'upstream status: test'
