id: sigmahq-sigma-a1e11042-a74a-46e6-b07c-c4ce8ecc239b
name: Potential Persistence Via Event Viewer Events.asp
description: Detects potential registry persistence technique using the Event Viewer
  "Events.asp" technique
severity: medium
enabled: false
tags:
  mitre:
  - T1112
  categories:
  - endpoint
references:
- https://twitter.com/nas_bench/status/1626648985824788480
- https://admx.help/?Category=Windows_7_2008R2&Policy=Microsoft.Policies.InternetCommunicationManagement::EventViewer_DisableLinks
- https://www.hexacorn.com/blog/2019/02/15/beyond-good-ol-run-key-part-103/
- https://github.com/redcanaryco/atomic-red-team/blob/f296668303c29d3f4c07e42bdd2b28d8dd6625f9/atomics/T1112/T1112.md
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains:
    - \Microsoft\Windows NT\CurrentVersion\Event Viewer\MicrosoftRedirectionProgram
    - \Microsoft\Windows NT\CurrentVersion\Event Viewer\MicrosoftRedirectionURL
  filter_default_redirect_program:
    Image|endswith: C:\WINDOWS\system32\svchost.exe
    TargetObject|endswith: \Microsoft\Windows NT\CurrentVersion\Event Viewer\MicrosoftRedirectionProgram
    Details: '%%SystemRoot%%\PCHealth\HelpCtr\Binaries\HelpCtr.exe'
  filter_default_redirect_program_cli:
    Image|endswith: C:\WINDOWS\system32\svchost.exe
    TargetObject|endswith: \Microsoft\Windows NT\CurrentVersion\Event Viewer\MicrosoftRedirectionProgramCommandLineParameters
    Details: -url hcp://services/centers/support?topic=%%s
  filter_url:
    Details: http://go.microsoft.com/fwlink/events.asp
  filter_cleaner:
    Details: (Empty)
  condition: selection and not 1 of filter_*
provenance:
  source: SigmaHQ/sigma
  source_id: a1e11042-a74a-46e6-b07c-c4ce8ecc239b
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_persistence_event_viewer_events_asp.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
