id: sigmahq-sigma-086ae989-9ca6-4fe7-895a-759c5544f247
name: Potential Persistence Via TypedPaths
description: Detects modification addition to the 'TypedPaths' key in the user or
  admin registry from a non standard application. Which might indicate persistence
  attempt
severity: high
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://twitter.com/dez_/status/1560101453150257154
- https://forensafe.com/blogs/typedpaths.html
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains: \Software\Microsoft\Windows\CurrentVersion\Explorer\TypedPaths\
  filter:
    Image:
    - C:\Windows\explorer.exe
    - C:\Windows\SysWOW64\explorer.exe
  condition: selection and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: 086ae989-9ca6-4fe7-895a-759c5544f247
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_persistence_typed_paths.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
