id: sigmahq-sigma-9f50fe98-fe5c-4a2d-86c7-fad7f63ed622
name: Potentially Suspicious ASP.NET Compilation Via AspNetCompiler
description: Detects execution of "aspnet_compiler.exe" with potentially suspicious
  paths for compilation.
severity: high
enabled: false
tags:
  mitre:
  - T1127
  categories:
  - endpoint
references:
- https://lolbas-project.github.io/lolbas/Binaries/Aspnet_Compiler/
- https://ijustwannared.team/2020/08/01/the-curious-case-of-aspnet_compiler-exe/
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|contains:
    - :\Windows\Microsoft.NET\Framework\
    - :\Windows\Microsoft.NET\Framework64\
    - :\Windows\Microsoft.NET\FrameworkArm\
    - :\Windows\Microsoft.NET\FrameworkArm64\
    Image|endswith: \aspnet_compiler.exe
    CommandLine|contains:
    - \Users\Public\
    - \AppData\Local\Temp\
    - \AppData\Local\Roaming\
    - :\Temp\
    - :\Windows\Temp\
    - :\Windows\System32\Tasks\
    - :\Windows\Tasks\
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 9f50fe98-fe5c-4a2d-86c7-fad7f63ed622
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_aspnet_compiler_susp_paths.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
