id: sigmahq-sigma-38879043-7e1e-47a9-8d46-6bec88e201df
name: Potential Persistence Attempt Via Existing Service Tampering
description: Detects the modification of an existing service in order to execute an
  arbitrary payload when the service is started or killed as a potential method for
  persistence.
severity: medium
enabled: false
tags:
  mitre:
  - T1543.003
  - T1574.011
  categories:
  - endpoint
references:
- https://pentestlab.blog/2020/01/22/persistence-modify-existing-service/
logsource:
  category: process_creation
  product: windows
detection:
  selection_sc:
  - CommandLine|contains|all:
    - 'sc '
    - 'config '
    - binpath=
  - CommandLine|contains|all:
    - 'sc '
    - failure
    - command=
  selection_reg_img:
  - CommandLine|contains|all:
    - 'reg '
    - 'add '
    - FailureCommand
  - CommandLine|contains|all:
    - 'reg '
    - 'add '
    - ImagePath
  selection_reg_ext:
    CommandLine|contains:
    - .sh
    - .exe
    - .dll
    - .bin$
    - .bat
    - .cmd
    - .js
    - .msh$
    - .reg$
    - .scr
    - .ps
    - .vb
    - .jar
    - .pl
  condition: selection_sc or all of selection_reg_*
provenance:
  source: SigmaHQ/sigma
  source_id: 38879043-7e1e-47a9-8d46-6bec88e201df
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_sc_service_tamper_for_persistence.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
