id: sigmahq-sigma-8d63dadf-b91b-4187-87b6-34a1114577ea
name: Potential Remote SquiblyTwo Technique Execution
description: 'Detects potential execution of the SquiblyTwo technique that leverages
  Windows Management Instrumentation (WMI)

  to execute malicious code remotely. This technique bypasses application whitelisting
  by using wmic.exe to process

  malicious XSL (eXtensible Stylesheet Language) scripts that can contain embedded
  JScript or VBScript.

  The attack typically works by fetching XSL content from a remote source (using HTTP/HTTPS)
  and executing it

  with full trust privileges directly in memory, avoiding disk-based detection mechanisms.
  This is a common

  LOLBin (Living Off The Land Binary) technique used for defense evasion and code
  execution.'
severity: high
enabled: false
tags:
  mitre:
  - T1047
  - T1220
  - T1059.005
  - T1059.007
  categories:
  - endpoint
references:
- https://web.archive.org/web/20190209154607/https://subt0x11.blogspot.com/2018/04/wmicexe-whitelisting-bypass-hacking.html
- https://twitter.com/mattifestation/status/986280382042595328
- https://atomicredteam.io/defense-evasion/T1220/
- https://lolbas-project.github.io/lolbas/Binaries/Wmic/
- https://x.com/byrne_emmy12099/status/1932346420226658668
logsource:
  category: process_creation
  product: windows
detection:
  selection_pe:
  - Image|endswith: \wmic.exe
  - OriginalFileName: wmic.exe
  - Hashes|contains:
    - IMPHASH=1B1A3F43BF37B5BFE60751F2EE2F326E
    - IMPHASH=37777A96245A3C74EB217308F3546F4C
    - IMPHASH=9D87C9D67CE724033C0B40CC4CA1B206
    - IMPHASH=B12619881D79C3ACADF45E752A58554A
    - IMPHASH=16A48C3CABF98A9DC1BF02C07FE1EA00
  selection_cli:
    CommandLine|contains|windash: '/format:'
    CommandLine|contains:
    - ://
    - \\\\
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 8d63dadf-b91b-4187-87b6-34a1114577ea
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_wmic_squiblytwo_bypass.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
