id: sigmahq-sigma-b86852fb-4c77-48f9-8519-eb1b2c308b59
name: Potential Persistence Via AppCompat RegisterAppRestart Layer
description: 'Detects the setting of the REGISTERAPPRESTART compatibility layer on
  an application.

  This compatibility layer allows an application to register for restart using the
  "RegisterApplicationRestart" API.

  This can be potentially abused as a persistence mechanism.'
severity: medium
enabled: false
tags:
  mitre:
  - T1546.011
  categories:
  - endpoint
references:
- https://github.com/nasbench/Misc-Research/blob/d114d6a5e0a437d3818e492ef9864367152543e7/Other/Persistence-Via-RegisterAppRestart-Shim.md
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains: \SOFTWARE\Microsoft\Windows NT\CurrentVersion\AppCompatFlags\Layers\
    Details|contains: REGISTERAPPRESTART
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: b86852fb-4c77-48f9-8519-eb1b2c308b59
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_persistence_app_cpmpat_layer_registerapprestart.yml
falsepositives:
- Legitimate applications making use of this feature for compatibility reasons
notes:
  quarantine_reason: 'upstream status: test'
