id: sigmahq-sigma-68654bf0-4412-43d5-bfe8-5eaa393cd939
name: Potential DLL Sideloading Via JsSchHlp
description: Detects potential DLL sideloading using JUSTSYSTEMS Japanese word processor
severity: medium
enabled: false
tags:
  mitre:
  - T1574.001
  categories:
  - endpoint
references:
- https://www.welivesecurity.com/2022/12/14/unmasking-mirrorface-operation-liberalface-targeting-japanese-political-entities/
- http://www.windowexe.com/bbs/board.php?q=jsschhlp-exe-c-program-files-common-files-justsystem-jsschhlp-jsschhlp
logsource:
  category: image_load
  product: windows
detection:
  selection:
    ImageLoaded|endswith: \JSESPR.dll
  filter:
    ImageLoaded|startswith: C:\Program Files\Common Files\Justsystem\JsSchHlp\
  condition: selection and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: 68654bf0-4412-43d5-bfe8-5eaa393cd939
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/image_load/image_load_side_load_jsschhlp.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
