id: sigmahq-sigma-7cccd811-7ae9-4ebe-9afd-cb5c406b824b
name: Potential Execution of Sysinternals Tools
description: Detects command lines that contain the 'accepteula' flag which could
  be a sign of execution of one of the Sysinternals tools
severity: low
enabled: false
tags:
  mitre:
  - T1588.002
  categories:
  - endpoint
references:
- https://twitter.com/Moti_B/status/1008587936735035392
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains|windash: ' -accepteula'
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 7cccd811-7ae9-4ebe-9afd-cb5c406b824b
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_sysinternals_eula_accepted.yml
falsepositives:
- Legitimate use of SysInternals tools
- Programs that use the same command line flag
notes:
  quarantine_reason: 'upstream status: test'
