id: sigmahq-sigma-1e0e1a81-e79b-44bc-935b-ddb9c8006b3d
name: Potential Script Proxy Execution Via CL_Mutexverifiers.ps1
description: Detects the use of the Microsoft signed script "CL_mutexverifiers" to
  proxy the execution of additional PowerShell script commands
severity: medium
enabled: false
tags:
  mitre:
  - T1216
  categories:
  - endpoint
references:
- https://lolbas-project.github.io/lolbas/Scripts/CL_mutexverifiers/
logsource:
  category: process_creation
  product: windows
detection:
  selection_pwsh:
    ParentImage|endswith:
    - \powershell.exe
    - \pwsh.exe
    Image|endswith: \powershell.exe
    CommandLine|contains: ' -nologo -windowstyle minimized -file '
  selection_temp:
    CommandLine|contains:
    - \AppData\Local\Temp\
    - \Windows\Temp\
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 1e0e1a81-e79b-44bc-935b-ddb9c8006b3d
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_powershell_cl_mutexverifiers.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
