id: sigmahq-sigma-a8f866e1-bdd4-425e-a27a-37619238d9c7
name: Potential Hidden Directory Creation Via NTFS INDEX_ALLOCATION Stream
description: Detects the creation of hidden file/folder with the "::$index_allocation"
  stream. Which can be used as a technique to prevent access to folder and files from
  tooling such as "explorer.exe" and "powershell.exe"
severity: medium
enabled: false
tags:
  mitre:
  - T1564.004
  categories:
  - endpoint
references:
- https://twitter.com/pfiatde/status/1681977680688738305
- https://soroush.me/blog/2010/12/a-dotty-salty-directory-a-secret-place-in-ntfs-for-secret-files/
- https://sec-consult.com/blog/detail/pentesters-windows-ntfs-tricks-collection/
- https://github.com/redcanaryco/atomic-red-team/blob/5c3b23002d2bbede3c07e7307165fc2a235a427d/atomics/T1564.004/T1564.004.md#atomic-test-5---create-hidden-directory-via-index_allocation
- https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-fscc/c54dec26-1551-4d3a-a0ea-4fa40f848eb3
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename|contains: ::$index_allocation
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: a8f866e1-bdd4-425e-a27a-37619238d9c7
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_susp_hidden_dir_index_allocation.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
