id: sigmahq-sigma-258fc8ce-8352-443a-9120-8a11e4857fa5
name: Potential Arbitrary Command Execution Using Msdt.EXE
description: Detects processes leveraging the "ms-msdt" handler or the "msdt.exe"
  binary to execute arbitrary commands as seen in the follina (CVE-2022-30190) vulnerability
severity: high
enabled: false
tags:
  mitre:
  - T1202
  categories:
  - endpoint
references:
- https://twitter.com/nao_sec/status/1530196847679401984
- https://app.any.run/tasks/713f05d2-fe78-4b9d-a744-f7c133e3fafb/
- https://twitter.com/_JohnHammond/status/1531672601067675648
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \msdt.exe
  - OriginalFileName: msdt.exe
  selection_cmd_inline:
    CommandLine|contains: IT_BrowseForFile=
  selection_cmd_answerfile_flag:
    CommandLine|contains: ' PCWDiagnostic'
  selection_cmd_answerfile_param:
    CommandLine|contains|windash: ' -af '
  condition: selection_img and (selection_cmd_inline or all of selection_cmd_answerfile_*)
provenance:
  source: SigmaHQ/sigma
  source_id: 258fc8ce-8352-443a-9120-8a11e4857fa5
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_msdt_arbitrary_command_execution.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
