id: sigmahq-sigma-9e620995-f2d8-4630-8430-4afd89f77604
name: Potential Active Directory Enumeration Using AD Module - PsScript
description: Detects usage of the "Import-Module" cmdlet to load the "Microsoft.ActiveDirectory.Management.dl"
  DLL. Which is often used by attackers to perform AD enumeration.
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://github.com/samratashok/ADModule
- https://twitter.com/cyb3rops/status/1617108657166061568?s=20
- https://www.ired.team/offensive-security-experiments/active-directory-kerberos-abuse/active-directory-enumeration-with-ad-module-without-rsat-or-admin-privileges
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enable'
detection:
  selection_generic:
    ScriptBlockText|contains|all:
    - 'Import-Module '
    - Microsoft.ActiveDirectory.Management.dll
  selection_specific:
    ScriptBlockText|contains: ipmo Microsoft.ActiveDirectory.Management.dll
  condition: 1 of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 9e620995-f2d8-4630-8430-4afd89f77604
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_active_directory_module_dll_import.yml
falsepositives:
- Legitimate use of the library for administrative activity
notes:
  quarantine_reason: 'upstream status: test'
