id: sigmahq-sigma-54127bd4-f541-4ac3-afdb-ea073f63f692
name: Potential Persistence Via Notepad++ Plugins
description: Detects creation of new ".dll" files inside the plugins directory of
  a notepad++ installation by a process other than "gup.exe". Which could indicates
  possible persistence
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://pentestlab.blog/2022/02/14/persistence-notepad-plugins/
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename|contains: \Notepad++\plugins\
    TargetFilename|endswith: .dll
  filter_gup:
    Image|endswith: \Notepad++\updater\gup.exe
  filter_install:
    Image|startswith: C:\Users\
    Image|contains: \AppData\Local\Temp\
    Image|endswith:
    - \target.exe
    - Installer.x64.exe
  filter_main_installer:
    Image|contains: \npp.
    Image|endswith: .exe
    TargetFilename:
    - C:\Program Files\Notepad++\plugins\NppExport\NppExport.dll
    - C:\Program Files\Notepad++\plugins\mimeTools\mimeTools.dll
    - C:\Program Files\Notepad++\plugins\NppConverter\NppConverter.dll
    - C:\Program Files\Notepad++\plugins\Config\nppPluginList.dll
  condition: selection and not 1 of filter_*
provenance:
  source: SigmaHQ/sigma
  source_id: 54127bd4-f541-4ac3-afdb-ea073f63f692
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_notepad_plus_plus_persistence.yml
falsepositives:
- Possible FPs during first installation of Notepad++
- Legitimate use of custom plugins by users in order to enhance notepad++ functionalities
notes:
  quarantine_reason: 'upstream status: test'
