id: sigmahq-sigma-6f0947a4-1c5e-4e0d-8ac7-53159b8f23ca
name: Potentially Suspicious Child Process Of Regsvr32
description: Detects potentially suspicious child processes of "regsvr32.exe".
severity: high
enabled: false
tags:
  mitre:
  - T1218.010
  categories:
  - endpoint
references:
- https://redcanary.com/blog/intelligence-insights-april-2022/
- https://www.echotrail.io/insights/search/regsvr32.exe
- https://www.ired.team/offensive-security/code-execution/t1117-regsvr32-aka-squiblydoo
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage|endswith: \regsvr32.exe
    Image|endswith:
    - \calc.exe
    - \cscript.exe
    - \explorer.exe
    - \mshta.exe
    - \net.exe
    - \net1.exe
    - \nltest.exe
    - \notepad.exe
    - \powershell.exe
    - \pwsh.exe
    - \reg.exe
    - \schtasks.exe
    - \werfault.exe
    - \wscript.exe
  filter_main_werfault:
    Image|endswith: \werfault.exe
    CommandLine|contains: ' -u -p '
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 6f0947a4-1c5e-4e0d-8ac7-53159b8f23ca
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_regsvr32_susp_child_process.yml
falsepositives:
- Unlikely, but can rarely occur. Apply additional filters accordingly.
notes:
  quarantine_reason: 'upstream status: test'
