id: sigmahq-sigma-f354eba5-623b-450f-b073-0b5b2773b6aa
name: Potential DCOM InternetExplorer.Application DLL Hijack - Image Load
description: Detects potential DLL hijack of "iertutil.dll" found in the DCOM InternetExplorer.Application
  Class
severity: critical
enabled: false
tags:
  mitre:
  - T1021.002
  - T1021.003
  categories:
  - endpoint
references:
- https://threathunterplaybook.com/hunts/windows/201009-RemoteDCOMIErtUtilDLLHijack/notebook.html
logsource:
  product: windows
  category: image_load
detection:
  selection:
    Image|endswith: \Internet Explorer\iexplore.exe
    ImageLoaded|endswith: \Internet Explorer\iertutil.dll
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: f354eba5-623b-450f-b073-0b5b2773b6aa
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/image_load/image_load_iexplore_dcom_iertutil_dll_hijack.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
