id: sigmahq-sigma-0fa66f66-e3f6-4a9c-93f8-4f2610b00171
name: Potential DLL Sideloading Using Coregen.exe
description: Detect usage of the "coregen.exe" (Microsoft CoreCLR Native Image Generator)
  binary to sideload arbitrary DLLs.
severity: medium
enabled: false
tags:
  mitre:
  - T1218
  - T1055
  categories:
  - endpoint
references:
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Coregen/
logsource:
  category: image_load
  product: windows
detection:
  selection:
    Image|endswith: \coregen.exe
  filter_main_legit_paths:
    ImageLoaded|startswith:
    - C:\Program Files (x86)\Microsoft Silverlight\
    - C:\Program Files\Microsoft Silverlight\
    - C:\Windows\System32\
    - C:\Windows\SysWOW64\
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 0fa66f66-e3f6-4a9c-93f8-4f2610b00171
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/image_load/image_load_side_load_coregen.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
