id: sigmahq-sigma-979baf41-ca44-4540-9d0c-4fcef3b5a3a4
name: Potential File Extension Spoofing Using Right-to-Left Override
description: Detects suspicious filenames that contain a right-to-left override character
  and a potentially spoofed file extensions.
severity: high
enabled: false
tags:
  mitre:
  - T1036.002
  categories:
  - endpoint
references:
- https://redcanary.com/blog/right-to-left-override/
- https://www.malwarebytes.com/blog/news/2014/01/the-rtlo-method
- https://tria.ge/241015-l98snsyeje/behavioral2
- https://www.unicode.org/versions/Unicode5.2.0/ch02.pdf
logsource:
  category: file_event
  product: windows
detection:
  selection_rtlo_unicode:
    TargetFilename|contains:
    - \u202e
    - '[U+202E]'
    - ‮
  selection_extensions:
    TargetFilename|contains:
    - 3pm.
    - 4pm.
    - cod.
    - fdp.
    - ftr.
    - gepj.
    - gnp.
    - gpj.
    - ism.
    - lmth.
    - nls.
    - piz.
    - slx.
    - tdo.
    - vsc.
    - vwm.
    - xcod.
    - xslx.
    - xtpp.
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 979baf41-ca44-4540-9d0c-4fcef3b5a3a4
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_susp_right_to_left_override_extension_spoofing.yml
falsepositives:
- Filenames that contains scriptures such as arabic or hebrew might make use of this
  character
notes:
  quarantine_reason: 'upstream status: test'
