id: sigmahq-sigma-be344333-921d-4c4d-8bb8-e584cf584780
name: Potentially Suspicious Event Viewer Child Process
description: Detects uncommon or suspicious child processes of "eventvwr.exe" which
  might indicate a UAC bypass attempt
severity: high
enabled: false
tags:
  mitre:
  - T1548.002
  categories:
  - endpoint
references:
- https://enigma0x3.net/2016/08/15/fileless-uac-bypass-using-eventvwr-exe-and-registry-hijacking/
- https://www.hybrid-analysis.com/sample/e122bc8bf291f15cab182a5d2d27b8db1e7019e4e96bb5cdbd1dfe7446f3f51f?environmentId=100
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage|endswith: \eventvwr.exe
  filter_main_generic:
    Image|endswith:
    - :\Windows\System32\mmc.exe
    - :\Windows\System32\WerFault.exe
    - :\Windows\SysWOW64\WerFault.exe
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: be344333-921d-4c4d-8bb8-e584cf584780
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_eventvwr_susp_child_process.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
