id: sigmahq-sigma-894a8613-cf12-48b3-8e57-9085f54aa0c3
name: Potential Base64 Encoded User-Agent
description: Detects User Agent strings that end with an equal sign, which can be
  a sign of base64 encoding.
severity: medium
enabled: false
tags:
  mitre:
  - T1071.001
  categories:
  - network
references:
- https://blogs.jpcert.or.jp/en/2022/07/yamabot.html
- https://deviceatlas.com/blog/list-of-user-agent-strings#desktop
logsource:
  category: proxy
detection:
  selection:
    c-useragent|endswith: '='
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 894a8613-cf12-48b3-8e57-9085f54aa0c3
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/web/proxy_generic/proxy_ua_susp_base64.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
