id: sigmahq-sigma-36803969-5421-41ec-b92f-8500f79c23b0
name: Potential Persistence Via GlobalFlags
description: Detects registry persistence technique using the GlobalFlags and SilentProcessExit
  keys
severity: high
enabled: false
tags:
  mitre:
  - T1546.012
  categories:
  - endpoint
references:
- https://oddvar.moe/2018/04/10/persistence-using-globalflags-in-image-file-execution-options-hidden-from-autoruns-exe/
- https://www.deepinstinct.com/2021/02/16/lsass-memory-dumps-are-stealthier-than-ever-before-part-2/
logsource:
  category: registry_set
  product: windows
detection:
  selection_global_flag:
    TargetObject|contains|all:
    - \Microsoft\Windows NT\CurrentVersion\
    - \Image File Execution Options\
    - \GlobalFlag
  selection_silent_process:
    TargetObject|contains|all:
    - \Microsoft\Windows NT\CurrentVersion\
    - \SilentProcessExit\
    TargetObject|contains:
    - \ReportingMode
    - \MonitorProcess
  condition: 1 of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 36803969-5421-41ec-b92f-8500f79c23b0
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_persistence_globalflags.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
