id: sigmahq-sigma-6b98b92b-4f00-4f62-b4fe-4d1920215771
name: Potential DLL Sideloading Of Non-Existent DLLs From System Folders
description: 'Detects loading of specific system DLL files that are usually not present
  on the system (or at least not in system directories) but may be loaded by legitimate
  processes, potentially indicating phantom DLL hijacking attempts.

  Phantom DLL hijacking involves placing malicious DLLs with names of non-existent
  system binaries in locations where legitimate applications may search for them,
  leading to execution of the malicious DLLs.'
severity: high
enabled: false
tags:
  mitre:
  - T1574.001
  categories:
  - endpoint
references:
- http://remoteawesomethoughts.blogspot.com/2019/05/windows-10-task-schedulerservice.html
- https://clement.notin.org/blog/2020/09/12/CVE-2020-7315-McAfee-Agent-DLL-injection/
- https://decoded.avast.io/martinchlumecky/png-steganography/
- https://github.com/Wh04m1001/SysmonEoP
- https://itm4n.github.io/cdpsvc-dll-hijacking/
- https://posts.specterops.io/lateral-movement-scm-and-dll-hijacking-primer-d2f61e8ab992
- https://securelist.com/passiveneuron-campaign-with-apt-implants-and-cobalt-strike/117745/
- https://www.crowdstrike.com/en-us/blog/4-ways-adversaries-hijack-dlls/
- https://www.hexacorn.com/blog/2013/12/08/beyond-good-ol-run-key-part-5/
- https://www.hexacorn.com/blog/2025/06/14/wermgr-exe-boot-offdmpsvc-dll-lolbin/
- https://www.hexacorn.com/blog/2025/06/14/wpr-exe-boottrace-phantom-dll-axeonoffhelper-dll-lolbin/
- https://x.com/0gtweet/status/1564131230941122561
logsource:
  category: image_load
  product: windows
detection:
  selection:
    ImageLoaded|endswith:
    - :\Windows\System32\axeonoffhelper.dll
    - :\Windows\System32\cdpsgshims.dll
    - :\Windows\System32\oci.dll
    - :\Windows\System32\offdmpsvc.dll
    - :\Windows\System32\shellchromeapi.dll
    - :\Windows\System32\TSMSISrv.dll
    - :\Windows\System32\TSVIPSrv.dll
    - :\Windows\System32\wbem\wbemcomn.dll
    - :\Windows\System32\WLBSCTRL.dll
    - :\Windows\System32\wow64log.dll
    - :\Windows\System32\WptsExtensions.dll
  filter_main_ms_signed:
    Signed: 'true'
    SignatureStatus: Valid
    Signature: Microsoft Windows
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 6b98b92b-4f00-4f62-b4fe-4d1920215771
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/image_load/image_load_side_load_non_existent_dlls.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
