id: sigmahq-sigma-e4d22291-f3d5-4b78-9a0c-a1fbaf32a6a4
name: Potentially Suspicious ODBC Driver Registered
description: Detects the registration of a new ODBC driver where the driver is located
  in a potentially suspicious location
severity: high
enabled: false
tags:
  mitre:
  - T1003
  categories:
  - endpoint
references:
- https://www.hexacorn.com/blog/2020/08/23/odbcconf-lolbin-trifecta/
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains: \SOFTWARE\ODBC\ODBCINST.INI\
    TargetObject|endswith:
    - \Driver
    - \Setup
    Details|contains:
    - :\PerfLogs\
    - :\ProgramData\
    - :\Temp\
    - :\Users\Public\
    - :\Windows\Registration\CRMLog
    - :\Windows\System32\com\dmp\
    - :\Windows\System32\FxsTmp\
    - :\Windows\System32\Microsoft\Crypto\RSA\MachineKeys\
    - :\Windows\System32\spool\drivers\color\
    - :\Windows\System32\spool\PRINTERS\
    - :\Windows\System32\spool\SERVERS\
    - :\Windows\System32\Tasks_Migrated\
    - :\Windows\System32\Tasks\Microsoft\Windows\SyncCenter\
    - :\Windows\SysWOW64\com\dmp\
    - :\Windows\SysWOW64\FxsTmp\
    - :\Windows\SysWOW64\Tasks\Microsoft\Windows\PLA\System\
    - :\Windows\SysWOW64\Tasks\Microsoft\Windows\SyncCenter\
    - :\Windows\Tasks\
    - :\Windows\Temp\
    - :\Windows\Tracing\
    - \AppData\Local\Temp\
    - \AppData\Roaming\
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: e4d22291-f3d5-4b78-9a0c-a1fbaf32a6a4
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_odbc_driver_registered_susp.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
