id: sigmahq-sigma-fb656378-f909-47c1-8747-278bf09f4f4f
name: Potential Credential Dumping Attempt Via PowerShell Remote Thread
description: Detects remote thread creation by PowerShell processes into "lsass.exe"
severity: high
enabled: false
tags:
  mitre:
  - T1003.001
  categories:
  - endpoint
references:
- https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse
logsource:
  product: windows
  category: create_remote_thread
detection:
  selection:
    SourceImage|endswith:
    - \powershell.exe
    - \pwsh.exe
    TargetImage|endswith: \lsass.exe
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: fb656378-f909-47c1-8747-278bf09f4f4f
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/create_remote_thread/create_remote_thread_win_powershell_lsass.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
