id: sigmahq-sigma-1dd05363-104e-4b4a-b963-196a534b03a1
name: Potential Suspicious Mofcomp Execution
description: 'Detects execution of the "mofcomp" utility as a child of a suspicious
  shell or script running utility or by having a suspicious path in the commandline.

  The "mofcomp" utility parses a file containing MOF statements and adds the classes
  and class instances defined in the file to the WMI repository.

  Attackers abuse this utility to install malicious MOF scripts'
severity: high
enabled: false
tags:
  mitre:
  - T1218
  categories:
  - endpoint
references:
- https://thedfirreport.com/2022/07/11/select-xmrig-from-sqlserver/
- https://github.com/The-DFIR-Report/Sigma-Rules/blob/75260568a7ffe61b2458ca05f6f25914efb44337/win_mofcomp_execution.yml
- https://learn.microsoft.com/en-us/windows/win32/wmisdk/mofcomp
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \mofcomp.exe
  - OriginalFileName: mofcomp.exe
  selection_case:
  - ParentImage|endswith:
    - \cmd.exe
    - \powershell.exe
    - \pwsh.exe
    - \wsl.exe
    - \wscript.exe
    - \cscript.exe
  - CommandLine|contains:
    - \AppData\Local\Temp
    - \Users\Public\
    - \WINDOWS\Temp\
    - '%temp%'
    - '%tmp%'
    - '%appdata%'
  filter_main_wmiprvse:
    ParentImage: C:\Windows\System32\wbem\WmiPrvSE.exe
    CommandLine|contains: C:\Windows\TEMP\
    CommandLine|endswith: .mof
  filter_optional_null_parent:
    CommandLine|contains: C:\Windows\TEMP\
    CommandLine|endswith: .mof
  condition: all of selection_* and not 1 of filter_main_* and not 1 of filter_optional_*
provenance:
  source: SigmaHQ/sigma
  source_id: 1dd05363-104e-4b4a-b963-196a534b03a1
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_mofcomp_execution.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
