id: sigmahq-sigma-a2edbce1-95c8-4291-8676-0d45146862b3
name: Potential SolidPDFCreator.DLL Sideloading
description: Detects potential DLL sideloading of "SolidPDFCreator.dll"
severity: medium
enabled: false
tags:
  mitre:
  - T1574.001
  categories:
  - endpoint
references:
- https://lab52.io/blog/new-mustang-pandas-campaing-against-australia/
logsource:
  category: image_load
  product: windows
detection:
  selection:
    ImageLoaded|endswith: \SolidPDFCreator.dll
  filter_main_path:
    Image|endswith: \SolidPDFCreator.exe
    ImageLoaded|startswith:
    - C:\Program Files (x86)\SolidDocuments\SolidPDFCreator\
    - C:\Program Files\SolidDocuments\SolidPDFCreator\
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: a2edbce1-95c8-4291-8676-0d45146862b3
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/image_load/image_load_side_load_solidpdfcreator.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
