id: sigmahq-sigma-6360757a-d460-456c-8b13-74cf0e60cceb
name: Potential DLL Sideloading Via comctl32.dll
description: Detects potential DLL sideloading using comctl32.dll to obtain system
  privileges
severity: high
enabled: false
tags:
  mitre:
  - T1574.001
  categories:
  - endpoint
references:
- https://github.com/binderlabs/DirCreate2System
- https://github.com/sailay1996/awesome_windows_logical_bugs/blob/60cbb23a801f4c3195deac1cc46df27c225c3d07/dir_create2system.txt
logsource:
  category: image_load
  product: windows
detection:
  selection:
    ImageLoaded|startswith:
    - C:\Windows\System32\logonUI.exe.local\
    - C:\Windows\System32\werFault.exe.local\
    - C:\Windows\System32\consent.exe.local\
    - C:\Windows\System32\narrator.exe.local\
    - C:\windows\system32\wermgr.exe.local\
    ImageLoaded|endswith: \comctl32.dll
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 6360757a-d460-456c-8b13-74cf0e60cceb
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/image_load/image_load_side_load_comctl32.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
