id: sigmahq-sigma-1d2de8a6-4803-4fde-b85b-f58f3aa7a705
name: Potentially Suspicious WDAC Policy File Creation
description: Detects suspicious Windows Defender Application Control (WDAC) policy
  file creation from abnormal processes that could be abused by attacker to block
  EDR/AV components while allowing their own malicious code to run on the system.
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/windows/security/application-security/application-control/app-control-for-business/deployment/deploy-appcontrol-policies-using-group-policy
- https://beierle.win/2024-12-20-Weaponizing-WDAC-Killing-the-Dreams-of-EDR/
- https://github.com/logangoins/Krueger/tree/main
- https://learn.microsoft.com/en-us/windows/security/application-security/application-control/app-control-for-business/deployment/appcontrol-deployment-guide
- https://learn.microsoft.com/en-us/windows/security/application-security/application-control/app-control-for-business/deployment/deploy-appcontrol-policies-with-script
- https://learn.microsoft.com/en-us/windows/security/application-security/application-control/app-control-for-business/deployment/deploy-appcontrol-policies-with-memcm
logsource:
  category: file_event
  product: windows
detection:
  selection_target:
    TargetFilename|contains: \Windows\System32\CodeIntegrity\
  filter_main_images:
    Image|endswith:
    - \Microsoft.ConfigurationManagement.exe
    - \WDAC Wizard.exe
    - C:\Program Files\PowerShell\7-preview\pwsh.exe
    - C:\Program Files\PowerShell\7\pwsh.exe
    - C:\Windows\System32\dllhost.exe
    - C:\Windows\System32\WindowsPowerShell\v1.0\powershell_ise.exe
    - C:\Windows\System32\WindowsPowerShell\v1.0\powershell.exe
    - C:\Windows\SysWOW64\dllhost.exe
    - C:\Windows\SysWOW64\WindowsPowerShell\v1.0\powershell_ise.exe
    - C:\Windows\SysWOW64\WindowsPowerShell\v1.0\powershell.exe
  filter_main_cli:
  - CommandLine|contains|all:
    - ConvertFrom-CIPolicy -XmlFilePath
    - '-BinaryFilePath '
  - CommandLine|contains: CiTool --update-policy
  - CommandLine|contains|all:
    - Copy-Item -Path
    - -Destination
  filter_main_system:
    Image: System
  filter_main_wuauclt:
    Image:
    - C:\Windows\System32\wuauclt.exe
    - C:\Windows\UUS\arm64\wuaucltcore.exe
  condition: selection_target and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 1d2de8a6-4803-4fde-b85b-f58f3aa7a705
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_susp_wdac_policy_creation.yml
falsepositives:
- Administrators and security vendors could leverage WDAC, apply additional filters
  as needed.
notes:
  quarantine_reason: 'upstream status: experimental'
