id: sigmahq-sigma-7d1aaf3d-4304-425c-b7c3-162055e0b3ab
name: Potential Data Exfiltration Activity Via CommandLine Tools
description: Detects the use of various CLI utilities exfiltrating data via web requests
severity: high
enabled: false
tags:
  mitre:
  - T1059.001
  categories:
  - endpoint
references:
- https://www.sentinelone.com/blog/living-off-windows-defender-lockbit-ransomware-sideloads-cobalt-strike-through-microsoft-security-tool/
logsource:
  category: process_creation
  product: windows
detection:
  selection_iwr:
    Image|endswith:
    - \powershell_ise.exe
    - \powershell.exe
    - \pwsh.exe
    - \cmd.exe
    CommandLine|contains:
    - 'curl '
    - Invoke-RestMethod
    - Invoke-WebRequest
    - 'irm '
    - 'iwr '
    - 'wget '
    CommandLine|contains|all:
    - ' -ur'
    - ' -me'
    - ' -b'
    - ' POST '
  selection_curl:
    Image|endswith: \curl.exe
    CommandLine|contains: --ur
  selection_curl_data:
    CommandLine|contains:
    - ' -d '
    - ' --data '
  selection_wget:
    Image|endswith: \wget.exe
    CommandLine|contains:
    - --post-data
    - --post-file
  payloads:
  - CommandLine|re:
    - net\s+view
    - sc\s+query
  - CommandLine|contains:
    - Get-Content
    - GetBytes
    - hostname
    - ifconfig
    - ipconfig
    - netstat
    - nltest
    - qprocess
    - systeminfo
    - tasklist
    - ToBase64String
    - whoami
  - CommandLine|contains|all:
    - 'type '
    - ' > '
    - ' C:\'
  condition: (selection_iwr or all of selection_curl* or selection_wget) and payloads
provenance:
  source: SigmaHQ/sigma
  source_id: 7d1aaf3d-4304-425c-b7c3-162055e0b3ab
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_susp_data_exfiltration_via_cli.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
