id: sigmahq-sigma-e2812b49-bae0-4b21-b366-7c142eafcde2
name: Potentially Suspicious Call To Win32_NTEventlogFile Class - PSScript
description: Detects usage of the WMI class "Win32_NTEventlogFile" in a potentially
  suspicious way (delete, backup, change permissions, etc.) from a PowerShell script
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/previous-versions/windows/desktop/legacy/aa394225(v=vs.85)
logsource:
  category: ps_script
  product: windows
  definition: bade5735-5ab0-4aa7-a642-a11be0e40872
detection:
  selection_class:
    ScriptBlockText|contains: Win32_NTEventlogFile
  selection_function:
    ScriptBlockText|contains:
    - .BackupEventlog(
    - .ChangeSecurityPermissions(
    - .ChangeSecurityPermissionsEx(
    - .ClearEventLog(
    - .Delete(
    - .DeleteEx(
    - .Rename(
    - .TakeOwnerShip(
    - .TakeOwnerShipEx(
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: e2812b49-bae0-4b21-b366-7c142eafcde2
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_win32_nteventlogfile_usage.yml
falsepositives:
- Legitimate administration and backup scripts
notes:
  quarantine_reason: 'upstream status: test'
