id: sigmahq-sigma-9fc3072c-dc8f-4bf7-b231-18950000fadd
name: Potential Recon Activity Using DriverQuery.EXE
description: Detect usage of the "driverquery" utility to perform reconnaissance on
  installed drivers
severity: high
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://thedfirreport.com/2023/01/09/unwrapping-ursnifs-gifts/
- https://www.vmray.com/cyber-security-blog/analyzing-ursnif-behavior-malware-sandbox/
- https://www.fireeye.com/blog/threat-research/2020/01/saigon-mysterious-ursnif-fork.html
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: driverquery.exe
  - OriginalFileName: drvqry.exe
  selection_parent:
  - ParentImage|endswith:
    - \cscript.exe
    - \mshta.exe
    - \regsvr32.exe
    - \rundll32.exe
    - \wscript.exe
  - ParentImage|contains:
    - \AppData\Local\
    - \Users\Public\
    - \Windows\Temp\
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 9fc3072c-dc8f-4bf7-b231-18950000fadd
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_driverquery_recon.yml
falsepositives:
- Legitimate usage by some scripts might trigger this as well
notes:
  quarantine_reason: 'upstream status: test'
