id: sigmahq-sigma-970007b7-ce32-49d0-a4a4-fbef016950bd
name: Potential Configuration And Service Reconnaissance Via Reg.EXE
description: Detects the usage of "reg.exe" in order to query reconnaissance information
  from the registry. Adversaries may interact with the Windows registry to gather
  information about credentials, the system, configuration, and installed software.
severity: medium
enabled: false
tags:
  mitre:
  - T1012
  - T1007
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1012/T1012.md
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \reg.exe
  - OriginalFileName: reg.exe
  selection_flag:
    CommandLine|contains: query
  selection_key:
    CommandLine|contains:
    - currentVersion\windows
    - winlogon\
    - currentVersion\shellServiceObjectDelayLoad
    - currentVersion\run
    - currentVersion\policies\explorer\run
    - currentcontrolset\services
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 970007b7-ce32-49d0-a4a4-fbef016950bd
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_reg_query_registry.yml
falsepositives:
- Discord
notes:
  quarantine_reason: 'upstream status: test'
