id: sigmahq-sigma-7f5d1c9a-3e83-48df-95a7-2b98aae6c13c
name: Potential Provlaunch.EXE Binary Proxy Execution Abuse
description: Detects child processes of "provlaunch.exe" which might indicate potential
  abuse to proxy execution.
severity: medium
enabled: false
tags:
  mitre:
  - T1218
  categories:
  - endpoint
references:
- https://lolbas-project.github.io/lolbas/Binaries/Provlaunch/
- https://twitter.com/0gtweet/status/1674399582162153472
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage|endswith: \provlaunch.exe
  filter_main_covered_children:
  - Image|endswith:
    - \calc.exe
    - \cmd.exe
    - \cscript.exe
    - \mshta.exe
    - \notepad.exe
    - \powershell.exe
    - \pwsh.exe
    - \regsvr32.exe
    - \rundll32.exe
    - \wscript.exe
  - Image|contains:
    - :\PerfLogs\
    - :\Temp\
    - :\Users\Public\
    - \AppData\Temp\
    - \Windows\System32\Tasks\
    - \Windows\Tasks\
    - \Windows\Temp\
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 7f5d1c9a-3e83-48df-95a7-2b98aae6c13c
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_provlaunch_potential_abuse.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
