id: sigmahq-sigma-867356ee-9352-41c9-a8f2-1be690d78216
name: Potentially Suspicious Regsvr32 HTTP/FTP Pattern
description: Detects regsvr32 execution to download/install/register new DLLs that
  are hosted on Web or FTP servers.
severity: medium
enabled: false
tags:
  mitre:
  - T1218.010
  categories:
  - endpoint
references:
- https://twitter.com/mrd0x/status/1461041276514623491
- https://twitter.com/tccontre18/status/1480950986650832903
- https://lolbas-project.github.io/lolbas/Binaries/Regsvr32/
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \regsvr32.exe
  - OriginalFileName: REGSVR32.EXE
  selection_flag:
    CommandLine|contains:
    - ' /i'
    - ' -i'
  selection_protocol:
    CommandLine|contains:
    - ftp
    - http
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 867356ee-9352-41c9-a8f2-1be690d78216
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_regsvr32_network_pattern.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
