id: sigmahq-sigma-0442defa-b4a2-41c9-ae2c-ea7042fc4701
name: Potential Credential Dumping Attempt Using New NetworkProvider - REG
description: Detects when an attacker tries to add a new network provider in order
  to dump clear text credentials, similar to how the NPPSpy tool does it
severity: medium
enabled: false
tags:
  mitre:
  - T1003
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/troubleshoot/windows-client/setup-upgrade-and-drivers/network-provider-settings-removed-in-place-upgrade
- https://github.com/gtworek/PSBits/tree/master/PasswordStealing/NPPSpy
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains|all:
    - \System\CurrentControlSet\Services\
    - \NetworkProvider
  filter:
    TargetObject|contains:
    - \System\CurrentControlSet\Services\WebClient\NetworkProvider
    - \System\CurrentControlSet\Services\LanmanWorkstation\NetworkProvider
    - \System\CurrentControlSet\Services\RDPNP\NetworkProvider
  filter_valid_procs:
    Image: C:\Windows\System32\poqexec.exe
  condition: selection and not 1 of filter*
provenance:
  source: SigmaHQ/sigma
  source_id: 0442defa-b4a2-41c9-ae2c-ea7042fc4701
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_new_network_provider.yml
falsepositives:
- Other legitimate network providers used and not filtred in this rule
notes:
  quarantine_reason: 'upstream status: test'
