id: sigmahq-sigma-55e29995-75e7-451a-bef0-6225e2f13597
name: Potential Credential Dumping Via LSASS SilentProcessExit Technique
description: Detects changes to the Registry in which a monitor program gets registered
  to dump the memory of the lsass.exe process
severity: critical
enabled: false
tags:
  mitre:
  - T1003.001
  categories:
  - endpoint
references:
- https://www.deepinstinct.com/2021/02/16/lsass-memory-dumps-are-stealthier-than-ever-before-part-2/
- https://oddvar.moe/2018/04/10/persistence-using-globalflags-in-image-file-execution-options-hidden-from-autoruns-exe/
logsource:
  category: registry_event
  product: windows
detection:
  selection:
    TargetObject|contains: Microsoft\Windows NT\CurrentVersion\SilentProcessExit\lsass.exe
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 55e29995-75e7-451a-bef0-6225e2f13597
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_event/registry_event_silentprocessexit_lsass.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
