id: sigmahq-sigma-12b8e9f5-96b2-41e1-9a42-8c6779a5c184
name: Potentially Suspicious Execution Of PDQDeployRunner
description: Detects suspicious execution of "PDQDeployRunner" which is part of the
  PDQDeploy service stack that is responsible for executing commands and packages
  on a remote machines
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://twitter.com/malmoeb/status/1550483085472432128
logsource:
  category: process_creation
  product: windows
detection:
  selection_parent:
    ParentImage|contains: \PDQDeployRunner-
  selection_child:
  - Image|endswith:
    - \bash.exe
    - \certutil.exe
    - \cmd.exe
    - \csc.exe
    - \cscript.exe
    - \dllhost.exe
    - \mshta.exe
    - \msiexec.exe
    - \regsvr32.exe
    - \rundll32.exe
    - \scriptrunner.exe
    - \wmic.exe
    - \wscript.exe
    - \wsl.exe
  - Image|contains:
    - :\ProgramData\
    - :\Users\Public\
    - :\Windows\TEMP\
    - \AppData\Local\Temp
  - CommandLine|contains:
    - ' -decode '
    - ' -enc '
    - ' -encodedcommand '
    - ' -w hidden'
    - DownloadString
    - FromBase64String
    - http
    - 'iex '
    - Invoke-
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 12b8e9f5-96b2-41e1-9a42-8c6779a5c184
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_pdqdeploy_runner_susp_children.yml
falsepositives:
- Legitimate use of the PDQDeploy tool to execute these commands
notes:
  quarantine_reason: 'upstream status: test'
