id: sigmahq-sigma-4cad6c64-d6df-42d6-8dae-eb78defdc415
name: Potential Linux Process Code Injection Via DD Utility
description: Detects the injection of code by overwriting the memory map of a Linux
  process using the "dd" Linux command.
severity: medium
enabled: false
tags:
  mitre:
  - T1055.009
  categories:
  - endpoint
references:
- https://www.aon.com/cyber-solutions/aon_cyber_labs/linux-based-inter-process-code-injection-without-ptrace2/
- https://github.com/AonCyberLabs/Cexigua/blob/34d338620afae4c6335ba8d8d499e1d7d3d5d7b5/overwrite.sh
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    Image|endswith: /dd
    CommandLine|contains|all:
    - of=
    - /proc/
    - /mem
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 4cad6c64-d6df-42d6-8dae-eb78defdc415
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/process_creation/proc_creation_lnx_dd_process_injection.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
