id: sigmahq-sigma-1eeed653-dbc8-4187-ad0c-eeebb20e6599
name: Potential SPN Enumeration Via Setspn.EXE
description: Detects service principal name (SPN) enumeration used for Kerberoasting
severity: medium
enabled: false
tags:
  mitre:
  - T1558.003
  categories:
  - endpoint
references:
- https://web.archive.org/web/20200329173843/https://p16.praetorian.com/blog/how-to-use-kerberoasting-t1208-for-privilege-escalation
- https://www.praetorian.com/blog/how-to-use-kerberoasting-t1208-for-privilege-escalation/?edition=2019
logsource:
  category: process_creation
  product: windows
detection:
  selection_pe:
  - Image|endswith: \setspn.exe
  - OriginalFileName: setspn.exe
  - Description|contains|all:
    - Query or reset the computer
    - SPN attribute
  selection_cli:
    CommandLine|contains:
    - ' -q '
    - ' /q '
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 1eeed653-dbc8-4187-ad0c-eeebb20e6599
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_setspn_spn_enumeration.yml
falsepositives:
- Administration activity
notes:
  quarantine_reason: 'upstream status: test'
