id: sigmahq-sigma-d2eb17db-1d39-41dc-b57f-301f6512fa75
name: Potentially Suspicious Command Targeting Teams Sensitive Files
description: 'Detects a commandline containing references to the Microsoft Teams database
  or cookies files from a process other than Teams.

  The database might contain authentication tokens and other sensitive information
  about the logged in accounts.'
severity: medium
enabled: false
tags:
  mitre:
  - T1528
  categories:
  - endpoint
references:
- https://www.bleepingcomputer.com/news/security/microsoft-teams-stores-auth-tokens-as-cleartext-in-windows-linux-macs/
- https://www.vectra.ai/blogpost/undermining-microsoft-teams-security-by-mining-tokens
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    CommandLine|contains:
    - \Microsoft\Teams\Cookies
    - \Microsoft\Teams\Local Storage\leveldb
  filter_main_legit_locations:
    Image|endswith: \Microsoft\Teams\current\Teams.exe
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: d2eb17db-1d39-41dc-b57f-301f6512fa75
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_teams_suspicious_command_line_cred_access.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
