id: sigmahq-sigma-0e20c89d-2264-44ae-8238-aeeaba609ece
name: Potential Persistence Via Microsoft Office Startup Folder
description: Detects creation of Microsoft Office files inside of one of the default
  startup folders in order to achieve persistence.
severity: high
enabled: false
tags:
  mitre:
  - T1137
  categories:
  - endpoint
references:
- https://insight-jp.nttsecurity.com/post/102hojk/operation-restylink-apt-campaign-targeting-japanese-companies
- https://learn.microsoft.com/en-us/office/troubleshoot/excel/use-startup-folders
logsource:
  category: file_event
  product: windows
detection:
  selection_word_paths:
  - TargetFilename|contains: \Microsoft\Word\STARTUP
  - TargetFilename|contains|all:
    - \Office
    - \Program Files
    - \STARTUP
  selection_word_extension:
    TargetFilename|endswith:
    - .doc
    - .docm
    - .docx
    - .dot
    - .dotm
    - .rtf
  selection_excel_paths:
  - TargetFilename|contains: \Microsoft\Excel\XLSTART
  - TargetFilename|contains|all:
    - \Office
    - \Program Files
    - \XLSTART
  selection_excel_extension:
    TargetFilename|endswith:
    - .xls
    - .xlsm
    - .xlsx
    - .xlt
    - .xltm
  filter_main_office:
    Image|endswith:
    - \WINWORD.exe
    - \EXCEL.exe
  condition: (all of selection_word_* or all of selection_excel_*) and not filter_main_office
provenance:
  source: SigmaHQ/sigma
  source_id: 0e20c89d-2264-44ae-8238-aeeaba609ece
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_office_startup_persistence.yml
falsepositives:
- Loading a user environment from a backup or a domain controller
- Synchronization of templates
notes:
  quarantine_reason: 'upstream status: test'
