id: sigmahq-sigma-4ae3e30b-b03f-43aa-87e3-b622f4048eed
name: Potential Arbitrary File Download Using Office Application
description: Detects potential arbitrary file download using a Microsoft Office application
severity: high
enabled: false
tags:
  mitre:
  - T1202
  categories:
  - endpoint
references:
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Winword/
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Powerpnt/
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Excel/
- https://medium.com/@reegun/unsanitized-file-validation-leads-to-malicious-payload-download-via-office-binaries-202d02db7191
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - \EXCEL.EXE
    - \POWERPNT.EXE
    - \WINWORD.exe
  - OriginalFileName:
    - Excel.exe
    - POWERPNT.EXE
    - WinWord.exe
  selection_http:
    CommandLine|contains:
    - http://
    - https://
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 4ae3e30b-b03f-43aa-87e3-b622f4048eed
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_office_arbitrary_cli_download.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
