id: sigmahq-sigma-c8da0dfd-4ed0-4b68-962d-13c9c884384e
name: Potential Credential Dumping Via LSASS Process Clone
description: Detects a suspicious LSASS process process clone that could be a sign
  of credential dumping activity
severity: critical
enabled: false
tags:
  mitre:
  - T1003
  - T1003.001
  categories:
  - endpoint
references:
- https://www.matteomalvica.com/blog/2019/12/02/win-defender-atp-cred-bypass/
- https://twitter.com/Hexacorn/status/1420053502554951689
- https://twitter.com/SBousseaden/status/1464566846594691073?s=20
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage|endswith: \Windows\System32\lsass.exe
    Image|endswith: \Windows\System32\lsass.exe
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: c8da0dfd-4ed0-4b68-962d-13c9c884384e
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_lsass_process_clone.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
