id: sigmahq-sigma-2569ed8c-1147-498a-9b8c-2ad3656b10ed
name: Potential Renamed Rundll32 Execution
description: Detects when 'DllRegisterServer' is called in the commandline and the
  image is not rundll32. This could mean that the 'rundll32' utility has been renamed
  in order to avoid detection
severity: high
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://twitter.com/swisscom_csirt/status/1331634525722521602?s=20
- https://app.any.run/tasks/f74c5157-8508-4ac6-9805-d63fe7b0d399/
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains: DllRegisterServer
  filter:
    Image|endswith: \rundll32.exe
  condition: selection and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: 2569ed8c-1147-498a-9b8c-2ad3656b10ed
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_renamed_rundll32_dllregisterserver.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
