id: sigmahq-sigma-79b06761-465f-4f88-9ef2-150e24d3d737
name: Potential SysInternals ProcDump Evasion
description: Detects uses of the SysInternals ProcDump utility in which ProcDump or
  its output get renamed, or a dump file is moved or copied to a different name
severity: high
enabled: false
tags:
  mitre:
  - T1036
  - T1003.001
  categories:
  - endpoint
references:
- https://twitter.com/mrd0x/status/1480785527901204481
logsource:
  category: process_creation
  product: windows
detection:
  selection_1:
    CommandLine|contains:
    - copy procdump
    - move procdump
  selection_2:
    CommandLine|contains|all:
    - 'copy '
    - '.dmp '
    CommandLine|contains:
    - 2.dmp
    - lsass
    - out.dmp
  selection_3:
    CommandLine|contains:
    - copy lsass.exe_
    - move lsass.exe_
  condition: 1 of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 79b06761-465f-4f88-9ef2-150e24d3d737
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_sysinternals_procdump_evasion.yml
falsepositives:
- False positives are expected in cases in which ProcDump just gets copied to a different
  directory without any renaming
notes:
  quarantine_reason: 'upstream status: test'
