id: sigmahq-sigma-02b18447-ea83-4b1b-8805-714a8a34546a
name: Potential Mpclient.DLL Sideloading Via OfflineScannerShell.EXE Execution
description: 'Detects execution of Windows Defender "OfflineScannerShell.exe" from
  its non standard directory.

  The "OfflineScannerShell.exe" binary is vulnerable to DLL side loading and will
  load any DLL named "mpclient.dll" from the current working directory.'
severity: medium
enabled: false
tags:
  mitre:
  - T1218
  categories:
  - endpoint
references:
- https://lolbas-project.github.io/lolbas/Binaries/OfflineScannerShell/
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Image|endswith: \OfflineScannerShell.exe
  - OriginalFileName: OfflineScannerShell.exe
  filter_main_legit_dir:
    CurrentDirectory: C:\Program Files\Windows Defender\Offline\
  filter_main_empty:
    CurrentDirectory: ''
  filter_main_null:
    CurrentDirectory: null
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 02b18447-ea83-4b1b-8805-714a8a34546a
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_offlinescannershell_mpclient_sideloading.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
