id: sigmahq-sigma-a4824fca-976f-4964-b334-0621379e84c4
name: Potential File Overwrite Via Sysinternals SDelete
description: Detects the use of SDelete to erase a file not the free space
severity: high
enabled: false
tags:
  mitre:
  - T1485
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1485/T1485.md
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    OriginalFileName: sdelete.exe
  filter:
    CommandLine|contains:
    - ' -h'
    - ' -c'
    - ' -z'
    - ' /\?'
  condition: selection and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: a4824fca-976f-4964-b334-0621379e84c4
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_sysinternals_sdelete.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
