id: sigmahq-sigma-91b76b84-8589-47aa-9605-c837583b82a9
name: Potential Okta Password in AlternateID Field
description: 'Detects when a user has potentially entered their password into the

  username field, which will cause the password to be retained in log files.'
severity: high
enabled: false
tags:
  mitre:
  - T1552
  categories:
  - identity
references:
- https://developer.okta.com/docs/reference/api/system-log/
- https://www.mitiga.io/blog/how-okta-passwords-can-be-compromised-uncovering-a-risk-to-user-data
- https://help.okta.com/en-us/Content/Topics/users-groups-profiles/usgp-create-character-restriction.htm
logsource:
  product: okta
  service: okta
detection:
  selection:
    legacyEventType: core.user_auth.login_failed
  filter_main:
    actor.alternateId|re: (^0oa.*|[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,10})
  condition: selection and not filter_main
provenance:
  source: SigmaHQ/sigma
  source_id: 91b76b84-8589-47aa-9605-c837583b82a9
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/identity/okta/okta_password_in_alternateid_field.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
