id: sigmahq-sigma-b9aeac14-2ffd-4ad3-b967-1354a4e628c3
name: PowerShell Get-Clipboard Cmdlet Via CLI
description: Detects usage of the 'Get-Clipboard' cmdlet via CLI
severity: medium
enabled: false
tags:
  mitre:
  - T1115
  categories:
  - endpoint
references:
- https://github.com/OTRF/detection-hackathon-apt29/issues/16
- https://github.com/OTRF/ThreatHunter-Playbook/blob/2d4257f630f4c9770f78d0c1df059f891ffc3fec/docs/evals/apt29/detections/3.B.2_C36B49B5-DF58-4A34-9FE9-56189B9DEFEA.md
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains: Get-Clipboard
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: b9aeac14-2ffd-4ad3-b967-1354a4e628c3
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_powershell_get_clipboard.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
