id: sigmahq-sigma-9e07f6e7-83aa-45c6-998e-0af26efd0a85
name: Powershell WMI Persistence
description: Adversaries may establish persistence and elevate privileges by executing
  malicious content triggered by a Windows Management Instrumentation (WMI) event
  subscription.
severity: medium
enabled: false
tags:
  mitre:
  - T1546.003
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1546.003/T1546.003.md
- https://github.com/EmpireProject/Empire/blob/08cbd274bef78243d7a8ed6443b8364acd1fc48b/data/module_source/persistence/Persistence.psm1#L545
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection_ioc:
  - ScriptBlockText|contains|all:
    - 'New-CimInstance '
    - '-Namespace root/subscription '
    - '-ClassName __EventFilter '
    - '-Property '
  - ScriptBlockText|contains|all:
    - 'New-CimInstance '
    - '-Namespace root/subscription '
    - '-ClassName CommandLineEventConsumer '
    - '-Property '
  condition: selection_ioc
provenance:
  source: SigmaHQ/sigma
  source_id: 9e07f6e7-83aa-45c6-998e-0af26efd0a85
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_wmi_persistence.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
