id: sigmahq-sigma-b5b78988-486d-4a80-b991-930eff3ff8bf
name: PowerShell Profile Modification
description: Detects the creation or modification of a powershell profile which could
  indicate suspicious activity as the profile can be used as a mean of persistence
severity: medium
enabled: false
tags:
  mitre:
  - T1546.013
  categories:
  - endpoint
references:
- https://www.welivesecurity.com/2019/05/29/turla-powershell-usage/
- https://persistence-info.github.io/Data/powershellprofile.html
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename|endswith:
    - \Microsoft.PowerShell_profile.ps1
    - \PowerShell\profile.ps1
    - \Program Files\PowerShell\7-preview\profile.ps1
    - \Program Files\PowerShell\7\profile.ps1
    - \Windows\System32\WindowsPowerShell\v1.0\profile.ps1
    - \WindowsPowerShell\profile.ps1
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: b5b78988-486d-4a80-b991-930eff3ff8bf
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_susp_powershell_profile.yml
falsepositives:
- System administrator creating Powershell profile manually
notes:
  quarantine_reason: 'upstream status: test'
