id: sigmahq-sigma-363eccc0-279a-4ccf-a3ab-24c2e63b11fb
name: Powershell Create Scheduled Task
description: Adversaries may abuse the Windows Task Scheduler to perform task scheduling
  for initial or recurring execution of malicious code
severity: medium
enabled: false
tags:
  mitre:
  - T1053.005
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1053.005/T1053.005.md#atomic-test-4---powershell-cmdlet-scheduled-task
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1053.005/T1053.005.md#atomic-test-6---wmi-invoke-cimmethod-scheduled-task
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection_cmdlet:
    ScriptBlockText|contains:
    - New-ScheduledTaskAction
    - New-ScheduledTaskTrigger
    - New-ScheduledTaskPrincipal
    - New-ScheduledTaskSettingsSet
    - New-ScheduledTask
    - Register-ScheduledTask
  selection_cimmethod:
    ScriptBlockText|contains|all:
    - Invoke-CimMethod
    - -ClassName
    - PS_ScheduledTask
    - -NameSpace
    - Root\Microsoft\Windows\TaskScheduler
  filter_main_legitimate_scripts:
    ScriptBlockText|contains|all:
    - Microsoft.PowerShell.Core\Export-ModuleMember
    - Microsoft.Management.Infrastructure.CimInstance
    - __cmdletization_methodParameter
  condition: 1 of selection_* and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 363eccc0-279a-4ccf-a3ab-24c2e63b11fb
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_cmdlet_scheduled_task.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
