id: sigmahq-sigma-c6fb44c6-71f5-49e6-9462-1425d328aee3
name: Powershell Base64 Encoded MpPreference Cmdlet
description: Detects base64 encoded "MpPreference" PowerShell cmdlet code that tries
  to modifies or tamper with Windows Defender AV
severity: high
enabled: false
tags:
  mitre:
  - T1685
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/defender-endpoint/configure-process-opened-file-exclusions-microsoft-defender-antivirus
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md
- https://twitter.com/AdamTheAnalyst/status/1483497517119590403
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - CommandLine|base64offset|contains:
    - 'Add-MpPreference '
    - 'Set-MpPreference '
    - 'add-mppreference '
    - 'set-mppreference '
  - CommandLine|contains:
    - QQBkAGQALQBNAHAAUAByAGUAZgBlAHIAZQBuAGMAZQAgA
    - EAZABkAC0ATQBwAFAAcgBlAGYAZQByAGUAbgBjAGUAIA
    - BAGQAZAAtAE0AcABQAHIAZQBmAGUAcgBlAG4AYwBlACAA
    - UwBlAHQALQBNAHAAUAByAGUAZgBlAHIAZQBuAGMAZQAgA
    - MAZQB0AC0ATQBwAFAAcgBlAGYAZQByAGUAbgBjAGUAIA
    - TAGUAdAAtAE0AcABQAHIAZQBmAGUAcgBlAG4AYwBlACAA
    - YQBkAGQALQBtAHAAcAByAGUAZgBlAHIAZQBuAGMAZQAgA
    - EAZABkAC0AbQBwAHAAcgBlAGYAZQByAGUAbgBjAGUAIA
    - hAGQAZAAtAG0AcABwAHIAZQBmAGUAcgBlAG4AYwBlACAA
    - cwBlAHQALQBtAHAAcAByAGUAZgBlAHIAZQBuAGMAZQAgA
    - MAZQB0AC0AbQBwAHAAcgBlAGYAZQByAGUAbgBjAGUAIA
    - zAGUAdAAtAG0AcABwAHIAZQBmAGUAcgBlAG4AYwBlACAA
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: c6fb44c6-71f5-49e6-9462-1425d328aee3
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_powershell_base64_mppreference.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
