id: sigmahq-sigma-8218c875-90b9-42e2-b60d-0b0069816d10
name: PowerShell Script Execution Policy Enabled
description: Detects the enabling of the PowerShell script execution policy. Once
  enabled, this policy allows scripts to be executed.
severity: low
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://admx.help/?Category=Windows_10_2016&Policy=Microsoft.Policies.PowerShell::EnableScripts
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|endswith: \Policies\Microsoft\Windows\PowerShell\EnableScripts
    Details: DWORD (0x00000001)
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 8218c875-90b9-42e2-b60d-0b0069816d10
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_powershell_enablescripts_enabled.yml
falsepositives:
- Likely
notes:
  quarantine_reason: 'upstream status: test'
