id: sigmahq-sigma-b5522a23-82da-44e5-9c8b-e10ed8955f88
name: Powershell Execute Batch Script
description: 'Adversaries may abuse the Windows command shell for execution.

  The Windows command shell ([cmd](https://attack.mitre.org/software/S0106)) is the
  primary command prompt on Windows systems.

  The Windows command prompt can be used to control almost any aspect of a system,
  with various permission levels required for different subsets of commands.

  Batch files (ex: .bat or .cmd) also provide the shell with a list of sequential
  commands to run, as well as normal scripting operations such as conditionals and
  loops.

  Common uses of batch files include long or repetitive tasks, or the need to run
  the same set of commands on multiple system'
severity: medium
enabled: false
tags:
  mitre:
  - T1059.003
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1059.003/T1059.003.md#atomic-test-1---create-and-execute-batch-script
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection_start:
    ScriptBlockText|contains: Start-Process
  selection_batch:
    ScriptBlockText|contains:
    - .cmd
    - .bat
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: b5522a23-82da-44e5-9c8b-e10ed8955f88
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_susp_execute_batch_script.yml
falsepositives:
- Legitimate administration script
notes:
  quarantine_reason: 'upstream status: test'
