id: sigmahq-sigma-6385697e-9f1b-40bd-8817-f4a91f40508e
name: PowerShell Base64 Encoded Invoke Keyword
description: Detects UTF-8 and UTF-16 Base64 encoded powershell 'Invoke-' calls
severity: high
enabled: false
tags:
  mitre:
  - T1059.001
  - T1027
  categories:
  - endpoint
references:
- https://thedfirreport.com/2022/05/09/seo-poisoning-a-gootloader-story/
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - \powershell.exe
    - \pwsh.exe
  - OriginalFileName:
    - PowerShell.EXE
    - pwsh.dll
  selection_cli_enc:
    CommandLine|contains: ' -e'
  selection_cli_invoke:
    CommandLine|contains:
    - SQBuAHYAbwBrAGUALQ
    - kAbgB2AG8AawBlAC0A
    - JAG4AdgBvAGsAZQAtA
    - SW52b2tlL
    - ludm9rZS
    - JbnZva2Ut
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 6385697e-9f1b-40bd-8817-f4a91f40508e
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_powershell_base64_invoke.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
