id: sigmahq-sigma-d2e3f2f6-7e09-4bf2-bc5d-90186809e7fb
name: PowerShell Script With File Upload Capabilities
description: Detects PowerShell scripts leveraging the "Invoke-WebRequest" cmdlet
  to send data via either "PUT" or "POST" method.
severity: low
enabled: false
tags:
  mitre:
  - T1020
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1020/T1020.md
- https://www.w3.org/Protocols/rfc2616/rfc2616-sec9.html
- https://learn.microsoft.com/en-us/powershell/module/microsoft.powershell.utility/invoke-webrequest?view=powershell-7.4
logsource:
  product: windows
  category: ps_script
  definition: bade5735-5ab0-4aa7-a642-a11be0e40872
detection:
  selection_cmdlet:
    ScriptBlockText|contains:
    - Invoke-RestMethod
    - Invoke-WebRequest
    - 'irm '
    - 'iwr '
  selection_flag:
    ScriptBlockText|contains:
    - -Method "POST"
    - -Method "PUT"
    - -Method POST
    - -Method PUT
    - -Method 'POST'
    - -Method 'PUT'
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: d2e3f2f6-7e09-4bf2-bc5d-90186809e7fb
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_script_with_upload_capabilities.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
