id: sigmahq-sigma-34f90d3c-c297-49e9-b26d-911b05a4866c
name: Powershell Keylogging
description: Adversaries may log user keystrokes to intercept credentials as the user
  types them.
severity: medium
enabled: false
tags:
  mitre:
  - T1056.001
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218/T1218.md
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1056.001/src/Get-Keystrokes.ps1
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection_basic:
    ScriptBlockText|contains: Get-Keystrokes
  selection_high:
    ScriptBlockText|contains|all:
    - Get-ProcAddress user32.dll GetAsyncKeyState
    - Get-ProcAddress user32.dll GetForegroundWindow
  condition: 1 of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 34f90d3c-c297-49e9-b26d-911b05a4866c
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_keylogging.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
