id: sigmahq-sigma-c70e019b-1479-4b65-b0cc-cd0c6093a599
name: PowerShell Called from an Executable Version Mismatch
description: Detects PowerShell called from an executable by the version mismatch
  method
severity: high
enabled: false
tags:
  mitre:
  - T1059.001
  categories:
  - endpoint
references:
- https://adsecurity.org/?p=2921
logsource:
  product: windows
  category: ps_classic_start
detection:
  selection_engine:
    Data|contains:
    - EngineVersion=2.
    - EngineVersion=4.
    - EngineVersion=5.
  selection_host:
    Data|contains: HostVersion=3.
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: c70e019b-1479-4b65-b0cc-cd0c6093a599
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_classic/posh_pc_exe_calling_ps.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
