id: sigmahq-sigma-a699b30e-d010-46c8-bbd1-ee2e26765fe9
name: Powershell Store File In Alternate Data Stream
description: Storing files in Alternate Data Stream (ADS) similar to Astaroth malware.
severity: medium
enabled: false
tags:
  mitre:
  - T1564.004
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1564.004/T1564.004.md
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection_compspec:
    ScriptBlockText|contains|all:
    - Start-Process
    - '-FilePath "$env:comspec" '
    - '-ArgumentList '
    - '>'
  condition: selection_compspec
provenance:
  source: SigmaHQ/sigma
  source_id: a699b30e-d010-46c8-bbd1-ee2e26765fe9
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_store_file_in_alternate_data_stream.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
