id: sigmahq-sigma-cae80281-ef23-44c5-873b-fd48d2666f49
name: PowerShell Script Change Permission Via Set-Acl - PsScript
description: Detects PowerShell scripts set ACL to of a file or a folder
severity: low
enabled: false
tags:
  mitre:
  - T1222
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/74438b0237d141ee9c99747976447dc884cb1a39/atomics/T1505.005/T1505.005.md
logsource:
  product: windows
  category: ps_script
  definition: bade5735-5ab0-4aa7-a642-a11be0e40872
detection:
  selection:
    ScriptBlockText|contains|all:
    - 'Set-Acl '
    - '-AclObject '
    - '-Path '
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: cae80281-ef23-44c5-873b-fd48d2666f49
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_set_acl.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
