id: sigmahq-sigma-17769c90-230e-488b-a463-e05c08e9d48f
name: Powershell Defender Exclusion
description: Detects requests to exclude files, folders or processes from Antivirus
  scanning using PowerShell cmdlets
severity: medium
enabled: false
tags:
  mitre:
  - T1685
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/defender-endpoint/configure-process-opened-file-exclusions-microsoft-defender-antivirus
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md
- https://twitter.com/AdamTheAnalyst/status/1483497517119590403
logsource:
  category: process_creation
  product: windows
detection:
  selection1:
    CommandLine|contains:
    - 'Add-MpPreference '
    - 'Set-MpPreference '
  selection2:
    CommandLine|contains:
    - ' -ExclusionPath '
    - ' -ExclusionExtension '
    - ' -ExclusionProcess '
    - ' -ExclusionIpAddress '
  condition: all of selection*
provenance:
  source: SigmaHQ/sigma
  source_id: 17769c90-230e-488b-a463-e05c08e9d48f
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_powershell_defender_exclusion.yml
falsepositives:
- Possible Admin Activity
- Other Cmdlets that may use the same parameters
notes:
  quarantine_reason: 'upstream status: test'
