id: sigmahq-sigma-16b37b70-6fcf-4814-a092-c36bd3aafcbd
name: PowerShell ShellCode
description: Detects Base64 encoded Shellcode
severity: high
enabled: false
tags:
  mitre:
  - T1055
  - T1059.001
  categories:
  - endpoint
references:
- https://twitter.com/cyb3rops/status/1063072865992523776
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection:
    ScriptBlockText|contains:
    - OiCAAAAYInlM
    - OiJAAAAYInlM
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 16b37b70-6fcf-4814-a092-c36bd3aafcbd
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_shellcode_b64.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
