id: sigmahq-sigma-e3845023-ca9a-4024-b2b2-5422156d5527
name: PowerShell Module File Created By Non-PowerShell Process
description: Detects the creation of a new PowerShell module ".psm1", ".psd1", ".dll",
  ".ps1", etc. by a non-PowerShell process
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- Internal Research
- https://learn.microsoft.com/en-us/powershell/scripting/developer/module/understanding-a-windows-powershell-module?view=powershell-7.3
logsource:
  category: file_event
  product: windows
detection:
  selection:
    TargetFilename|contains:
    - \WindowsPowerShell\Modules\
    - \PowerShell\7\Modules\
  filter_main_pwsh:
    Image|endswith:
    - :\Program Files\PowerShell\7-preview\pwsh.exe
    - :\Program Files\PowerShell\7\pwsh.exe
    - :\Windows\System32\poqexec.exe
    - :\Windows\System32\WindowsPowerShell\v1.0\powershell_ise.exe
    - :\Windows\System32\WindowsPowerShell\v1.0\powershell.exe
    - :\Windows\SysWOW64\poqexec.exe
    - :\Windows\SysWOW64\WindowsPowerShell\v1.0\powershell_ise.exe
    - :\Windows\SysWOW64\WindowsPowerShell\v1.0\powershell.exe
  filter_main_msiexec:
    Image:
    - C:\Windows\System32\msiexec.exe
    - C:\Windows\SysWOW64\msiexec.exe
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: e3845023-ca9a-4024-b2b2-5422156d5527
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_powershell_module_uncommon_creation.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
