id: sigmahq-sigma-ac175779-025a-4f12-98b0-acdaeb77ea85
name: PowerShell Script Run in AppData
description: Detects a suspicious command line execution that invokes PowerShell with
  reference to an AppData folder
severity: medium
enabled: false
tags:
  mitre:
  - T1059.001
  categories:
  - endpoint
references:
- https://twitter.com/JohnLaTwC/status/1082851155481288706
- https://app.any.run/tasks/f87f1c4e-47e2-4c46-9cf4-31454c06ce03
logsource:
  category: process_creation
  product: windows
detection:
  selection1:
    CommandLine|contains:
    - powershell.exe
    - \powershell
    - \pwsh
    - pwsh.exe
  selection2:
    CommandLine|contains|all:
    - '/c '
    - \AppData\
    CommandLine|contains:
    - Local\
    - Roaming\
  condition: all of selection*
provenance:
  source: SigmaHQ/sigma
  source_id: ac175779-025a-4f12-98b0-acdaeb77ea85
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_powershell_susp_ps_appdata.yml
falsepositives:
- Administrative scripts
notes:
  quarantine_reason: 'upstream status: test'
