id: sigmahq-sigma-c6438007-e081-42ce-9483-b067fbef33c3
name: Powershell Timestomp
description: 'Adversaries may modify file time attributes to hide new or changes to
  existing files.

  Timestomping is a technique that modifies the timestamps of a file (the modify,
  access, create, and change times), often to mimic files that are in the same folder.'
severity: medium
enabled: false
tags:
  mitre:
  - T1070.006
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1070.006/T1070.006.md
- https://www.offensive-security.com/metasploit-unleashed/timestomp/
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection_ioc:
    ScriptBlockText|contains:
    - .CreationTime =
    - .LastWriteTime =
    - .LastAccessTime =
    - '[IO.File]::SetCreationTime'
    - '[IO.File]::SetLastAccessTime'
    - '[IO.File]::SetLastWriteTime'
  condition: selection_ioc
provenance:
  source: SigmaHQ/sigma
  source_id: c6438007-e081-42ce-9483-b067fbef33c3
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_timestomp.yml
falsepositives:
- Legitimate admin script
notes:
  quarantine_reason: 'upstream status: test'
