id: sigmahq-sigma-4cbd4f12-2e22-43e3-882f-bff3247ffb78
name: PowerShell Get Clipboard
description: A General detection for the Get-Clipboard commands in PowerShell logs.
  This could be an adversary capturing clipboard contents.
severity: medium
enabled: false
tags:
  mitre:
  - T1115
  categories:
  - endpoint
references:
- https://github.com/OTRF/detection-hackathon-apt29/issues/16
- https://github.com/OTRF/ThreatHunter-Playbook/blob/2d4257f630f4c9770f78d0c1df059f891ffc3fec/docs/evals/apt29/detections/7.A.2_F4609F7E-C4DB-4327-91D4-59A58C962A02.md
logsource:
  product: windows
  category: ps_module
  definition: 0ad03ef1-f21b-4a79-8ce8-e6900c54b65b
detection:
  selection:
    Payload|contains: Get-Clipboard
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 4cbd4f12-2e22-43e3-882f-bff3247ffb78
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_module/posh_pm_get_clipboard.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
