id: sigmahq-sigma-4368354e-1797-463c-bc39-a309effbe8d7
name: Powershell Add Name Resolution Policy Table Rule
description: 'Detects powershell scripts that adds a Name Resolution Policy Table
  (NRPT) rule for the specified namespace.

  This will bypass the default DNS server and uses a specified server for answering
  the query.'
severity: high
enabled: false
tags:
  mitre:
  - T1565
  categories:
  - endpoint
references:
- https://twitter.com/NathanMcNulty/status/1569497348841287681
- https://learn.microsoft.com/en-us/powershell/module/dnsclient/add-dnsclientnrptrule?view=windowsserver2022-ps
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection:
    ScriptBlockText|contains|all:
    - Add-DnsClientNrptRule
    - -Namesp
    - -NameSe
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 4368354e-1797-463c-bc39-a309effbe8d7
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_add_dnsclient_rule.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
