id: sigmahq-sigma-1ddc1472-8e52-4f7d-9f11-eab14fc171f5
name: PowerShell Decompress Commands
description: A General detection for specific decompress commands in PowerShell logs.
  This could be an adversary decompressing files.
severity: low
enabled: false
tags:
  mitre:
  - T1140
  categories:
  - endpoint
references:
- https://github.com/OTRF/detection-hackathon-apt29/issues/8
- https://github.com/OTRF/ThreatHunter-Playbook/blob/2d4257f630f4c9770f78d0c1df059f891ffc3fec/docs/evals/apt29/detections/4.A.3_09F29912-8E93-461E-9E89-3F06F6763383.md
logsource:
  product: windows
  category: ps_module
  definition: 0ad03ef1-f21b-4a79-8ce8-e6900c54b65b
detection:
  selection_4103:
    Payload|contains: Expand-Archive
  condition: selection_4103
provenance:
  source: SigmaHQ/sigma
  source_id: 1ddc1472-8e52-4f7d-9f11-eab14fc171f5
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_module/posh_pm_decompress_commands.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
