id: sigmahq-sigma-3bf1d859-3a7e-44cb-8809-a99e066d3478
name: PowerShell Set-Acl On Windows Folder - PsScript
description: Detects PowerShell scripts to set the ACL to a file in the Windows folder
severity: high
enabled: false
tags:
  mitre:
  - T1222
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/74438b0237d141ee9c99747976447dc884cb1a39/atomics/T1505.005/T1505.005.md
- https://learn.microsoft.com/en-us/powershell/module/microsoft.powershell.security/set-acl?view=powershell-5.1
logsource:
  product: windows
  category: ps_script
  definition: bade5735-5ab0-4aa7-a642-a11be0e40872
detection:
  selection_cmdlet:
    ScriptBlockText|contains|all:
    - 'Set-Acl '
    - '-AclObject '
  selection_paths:
    ScriptBlockText|contains:
    - -Path "C:\Windows
    - -Path "C:/Windows
    - -Path 'C:\Windows
    - -Path 'C:/Windows
    - -Path C:\\Windows
    - -Path C:/Windows
    - -Path $env:windir
    - -Path "$env:windir
    - -Path '$env:windir
  selection_permissions:
    ScriptBlockText|contains:
    - FullControl
    - Allow
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 3bf1d859-3a7e-44cb-8809-a99e066d3478
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_set_acl_susp_location.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
