id: sigmahq-sigma-4c4af3cd-2115-479c-8193-6b8bfce9001c
name: PowerShell ICMP Exfiltration
description: Detects Exfiltration Over Alternative Protocol - ICMP. Adversaries may
  steal data by exfiltrating it over an un-encrypted network protocol other than that
  of the existing command and control channel.
severity: medium
enabled: false
tags:
  mitre:
  - T1048.003
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1048.003/T1048.003.md#atomic-test-2---exfiltration-over-alternative-protocol---icmp
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection:
    ScriptBlockText|contains|all:
    - New-Object
    - System.Net.NetworkInformation.Ping
    - .Send(
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 4c4af3cd-2115-479c-8193-6b8bfce9001c
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_icmp_exfiltration.yml
falsepositives:
- Legitimate usage of System.Net.NetworkInformation.Ping class
notes:
  quarantine_reason: 'upstream status: test'
