id: sigmahq-sigma-2a926e6a-4b81-4011-8a96-e36cc8c04302
name: PowerShell Scripts Installed as Services - Security
description: Detects powershell script installed as a Service
severity: high
enabled: false
tags:
  mitre:
  - T1569.002
  categories:
  - endpoint
references:
- https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse
logsource:
  product: windows
  service: security
  definition: The 'System Security Extension' audit subcategory need to be enabled
    to log the EID 4697
detection:
  selection:
    EventID: 4697
    ServiceFileName|contains:
    - powershell
    - pwsh
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 2a926e6a-4b81-4011-8a96-e36cc8c04302
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/security/win_security_powershell_script_installed_as_service.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
