id: sigmahq-sigma-222720a7-047f-4054-baa5-bab9be757db0
name: PowerShell MSI Install via WindowsInstaller COM From Remote Location
description: 'Detects the execution of PowerShell commands that attempt to install
  MSI packages via the

  Windows Installer COM object (`WindowsInstaller.Installer`) hosted remotely.

  This could be indication of malicious software deployment or lateral movement attempts
  using Windows Installer functionality.

  And the usage of WindowsInstaller COM object rather than msiexec could be an attempt
  to bypass the detection.'
severity: medium
enabled: false
tags:
  mitre:
  - T1059.001
  - T1218
  - T1105
  categories:
  - endpoint
references:
- https://informationsecuritybuzz.com/the-real-danger-behind-a-simple-windows-shortcut/
- https://redcanary.com/blog/threat-intelligence/intelligence-insights-may-2025/
- https://www.virustotal.com/gui/file/f9710b0ba4de5fa0e7ec27da462d4d2fc6838eba83a19f23f6617a466bbad457
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - \powershell_ise.exe
    - \powershell.exe
    - \pwsh.exe
  - OriginalFileName:
    - PowerShell_ISE.EXE
    - PowerShell.EXE
    - pwsh.dll
  selection_cli:
    CommandLine|contains|all:
    - -ComObject
    - InstallProduct(
  selection_remote:
    CommandLine|contains:
    - http
    - \\\\
  filter_main_localhost:
    CommandLine|contains:
    - ://127.0.0.1
    - ://localhost
  condition: all of selection_* and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 222720a7-047f-4054-baa5-bab9be757db0
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_powershell_comobject_msi_remote.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: experimental'
