id: sigmahq-sigma-fbc5e92f-3044-4e73-a5c6-1c4359b539de
name: PowerShell Script With File Hostname Resolving Capabilities
description: Detects PowerShell scripts that have capabilities to read files, loop
  through them and resolve DNS host entries.
severity: medium
enabled: false
tags:
  mitre:
  - T1020
  categories:
  - endpoint
references:
- https://www.fortypoundhead.com/showcontent.asp?artid=24022
- https://labs.withsecure.com/publications/fin7-target-veeam-servers
logsource:
  product: windows
  category: ps_script
  definition: bade5735-5ab0-4aa7-a642-a11be0e40872
detection:
  selection:
    ScriptBlockText|contains|all:
    - 'Get-content '
    - foreach
    - '[System.Net.Dns]::GetHostEntry'
    - Out-File
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: fbc5e92f-3044-4e73-a5c6-1c4359b539de
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_resolve_list_of_ip_from_file.yml
falsepositives:
- The same functionality can be implemented by admin scripts, correlate with name
  and creator
notes:
  quarantine_reason: 'upstream status: test'
