id: sigmahq-sigma-ee218c12-627a-4d27-9e30-d6fb2fe22ed2
name: Powershell Inline Execution From A File
description: Detects inline execution of PowerShell code from a file
severity: medium
enabled: false
tags:
  mitre:
  - T1059.001
  categories:
  - endpoint
references:
- https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=50
logsource:
  product: windows
  category: process_creation
detection:
  selection_exec:
    CommandLine|contains:
    - 'iex '
    - 'Invoke-Expression '
    - 'Invoke-Command '
    - 'icm '
  selection_read:
    CommandLine|contains:
    - 'cat '
    - 'get-content '
    - 'type '
  selection_raw:
    CommandLine|contains: ' -raw'
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: ee218c12-627a-4d27-9e30-d6fb2fe22ed2
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_powershell_exec_data_file.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
