id: sigmahq-sigma-1af57a4b-460a-4738-9034-db68b880c665
name: PowerShell SAM Copy
description: Detects suspicious PowerShell scripts accessing SAM hives
severity: high
enabled: false
tags:
  mitre:
  - T1003.002
  categories:
  - endpoint
references:
- https://twitter.com/splinter_code/status/1420546784250769408
logsource:
  category: process_creation
  product: windows
detection:
  selection_1:
    CommandLine|contains|all:
    - \HarddiskVolumeShadowCopy
    - System32\config\sam
  selection_2:
    CommandLine|contains:
    - Copy-Item
    - cp $_.
    - cpi $_.
    - copy $_.
    - .File]::Copy(
  condition: all of selection*
provenance:
  source: SigmaHQ/sigma
  source_id: 1af57a4b-460a-4738-9034-db68b880c665
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_powershell_sam_access.yml
falsepositives:
- Some rare backup scenarios
- PowerShell scripts fixing HiveNightmare / SeriousSAM ACLs
notes:
  quarantine_reason: 'upstream status: test'
