id: sigmahq-sigma-576426ad-0131-4001-ae01-be175da0c108
name: PowerShell Script Dropped Via PowerShell.EXE
description: Detects PowerShell creating a PowerShell file (.ps1). While often times
  this behavior is benign, sometimes it can be a sign of a dropper script trying to
  achieve persistence.
severity: low
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://www.zscaler.com/blogs/security-research/onenote-growing-threat-malware-distribution
logsource:
  product: windows
  category: file_event
detection:
  selection:
    Image|endswith:
    - \powershell.exe
    - \pwsh.exe
    TargetFilename|endswith: .ps1
  filter_main_psscriptpolicytest:
    TargetFilename|contains: __PSScriptPolicyTest_
  filter_main_appdata:
    TargetFilename|startswith: C:\Users\
    TargetFilename|contains: \AppData\Local\Temp\
  filter_main_windows_temp:
    TargetFilename|startswith: C:\Windows\Temp\
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 576426ad-0131-4001-ae01-be175da0c108
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_powershell_drop_powershell.yml
falsepositives:
- False positives will differ depending on the environment and scripts used. Apply
  additional filters accordingly.
notes:
  quarantine_reason: 'upstream status: test'
