id: sigmahq-sigma-bdeb2cff-af74-4094-8426-724dc937f20a
name: PowerShell Script Change Permission Via Set-Acl
description: Detects PowerShell execution to set the ACL of a file or a folder
severity: high
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/powershell/module/microsoft.powershell.security/set-acl?view=powershell-5.1
- https://github.com/redcanaryco/atomic-red-team/blob/74438b0237d141ee9c99747976447dc884cb1a39/atomics/T1505.005/T1505.005.md
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - OriginalFileName:
    - PowerShell.EXE
    - pwsh.dll
  - Image|endswith:
    - \powershell.exe
    - \pwsh.exe
  selection_cmdlet:
    CommandLine|contains|all:
    - 'Set-Acl '
    - '-AclObject '
    - '-Path '
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: bdeb2cff-af74-4094-8426-724dc937f20a
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_powershell_set_acl.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
