id: sigmahq-sigma-3b6ab547-8ec2-4991-b9d2-2b06702a48d7
name: PowerShell Download Pattern
description: Detects a Powershell process that contains download commands in its command
  line string
severity: medium
enabled: false
tags:
  mitre:
  - T1059.001
  categories:
  - endpoint
references:
- https://blog.redteam.pl/2020/06/black-kingdom-ransomware.html
- https://lab52.io/blog/winter-vivern-all-summer/
- https://hatching.io/blog/powershell-analysis/
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - \powershell_ise.exe
    - \powershell.exe
    - \pwsh.exe
  - OriginalFileName:
    - PowerShell_ISE.EXE
    - PowerShell.EXE
    - pwsh.dll
  selection_cli:
    CommandLine|contains|all:
    - new-object
    - net.webclient).
    - download
    CommandLine|contains:
    - string(
    - file(
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 3b6ab547-8ec2-4991-b9d2-2b06702a48d7
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_powershell_download_patterns.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
