id: sigmahq-sigma-6331d09b-4785-4c13-980f-f96661356249
name: PowerShell Downgrade Attack - PowerShell
description: Detects PowerShell downgrade attack by comparing the host versions with
  the actually used engine version 2.0
severity: medium
enabled: false
tags:
  mitre:
  - T1059.001
  categories:
  - endpoint
references:
- http://www.leeholmes.com/blog/2017/03/17/detecting-and-preventing-powershell-downgrade-attacks/
logsource:
  product: windows
  category: ps_classic_start
detection:
  selection:
    Data|contains: EngineVersion=2.
  filter_main:
    Data|contains: HostVersion=2.
  condition: selection and not filter_main
provenance:
  source: SigmaHQ/sigma
  source_id: 6331d09b-4785-4c13-980f-f96661356249
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_classic/posh_pc_downgrade_attack.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
