id: sigmahq-sigma-a84fc3b1-c9ce-4125-8e74-bdcdb24021f1
name: Primary Refresh Token Access Attempt
description: Indicates access attempt to the PRT resource which can be used to move
  laterally into an organization or perform credential theft
severity: high
enabled: false
tags:
  mitre:
  - T1528
  categories:
  - cloud
references:
- https://learn.microsoft.com/en-us/entra/id-protection/concept-identity-protection-risks#possible-attempt-to-access-primary-refresh-token-prt
- https://learn.microsoft.com/en-us/entra/architecture/security-operations-user-accounts#unusual-sign-ins
logsource:
  product: azure
  service: riskdetection
detection:
  selection:
    riskEventType: attemptedPrtAccess
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: a84fc3b1-c9ce-4125-8e74-bdcdb24021f1
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/azure/identity_protection/azure_identity_protection_prt_access.yml
falsepositives:
- This detection is low-volume and is seen infrequently in most organizations. When
  this detection appears it's high risk, and users should be remediated.
notes:
  quarantine_reason: 'upstream status: test'
