id: sigmahq-sigma-0ac15ec3-d24f-4246-aa2a-3077bb1cf90e
name: Privileged User Has Been Created
description: Detects the addition of a new user to a privileged group such as "root"
  or "sudo"
severity: high
enabled: false
tags:
  mitre:
  - T1136.001
  - T1098
  categories:
  - endpoint
references:
- https://digital.nhs.uk/cyber-alerts/2018/cc-2825
- https://linux.die.net/man/8/useradd
- https://github.com/redcanaryco/atomic-red-team/blob/25acadc0b43a07125a8a5b599b28bbc1a91ffb06/atomics/T1136.001/T1136.001.md#atomic-test-5---create-a-new-user-in-linux-with-root-uid-and-gid
logsource:
  product: linux
  definition: /var/log/secure on REHL systems or /var/log/auth.log on debian like
    Systems needs to be collected in order for this detection to work
detection:
  selection_new_user:
  - new user
  selection_uids_gids:
  - GID=0,
  - UID=0,
  - GID=10,
  - GID=27,
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 0ac15ec3-d24f-4246-aa2a-3077bb1cf90e
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/builtin/lnx_privileged_user_creation.yml
falsepositives:
- Administrative activity
notes:
  quarantine_reason: 'upstream status: test'
