id: sigmahq-sigma-221b251a-357a-49a9-920a-271802777cc0
name: Process Reconnaissance Via Wmic.EXE
description: Detects the execution of "wmic" with the "process" flag, which adversary
  might use to list processes running on the compromised host or list installed software
  hotfixes and patches.
severity: medium
enabled: false
tags:
  mitre:
  - T1047
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1047/T1047.md
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/wmic
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \WMIC.exe
  - OriginalFileName: wmic.exe
  selection_cli:
    CommandLine|contains: process
  filter_main_creation:
    CommandLine|contains|all:
    - call
    - create
  condition: all of selection* and not 1 of filter_*
provenance:
  source: SigmaHQ/sigma
  source_id: 221b251a-357a-49a9-920a-271802777cc0
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_wmic_recon_process.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
