id: sigmahq-sigma-3dfd06d2-eaf4-4532-9555-68aca59f57c4
name: Process Execution From A Potentially Suspicious Folder
description: Detects a potentially suspicious execution from an uncommon folder.
severity: high
enabled: false
tags:
  mitre:
  - T1036
  categories:
  - endpoint
references:
- https://github.com/mbevilacqua/appcompatprocessor/blob/6c847937c5a836e2ce2fe2b915f213c345a3c389/AppCompatSearch.txt
- https://www.secureworks.com/research/bronze-butler-targets-japanese-businesses
- https://www.crowdstrike.com/resources/reports/2019-crowdstrike-global-threat-report/
- https://github.com/ThreatHuntingProject/ThreatHunting/blob/cb22598bb70651f88e0285abc8d835757d2cb596/hunts/suspicious_process_creation_via_windows_event_logs.md
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|contains:
    - :\Perflogs\
    - :\Users\All Users\
    - :\Users\Default\
    - :\Users\NetworkService\
    - :\Windows\addins\
    - :\Windows\debug\
    - :\Windows\Fonts\
    - :\Windows\Help\
    - :\Windows\IME\
    - :\Windows\Media\
    - :\Windows\repair\
    - :\Windows\security\
    - :\Windows\System32\Tasks\
    - :\Windows\Tasks\
    - $Recycle.bin
    - \config\systemprofile\
    - \Intel\Logs\
    - \RSA\MachineKeys\
  filter_optional_ibm:
    Image|startswith: C:\Users\Public\IBM\ClientSolutions\Start_Programs\
  filter_optional_citrix:
    Image|startswith: C:\Windows\SysWOW64\config\systemprofile\Citrix\UpdaterBinaries\
    Image|endswith: \CitrixReceiverUpdater.exe
  condition: selection and not 1 of filter_optional_*
provenance:
  source: SigmaHQ/sigma
  source_id: 3dfd06d2-eaf4-4532-9555-68aca59f57c4
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_susp_execution_path.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
