id: sigmahq-sigma-f208d6d8-d83a-4c2c-960d-877c37da84e5
name: Process Launched Without Image Name
description: Detect the use of processes with no name (".exe"), which can be used
  to evade Image-based detections.
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://www.huntress.com/blog/fake-browser-updates-lead-to-boinc-volunteer-computing-software
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: \.exe
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: f208d6d8-d83a-4c2c-960d-877c37da84e5
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_susp_no_image_name.yml
falsepositives:
- Rare legitimate software.
notes:
  quarantine_reason: 'upstream status: test'
