id: sigmahq-sigma-8cd538a4-62d5-4e83-810b-12d41e428d6e
name: Processes Accessing the Microphone and Webcam
description: Potential adversaries accessing the microphone and webcam in an endpoint.
severity: medium
enabled: false
tags:
  mitre:
  - T1123
  categories:
  - endpoint
references:
- https://twitter.com/duzvik/status/1269671601852813320
- https://medium.com/@7a616368/can-you-track-processes-accessing-the-camera-and-microphone-7e6885b37072
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID:
    - 4657
    - 4656
    - 4663
    ObjectName|contains:
    - \SOFTWARE\Microsoft\Windows\CurrentVersion\CapabilityAccessManager\ConsentStore\microphone\NonPackaged
    - \SOFTWARE\Microsoft\Windows\CurrentVersion\CapabilityAccessManager\ConsentStore\webcam\NonPackaged
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 8cd538a4-62d5-4e83-810b-12d41e428d6e
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/security/win_security_camera_microphone_access.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
