id: sigmahq-sigma-edadb1e5-5919-4e4c-8462-a9e643b02c4b
name: Process Memory Dump via RdrLeakDiag.EXE
description: Detects the use of the Microsoft Windows Resource Leak Diagnostic tool
  "rdrleakdiag.exe" to dump process memory
severity: high
enabled: false
tags:
  mitre:
  - T1003.001
  categories:
  - endpoint
references:
- https://www.pureid.io/dumping-abusing-windows-credentials-part-1/
- https://www.crowdstrike.com/blog/overwatch-exposes-aquatic-panda-in-possession-of-log-4-shell-exploit-tools/
- https://lolbas-project.github.io/lolbas/Binaries/Rdrleakdiag/
- https://twitter.com/0gtweet/status/1299071304805560321?s=21
- https://news.sophos.com/en-us/2024/06/05/operation-crimson-palace-a-technical-deep-dive
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \rdrleakdiag.exe
  - OriginalFileName: RdrLeakDiag.exe
  selection_cli_dump:
    CommandLine|contains|windash:
    - /memdmp
    - fullmemdmp
  selection_cli_output_process:
    CommandLine|contains|windash:
    - ' /o '
    - ' /p '
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: edadb1e5-5919-4e4c-8462-a9e643b02c4b
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_rdrleakdiag_process_dumping.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
