id: sigmahq-sigma-2e65275c-8288-4ab4-aeb7-6274f58b6b20
name: Procdump Execution
description: Detects usage of the SysInternals Procdump utility
severity: medium
enabled: false
tags:
  mitre:
  - T1036
  - T1003.001
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/sysinternals/downloads/procdump
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith:
    - \procdump.exe
    - \procdump64.exe
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 2e65275c-8288-4ab4-aeb7-6274f58b6b20
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_sysinternals_procdump.yml
falsepositives:
- Legitimate use of procdump by a developer or administrator
notes:
  quarantine_reason: 'upstream status: test'
