id: sigmahq-sigma-45545954-4016-43c6-855e-eae8f1c369dc
name: Protected Storage Service Access
description: Detects access to a protected_storage service over the network. Potential
  abuse of DPAPI to extract domain backup keys from Domain Controllers
severity: high
enabled: false
tags:
  mitre:
  - T1021.002
  categories:
  - endpoint
references:
- https://threathunterplaybook.com/hunts/windows/190620-DomainDPAPIBackupKeyExtraction/notebook.html
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 5145
    ShareName|contains: IPC
    RelativeTargetName: protected_storage
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 45545954-4016-43c6-855e-eae8f1c369dc
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/security/win_security_protected_storage_service_access.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
