id: sigmahq-sigma-af77cf95-c469-471c-b6a0-946c685c4798
name: Proxy Execution Via Wuauclt.EXE
description: Detects the use of the Windows Update Client binary (wuauclt.exe) for
  proxy execution.
severity: high
enabled: false
tags:
  mitre:
  - T1218
  categories:
  - endpoint
references:
- https://dtm.uk/wuauclt/
- https://blog.malwarebytes.com/threat-intelligence/2022/01/north-koreas-lazarus-apt-leverages-windows-update-client-github-in-latest-campaign/
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \wuauclt.exe
  - OriginalFileName: wuauclt.exe
  selection_cli:
    CommandLine|contains|all:
    - UpdateDeploymentProvider
    - RunHandlerComServer
  filter_main_generic:
    CommandLine|contains: ' /UpdateDeploymentProvider UpdateDeploymentProvider.dll '
  filter_main_wuaueng:
    CommandLine|contains: ' wuaueng.dll '
  filter_main_uus:
    CommandLine|contains:
    - :\Windows\UUS\Packages\Preview\amd64\updatedeploy.dll /ClassId
    - :\Windows\UUS\amd64\UpdateDeploy.dll /ClassId
  filter_main_winsxs:
    CommandLine|contains|all:
    - :\Windows\WinSxS\
    - '\UpdateDeploy.dll /ClassId '
  condition: all of selection_* and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: af77cf95-c469-471c-b6a0-946c685c4798
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_wuauclt_dll_loading.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
