id: sigmahq-sigma-550d3350-bb8a-4ff3-9533-2ba533f4a1c0
name: ProxyLogon MSExchange OabVirtualDirectory
description: Detects specific patterns found after a successful ProxyLogon exploitation
  in relation to a Commandlet invocation of Set-OabVirtualDirectory
severity: critical
enabled: false
tags:
  mitre:
  - T1587.001
  categories:
  - endpoint
references:
- https://bi-zone.medium.com/hunting-down-ms-exchange-attacks-part-1-proxylogon-cve-2021-26855-26858-27065-26857-6e885c5f197c
logsource:
  product: windows
  service: msexchange-management
detection:
  keywords_cmdlet:
    '|all':
    - OabVirtualDirectory
    - ' -ExternalUrl '
  keywords_params:
  - eval(request
  - http://f/<script
  - '"unsafe"};'
  - function Page_Load()
  condition: keywords_cmdlet and keywords_params
provenance:
  source: SigmaHQ/sigma
  source_id: 550d3350-bb8a-4ff3-9533-2ba533f4a1c0
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/msexchange/win_exchange_proxylogon_oabvirtualdir.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
