id: sigmahq-sigma-afd3df04-948d-46f6-ae44-25966c44b97f
name: PSAsyncShell - Asynchronous TCP Reverse Shell
description: Detects the use of PSAsyncShell an Asynchronous TCP Reverse Shell written
  in powershell
severity: high
enabled: false
tags:
  mitre:
  - T1059.001
  categories:
  - endpoint
references:
- https://github.com/JoelGMSec/PSAsyncShell
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection:
    ScriptBlockText|contains: PSAsyncShell
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: afd3df04-948d-46f6-ae44-25966c44b97f
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_psasyncshell.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
