id: sigmahq-sigma-41504465-5e3a-4a5b-a5b4-2a0baadd4463
name: PsExec Tool Execution From Suspicious Locations - PipeName
description: Detects PsExec default pipe creation where the image executed is located
  in a suspicious location. Which could indicate that the tool is being used in an
  attack
severity: medium
enabled: false
tags:
  mitre:
  - T1569.002
  categories:
  - endpoint
references:
- https://www.jpcert.or.jp/english/pub/sr/ir_research.html
- https://jpcertcc.github.io/ToolAnalysisResultSheet
logsource:
  category: pipe_created
  product: windows
  definition: Note that you have to configure logging for Named Pipe Events in Sysmon
    config (Event ID 17 and Event ID 18). The basic configuration is in popular sysmon
    configuration (https://github.com/SwiftOnSecurity/sysmon-config), but it is worth
    verifying. You can also use other repo, e.g. https://github.com/Neo23x0/sysmon-config,
    https://github.com/olafhartong/sysmon-modular. How to test detection? You can
    check powershell script from this site https://svch0st.medium.com/guide-to-named-pipes-and-hunting-for-cobalt-strike-pipes-dc46b2c5f575
detection:
  selection:
    PipeName: \PSEXESVC
    Image|contains:
    - :\Users\Public\
    - :\Windows\Temp\
    - \AppData\Local\Temp\
    - \Desktop\
    - \Downloads\
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 41504465-5e3a-4a5b-a5b4-2a0baadd4463
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/pipe_created/pipe_created_sysinternals_psexec_default_pipe_susp_location.yml
falsepositives:
- Rare legitimate use of psexec from the locations mentioned above. This will require
  initial tuning based on your environment.
notes:
  quarantine_reason: 'upstream status: test'
