id: sigmahq-sigma-97b9ce1e-c5ab-11ea-87d0-0242ac130003
name: PSExec and WMI Process Creations Block
description: Detects blocking of process creations originating from PSExec and WMI
  commands
severity: high
enabled: false
tags:
  mitre:
  - T1047
  - T1569.002
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/defender-endpoint/attack-surface-reduction-rules-reference?view=o365-worldwide#block-process-creations-originating-from-psexec-and-wmi-commands
- https://twitter.com/duff22b/status/1280166329660497920
logsource:
  product: windows
  service: windefend
  definition: 'Requirements:Enabled Block process creations originating from PSExec
    and WMI commands from Attack Surface Reduction (GUID: d1e49aac-8f56-4280-b9ba-993a6d77406c)'
detection:
  selection:
    EventID: 1121
    ProcessName|endswith:
    - \wmiprvse.exe
    - \psexesvc.exe
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 97b9ce1e-c5ab-11ea-87d0-0242ac130003
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/windefend/win_defender_asr_psexec_wmi.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
