id: sigmahq-sigma-1027d292-dd87-4a1a-8701-2abe04d7783c
name: PSScriptPolicyTest Creation By Uncommon Process
description: Detects the creation of the "PSScriptPolicyTest" PowerShell script by
  an uncommon process. This file is usually generated by Microsoft Powershell to test
  against Applocker.
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://www.paloaltonetworks.com/blog/security-operations/stopping-powershell-without-powershell/
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename|contains: __PSScriptPolicyTest_
  filter_main_powershell:
    Image:
    - C:\Program Files\PowerShell\7-preview\pwsh.exe
    - C:\Program Files\PowerShell\7\pwsh.exe
    - C:\Windows\System32\WindowsPowerShell\v1.0\powershell_ise.exe
    - C:\Windows\System32\WindowsPowerShell\v1.0\powershell.exe
    - C:\Windows\SysWOW64\WindowsPowerShell\v1.0\powershell_ise.exe
    - C:\Windows\SysWOW64\WindowsPowerShell\v1.0\powershell.exe
  filter_main_pwsh_preview:
    Image|contains:
    - C:\Program Files\WindowsApps\Microsoft.PowerShellPreview
    - \AppData\Local\Microsoft\WindowsApps\Microsoft.PowerShellPreview
    Image|endswith: \pwsh.exe
  filter_main_generic:
    Image:
    - C:\Windows\System32\dsac.exe
    - C:\Windows\System32\sdiagnhost.exe
    - C:\Windows\System32\ServerManager.exe
    - C:\Windows\System32\wsmprovhost.exe
    - C:\Windows\SysWOW64\sdiagnhost.exe
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 1027d292-dd87-4a1a-8701-2abe04d7783c
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_ps_script_policy_test_creation_by_uncommon_process.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
