id: sigmahq-sigma-6897cd82-6664-11ed-9022-0242ac120002
name: PST Export Alert Using New-ComplianceSearchAction
description: Alert when a user has performed an export to a search using 'New-ComplianceSearchAction'
  with the '-Export' flag. This detection will detect PST export even if the 'eDiscovery
  search or exported' alert is disabled in the O365.This rule will apply to ExchangePowerShell
  usage and from the cloud.
severity: medium
enabled: false
tags:
  mitre:
  - T1114
  categories:
  - cloud
references:
- https://learn.microsoft.com/en-us/powershell/module/exchange/new-compliancesearchaction?view=exchange-ps
logsource:
  service: threat_management
  product: m365
detection:
  selection:
    eventSource: SecurityComplianceCenter
    Payload|contains|all:
    - New-ComplianceSearchAction
    - Export
    - pst
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 6897cd82-6664-11ed-9022-0242ac120002
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/m365/threat_management/microsoft365_pst_export_alert_using_new_compliancesearchaction.yml
falsepositives:
- Exporting a PST can be done for legitimate purposes by legitimate sources, but due
  to the sensitive nature of PST content, it must be monitored.
notes:
  quarantine_reason: 'upstream status: test'
