id: sigmahq-sigma-f38a82d2-fba3-4781-b549-525efbec8506
name: PUA - 3Proxy Execution
description: Detects the use of 3proxy, a tiny free proxy server
severity: high
enabled: false
tags:
  mitre:
  - T1572
  categories:
  - endpoint
references:
- https://github.com/3proxy/3proxy
- https://blog.talosintelligence.com/2022/09/lazarus-three-rats.html
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
    Image|endswith: \3proxy.exe
  selection_pe:
    Description: 3proxy - tiny proxy server
  selection_params:
    CommandLine|contains: .exe -i127.0.0.1 -p
  condition: 1 of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: f38a82d2-fba3-4781-b549-525efbec8506
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_pua_3proxy_execution.yml
falsepositives:
- Administrative activity
notes:
  quarantine_reason: 'upstream status: test'
