id: sigmahq-sigma-9a132afa-654e-11eb-ae93-0242ac130002
name: PUA - AdFind Suspicious Execution
description: Detects AdFind execution with common flags seen used during attacks
severity: high
enabled: false
tags:
  mitre:
  - T1018
  - T1087.002
  - T1482
  - T1069.002
  categories:
  - endpoint
references:
- https://www.joeware.net/freetools/tools/adfind/
- https://thedfirreport.com/2020/05/08/adfind-recon/
- https://thedfirreport.com/2021/01/11/trickbot-still-alive-and-well/
- https://www.microsoft.com/security/blog/2021/01/20/deep-dive-into-the-solorigate-second-stage-activation-from-sunburst-to-teardrop-and-raindrop/
- https://social.technet.microsoft.com/wiki/contents/articles/7535.adfind-command-examples.aspx
- https://github.com/center-for-threat-informed-defense/adversary_emulation_library/blob/bf62ece1c679b07b5fb49c4bae947fe24c81811f/fin6/Emulation_Plan/Phase1.md
- https://github.com/redcanaryco/atomic-red-team/blob/0f229c0e42bfe7ca736a14023836d65baa941ed2/atomics/T1087.002/T1087.002.md#atomic-test-7---adfind---enumerate-active-directory-user-objects
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains:
    - domainlist
    - trustdmp
    - dcmodes
    - adinfo
    - -sc dclist
    - computer_pwdnotreqd
    - objectcategory=
    - -subnets -f
    - name="Domain Admins"
    - '-sc u:'
    - domainncs
    - dompol
    - ' oudmp '
    - subnetdmp
    - gpodmp
    - fspdmp
    - users_noexpire
    - computers_active
    - computers_pwdnotreqd
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 9a132afa-654e-11eb-ae93-0242ac130002
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_pua_adfind_susp_usage.yml
falsepositives:
- Legitimate admin activity
notes:
  quarantine_reason: 'upstream status: test'
