id: sigmahq-sigma-f44800ac-38ec-471f-936e-3fa7d9c53100
name: PUA - CleanWipe Execution
description: Detects the use of CleanWipe a tool usually used to delete Symantec antivirus.
severity: high
enabled: false
tags:
  mitre:
  - T1685
  categories:
  - endpoint
references:
- https://github.com/3CORESec/MAL-CL/tree/master/Descriptors/Other/CleanWipe
logsource:
  category: process_creation
  product: windows
detection:
  selection1:
    Image|endswith: \SepRemovalToolNative_x64.exe
  selection2:
    Image|endswith: \CATClean.exe
    CommandLine|contains: --uninstall
  selection3:
    Image|endswith: \NetInstaller.exe
    CommandLine|contains: -r
  selection4:
    Image|endswith: \WFPUnins.exe
    CommandLine|contains|all:
    - /uninstall
    - /enterprise
  condition: 1 of selection*
provenance:
  source: SigmaHQ/sigma
  source_id: f44800ac-38ec-471f-936e-3fa7d9c53100
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_pua_cleanwipe.yml
falsepositives:
- Legitimate administrative use (Should be investigated either way)
notes:
  quarantine_reason: 'upstream status: test'
