id: sigmahq-sigma-bdeeabc9-ff2a-4a51-be59-bb253aac7891
name: PUA - Wsudo Suspicious Execution
description: Detects usage of wsudo (Windows Sudo Utility). Which is a tool that let
  the user execute programs with different permissions (System, Trusted Installer,
  Administrator...etc)
severity: high
enabled: false
tags:
  mitre:
  - T1059
  categories:
  - endpoint
references:
- https://github.com/M2Team/Privexec/
logsource:
  category: process_creation
  product: windows
detection:
  selection_metadata:
  - Image|endswith: \wsudo.exe
  - OriginalFileName: wsudo.exe
  - Description: Windows sudo utility
  - ParentImage|endswith: \wsudo-bridge.exe
  selection_cli:
    CommandLine|contains:
    - -u System
    - -uSystem
    - -u TrustedInstaller
    - -uTrustedInstaller
    - ' --ti '
  condition: 1 of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: bdeeabc9-ff2a-4a51-be59-bb253aac7891
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_pua_wsudo_susp_execution.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
