id: sigmahq-sigma-d08a2711-ee8b-4323-bdec-b7d85e892b31
name: PUA - CsExec Execution
description: Detects the use of the lesser known remote execution tool named CsExec
  a PsExec alternative
severity: high
enabled: false
tags:
  mitre:
  - T1587.001
  - T1569.002
  categories:
  - endpoint
references:
- https://github.com/malcomvetter/CSExec
- https://www.microsoft.com/security/blog/2022/05/09/ransomware-as-a-service-understanding-the-cybercrime-gig-economy-and-how-to-protect-yourself/
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: \csexec.exe
  selection_pe:
    Description: csexec
  condition: 1 of selection*
provenance:
  source: SigmaHQ/sigma
  source_id: d08a2711-ee8b-4323-bdec-b7d85e892b31
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_pua_csexec.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
