id: sigmahq-sigma-54773c5f-f1cc-4703-9126-2f797d96a69d
name: PUA - Advanced Port Scanner Execution
description: Detects the use of Advanced Port Scanner.
severity: medium
enabled: false
tags:
  mitre:
  - T1046
  - T1135
  categories:
  - endpoint
references:
- https://github.com/3CORESec/MAL-CL/tree/master/Descriptors/Other/Advanced%20Port%20Scanner
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|contains: \advanced_port_scanner
  - OriginalFileName|contains: advanced_port_scanner
  - Description|contains: Advanced Port Scanner
  selection_cli:
    CommandLine|contains|all:
    - /portable
    - /lng
  condition: 1 of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 54773c5f-f1cc-4703-9126-2f797d96a69d
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_pua_advanced_port_scanner.yml
falsepositives:
- Legitimate administrative use
- Tools with similar commandline (very rare)
notes:
  quarantine_reason: 'upstream status: test'
