id: sigmahq-sigma-bef37fa2-f205-4a7b-b484-0759bfd5f86f
name: PUA - Advanced IP Scanner Execution
description: Detects the use of Advanced IP Scanner. Seems to be a popular tool for
  ransomware groups.
severity: medium
enabled: false
tags:
  mitre:
  - T1046
  - T1135
  categories:
  - endpoint
references:
- https://news.sophos.com/en-us/2019/12/09/snatch-ransomware-reboots-pcs-into-safe-mode-to-bypass-protection/
- https://www.fireeye.com/blog/threat-research/2020/05/tactics-techniques-procedures-associated-with-maze-ransomware-incidents.html
- https://labs.f-secure.com/blog/prelude-to-ransomware-systembc
- https://assets.documentcloud.org/documents/20444693/fbi-pin-egregor-ransomware-bc-01062021.pdf
- https://thedfirreport.com/2021/01/18/all-that-for-a-coinminer
- https://github.com/3CORESec/MAL-CL/tree/master/Descriptors/Other/Advanced%20IP%20Scanner
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|contains: \advanced_ip_scanner
  - OriginalFileName|contains: advanced_ip_scanner
  - Description|contains: Advanced IP Scanner
  selection_cli:
    CommandLine|contains|all:
    - /portable
    - /lng
  condition: 1 of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: bef37fa2-f205-4a7b-b484-0759bfd5f86f
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_pua_advanced_ip_scanner.yml
falsepositives:
- Legitimate administrative use
notes:
  quarantine_reason: 'upstream status: test'
