id: sigmahq-sigma-67add051-9ee7-4ad3-93ba-42935615ae8d
name: PUA - Process Hacker Driver Load
description: Detects driver load of the Process Hacker tool
severity: high
enabled: false
tags:
  mitre:
  - T1543
  categories:
  - endpoint
references:
- https://processhacker.sourceforge.io/
logsource:
  category: driver_load
  product: windows
detection:
  selection:
  - ImageLoaded|endswith: \kprocesshacker.sys
  - Hashes|contains:
    - IMPHASH=821D74031D3F625BCBD0DF08B70F1E77
    - IMPHASH=F86759BB4DE4320918615DC06E998A39
    - IMPHASH=0A64EEB85419257D0CE32BD5D55C3A18
    - IMPHASH=6E7B34DFC017700B1517B230DF6FF0D0
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 67add051-9ee7-4ad3-93ba-42935615ae8d
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/driver_load/driver_load_win_pua_process_hacker.yml
falsepositives:
- Legitimate use of process hacker or system informer by developers or system administrators
notes:
  quarantine_reason: 'upstream status: test'
