id: sigmahq-sigma-c9192ad9-75e5-43eb-8647-82a0a5b493e3
name: PUA - Mouse Lock Execution
description: In Kaspersky's 2020 Incident Response Analyst Report they listed legitimate
  tool "Mouse Lock" as being used for both credential access and collection in security
  incidents.
severity: medium
enabled: false
tags:
  mitre:
  - T1056.002
  categories:
  - endpoint
references:
- https://github.com/klsecservices/Publications/blob/657deb6a6eb6e00669afd40173f425fb49682eaa/Incident-Response-Analyst-Report-2020.pdf
- https://sourceforge.net/projects/mouselock/
logsource:
  product: windows
  category: process_creation
detection:
  selection:
  - Product|contains: Mouse Lock
  - Company|contains: Misc314
  - CommandLine|contains: Mouse Lock_
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: c9192ad9-75e5-43eb-8647-82a0a5b493e3
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_pua_mouselock_execution.yml
falsepositives:
- Legitimate uses of Mouse Lock software
notes:
  quarantine_reason: 'upstream status: test'
