id: sigmahq-sigma-4fd6b1c7-19b8-4488-97f6-00f0924991a3
name: PUA - NimScan Execution
description: 'Detects usage of NimScan, a portscanner utility.

  In early 2025, adversaries were observed using this utility to scan for open ports
  on remote hosts in a compromised environment.

  This rule identifies the execution of NimScan based on the process image name and
  specific hash values associated with different versions of the tool.'
severity: medium
enabled: false
tags:
  mitre:
  - T1046
  categories:
  - endpoint
references:
- https://x.com/cyberfeeddigest/status/1887041526397587859
- https://github.com/elddy/NimScan
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Image|endswith: \NimScan.exe
  - Hashes|contains:
    - IMPHASH=41BB1C7571B3A724EB83A1D2B96DBB8C
    - IMPHASH=B1B6ADACB172795480179EFD18A29549
    - IMPHASH=0D1F896DC7642AD8384F9042F30279C2
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 4fd6b1c7-19b8-4488-97f6-00f0924991a3
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_pua_nimscan.yml
falsepositives:
- Legitimate administrator activity
notes:
  quarantine_reason: 'upstream status: test'
