id: sigmahq-sigma-e37db05d-d1f9-49c8-b464-cee1a4b11638
name: PUA - Rclone Execution
description: Detects execution of RClone utility for exfiltration as used by various
  ransomwares strains like REvil, Conti, FiveHands, etc
severity: high
enabled: false
tags:
  mitre:
  - T1567.002
  categories:
  - endpoint
references:
- https://research.nccgroup.com/2021/05/27/detecting-rclone-an-effective-tool-for-exfiltration/
- https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware
- https://us-cert.cisa.gov/ncas/analysis-reports/ar21-126a
- https://labs.sentinelone.com/egregor-raas-continues-the-chaos-with-cobalt-strike-and-rclone
- https://www.splunk.com/en_us/blog/security/darkside-ransomware-splunk-threat-update-and-detections.html
logsource:
  product: windows
  category: process_creation
detection:
  selection_specific_options:
    CommandLine|contains|all:
    - '--config '
    - '--no-check-certificate '
    - ' copy '
  selection_rclone_img:
  - Image|endswith: \rclone.exe
  - Description: Rsync for cloud storage
  selection_rclone_cli:
    CommandLine|contains:
    - pass
    - user
    - copy
    - sync
    - config
    - lsd
    - remote
    - ls
    - mega
    - pcloud
    - ftp
    - ignore-existing
    - auto-confirm
    - transfers
    - multi-thread-streams
    - 'no-check-certificate '
  condition: selection_specific_options or all of selection_rclone_*
provenance:
  source: SigmaHQ/sigma
  source_id: e37db05d-d1f9-49c8-b464-cee1a4b11638
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_pua_rclone_execution.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
