id: sigmahq-sigma-d0dae994-26c6-4d2d-83b5-b3c8b79ae513
name: PUA - WebBrowserPassView Execution
description: Detects the execution of WebBrowserPassView.exe. A password recovery
  tool that reveals the passwords stored by the following Web browsers, Internet Explorer
  (Version 4.0 - 11.0), Mozilla Firefox (All Versions), Google Chrome, Safari, and
  Opera
severity: medium
enabled: false
tags:
  mitre:
  - T1555.003
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1555.003/T1555.003.md
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Description: Web Browser Password Viewer
  - Image|endswith: \WebBrowserPassView.exe
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: d0dae994-26c6-4d2d-83b5-b3c8b79ae513
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_pua_webbrowserpassview.yml
falsepositives:
- Legitimate use
notes:
  quarantine_reason: 'upstream status: test'
