id: sigmahq-sigma-68d37776-61db-42f5-bf54-27e87072d17e
name: PUA - NPS Tunneling Tool Execution
description: Detects the use of NPS, a port forwarding and intranet penetration proxy
  server
severity: high
enabled: false
tags:
  mitre:
  - T1090
  categories:
  - endpoint
references:
- https://github.com/ehang-io/nps
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
    Image|endswith: \npc.exe
  selection_cli_1:
    CommandLine|contains|all:
    - ' -server='
    - ' -vkey='
    - ' -password='
  selection_cli_2:
    CommandLine|contains: ' -config=npc'
  selection_hashes:
    Hashes|contains:
    - MD5=AE8ACF66BFE3A44148964048B826D005
    - SHA1=CEA49E9B9B67F3A13AD0BE1C2655293EA3C18181
    - SHA256=5A456283392FFCEEEACA3D3426C306EB470304637520D72FED1CC1FEBBBD6856
  condition: 1 of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 68d37776-61db-42f5-bf54-27e87072d17e
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_pua_nps.yml
falsepositives:
- Legitimate use
notes:
  quarantine_reason: 'upstream status: test'
