id: sigmahq-sigma-f6ecd1cf-19b8-4488-97f6-00f0924991a3
name: PUA - Nmap/Zenmap Execution
description: Detects usage of namp/zenmap. Adversaries may attempt to get a listing
  of services running on remote hosts, including those that may be vulnerable to remote
  software exploitation
severity: medium
enabled: false
tags:
  mitre:
  - T1046
  categories:
  - endpoint
references:
- https://nmap.org/
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1046/T1046.md#atomic-test-3---port-scan-nmap-for-windows
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Image|endswith:
    - \nmap.exe
    - \zennmap.exe
  - OriginalFileName:
    - nmap.exe
    - zennmap.exe
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: f6ecd1cf-19b8-4488-97f6-00f0924991a3
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_pua_nmap_zenmap.yml
falsepositives:
- Legitimate administrator activity
notes:
  quarantine_reason: 'upstream status: test'
