id: sigmahq-sigma-2c32b543-1058-4808-91c6-5b31b8bed6c5
name: PUA - Crassus Execution
description: Detects Crassus, a Windows privilege escalation discovery tool, based
  on PE metadata characteristics.
severity: high
enabled: false
tags:
  mitre:
  - T1590.001
  categories:
  - endpoint
references:
- https://github.com/vu-ls/Crassus
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Image|endswith: \Crassus.exe
  - OriginalFileName: Crassus.exe
  - Description|contains: Crassus
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 2c32b543-1058-4808-91c6-5b31b8bed6c5
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_pua_crassus.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
