id: sigmahq-sigma-6ddff2e8-ea1a-45d0-8938-93dfc1d67ae7
name: PUA - Restic Backup Tool Execution
description: 'Detects the execution of the Restic backup tool, which can be used for
  data exfiltration.

  Threat actors may leverage Restic to back up and exfiltrate sensitive data to remote
  storage locations, including cloud services.

  If not legitimately used in the enterprise environment, its presence may indicate
  malicious activity.'
severity: high
enabled: false
tags:
  mitre:
  - T1048
  - T1567.002
  categories:
  - endpoint
references:
- https://thedfirreport.com/2024/09/30/nitrogen-campaign-drops-sliver-and-ends-with-blackcat-ransomware/#exfiltration
- https://restic.net/
- https://restic.readthedocs.io/en/stable/030_preparing_a_new_repo.html
logsource:
  product: windows
  category: process_creation
detection:
  selection_specific:
  - CommandLine|contains|all:
    - --password-file
    - init
    - ' -r '
  - CommandLine|contains|all:
    - --use-fs-snapshot
    - backup
    - ' -r '
  selection_restic:
    CommandLine|contains:
    - 'sftp:'
    - rest:http
    - s3:s3.
    - s3.http
    - 'azure:'
    - ' gs:'
    - 'rclone:'
    - 'swift:'
    - ' b2:'
    CommandLine|contains|all:
    - ' init '
    - ' -r '
  condition: 1 of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 6ddff2e8-ea1a-45d0-8938-93dfc1d67ae7
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_pua_restic.yml
falsepositives:
- Legitimate use of Restic for backup purposes within the organization.
notes:
  quarantine_reason: 'upstream status: experimental'
