id: sigmahq-sigma-f0ca6c24-3225-47d5-b1f5-352bf07ecfa7
name: PUA - DefenderCheck Execution
description: Detects the use of DefenderCheck, a tool to evaluate the signatures used
  in Microsoft Defender. It can be used to figure out the strings / byte chains used
  in Microsoft Defender to detect a tool and thus used for AV evasion.
severity: high
enabled: false
tags:
  mitre:
  - T1027.005
  categories:
  - endpoint
references:
- https://github.com/matterpreter/DefenderCheck
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Image|endswith: \DefenderCheck.exe
  - Description: DefenderCheck
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: f0ca6c24-3225-47d5-b1f5-352bf07ecfa7
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_pua_defendercheck.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
