id: sigmahq-sigma-8b0e12da-d3c3-49db-bb4f-256703f380e5
name: PUA - Chisel Tunneling Tool Execution
description: Detects usage of the Chisel tunneling tool via the commandline arguments
severity: high
enabled: false
tags:
  mitre:
  - T1090.001
  categories:
  - endpoint
references:
- https://github.com/jpillora/chisel/
- https://arcticwolf.com/resources/blog/lorenz-ransomware-chiseling-in/
- https://blog.sekoia.io/lucky-mouse-incident-response-to-detection-engineering/
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
    Image|endswith: \chisel.exe
  selection_param1:
    CommandLine|contains:
    - 'exe client '
    - 'exe server '
  selection_param2:
    CommandLine|contains:
    - -socks5
    - -reverse
    - ' r:'
    - ':127.0.0.1:'
    - '-tls-skip-verify '
    - :socks
  condition: selection_img or all of selection_param*
provenance:
  source: SigmaHQ/sigma
  source_id: 8b0e12da-d3c3-49db-bb4f-256703f380e5
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_pua_chisel.yml
falsepositives:
- Some false positives may occur with other tools with similar commandlines
notes:
  quarantine_reason: 'upstream status: test'
