id: sigmahq-sigma-d2b749ee-4225-417e-b20e-a8d2193cbb84
name: PUA - AdvancedRun Execution
description: Detects the execution of AdvancedRun utility
severity: medium
enabled: false
tags:
  mitre:
  - T1564.003
  - T1134.002
  - T1059.003
  categories:
  - endpoint
references:
- https://twitter.com/splinter_code/status/1483815103279603714
- https://medium.com/s2wblog/analysis-of-destructive-malware-whispergate-targeting-ukraine-9d5d158f19f3
- https://www.elastic.co/security-labs/operation-bleeding-bear
- https://www.winhelponline.com/blog/run-program-as-system-localsystem-account-windows/
logsource:
  product: windows
  category: process_creation
detection:
  selection:
  - OriginalFileName: AdvancedRun.exe
  - CommandLine|contains|all:
    - ' /EXEFilename '
    - ' /Run'
  - CommandLine|contains|all:
    - ' /WindowState 0'
    - ' /RunAs '
    - ' /CommandLine '
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: d2b749ee-4225-417e-b20e-a8d2193cbb84
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_pua_advancedrun.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
