id: sigmahq-sigma-d7654f02-e04b-4934-9838-65c46f187ebc
name: PUA- IOX Tunneling Tool Execution
description: Detects the use of IOX - a tool for port forwarding and intranet proxy
  purposes
severity: high
enabled: false
tags:
  mitre:
  - T1090
  categories:
  - endpoint
references:
- https://github.com/EddieIvan01/iox
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: \iox.exe
  selection_commandline:
    CommandLine|contains:
    - '.exe fwd -l '
    - '.exe fwd -r '
    - '.exe proxy -l '
    - '.exe proxy -r '
  selection_hashes:
    Hashes|contains:
    - MD5=9DB2D314DD3F704A02051EF5EA210993
    - SHA1=039130337E28A6623ECF9A0A3DA7D92C5964D8DD
    - SHA256=C6CF82919B809967D9D90EA73772A8AA1C1EB3BC59252D977500F64F1A0D6731
  condition: 1 of selection*
provenance:
  source: SigmaHQ/sigma
  source_id: d7654f02-e04b-4934-9838-65c46f187ebc
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_pua_iox.yml
falsepositives:
- Legitimate use
notes:
  quarantine_reason: 'upstream status: test'
