id: sigmahq-sigma-e76ca062-4de0-4d79-8d90-160a0d335eca
name: PUA - Kernel Driver Utility (KDU) Execution
description: 'Detects execution of the Kernel Driver Utility (KDU) tool.

  KDU can be used to bypass driver signature enforcement and load unsigned or malicious
  drivers into the Windows kernel.

  Potentially allowing for privilege escalation, persistence, or evasion of security
  controls.'
severity: high
enabled: false
tags:
  mitre:
  - T1543.003
  categories:
  - endpoint
references:
- https://github.com/h4rmy/KDU
- https://huntress.com/blog/esxi-vm-escape-exploit
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - \kdu.exe
    - \hamakaze.exe
  - OriginalFileName: hamakaze.exe
  selection_cli_suspicious:
    CommandLine|contains:
    - '-map '
    - '-prv '
    - '-dse '
    - '-ps '
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: e76ca062-4de0-4d79-8d90-160a0d335eca
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_pua_kdu_driver_tool.yml
falsepositives:
- Legitimate driver development, testing, or administrative troubleshooting (e.g.,
  enabling/disabling hardware)
notes:
  quarantine_reason: 'upstream status: experimental'
