id: sigmahq-sigma-fa00b701-44c6-4679-994d-5a18afa8a707
name: PUA - AdvancedRun Suspicious Execution
description: Detects the execution of AdvancedRun utility in the context of the TrustedInstaller,
  SYSTEM, Local Service or Network Service accounts
severity: high
enabled: false
tags:
  mitre:
  - T1134.002
  categories:
  - endpoint
references:
- https://twitter.com/splinter_code/status/1483815103279603714
- https://medium.com/s2wblog/analysis-of-destructive-malware-whispergate-targeting-ukraine-9d5d158f19f3
- https://www.elastic.co/security-labs/operation-bleeding-bear
- https://www.winhelponline.com/blog/run-program-as-system-localsystem-account-windows/
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    CommandLine|contains:
    - /EXEFilename
    - /CommandLine
  selection_runas:
  - CommandLine|contains:
    - ' /RunAs 8 '
    - ' /RunAs 4 '
    - ' /RunAs 10 '
    - ' /RunAs 11 '
  - CommandLine|endswith:
    - /RunAs 8
    - /RunAs 4
    - /RunAs 10
    - /RunAs 11
  condition: all of selection*
provenance:
  source: SigmaHQ/sigma
  source_id: fa00b701-44c6-4679-994d-5a18afa8a707
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_pua_advancedrun_priv_user.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
