id: sigmahq-sigma-74a12f18-505c-4114-8d0b-8448dd5485c6
name: PUA - Nimgrab Execution
description: Detects the usage of nimgrab, a tool bundled with the Nim programming
  framework and used for downloading files.
severity: high
enabled: false
tags:
  mitre:
  - T1105
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/28d190330fe44de6ff4767fc400cc10fa7cd6540/atomics/T1105/T1105.md
logsource:
  category: process_creation
  product: windows
detection:
  selection_name:
    Image|endswith: \nimgrab.exe
  selection_hashes:
    Hashes|contains:
    - MD5=2DD44C3C29D667F5C0EF5F9D7C7FFB8B
    - SHA256=F266609E91985F0FE3E31C5E8FAEEEC4FFA5E0322D8B6F15FE69F4C5165B9559
    - IMPHASH=C07FDDD21D123EA9B3A08EEF44AAAC45
  condition: 1 of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 74a12f18-505c-4114-8d0b-8448dd5485c6
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_pua_nimgrab.yml
falsepositives:
- Legitimate use of Nim on a developer systems
notes:
  quarantine_reason: 'upstream status: test'
