id: sigmahq-sigma-5722dff1-4bdd-4949-86ab-fbaf707e767a
name: PUA - System Informer Execution
description: Detects the execution of System Informer, a task manager tool to view
  and manipulate processes, kernel options and other low level operations
severity: medium
enabled: false
tags:
  mitre:
  - T1082
  - T1564
  - T1543
  categories:
  - endpoint
references:
- https://github.com/winsiderss/systeminformer
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Image|endswith: \SystemInformer.exe
  - OriginalFileName: SystemInformer.exe
  - Description: System Informer
  - Product: System Informer
  - Hashes|contains:
    - MD5=19426363A37C03C3ED6FEDF57B6696EC
    - SHA1=8B12C6DA8FAC0D5E8AB999C31E5EA04AF32D53DC
    - SHA256=8EE9D84DE50803545937A63C686822388A3338497CDDB660D5D69CF68B68F287
    - IMPHASH=B68908ADAEB5D662F87F2528AF318F12
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 5722dff1-4bdd-4949-86ab-fbaf707e767a
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_pua_system_informer.yml
falsepositives:
- System Informer is regularly used legitimately by system administrators or developers.
  Apply additional filters accordingly
notes:
  quarantine_reason: 'upstream status: test'
