id: sigmahq-sigma-93199800-b52a-4dec-b762-75212c196542
name: PUA - RunXCmd Execution
description: Detects the use of the RunXCmd tool to execute commands with System or
  TrustedInstaller accounts
severity: high
enabled: false
tags:
  mitre:
  - T1569.002
  categories:
  - endpoint
references:
- https://www.d7xtech.com/free-software/runx/
- https://www.winhelponline.com/blog/run-program-as-system-localsystem-account-windows/
logsource:
  category: process_creation
  product: windows
detection:
  selection_account:
    CommandLine|contains:
    - ' /account=system '
    - ' /account=ti '
  selection_exec:
    CommandLine|contains: /exec=
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 93199800-b52a-4dec-b762-75212c196542
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_pua_runxcmd.yml
falsepositives:
- Legitimate use by administrators
notes:
  quarantine_reason: 'upstream status: test'
