id: sigmahq-sigma-c7da8edc-49ae-45a2-9e61-9fd860e4e73d
name: PUA - Sysinternals Tools Execution - Registry
description: Detects the execution of some potentially unwanted tools such as PsExec,
  Procdump, etc. (part of the Sysinternals suite) via the creation of the "accepteula"
  registry key.
severity: medium
enabled: false
tags:
  mitre:
  - T1588.002
  categories:
  - endpoint
references:
- https://twitter.com/Moti_B/status/1008587936735035392
logsource:
  product: windows
  category: registry_set
detection:
  selection:
    TargetObject|contains:
    - \Active Directory Explorer
    - \Handle
    - \LiveKd
    - \Process Explorer
    - \ProcDump
    - \PsExec
    - \PsLoglist
    - \PsPasswd
    - \SDelete
    - \Sysinternals
    TargetObject|endswith: \EulaAccepted
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: c7da8edc-49ae-45a2-9e61-9fd860e4e73d
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_pua_sysinternals_susp_execution_via_eula.yml
falsepositives:
- Legitimate use of SysInternals tools. Filter the legitimate paths used in your environment
notes:
  quarantine_reason: 'upstream status: test'
