id: sigmahq-sigma-1fb76ab8-fa60-4b01-bddd-71e89bf555da
name: Pubprn.vbs Proxy Execution
description: Detects the use of the 'Pubprn.vbs' Microsoft signed script to execute
  commands.
severity: medium
enabled: false
tags:
  mitre:
  - T1216.001
  categories:
  - endpoint
references:
- https://lolbas-project.github.io/lolbas/Scripts/Pubprn/
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains|all:
    - \pubprn.vbs
    - 'script:'
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 1fb76ab8-fa60-4b01-bddd-71e89bf555da
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_lolbin_pubprn.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
