id: sigmahq-sigma-50a0aa3d-ab16-4594-a8aa-5145a6e6792b
name: Python One-Liners with Base64 Decoding
description: 'Detects Python one-liners that use base64 decoding functions in command
  line executions.

  Malicious scripts or attackers often use python one-liners to decode and execute
  base64-encoded payloads, which is a common technique for obfuscation and evasion.'
severity: high
enabled: false
tags:
  mitre:
  - T1059.006
  - T1027.010
  categories:
  - endpoint
references:
- https://docs.python.org/3/library/base64.html
- https://www.virustotal.com/gui/file/bc43e925d7b4b74319f6e74e836a96f1997ba404e14ac566cf12a21e9da463db/behavior
- https://cloud.google.com/blog/topics/threat-intelligence/cybercriminals-weaponize-fake-ai-websites
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|contains: \python
  - OriginalFileName|contains: python
  selection_cli:
    CommandLine|contains|all:
    - import
    - base64
    - ' -c'
    CommandLine|contains:
    - .decode
    - b16decode
    - b32decode
    - b32hexdecode
    - b64decode
    - b85decode
    - z85decode
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 50a0aa3d-ab16-4594-a8aa-5145a6e6792b
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_python_base64_encoded_execution.yml
falsepositives:
- Legitimate use of Python for decoding data, which is uncommon in typical enterprise
  environments but possible in development or data analysis contexts.
notes:
  quarantine_reason: 'upstream status: experimental'
