id: sigmahq-sigma-55e862a8-dd9c-4651-807a-f21fcad56716
name: Python One-Liners with Base64 Decoding - Linux
description: 'Detects the use of Python''s base64 decoding functions in command line
  executions on Linux systems.

  Malicious scripts often use python one-liners to decode and execute base64-encoded
  payloads, which is a common technique for obfuscation and evasion.'
severity: high
enabled: false
tags:
  mitre:
  - T1059.006
  - T1027.010
  categories:
  - endpoint
references:
- https://docs.python.org/3/library/base64.html
- https://www.virustotal.com/gui/file/bc43e925d7b4b74319f6e74e836a96f1997ba404e14ac566cf12a21e9da463db/behavior
- https://cloud.google.com/blog/topics/threat-intelligence/cybercriminals-weaponize-fake-ai-websites
logsource:
  category: process_creation
  product: linux
detection:
  selection_img:
    Image|contains: /python
  selection_cli:
    CommandLine|contains|all:
    - import
    - base64
    - ' -c'
    CommandLine|contains:
    - .decode
    - b16decode
    - b32decode
    - b32hexdecode
    - b64decode
    - b85decode
    - z85decode
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 55e862a8-dd9c-4651-807a-f21fcad56716
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/process_creation/proc_creation_lnx_python_base64_encoded_execution.yml
falsepositives:
- Legitimate use of Python for decoding data, which is uncommon in typical enterprise
  environments but possible in development or data analysis contexts.
notes:
  quarantine_reason: 'upstream status: experimental'
