id: sigmahq-sigma-023c654f-8f16-44d9-bb2b-00ff36a62af9
name: Python Function Execution Security Warning Disabled In Excel
description: 'Detects changes to the registry value "PythonFunctionWarnings" that
  would prevent any warnings or alerts from showing when Python functions are about
  to be executed.

  Threat actors could run malicious code through the new Microsoft Excel feature that
  allows Python to run within the spreadsheet.'
severity: high
enabled: false
tags:
  mitre:
  - T1685
  categories:
  - endpoint
references:
- https://support.microsoft.com/en-us/office/data-security-and-python-in-excel-33cc88a4-4a87-485e-9ff9-f35958278327
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains|all:
    - \Microsoft\Office\
    - \Excel\Security
    - PythonFunctionWarnings
    CommandLine|contains: ' 0'
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 023c654f-8f16-44d9-bb2b-00ff36a62af9
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_registry_office_disable_python_security_warnings.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
