id: sigmahq-sigma-cbb56d62-4060-40f7-9466-d8aaf3123f83
name: Python Image Load By Non-Python Process
description: 'Detects the image load of "Python Core" by a non-Python process. This
  might be indicative of a execution of executable that has been bundled from Python
  code.

  Various tools like Py2Exe, PyInstaller, and cx_Freeze are used to bundle Python
  code into standalone executables.

  Threat actors often use these tools to bundle malicious Python scripts into executables,
  sometimes to obfuscate the code or to bypass security measures.'
severity: low
enabled: false
tags:
  mitre:
  - T1027.002
  categories:
  - endpoint
references:
- https://www.py2exe.org/
- https://unit42.paloaltonetworks.com/unit-42-technical-analysis-seaduke/
logsource:
  product: windows
  category: image_load
detection:
  selection:
    Description: Python Core
  filter_main_generic:
  - Image|contains: Python
  - Image|startswith:
    - C:\Program Files\
    - C:\Program Files (x86)\
    - C:\ProgramData\Anaconda3\
  filter_optional_null_image:
    Image: null
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
provenance:
  source: SigmaHQ/sigma
  source_id: cbb56d62-4060-40f7-9466-d8aaf3123f83
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/image_load/image_load_susp_python_image_load.yml
falsepositives:
- Legitimate Py2Exe Binaries
- Known false positive caused with Python Anaconda
- Various legitimate software is bundled from Python code into executables
notes:
  quarantine_reason: 'upstream status: test'
