id: sigmahq-sigma-3f0f5957-04f8-4792-ad89-192b0303bde6
name: Python WebServer Execution - Linux
description: 'Detects the execution of Python web servers via command line interface
  (CLI).

  After gaining access to target systems, adversaries may use Python''s built-in HTTP
  server modules to quickly establish a web server without requiring additional software.

  This technique is commonly used in post-exploitation scenarios as it provides a
  simple method for transferring files between the compromised host and attacker-controlled
  systems.'
severity: medium
enabled: false
tags:
  mitre:
  - T1048.003
  categories:
  - endpoint
references:
- https://www.atomicredteam.io/atomic-red-team/atomics/T1048.003#atomic-test-8---python3-httpserver
- https://docs.python.org/3/library/http.server.html
- https://docs.python.org/2/library/simplehttpserver.html
logsource:
  product: linux
  category: process_creation
detection:
  selection_img:
  - Image|endswith:
    - /python
    - /python2
    - /python3
  - Image|contains:
    - /python2.
    - /python3.
  selection_module:
    CommandLine|contains:
    - http.server
    - SimpleHTTPServer
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 3f0f5957-04f8-4792-ad89-192b0303bde6
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/process_creation/proc_creation_lnx_python_http_server_execution.yml
falsepositives:
- Testing or development activity
notes:
  quarantine_reason: 'upstream status: experimental'
