id: sigmahq-sigma-c4042d54-110d-45dd-a0e1-05c47822c937
name: Python Spawning Pretty TTY Via PTY Module
description: Detects a python process calling to the PTY module in order to spawn
  a pretty tty which could be indicative of potential reverse shell activity.
severity: medium
enabled: false
tags:
  mitre:
  - T1059
  categories:
  - endpoint
references:
- https://www.volexity.com/blog/2022/06/02/zero-day-exploitation-of-atlassian-confluence/
logsource:
  category: process_creation
  product: linux
detection:
  selection_img:
  - Image|endswith:
    - /python
    - /python2
    - /python3
  - Image|contains:
    - /python2.
    - /python3.
  selection_cli_import:
    CommandLine|contains:
    - import pty
    - 'from pty '
  selection_cli_spawn:
    CommandLine|contains: spawn
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: c4042d54-110d-45dd-a0e1-05c47822c937
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/process_creation/proc_creation_lnx_python_pty_spawn.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
