id: sigmahq-sigma-8384bd26-bde6-4da9-8e5d-4174a7a47ca2
name: Query Tor Onion Address - DNS Client
description: Detects DNS resolution of an .onion address related to Tor routing networks
severity: high
enabled: false
tags:
  mitre:
  - T1090.003
  categories:
  - endpoint
references:
- https://www.logpoint.com/en/blog/detecting-tor-use-with-logpoint/
- https://github.com/Azure/Azure-Sentinel/blob/f99542b94afe0ad2f19a82cc08262e7ac8e1428e/Detections/ASimDNS/imDNS_TorProxies.yaml
logsource:
  product: windows
  service: dns-client
  definition: 'Requirements: Microsoft-Windows-DNS Client Events/Operational Event
    Log must be enabled/collected in order to receive the events.'
detection:
  selection:
    EventID: 3008
    QueryName|endswith:
    - .hiddenservice.net
    - .onion.ca
    - .onion.cab
    - .onion.casa
    - .onion.city
    - .onion.direct
    - .onion.dog
    - .onion.glass
    - .onion.gq
    - .onion.guide
    - .onion.in.net
    - .onion.ink
    - .onion.it
    - .onion.link
    - .onion.lt
    - .onion.lu
    - .onion.ly
    - .onion.mn
    - .onion.network
    - .onion.nu
    - .onion.pet
    - .onion.plus
    - .onion.pt
    - .onion.pw
    - .onion.rip
    - .onion.sh
    - .onion.si
    - .onion.to
    - .onion.top
    - .onion.ws
    - .onion
    - .s1.tor-gateways.de
    - .s2.tor-gateways.de
    - .s3.tor-gateways.de
    - .s4.tor-gateways.de
    - .s5.tor-gateways.de
    - .t2w.pw
    - .tor2web.ae.org
    - .tor2web.blutmagie.de
    - .tor2web.com
    - .tor2web.fi
    - .tor2web.io
    - .tor2web.org
    - .tor2web.xyz
    - .torlink.co
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 8384bd26-bde6-4da9-8e5d-4174a7a47ca2
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/dns_client/win_dns_client_tor_onion.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
