id: sigmahq-sigma-a31eeaed-3fd5-478e-a8ba-e62c6b3f9ecc
name: Raccine Uninstall
description: Detects commands that indicate a Raccine removal from an end system.
  Raccine is a free ransomware protection tool.
severity: high
enabled: false
tags:
  mitre:
  - T1685
  categories:
  - endpoint
references:
- https://github.com/Neo23x0/Raccine
logsource:
  category: process_creation
  product: windows
detection:
  selection1:
    CommandLine|contains|all:
    - 'taskkill '
    - RaccineSettings.exe
  selection2:
    CommandLine|contains|all:
    - reg.exe
    - delete
    - Raccine Tray
  selection3:
    CommandLine|contains|all:
    - schtasks
    - /DELETE
    - Raccine Rules Updater
  condition: 1 of selection*
provenance:
  source: SigmaHQ/sigma
  source_id: a31eeaed-3fd5-478e-a8ba-e62c6b3f9ecc
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_susp_disable_raccine.yml
falsepositives:
- Legitimate deinstallation by administrative staff
notes:
  quarantine_reason: 'upstream status: test'
