id: sigmahq-sigma-faa48cae-6b25-4f00-a094-08947fef582f
name: Rar Usage with Password and Compression Level
description: Detects the use of rar.exe, on the command line, to create an archive
  with password protection or with a specific compression level. This is pretty indicative
  of malicious actions.
severity: high
enabled: false
tags:
  mitre:
  - T1560.001
  categories:
  - endpoint
references:
- https://labs.sentinelone.com/the-anatomy-of-an-apt-attack-and-cobaltstrike-beacons-encoded-configuration/
- https://ss64.com/bash/rar.html
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1560.001/T1560.001.md
logsource:
  category: process_creation
  product: windows
detection:
  selection_password:
    CommandLine|contains: ' -hp'
  selection_other:
    CommandLine|contains:
    - ' -m'
    - ' a '
  condition: selection_password and selection_other
provenance:
  source: SigmaHQ/sigma
  source_id: faa48cae-6b25-4f00-a094-08947fef582f
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_rar_compression_with_password.yml
falsepositives:
- Legitimate use of Winrar command line version
- Other command line tools, that use these flags
notes:
  quarantine_reason: 'upstream status: test'
