id: sigmahq-sigma-5468045b-4fcc-4d1a-973c-c9c9578edacb
name: Raw Paste Service Access
description: Detects direct access to raw pastes in different paste services often
  used by malware in their second stages to download malicious code in encrypted or
  encoded form
severity: high
enabled: false
tags:
  mitre:
  - T1071.001
  - T1102.001
  - T1102.003
  categories:
  - network
references:
- https://www.virustotal.com/gui/domain/paste.ee/relations
logsource:
  category: proxy
detection:
  selection:
    c-uri|contains:
    - .paste.ee/r/
    - .pastebin.com/raw/
    - .hastebin.com/raw/
    - .ghostbin.co/paste/*/raw/
    - pastetext.net/
    - pastebin.pl/
    - paste.ee/
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 5468045b-4fcc-4d1a-973c-c9c9578edacb
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/web/proxy_generic/proxy_raw_paste_service_access.yml
falsepositives:
- User activity (e.g. developer that shared and copied code snippets and used the
  raw link instead of just copy & paste)
notes:
  quarantine_reason: 'upstream status: test'
