id: sigmahq-sigma-84b777bd-c946-4d17-aa2e-c39f5a454325
name: RBAC Permission Enumeration Attempt
description: 'Detects identities attempting to enumerate their Kubernetes RBAC permissions.

  In the early stages of a breach, attackers will aim to list the permissions they
  have within the compromised environment.

  In a Kubernetes cluster, this can be achieved by interacting with the API server,
  and querying the SelfSubjectAccessReview API via e.g. a "kubectl auth can-i --list"
  command.

  This will enumerate the Role-Based Access Controls (RBAC) rules defining the compromised
  user''s authorization.'
severity: low
enabled: false
tags:
  mitre:
  - T1069.003
  - T1087.004
  categories:
  - endpoint
references:
- https://www.elastic.co/guide/en/security/current/kubernetes-suspicious-self-subject-review.html
logsource:
  category: application
  product: kubernetes
  service: audit
detection:
  selection:
    verb: create
    apiGroup: authorization.k8s.io
    objectRef.resource: selfsubjectrulesreviews
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 84b777bd-c946-4d17-aa2e-c39f5a454325
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/application/kubernetes/audit/kubernetes_audit_rbac_permisions_listing.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
