id: sigmahq-sigma-34986307-b7f4-49be-92f3-e7a4d01ac5db
name: Rclone Config File Creation
description: Detects Rclone config files being created
severity: medium
enabled: false
tags:
  mitre:
  - T1567.002
  categories:
  - endpoint
references:
- https://research.nccgroup.com/2021/05/27/detecting-rclone-an-effective-tool-for-exfiltration/
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename|contains|all:
    - :\Users\
    - \.config\rclone\
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 34986307-b7f4-49be-92f3-e7a4d01ac5db
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_rclone_config_files.yml
falsepositives:
- Legitimate Rclone usage
notes:
  quarantine_reason: 'upstream status: test'
