id: sigmahq-sigma-a2863fbc-d5cb-48d5-83fb-d976d4b1743b
name: RDP Sensitive Settings Changed to Zero
description: 'Detects tampering of RDP Terminal Service/Server sensitive settings.

  Such as allowing unauthorized users access to a system via the ''fAllowUnsolicited''
  or enabling RDP via ''fDenyTSConnections'', etc.'
severity: medium
enabled: false
tags:
  mitre:
  - T1112
  categories:
  - endpoint
references:
- https://web.archive.org/web/20200929062532/https://blog.menasec.net/2019/02/threat-hunting-rdp-hijacking-via.html
- http://woshub.com/rds-shadow-how-to-connect-to-a-user-session-in-windows-server-2012-r2/
- https://twitter.com/SagieSec/status/1469001618863624194?t=HRf0eA0W1YYzkTSHb-Ky1A&s=03
- https://threathunterplaybook.com/hunts/windows/190407-RegModEnableRDPConnections/notebook.html
- https://bazaar.abuse.ch/sample/6f3aa9362d72e806490a8abce245331030d1ab5ac77e400dd475748236a6cc81/
- http://etutorials.org/Microsoft+Products/microsoft+windows+server+2003+terminal+services/Chapter+6+Registry/Registry+Keys+for+Terminal+Services/
- https://admx.help/HKLM/SOFTWARE/Policies/Microsoft/Windows%20NT/Terminal%20Services
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|endswith:
    - \fDenyTSConnections
    - \fSingleSessionPerUser
    - \UserAuthentication
    Details: DWORD (0x00000000)
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: a2863fbc-d5cb-48d5-83fb-d976d4b1743b
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_terminal_server_suspicious.yml
falsepositives:
- Some of the keys mentioned here could be modified by an administrator while setting
  group policy (it should be investigated either way)
notes:
  quarantine_reason: 'upstream status: test'
