id: sigmahq-sigma-782d6f3e-4c5d-4b8c-92a3-1d05fed72e63
name: RDP Port Forwarding Rule Added Via Netsh.EXE
description: Detects the execution of netsh to configure a port forwarding of port
  3389 (RDP) rule
severity: high
enabled: false
tags:
  mitre:
  - T1090
  categories:
  - endpoint
references:
- https://www.fireeye.com/blog/threat-research/2019/01/bypassing-network-restrictions-through-rdp-tunneling.html
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \netsh.exe
  - OriginalFileName: netsh.exe
  selection_cli:
    CommandLine|contains|all:
    - ' i'
    - ' p'
    - =3389
    - ' c'
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 782d6f3e-4c5d-4b8c-92a3-1d05fed72e63
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_netsh_port_forwarding_3389.yml
falsepositives:
- Legitimate administration activity
notes:
  quarantine_reason: 'upstream status: test'
