id: sigmahq-sigma-01aeb693-138d-49d2-9403-c4f52d7d3d62
name: RDP Connection Allowed Via Netsh.EXE
description: Detects usage of the netsh command to open and allow connections to port
  3389 (RDP). As seen used by Sarwent Malware
severity: high
enabled: false
tags:
  mitre:
  - T1686.003
  categories:
  - endpoint
references:
- https://labs.sentinelone.com/sarwent-malware-updates-command-detonation/
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \netsh.exe
  - OriginalFileName: netsh.exe
  selection_cli:
    CommandLine|contains|all:
    - 'firewall '
    - 'add '
    - 'tcp '
    - '3389'
    CommandLine|contains:
    - portopening
    - allow
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 01aeb693-138d-49d2-9403-c4f52d7d3d62
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_netsh_fw_allow_rdp.yml
falsepositives:
- Legitimate administration activity
notes:
  quarantine_reason: 'upstream status: test'
