id: sigmahq-sigma-241e802a-b65e-484f-88cd-c2dc10f9206d
name: Read Contents From Stdin Via Cmd.EXE
description: Detect the use of "<" to read and potentially execute a file via cmd.exe
severity: medium
enabled: false
tags:
  mitre:
  - T1059.003
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1059.003/T1059.003.md
- https://web.archive.org/web/20220306121156/https://www.x86matthew.com/view_post?id=ntdll_pipe
logsource:
  category: process_creation
  product: windows
detection:
  selection_cmd:
  - OriginalFileName: Cmd.Exe
  - Image|endswith: \cmd.exe
  selection_cli:
    CommandLine|contains: <
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 241e802a-b65e-484f-88cd-c2dc10f9206d
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_cmd_stdin_redirect.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
