id: sigmahq-sigma-cc9d3712-6310-4320-b2df-7cb408274d53
name: Rebuild Performance Counter Values Via Lodctr.EXE
description: Detects the execution of "lodctr.exe" to rebuild the performance counter
  registry values. This can be abused by attackers by providing a malicious config
  file to overwrite performance counter configuration to confuse and evade monitoring
  and security solutions.
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/windows/security/identity-protection/virtual-smart-cards/virtual-smart-card-tpmvscmgr
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
    Image|endswith: \lodctr.exe
    OriginalFileName: LODCTR.EXE
  selection_cli:
    CommandLine|contains|windash: ' -r'
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: cc9d3712-6310-4320-b2df-7cb408274d53
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_lodctr_performance_counter_tampering.yml
falsepositives:
- Legitimate usage by an administrator
notes:
  quarantine_reason: 'upstream status: test'
