id: sigmahq-sigma-aa2efee7-34dd-446e-8a37-40790a66efd7
name: Recon Information for Export with Command Prompt
description: Once established within a system or network, an adversary may use automated
  techniques for collecting internal data.
severity: medium
enabled: false
tags:
  mitre:
  - T1119
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1119/T1119.md
logsource:
  product: windows
  category: process_creation
detection:
  selection_image:
  - Image|endswith:
    - \tree.com
    - \WMIC.exe
    - \doskey.exe
    - \sc.exe
  - OriginalFileName:
    - wmic.exe
    - DOSKEY.EXE
    - sc.exe
  selection_redirect:
    ParentCommandLine|contains:
    - ' > %TEMP%\'
    - ' > %TMP%\'
  condition: all of selection*
provenance:
  source: SigmaHQ/sigma
  source_id: aa2efee7-34dd-446e-8a37-40790a66efd7
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_susp_recon.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
