id: sigmahq-sigma-ccb5742c-c248-4982-8c5c-5571b9275ad3
name: Recon Command Output Piped To Findstr.EXE
description: 'Detects the execution of a potential recon command where the results
  are piped to "findstr". This is meant to trigger on inline calls of "cmd.exe" via
  the "/c" or "/k" for example.

  Attackers often time use this technique to extract specific information they require
  in their reconnaissance phase.'
severity: medium
enabled: false
tags:
  mitre:
  - T1057
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/02cb591f75064ffe1e0df9ac3ed5972a2e491c97/atomics/T1057/T1057.md#atomic-test-6---discover-specific-process---tasklist
- https://www.hhs.gov/sites/default/files/manage-engine-vulnerability-sector-alert-tlpclear.pdf
- https://www.trendmicro.com/en_us/research/22/d/spring4shell-exploited-to-deploy-cryptocurrency-miners.html
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains:
    - ipconfig*|*find
    - net*|*find
    - netstat*|*find
    - ping*|*find
    - systeminfo*|*find
    - tasklist*|*find
    - whoami*|*find
  filter_optional_xampp:
    CommandLine|contains|all:
    - cmd.exe /c TASKLIST /V |
    - FIND /I
    - \xampp\
    - \catalina_start.bat
  condition: selection and not 1 of filter_optional_*
provenance:
  source: SigmaHQ/sigma
  source_id: ccb5742c-c248-4982-8c5c-5571b9275ad3
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_findstr_recon_pipe_output.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
