id: sigmahq-sigma-0a3ff354-93fc-4273-8a03-1078782de5b7
name: Recon Activity via SASec
description: Detects remote RPC calls to read information about scheduled tasks via
  SASec
severity: high
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-tsch/d1058a28-7e02-4948-8b8d-4a347fa64931
- https://github.com/jsecurity101/MSRPC-to-ATTACK/blob/ddd4608fe8684fcf2fcf9b48c5f0b3c28097f8a3/documents/MS-TSCH.md
- https://github.com/zeronetworks/rpcfirewall
- https://zeronetworks.com/blog/stopping-lateral-movement-via-the-rpc-firewall/
logsource:
  product: rpc_firewall
  category: application
  definition: 'Requirements: install and apply the RPC Firewall to all processes with
    "audit:true action:block uuid:378e52b0-c0a9-11cf-822d-00aa0051e40f"'
detection:
  selection:
    EventLog: RPCFW
    EventID: 3
    InterfaceUuid: 378e52b0-c0a9-11cf-822d-00aa0051e40f
  filter:
    OpNum:
    - 0
    - 1
  condition: selection and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: 0a3ff354-93fc-4273-8a03-1078782de5b7
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/application/rpc_firewall/rpc_firewall_sasec_recon.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
