id: sigmahq-sigma-651f87f7-12db-47f9-84c5-f27b081b94b6
name: RegAsm.EXE Execution Without CommandLine Flags or Files
description: 'Detects the execution of "RegAsm.exe" without a commandline flag or
  file, which might indicate potential process injection activity.

  Usually "RegAsm.exe" should point to a dedicated DLL file or call the help with
  the "/?" flag.'
severity: low
enabled: false
tags:
  mitre:
  - T1218.009
  categories:
  - endpoint
references:
- https://www.mcafee.com/blogs/other-blogs/mcafee-labs/agent-teslas-unique-approach-vbs-and-steganography-for-delivery-and-intrusion/
- https://www.zscaler.fr/blogs/security-research/threat-actors-exploit-cve-2017-11882-deliver-agent-tesla
- https://learn.microsoft.com/en-us/dotnet/framework/tools/regasm-exe-assembly-registration-tool
- https://app.any.run/tasks/ea944b89-69d8-49c8-ac1f-5c76ad300db2
- https://www.joesandbox.com/analysis/1467354/0/html
logsource:
  product: windows
  category: process_creation
detection:
  selection_img:
  - Image|endswith: \RegAsm.exe
  - OriginalFileName: RegAsm.exe
  selection_cli:
    CommandLine|endswith:
    - RegAsm
    - RegAsm.exe
    - RegAsm.exe"
    - RegAsm.exe'
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 651f87f7-12db-47f9-84c5-f27b081b94b6
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_regasm_no_flag_or_dll_execution.yml
falsepositives:
- Legitimate use of Regasm by developers.
notes:
  quarantine_reason: 'upstream status: experimental'
