id: sigmahq-sigma-883835a7-df45-43e4-bf1d-4268768afda4
name: Regedit as Trusted Installer
description: Detects a regedit started with TrustedInstaller privileges or by ProcessHacker.exe
severity: high
enabled: false
tags:
  mitre:
  - T1548
  categories:
  - endpoint
references:
- https://twitter.com/1kwpeter/status/1397816101455765504
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: \regedit.exe
    ParentImage|endswith:
    - \TrustedInstaller.exe
    - \ProcessHacker.exe
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 883835a7-df45-43e4-bf1d-4268768afda4
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_regedit_trustedinstaller.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
