id: sigmahq-sigma-7f4c43f9-b1a5-4c7d-b24a-b41bf3a3ebf2
name: Registry Tampering by Potentially Suspicious Processes
description: 'Detects suspicious registry modifications made by suspicious processes
  such as script engine processes such as WScript, or CScript etc.

  These processes are rarely used for legitimate registry modifications, and their
  activity may indicate an attempt to modify the registry

  without using standard tools like regedit.exe or reg.exe, potentially for evasion
  and persistence.'
severity: medium
enabled: false
tags:
  mitre:
  - T1112
  - T1059.005
  categories:
  - endpoint
references:
- https://www.nextron-systems.com/2025/07/29/detecting-the-most-popular-mitre-persistence-method-registry-run-keys-startup-folder/
- https://www.linkedin.com/posts/mauricefielenbach_livingofftheland-redteam-persistence-activity-7344801774182051843-TE00/
logsource:
  category: registry_event
  product: windows
detection:
  selection:
    Image|endswith:
    - \mshta.exe
    - \wscript.exe
    - \cscript.exe
  filter_main_binary_data:
    Details: Binary Data
  filter_main_null:
    Details: null
  filter_main_wscript_legit_1:
    Image|endswith: \wscript.exe
    TargetObject|contains:
    - SOFTWARE\Microsoft\Windows NT\CurrentVersion\Notifications\Data\
    - \Services\bam\State\UserSettings\S-1-
    - Software\Microsoft\Windows Script\Settings\Telemetry\wscript.exe\
    - Software\Microsoft\Windows\CurrentVersion\Internet Settings\
  filter_main_wscript_legit_2:
    Image|endswith: \wscript.exe
    TargetObject|contains: \wscript.exe
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 7f4c43f9-b1a5-4c7d-b24a-b41bf3a3ebf2
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_event/registry_event_susp_process_registry_modification.yml
falsepositives:
- Some legitimate admin or install scripts may use these processes for registry modifications.
notes:
  quarantine_reason: 'upstream status: experimental'
