id: sigmahq-sigma-12e6d621-194f-4f59-90cc-1959e21e69f7
name: Register new Logon Process by Rubeus
description: Detects potential use of Rubeus via registered new trusted logon process
severity: high
enabled: false
tags:
  mitre:
  - T1558.003
  categories:
  - endpoint
references:
- https://posts.specterops.io/hunting-in-active-directory-unconstrained-delegation-forests-trusts-71f2b33688e1
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4611
    LogonProcessName: User32LogonProcesss
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 12e6d621-194f-4f59-90cc-1959e21e69f7
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/security/win_security_register_new_logon_process_by_rubeus.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
