id: sigmahq-sigma-1c3121ed-041b-4d97-a075-07f54f20fb4a
name: Registry Explorer Policy Modification
description: Detects registry modifications that disable internal tools or functions
  in explorer (malware like Agent Tesla uses this technique)
severity: medium
enabled: false
tags:
  mitre:
  - T1112
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1112/T1112.md
logsource:
  category: registry_set
  product: windows
detection:
  selection_set_1:
    TargetObject|endswith:
    - SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer\NoLogOff
    - SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer\NoDesktop
    - SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer\NoRun
    - SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer\NoFind
    - SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer\NoControlPanel
    - SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer\NoFileMenu
    - SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer\NoClose
    - SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer\NoSetTaskbar
    - SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer\NoPropertiesMyDocuments
    - SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer\NoTrayContextMenu
    Details: DWORD (0x00000001)
  condition: selection_set_1
provenance:
  source: SigmaHQ/sigma
  source_id: 1c3121ed-041b-4d97-a075-07f54f20fb4a
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_set_nopolicies_user.yml
falsepositives:
- Legitimate admin script
notes:
  quarantine_reason: 'upstream status: test'
