id: sigmahq-sigma-cc1abf27-78a3-4ac5-a51c-f3070b1d8e40
name: Registry Export of Third-Party Credentials
description: 'Detects the use of reg.exe to export registry paths associated with
  third-party credentials.

  Credential stealers have been known to use this technique to extract sensitive information
  from the registry.'
severity: high
enabled: false
tags:
  mitre:
  - T1552.002
  categories:
  - endpoint
references:
- https://www.virustotal.com/gui/file/fdc86a5b3d7df37a72c3272836f743747c47bfbc538f05af9ecf78547fa2e789/behavior
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \reg.exe
  - OriginalFileName: reg.exe
  selection_cli_save:
    CommandLine|contains:
    - save
    - export
  selection_cli_path:
    CommandLine|contains:
    - \Software\Aerofox\Foxmail\V3.1
    - \Software\Aerofox\FoxmailPreview
    - \Software\DownloadManager\Passwords
    - \Software\FTPWare\COREFTP\Sites
    - \Software\IncrediMail\Identities
    - \Software\Martin Prikryl\WinSCP 2\Sessions
    - \Software\Mobatek\MobaXterm
    - \Software\OpenSSH\Agent\Keys
    - \Software\OpenVPN-GUI\configs
    - \Software\ORL\WinVNC3\Password
    - \Software\Qualcomm\Eudora\CommandLine
    - \Software\RealVNC\WinVNC4
    - \Software\RimArts\B2\Settings
    - \Software\SimonTatham\PuTTY\Sessions
    - \Software\SimonTatham\PuTTY\SshHostKeys
    - \Software\Sota\FFFTP
    - \Software\TightVNC\Server
    - \Software\WOW6432Node\Radmin\v3.0\Server\Parameters\Radmin
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: cc1abf27-78a3-4ac5-a51c-f3070b1d8e40
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_registry_export_of_thirdparty_creds.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: experimental'
