id: sigmahq-sigma-5a93eb65-dffa-4543-b761-94aa60098fb6
name: Registry Hide Function from User
description: Detects registry modifications that hide internal tools or functions
  from the user (malware like Agent Tesla, Hermetic Wiper uses this technique)
severity: medium
enabled: false
tags:
  mitre:
  - T1112
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1564.001/T1564.001.md
logsource:
  category: registry_set
  product: windows
detection:
  selection_set_1:
    TargetObject|endswith:
    - SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer\HideClock
    - SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer\HideSCAHealth
    - SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer\HideSCANetwork
    - SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer\HideSCAPower
    - SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer\HideSCAVolume
    Details: DWORD (0x00000001)
  selection_set_0:
    TargetObject|endswith:
    - SOFTWARE\Microsoft\Windows\CurrentVersion\Explorer\Advanced\ShowInfoTip
    - SOFTWARE\Microsoft\Windows\CurrentVersion\Explorer\Advanced\ShowCompColor
    Details: DWORD (0x00000000)
  condition: 1 of selection_set_*
provenance:
  source: SigmaHQ/sigma
  source_id: 5a93eb65-dffa-4543-b761-94aa60098fb6
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_hide_function_user.yml
falsepositives:
- Legitimate admin script
notes:
  quarantine_reason: 'upstream status: test'
