id: sigmahq-sigma-1547e27c-3974-43e2-a7d7-7f484fb928ec
name: Registry Persistence via Service in Safe Mode
description: Detects the modification of the registry to allow a driver or service
  to persist in Safe Mode.
severity: high
enabled: false
tags:
  mitre:
  - T1564.001
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1112/T1112.md#atomic-test-33---windows-add-registry-value-to-load-service-in-safe-mode-without-network
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1112/T1112.md#atomic-test-34---windows-add-registry-value-to-load-service-in-safe-mode-with-network
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains:
    - \Control\SafeBoot\Minimal\
    - \Control\SafeBoot\Network\
    TargetObject|endswith: \(Default)
    Details: Service
  filter_optional_sophos:
    Image: C:\WINDOWS\system32\msiexec.exe
    TargetObject|endswith:
    - \Control\SafeBoot\Minimal\SAVService\(Default)
    - \Control\SafeBoot\Network\SAVService\(Default)
  filter_optional_mbamservice:
    Image|endswith: \MBAMInstallerService.exe
    TargetObject|endswith: \MBAMService\(Default)
    Details: Service
  filter_optional_hexnode:
    Image: C:\Hexnode\Hexnode Agent\Current\HexnodeAgent.exe
    TargetObject|endswith:
    - \Control\SafeBoot\Minimal\Hexnode Updater\(Default)
    - \Control\SafeBoot\Network\Hexnode Updater\(Default)
    - \Control\SafeBoot\Minimal\Hexnode Agent\(Default)
    - \Control\SafeBoot\Network\Hexnode Agent\(Default)
    Details: Service
  condition: selection and not 1 of filter_optional_*
provenance:
  source: SigmaHQ/sigma
  source_id: 1547e27c-3974-43e2-a7d7-7f484fb928ec
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_add_load_service_in_safe_mode.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
