id: sigmahq-sigma-23590215-4702-4a70-8805-8dc9e58314a2
name: Registry-Free Process Scope COR_PROFILER
description: 'Adversaries may leverage the COR_PROFILER environment variable to hijack
  the execution flow of programs that load the .NET CLR.

  The COR_PROFILER is a .NET Framework feature which allows developers to specify
  an unmanaged (or external of .NET) profiling DLL to be loaded into each .NET process
  that loads the Common Language Runtime (CLR).

  These profiliers are designed to monitor, troubleshoot, and debug managed code executed
  by the .NET CLR.

  (Citation: Microsoft Profiling Mar 2017)

  (Citation: Microsoft COR_PROFILER Feb 2013)'
severity: medium
enabled: false
tags:
  mitre:
  - T1574.012
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1574.012/T1574.012.md#atomic-test-3---registry-free-process-scope-cor_profiler
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection:
    ScriptBlockText|contains|all:
    - $env:COR_ENABLE_PROFILING
    - $env:COR_PROFILER
    - $env:COR_PROFILER_PATH
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 23590215-4702-4a70-8805-8dc9e58314a2
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_cor_profiler.yml
falsepositives:
- Legitimate administrative script
notes:
  quarantine_reason: 'upstream status: test'
