id: sigmahq-sigma-dd3ee8cc-f751-41c9-ba53-5a32ed47e563
name: Registry Modification of MS-settings Protocol Handler
description: 'Detects registry modifications to the ''ms-settings'' protocol handler,
  which is frequently targeted for UAC bypass or persistence.

  Attackers can modify this registry to execute malicious code with elevated privileges
  by hijacking the command execution path.'
severity: medium
enabled: false
tags:
  mitre:
  - T1548.002
  - T1546.001
  - T1112
  categories:
  - endpoint
references:
- https://thedfirreport.com/2021/12/13/diavol-ransomware/
- https://www.trendmicro.com/en_us/research/25/f/water-curse.html
logsource:
  category: process_creation
  product: windows
detection:
  selection_reg_img:
  - Image|endswith: \reg.exe
  - OriginalFileName: reg.exe
  selection_pwsh_img:
  - Image|endswith:
    - \powershell.exe
    - \pwsh.exe
  - OriginalFileName:
    - powershell.exe
    - pwsh.dll
  selection_reg_cli:
    CommandLine|contains: add
  selection_pwsh_cli:
    CommandLine|contains:
    - New-ItemProperty
    - Set-ItemProperty
    - 'ni '
    - 'sp '
  selection_cli_key:
    CommandLine|contains: \ms-settings\shell\open\command
  condition: (all of selection_reg_* or all of selection_pwsh_*) and selection_cli_key
provenance:
  source: SigmaHQ/sigma
  source_id: dd3ee8cc-f751-41c9-ba53-5a32ed47e563
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_susp_registry_modification_of_ms_setting_protocol_handler.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
