id: sigmahq-sigma-5f60740a-f57b-4e76-82a1-15b6ff2cb134
name: Registry Modification Via Regini.EXE
description: Detects the execution of regini.exe which can be used to modify registry
  keys, the changes are imported from one or more text files.
severity: low
enabled: false
tags:
  mitre:
  - T1112
  categories:
  - endpoint
references:
- https://lolbas-project.github.io/lolbas/Binaries/Regini/
- https://gist.github.com/api0cradle/cdd2d0d0ec9abb686f0e89306e277b8f
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/regini
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Image|endswith: \regini.exe
  - OriginalFileName: REGINI.EXE
  filter:
    CommandLine|re: :[^ \\]
  condition: selection and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: 5f60740a-f57b-4e76-82a1-15b6ff2cb134
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_regini_execution.yml
falsepositives:
- Legitimate modification of keys
notes:
  quarantine_reason: 'upstream status: test'
