id: sigmahq-sigma-089fc3d2-71e8-4763-a8a5-c97fbb0a403e
name: Regsvr32 DLL Execution With Suspicious File Extension
description: Detects the execution of REGSVR32.exe with DLL files masquerading as
  other files
severity: high
enabled: false
tags:
  mitre:
  - T1218.010
  categories:
  - endpoint
references:
- https://thedfirreport.com/2021/11/29/continuing-the-bazar-ransomware-story/
- https://blog.talosintelligence.com/2021/10/threat-hunting-in-large-datasets-by.html
- https://guides.lib.umich.edu/c.php?g=282942&p=1885348
- https://harfanglab.io/insidethelab/uac-0057-pressure-ukraine-poland/
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \regsvr32.exe
  - OriginalFileName: REGSVR32.EXE
  selection_cli:
    CommandLine|endswith:
    - .bin
    - .bmp
    - .cr2
    - .dat
    - .eps
    - .gif
    - .ico
    - .jpeg
    - .jpg
    - .log
    - .nef
    - .orf
    - .png
    - .raw
    - .rtf
    - .sr2
    - .temp
    - .tif
    - .tiff
    - .tmp
    - .txt
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 089fc3d2-71e8-4763-a8a5-c97fbb0a403e
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_regsvr32_susp_extensions.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
