id: sigmahq-sigma-50919691-7302-437f-8e10-1fe088afa145
name: Regsvr32 DLL Execution With Uncommon Extension
description: Detects a "regsvr32" execution where the DLL doesn't contain a common
  file extension.
severity: medium
enabled: false
tags:
  mitre:
  - T1574
  categories:
  - endpoint
references:
- https://app.any.run/tasks/34221348-072d-4b70-93f3-aa71f6ebecad/
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Image|endswith: \regsvr32.exe
  - OriginalFileName: REGSVR32.EXE
  filter_main_legit_ext:
    CommandLine|contains:
    - .ax
    - .cpl
    - .dll
    - .ocx
  filter_optional_pascal:
    CommandLine|contains: .ppl
  filter_optional_avg:
    CommandLine|contains: .bav
  filter_main_null_4688:
    CommandLine: null
  filter_main_empty_4688:
    CommandLine: ''
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
provenance:
  source: SigmaHQ/sigma
  source_id: 50919691-7302-437f-8e10-1fe088afa145
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_regsvr32_uncommon_extension.yml
falsepositives:
- Other legitimate extensions currently not in the list either from third party or
  specific Windows components.
notes:
  quarantine_reason: 'upstream status: test'
