id: sigmahq-sigma-57bff678-25d1-4d6c-8211-8ca106d12053
name: Remote Access Tool - ScreenConnect Execution
description: 'An adversary may use legitimate desktop support and remote access software,
  such as Team Viewer, Go2Assist, LogMein, AmmyyAdmin, etc, to establish an interactive
  command and control channel to target systems within networks.

  These services are commonly used as legitimate technical support software, and may
  be allowed by application control within a target environment.

  Remote access tools like VNC, Ammyy, and Teamviewer are used frequently when compared
  with other legitimate software commonly used by adversaries. (Citation: Symantec
  Living off the Land)'
severity: medium
enabled: false
tags:
  mitre:
  - T1219.002
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1219/T1219.md#atomic-test-5---screenconnect-application-download-and-install-on-windows
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Description: ScreenConnect Service
  - Product: ScreenConnect
  - Company: ScreenConnect Software
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 57bff678-25d1-4d6c-8211-8ca106d12053
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_remote_access_tools_screenconnect.yml
falsepositives:
- Legitimate usage of the tool
notes:
  quarantine_reason: 'upstream status: test'
