id: sigmahq-sigma-0afecb6e-6223-4a82-99fb-bf5b981e92a5
name: Remote Access Tool - ScreenConnect Temporary File
description: 'Detects the creation of files in a specific location by ScreenConnect
  RMM.

  ScreenConnect has feature to remotely execute binaries on a target machine. These
  binaries will be dropped to ":\Users\<username>\Documents\ConnectWiseControl\Temp\"
  before execution.'
severity: low
enabled: false
tags:
  mitre:
  - T1059.003
  categories:
  - endpoint
references:
- https://github.com/SigmaHQ/sigma/pull/4467
logsource:
  category: file_event
  product: windows
detection:
  selection:
    Image|endswith: \ScreenConnect.WindowsClient.exe
    TargetFilename|contains: \Documents\ConnectWiseControl\Temp\
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 0afecb6e-6223-4a82-99fb-bf5b981e92a5
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_remote_access_tools_screenconnect_remote_file.yml
falsepositives:
- Legitimate use of ScreenConnect
notes:
  quarantine_reason: 'upstream status: test'
