id: sigmahq-sigma-e01fa958-6893-41d4-ae03-182477c5e77d
name: Remote Access Tool - RURAT Execution From Unusual Location
description: Detects execution of Remote Utilities RAT (RURAT) from an unusual location
  (outside of 'C:\Program Files')
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://redcanary.com/blog/misbehaving-rats/
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Image|endswith:
    - \rutserv.exe
    - \rfusclient.exe
  - Product: Remote Utilities
  filter:
    Image|startswith:
    - C:\Program Files\Remote Utilities
    - C:\Program Files (x86)\Remote Utilities
  condition: selection and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: e01fa958-6893-41d4-ae03-182477c5e77d
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_remote_access_tools_rurat_non_default_location.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
