id: sigmahq-sigma-2053961f-44c7-4a64-b62d-f6e72800af0d
name: Remote Event Log Recon
description: Detects remote RPC calls to get event log information via EVEN or EVEN6
severity: high
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://github.com/zeronetworks/rpcfirewall
- https://zeronetworks.com/blog/stopping-lateral-movement-via-the-rpc-firewall/
logsource:
  product: rpc_firewall
  category: application
  definition: 'Requirements: install and apply the RPC Firewall to all processes with
    "audit:true action:block uuid:82273fdc-e32a-18c3-3f78-827929dc23ea and uuid:f6beaff7-1e19-4fbb-9f8f-b89e2018337c"'
detection:
  selection:
    EventLog: RPCFW
    EventID: 3
    InterfaceUuid:
    - 82273fdc-e32a-18c3-3f78-827929dc23ea
    - f6beaff7-1e19-4fbb-9f8f-b89e2018337c
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 2053961f-44c7-4a64-b62d-f6e72800af0d
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/application/rpc_firewall/rpc_firewall_eventlog_recon.yml
falsepositives:
- Remote administrative tasks on Windows Events
notes:
  quarantine_reason: 'upstream status: test'
