id: sigmahq-sigma-95e60a2b-4705-444b-b7da-ba0ea81a3ee2
name: Remote Access Tool - Simple Help Execution
description: 'An adversary may use legitimate desktop support and remote access software,
  such as Team Viewer, Go2Assist, LogMein, AmmyyAdmin, etc, to establish an interactive
  command and control channel to target systems within networks.

  These services are commonly used as legitimate technical support software, and may
  be allowed by application control within a target environment.

  Remote access tools like VNC, Ammyy, and Teamviewer are used frequently when compared
  with other legitimate software commonly used by adversaries. (Citation: Symantec
  Living off the Land)'
severity: medium
enabled: false
tags:
  mitre:
  - T1219.002
  categories:
  - endpoint
references:
- https://www.huntress.com/blog/slashandgrab-screen-connect-post-exploitation-in-the-wild-cve-2024-1709-cve-2024-1708
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|contains:
    - \JWrapper-Remote Access\
    - \JWrapper-Remote Support\
    Image|endswith: \SimpleService.exe
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 95e60a2b-4705-444b-b7da-ba0ea81a3ee2
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_remote_access_tools_simple_help.yml
falsepositives:
- Legitimate usage of the tool
notes:
  quarantine_reason: 'upstream status: test'
