id: sigmahq-sigma-5f92fff9-82e2-48eb-8fc1-8b133556a551
name: Remote Encrypting File System Abuse
description: Detects remote RPC calls to possibly abuse remote encryption service
  via MS-EFSR
severity: high
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-36942
- https://github.com/jsecurity101/MSRPC-to-ATTACK/blob/ddd4608fe8684fcf2fcf9b48c5f0b3c28097f8a3/documents/MS-EFSR.md
- https://github.com/zeronetworks/rpcfirewall
- https://zeronetworks.com/blog/stopping-lateral-movement-via-the-rpc-firewall/
logsource:
  product: rpc_firewall
  category: application
  definition: 'Requirements: install and apply the RPC Firewall to all processes with
    "audit:true action:block uuid:df1941c5-fe89-4e79-bf10-463657acf44d or c681d488-d850-11d0-8c52-00c04fd90f7e'
detection:
  selection:
    EventLog: RPCFW
    EventID: 3
    InterfaceUuid:
    - df1941c5-fe89-4e79-bf10-463657acf44d
    - c681d488-d850-11d0-8c52-00c04fd90f7e
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 5f92fff9-82e2-48eb-8fc1-8b133556a551
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/application/rpc_firewall/rpc_firewall_efs_abuse.yml
falsepositives:
- Legitimate usage of remote file encryption
notes:
  quarantine_reason: 'upstream status: test'
