id: sigmahq-sigma-c8b00925-926c-47e3-beea-298fd563728e
name: Remote Access Tool Services Have Been Installed - Security
description: Detects service installation of different remote access tools software.
  These software are often abused by threat actors to perform
severity: medium
enabled: false
tags:
  mitre:
  - T1543.003
  - T1569.002
  categories:
  - endpoint
references:
- https://redcanary.com/blog/misbehaving-rats/
logsource:
  product: windows
  service: security
  definition: The 'System Security Extension' audit subcategory need to be enabled
    to log the EID 4697
detection:
  selection:
    EventID: 4697
    ServiceName|contains:
    - AmmyyAdmin
    - AnyDesk
    - Atera
    - BASupportExpressSrvcUpdater
    - BASupportExpressStandaloneService
    - chromoting
    - GoToAssist
    - GoToMyPC
    - jumpcloud
    - LMIGuardianSvc
    - LogMeIn
    - monblanking
    - Parsec
    - RManService
    - RPCPerformanceService
    - RPCService
    - SplashtopRemoteService
    - SSUService
    - TeamViewer
    - TightVNC
    - vncserver
    - Zoho
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: c8b00925-926c-47e3-beea-298fd563728e
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/security/win_security_service_install_remote_access_software.yml
falsepositives:
- The rule doesn't look for anything suspicious so false positives are expected. If
  you use one of the tools mentioned, comment it out
notes:
  quarantine_reason: 'upstream status: test'
