id: sigmahq-sigma-f177f2bc-5f3e-4453-b599-57eefce9a59c
name: Remote Schedule Task Recon via AtScv
description: Detects remote RPC calls to read information about scheduled tasks via
  AtScv
severity: high
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-tsch/d1058a28-7e02-4948-8b8d-4a347fa64931
- https://github.com/zeronetworks/rpcfirewall
- https://github.com/jsecurity101/MSRPC-to-ATTACK/blob/ddd4608fe8684fcf2fcf9b48c5f0b3c28097f8a3/documents/MS-TSCH.md
- https://zeronetworks.com/blog/stopping-lateral-movement-via-the-rpc-firewall/
logsource:
  product: rpc_firewall
  category: application
  definition: 'Requirements: install and apply the RPC Firewall to all processes with
    "audit:true action:block uuid:1ff70682-0a51-30e8-076d-740be8cee98b"'
detection:
  selection:
    EventLog: RPCFW
    EventID: 3
    InterfaceUuid: 1ff70682-0a51-30e8-076d-740be8cee98b
  filter:
    OpNum:
    - 0
    - 1
  condition: selection and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: f177f2bc-5f3e-4453-b599-57eefce9a59c
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/application/rpc_firewall/rpc_firewall_atsvc_recon.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
