id: sigmahq-sigma-b6ea3cc7-542f-43ef-bbe4-980fbed444c7
name: Remote Server Service Abuse
description: Detects remote RPC calls to possibly abuse remote encryption service
  via MS-SRVS
severity: high
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-srvs/accf23b0-0f57-441c-9185-43041f1b0ee9
- https://github.com/jsecurity101/MSRPC-to-ATTACK/blob/ddd4608fe8684fcf2fcf9b48c5f0b3c28097f8a3/documents/MS-SRVS.md
- https://github.com/zeronetworks/rpcfirewall
- https://zeronetworks.com/blog/stopping-lateral-movement-via-the-rpc-firewall/
logsource:
  product: rpc_firewall
  category: application
  definition: 'Requirements: install and apply the RPC Firewall to all processes with
    "audit:true action:block uuid:4b324fc8-1670-01d3-1278-5a47bf6ee188'
detection:
  selection:
    EventLog: RPCFW
    EventID: 3
    InterfaceUuid: 4b324fc8-1670-01d3-1278-5a47bf6ee188
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: b6ea3cc7-542f-43ef-bbe4-980fbed444c7
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/application/rpc_firewall/rpc_firewall_remote_server_service_abuse.yml
falsepositives:
- Legitimate remote share creation
notes:
  quarantine_reason: 'upstream status: test'
