id: sigmahq-sigma-9df0dd3a-1a5c-47e3-a2bc-30ed177646a0
name: Remote Code Execute via Winrm.vbs
description: Detects an attempt to execute code or create service on remote host via
  winrm.vbs.
severity: medium
enabled: false
tags:
  mitre:
  - T1216
  categories:
  - endpoint
references:
- https://twitter.com/bohops/status/994405551751815170
- https://redcanary.com/blog/lateral-movement-winrm-wmi/
- https://lolbas-project.github.io/lolbas/Scripts/Winrm/
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \cscript.exe
  - OriginalFileName: cscript.exe
  selection_cli:
    CommandLine|contains|all:
    - winrm
    - invoke Create wmicimv2/Win32_
    - -r:http
  condition: all of selection*
provenance:
  source: SigmaHQ/sigma
  source_id: 9df0dd3a-1a5c-47e3-a2bc-30ed177646a0
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_winrm_execution_via_scripting_api_winrm_vbs.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
