id: sigmahq-sigma-b1f73849-6329-4069-bc8f-78a604bb8b23
name: Remote Access Tool - ScreenConnect Remote Command Execution
description: Detects the execution of a system command via the ScreenConnect RMM service.
severity: low
enabled: false
tags:
  mitre:
  - T1059.003
  categories:
  - endpoint
references:
- https://github.com/SigmaHQ/sigma/pull/4467
logsource:
  category: process_creation
  product: windows
detection:
  selection_parent:
    ParentImage|endswith: \ScreenConnect.ClientService.exe
  selection_img:
  - Image|endswith: \cmd.exe
  - OriginalFileName: Cmd.Exe
  selection_cli:
    CommandLine|contains: \TEMP\ScreenConnect\
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: b1f73849-6329-4069-bc8f-78a604bb8b23
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_remote_access_tools_screenconnect_remote_execution.yml
falsepositives:
- Legitimate use of ScreenConnect. Disable this rule if ScreenConnect is heavily used.
notes:
  quarantine_reason: 'upstream status: test'
