id: sigmahq-sigma-1f6b8cd4-3e60-47cc-b282-5aa1cbc9182d
name: Remote Access Tool - Team Viewer Session Started On Linux Host
description: 'Detects the command line executed when TeamViewer starts a session started
  by a remote host.

  Once a connection has been started, an investigator can verify the connection details
  by viewing the "incoming_connections.txt" log file in the TeamViewer folder.'
severity: low
enabled: false
tags:
  mitre:
  - T1133
  categories:
  - endpoint
references:
- Internal Research
logsource:
  category: process_creation
  product: linux
detection:
  selection:
    ParentImage|endswith: /TeamViewer_Service
    Image|endswith: /TeamViewer_Desktop
    CommandLine|endswith: /TeamViewer_Desktop --IPCport 5939 --Module 1
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 1f6b8cd4-3e60-47cc-b282-5aa1cbc9182d
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/process_creation/proc_creation_lnx_remote_access_tools_teamviewer_incoming_connection.yml
falsepositives:
- Legitimate usage of TeamViewer
notes:
  quarantine_reason: 'upstream status: test'
