id: sigmahq-sigma-c0aac16a-b1e7-4330-bab0-3c27bb4987c7
name: Remote Thread Creation In Mstsc.Exe From Suspicious Location
description: 'Detects remote thread creation in the "mstsc.exe" process by a process
  located in a potentially suspicious location.

  This technique is often used by attackers in order to hook some APIs used by DLLs
  loaded by "mstsc.exe" during RDP authentications in order to steal credentials.'
severity: high
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://github.com/S12cybersecurity/RDPCredentialStealer/blob/1b8947cdd065a06c1b62e80967d3c7af895fcfed/APIHookInjectorBin/APIHookInjectorBin/Inject.h#L25
logsource:
  product: windows
  category: create_remote_thread
detection:
  selection:
    TargetImage|endswith: \mstsc.exe
    SourceImage|contains:
    - :\Temp\
    - :\Users\Public\
    - :\Windows\PerfLogs\
    - :\Windows\Tasks\
    - :\Windows\Temp\
    - \AppData\Local\Temp\
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: c0aac16a-b1e7-4330-bab0-3c27bb4987c7
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/create_remote_thread/create_remote_thread_win_mstsc_susp_location.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
