id: sigmahq-sigma-bd3b5eaa-439d-4a42-8f35-a49f5c8a2582
name: Remote Access Tool - Renamed MeshAgent Execution - MacOS
description: 'Detects the execution of a renamed instance of the Remote Monitoring
  and Management (RMM) tool, MeshAgent.

  RMM tools such as MeshAgent are commonly utilized by IT administrators for legitimate
  remote support and system management.

  However, malicious actors may exploit these tools by renaming them to bypass detection
  mechanisms, enabling unauthorized access and control over compromised systems.'
severity: high
enabled: false
tags:
  mitre:
  - T1219.002
  - T1036.003
  categories:
  - endpoint
references:
- https://www.huntress.com/blog/know-thy-enemy-a-novel-november-case-on-persistent-remote-access
- https://thecyberexpress.com/ukraine-hit-by-meshagent-malware-campaign/
- https://wazuh.com/blog/how-to-detect-meshagent-with-wazuh/
- https://www.security.com/threat-intelligence/medusa-ransomware-attacks
logsource:
  category: process_creation
  product: macos
detection:
  selection_meshagent:
  - CommandLine|contains: --meshServiceName
  - OriginalFileName|contains: meshagent
  filter_main_legitimate:
    Image|endswith:
    - /meshagent
    - /meshagent_osx64
  condition: selection_meshagent and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: bd3b5eaa-439d-4a42-8f35-a49f5c8a2582
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/macos/process_creation/proc_creation_macos_remote_access_tools_renamed_meshagent_execution.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: experimental'
