id: sigmahq-sigma-0fcd1c79-4eeb-4746-aba9-1b458f7a79cb
name: Remote Schedule Task Lateral Movement via ATSvc
description: Detects remote RPC calls to create or execute a scheduled task via ATSvc
severity: high
enabled: false
tags:
  mitre:
  - T1053
  - T1053.002
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-tsch/d1058a28-7e02-4948-8b8d-4a347fa64931
- https://github.com/jsecurity101/MSRPC-to-ATTACK/blob/ddd4608fe8684fcf2fcf9b48c5f0b3c28097f8a3/documents/MS-TSCH.md
- https://github.com/zeronetworks/rpcfirewall
- https://zeronetworks.com/blog/stopping-lateral-movement-via-the-rpc-firewall/
logsource:
  product: rpc_firewall
  category: application
  definition: 'Requirements: install and apply the RPC Firewall to all processes with
    "audit:true action:block uuid:1ff70682-0a51-30e8-076d-740be8cee98b"'
detection:
  selection:
    EventLog: RPCFW
    EventID: 3
    InterfaceUuid: 1ff70682-0a51-30e8-076d-740be8cee98b
    OpNum:
    - 0
    - 1
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 0fcd1c79-4eeb-4746-aba9-1b458f7a79cb
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/application/rpc_firewall/rpc_firewall_atsvc_lateral_movement.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
