id: sigmahq-sigma-74a2b202-73e0-4693-9a3a-9d36146d0775
name: Remote Access Tool - MeshAgent Command Execution via MeshCentral
description: 'Detects the use of MeshAgent to execute commands on the target host,
  particularly when threat actors might abuse it to execute commands directly.

  MeshAgent can execute commands on the target host by leveraging win-console to obscure
  their activities and win-dispatcher to run malicious code through IPC with child
  processes.'
severity: medium
enabled: false
tags:
  mitre:
  - T1219.002
  categories:
  - endpoint
references:
- https://github.com/Ylianst/MeshAgent
- https://github.com/Ylianst/MeshAgent/blob/52cf129ca43d64743181fbaf940e0b4ddb542a37/modules/win-dispatcher.js#L173
- https://github.com/Ylianst/MeshAgent/blob/52cf129ca43d64743181fbaf940e0b4ddb542a37/modules/win-info.js#L55
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    ParentImage|endswith: \meshagent.exe
    Image|endswith:
    - \cmd.exe
    - \powershell.exe
    - \pwsh.exe
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 74a2b202-73e0-4693-9a3a-9d36146d0775
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_remote_access_tools_meshagent_exec.yml
falsepositives:
- False positives can be found in environments using MeshAgent for remote management,
  analysis should prioritize the grandparent process, MeshAgent.exe, and scrutinize
  the resulting child processes triggered by any suspicious interactive commands directed
  at the target host.
notes:
  quarantine_reason: 'upstream status: test'
