id: sigmahq-sigma-c2e234de-03a3-41e1-b39a-1e56dc17ba67
name: Remove Scheduled Cron Task/Job
description: 'Detects usage of the ''crontab'' utility to remove the current crontab.

  This is a common occurrence where cryptocurrency miners compete against each other
  by removing traces of other miners to hijack the maximum amount of resources possible'
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://www.trendmicro.com/en_us/research/22/i/how-malicious-actors-abuse-native-linux-tools-in-their-attacks.html
logsource:
  category: process_creation
  product: linux
detection:
  selection:
    Image|endswith: crontab
    CommandLine|contains: ' -r'
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: c2e234de-03a3-41e1-b39a-1e56dc17ba67
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/process_creation/proc_creation_lnx_crontab_removal.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
