id: sigmahq-sigma-ace3ff54-e7fd-46bd-8ea0-74b49a0aca1d
name: Remote Schedule Task Lateral Movement via ITaskSchedulerService
description: Detects remote RPC calls to create or execute a scheduled task
severity: high
enabled: false
tags:
  mitre:
  - T1053
  - T1053.002
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-tsch/d1058a28-7e02-4948-8b8d-4a347fa64931
- https://github.com/jsecurity101/MSRPC-to-ATTACK/blob/ddd4608fe8684fcf2fcf9b48c5f0b3c28097f8a3/documents/MS-TSCH.md
- https://github.com/zeronetworks/rpcfirewall
- https://zeronetworks.com/blog/stopping-lateral-movement-via-the-rpc-firewall/
logsource:
  product: rpc_firewall
  category: application
  definition: 'Requirements: install and apply the RPC Firewall to all processes with
    "audit:true action:block uuid:86d35949-83c9-4044-b424-db363231fd0c"'
detection:
  selection:
    EventLog: RPCFW
    EventID: 3
    InterfaceUuid: 86d35949-83c9-4044-b424-db363231fd0c
    OpNum:
    - 1
    - 3
    - 4
    - 10
    - 11
    - 12
    - 13
    - 14
    - 15
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: ace3ff54-e7fd-46bd-8ea0-74b49a0aca1d
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/application/rpc_firewall/rpc_firewall_itaskschedulerservice_lateral_movement.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
