id: sigmahq-sigma-526cc8bc-1cdc-48ad-8b26-f19bff969cec
name: Removal Of Index Value to Hide Schedule Task - Registry
description: Detects when the "index" value of a scheduled task is removed or deleted
  from the registry. Which effectively hides it from any tooling such as "schtasks
  /query"
severity: medium
enabled: false
tags:
  mitre:
  - T1685
  categories:
  - endpoint
references:
- https://blog.qualys.com/vulnerabilities-threat-research/2022/06/20/defending-against-scheduled-task-attacks-in-windows-environments
logsource:
  product: windows
  category: registry_delete
detection:
  selection:
    TargetObject|contains|all:
    - \SOFTWARE\Microsoft\Windows NT\CurrentVersion\Schedule\TaskCache\Tree\
    - Index
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 526cc8bc-1cdc-48ad-8b26-f19bff969cec
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_delete/registry_delete_schtasks_hide_task_via_index_value_removal.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
