id: sigmahq-sigma-68050b10-e477-4377-a99b-3721b422d6ef
name: Remote DCOM/WMI Lateral Movement
description: Detects remote RPC calls that performs remote DCOM operations. These
  could be abused for lateral movement via DCOM or WMI.
severity: high
enabled: false
tags:
  mitre:
  - T1021.003
  - T1047
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-srvs/accf23b0-0f57-441c-9185-43041f1b0ee9
- https://github.com/zeronetworks/rpcfirewall
- https://zeronetworks.com/blog/stopping-lateral-movement-via-the-rpc-firewall/
logsource:
  product: rpc_firewall
  category: application
  definition: 'Requirements: install and apply the RPC Firewall to all processes with
    "audit:true action:block uuid:367abb81-9844-35f1-ad32-98f038001003'
detection:
  selection:
    EventLog: RPCFW
    EventID: 3
    InterfaceUuid:
    - 4d9f4ab8-7d1c-11cf-861e-0020af6e7c57
    - 99fcfec4-5260-101b-bbcb-00aa0021347a
    - 000001a0-0000-0000-c000-000000000046
    - 00000131-0000-0000-c000-000000000046
    - 00000143-0000-0000-c000-000000000046
    - 00000000-0000-0000-c000-000000000046
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 68050b10-e477-4377-a99b-3721b422d6ef
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/application/rpc_firewall/rpc_firewall_remote_dcom_or_wmi.yml
falsepositives:
- Some administrative tasks on remote host
notes:
  quarantine_reason: 'upstream status: test'
