id: sigmahq-sigma-8b48ad89-10d8-4382-a546-50588c410f0d
name: Remote AppX Package Downloaded from File Sharing or CDN Domain
description: Detects an appx package that was added to the pipeline of the "to be
  processed" packages which was downloaded from a file sharing or CDN domain.
severity: high
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://www.sentinelone.com/labs/inside-malicious-windows-apps-for-malware-deployment/
- https://learn.microsoft.com/en-us/windows/win32/appxpkg/troubleshooting
- https://news.sophos.com/en-us/2021/11/11/bazarloader-call-me-back-attack-abuses-windows-10-apps-mechanism/
logsource:
  product: windows
  service: appxdeployment-server
detection:
  selection:
    EventID: 854
    Path|contains:
    - .githubusercontent.com
    - anonfiles.com
    - cdn.discordapp.com
    - ddns.net
    - dl.dropboxusercontent.com
    - ghostbin.co
    - github.com
    - glitch.me
    - gofile.io
    - hastebin.com
    - mediafire.com
    - mega.nz
    - onrender.com
    - pages.dev
    - paste.ee
    - pastebin.com
    - pastebin.pl
    - pastetext.net
    - privatlab.com
    - privatlab.net
    - send.exploit.in
    - sendspace.com
    - storage.googleapis.com
    - storjshare.io
    - supabase.co
    - temp.sh
    - transfer.sh
    - trycloudflare.com
    - ufile.io
    - w3spaces.com
    - workers.dev
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 8b48ad89-10d8-4382-a546-50588c410f0d
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/appxdeployment_server/win_appxdeployment_server_appx_downloaded_from_file_sharing_domains.yml
falsepositives:
- Unlikely, unless the organization uses file sharing or CDN services to distribute
  internal applications.
notes:
  quarantine_reason: 'upstream status: test'
