id: sigmahq-sigma-587254ee-a24b-4335-b3cd-065c0f1f4baa
name: Remote File Download Via Findstr.EXE
description: Detects execution of "findstr" with specific flags and a remote share
  path. This specific set of CLI flags would allow "findstr" to download the content
  of the file located on the remote share as described in the LOLBAS entry.
severity: medium
enabled: false
tags:
  mitre:
  - T1218
  - T1564.004
  - T1552.001
  - T1105
  categories:
  - endpoint
references:
- https://lolbas-project.github.io/lolbas/Binaries/Findstr/
- https://oddvar.moe/2018/04/11/putting-data-in-alternate-data-streams-and-how-to-execute-it-part-2/
- https://gist.github.com/api0cradle/cdd2d0d0ec9abb686f0e89306e277b8f
logsource:
  category: process_creation
  product: windows
detection:
  selection_findstr:
  - CommandLine|contains: findstr
  - Image|endswith: findstr.exe
  - OriginalFileName: FINDSTR.EXE
  selection_cli_download_1:
    CommandLine|contains|windash: ' -v '
  selection_cli_download_2:
    CommandLine|contains|windash: ' -l '
  selection_cli_download_3:
    CommandLine|contains: \\\\
  condition: selection_findstr and all of selection_cli_download_*
provenance:
  source: SigmaHQ/sigma
  source_id: 587254ee-a24b-4335-b3cd-065c0f1f4baa
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_findstr_download.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
