id: sigmahq-sigma-d58ba5c6-0ed7-4b9d-a433-6878379efda9
name: Remote Access Tool - AnyDesk Incoming Connection
description: Detects incoming connections to AnyDesk. This could indicate a potential
  remote attacker trying to connect to a listening instance of AnyDesk and use it
  as potential command and control channel.
severity: medium
enabled: false
tags:
  mitre:
  - T1219.002
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1219/T1219.md#atomic-test-2---anydesk-files-detected-test-on-windows
- https://asec.ahnlab.com/en/40263/
logsource:
  category: network_connection
  product: windows
detection:
  selection:
    Image|endswith:
    - \AnyDesk.exe
    - \AnyDeskMSI.exe
    Initiated: 'false'
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: d58ba5c6-0ed7-4b9d-a433-6878379efda9
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/network_connection/net_connection_win_remote_access_tools_anydesk_incoming_connection.yml
falsepositives:
- Legitimate incoming connections (e.g. sysadmin activity). Most of the time I would
  expect outgoing connections (initiated locally).
notes:
  quarantine_reason: 'upstream status: experimental'
