id: sigmahq-sigma-f57c58b3-ee69-4ef5-9041-455bf39aaa89
name: Remote CHM File Download/Execution Via HH.EXE
description: Detects the usage of "hh.exe" to execute/download remotely hosted ".chm"
  files.
severity: high
enabled: false
tags:
  mitre:
  - T1218.001
  categories:
  - endpoint
references:
- https://www.splunk.com/en_us/blog/security/follina-for-protocol-handlers.html
- https://github.com/redcanaryco/atomic-red-team/blob/1cf4dd51f83dcb0ebe6ade902d6157ad2dbc6ac8/atomics/T1218.001/T1218.001.md
- https://www.zscaler.com/blogs/security-research/unintentional-leak-glimpse-attack-vectors-apt37
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - OriginalFileName: HH.exe
  - Image|endswith: \hh.exe
  selection_cli:
    CommandLine|contains:
    - http://
    - https://
    - \\\\
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: f57c58b3-ee69-4ef5-9041-455bf39aaa89
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_hh_chm_remote_download_or_execution.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
