id: sigmahq-sigma-a1a144b7-5c9b-4853-a559-2172be8d4a03
name: Remote Thread Creation In Uncommon Target Image
description: Detects uncommon target processes for remote thread creation
severity: medium
enabled: false
tags:
  mitre:
  - T1055.003
  categories:
  - endpoint
references:
- https://web.archive.org/web/20220319032520/https://blog.redbluepurple.io/offensive-research/bypassing-injection-detection
logsource:
  product: windows
  category: create_remote_thread
detection:
  selection:
    TargetImage|endswith:
    - \calc.exe
    - \calculator.exe
    - \mspaint.exe
    - \notepad.exe
    - \ping.exe
    - \sethc.exe
    - \spoolsv.exe
    - \wordpad.exe
    - \write.exe
  filter_main_csrss:
    SourceImage: C:\Windows\System32\csrss.exe
  filter_main_notepad:
    SourceImage:
    - C:\Windows\System32\explorer.exe
    - C:\Windows\System32\OpenWith.exe
    TargetImage: C:\Windows\System32\notepad.exe
  filter_main_sethc:
    SourceImage: C:\Windows\System32\AtBroker.exe
    TargetImage: C:\Windows\System32\Sethc.exe
  filter_optional_aurora_1:
    StartFunction: EtwpNotificationThread
  filter_optional_aurora_2:
    SourceImage|contains: unknown process
  filter_optional_vmtoolsd:
    SourceImage: C:\Program Files\VMware\VMware Tools\vmtoolsd.exe
    StartFunction: GetCommandLineW
    TargetImage:
    - C:\Windows\System32\notepad.exe
    - C:\Windows\System32\spoolsv.exe
  filter_optional_xerox_pjems:
    SourceImage: C:\Program Files\Xerox\XeroxPrintExperience\CommonFiles\XeroxPrintJobEventManagerService.exe
    StartFunction: LoadLibraryW
    TargetImage: C:\Windows\System32\spoolsv.exe
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
provenance:
  source: SigmaHQ/sigma
  source_id: a1a144b7-5c9b-4853-a559-2172be8d4a03
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/create_remote_thread/create_remote_thread_win_susp_uncommon_target_image.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
