id: sigmahq-sigma-d8ffe17e-04be-4886-beb9-c1dd1944b9a8
name: Remote Registry Recon
description: Detects remote RPC calls to collect information
severity: high
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-rrp/0fa3191d-bb79-490a-81bd-54c2601b7a78
- https://github.com/jsecurity101/MSRPC-to-ATTACK/blob/ddd4608fe8684fcf2fcf9b48c5f0b3c28097f8a3/documents/MS-RRP.md
- https://github.com/zeronetworks/rpcfirewall
- https://zeronetworks.com/blog/stopping-lateral-movement-via-the-rpc-firewall/
logsource:
  product: rpc_firewall
  category: application
  definition: 'Requirements: install and apply the RPC Firewall to all processes with
    "audit:true action:block uuid:338cd001-2244-31f1-aaaa-900038001003"'
detection:
  selection:
    EventLog: RPCFW
    EventID: 3
    InterfaceUuid: 338cd001-2244-31f1-aaaa-900038001003
  filter:
    OpNum:
    - 6
    - 7
    - 8
    - 13
    - 18
    - 19
    - 21
    - 22
    - 23
    - 35
  condition: selection and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: d8ffe17e-04be-4886-beb9-c1dd1944b9a8
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/application/rpc_firewall/rpc_firewall_remote_registry_recon.yml
falsepositives:
- Remote administration of registry values
notes:
  quarantine_reason: 'upstream status: test'
