id: sigmahq-sigma-f40017b3-cb2e-4335-ab5d-3babf679c1de
name: Remote DLL Load Via Rundll32.EXE
description: Detects a remote DLL load event via "rundll32.exe".
severity: medium
enabled: false
tags:
  mitre:
  - T1204.002
  categories:
  - endpoint
references:
- https://github.com/gabe-k/themebleed
- Internal Research
logsource:
  category: image_load
  product: windows
detection:
  selection:
    Image|endswith: \rundll32.exe
    ImageLoaded|startswith: \\\\
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: f40017b3-cb2e-4335-ab5d-3babf679c1de
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/image_load/image_load_rundll32_remote_share_load.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
