id: sigmahq-sigma-c15e99a3-c474-48ab-b9a7-84549a7a9d16
name: Remote Thread Creation Ttdinject.exe Proxy
description: Detects a remote thread creation of Ttdinject.exe used as proxy
severity: high
enabled: false
tags:
  mitre:
  - T1127
  categories:
  - endpoint
references:
- https://lolbas-project.github.io/lolbas/Binaries/Ttdinject/
logsource:
  product: windows
  category: create_remote_thread
detection:
  selection:
    SourceImage|endswith: \ttdinject.exe
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: c15e99a3-c474-48ab-b9a7-84549a7a9d16
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/create_remote_thread/create_remote_thread_win_ttdinjec.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
