id: sigmahq-sigma-065b00ca-5d5c-4557-ac95-64a6d0b64d86
name: Remote Access Tool - Anydesk Execution From Suspicious Folder
description: 'An adversary may use legitimate desktop support and remote access software,
  such as Team Viewer, Go2Assist, LogMein, AmmyyAdmin, etc, to establish an interactive
  command and control channel to target systems within networks.

  These services are commonly used as legitimate technical support software, and may
  be allowed by application control within a target environment.

  Remote access tools like VNC, Ammyy, and Teamviewer are used frequently when compared
  with other legitimate software commonly used by adversaries. (Citation: Symantec
  Living off the Land)'
severity: high
enabled: false
tags:
  mitre:
  - T1219.002
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1219/T1219.md#atomic-test-2---anydesk-files-detected-test-on-windows
- https://thedfirreport.com/2025/02/24/confluence-exploit-leads-to-lockbit-ransomware/
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Image|endswith:
    - \AnyDesk.exe
    - \AnyDeskMSI.exe
  - Description: AnyDesk
  - Product: AnyDesk
  - Company: AnyDesk Software GmbH
  filter:
    Image|contains:
    - \AppData\
    - Program Files (x86)\AnyDesk
    - Program Files\AnyDesk
  condition: selection and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: 065b00ca-5d5c-4557-ac95-64a6d0b64d86
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_remote_access_tools_anydesk_susp_exec.yml
falsepositives:
- Legitimate use of AnyDesk from a non-standard folder
notes:
  quarantine_reason: 'upstream status: test'
