id: sigmahq-sigma-b98d0db6-511d-45de-ad02-e82a98729620
name: Remotely Hosted HTA File Executed Via Mshta.EXE
description: Detects execution of the "mshta" utility with an argument containing
  the "http" keyword, which could indicate that an attacker is executing a remotely
  hosted malicious hta file
severity: high
enabled: false
tags:
  mitre:
  - T1218.005
  categories:
  - endpoint
references:
- https://www.trendmicro.com/en_us/research/22/e/avoslocker-ransomware-variant-abuses-driver-file-to-disable-anti-Virus-scans-log4shell.html
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \mshta.exe
  - OriginalFileName: MSHTA.EXE
  selection_cli:
    CommandLine|contains:
    - http://
    - https://
    - ftp://
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: b98d0db6-511d-45de-ad02-e82a98729620
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_mshta_http.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
