id: sigmahq-sigma-ab70c354-d9ac-4e11-bbb6-ec8e3b153357
name: Remote Access Tool - Team Viewer Session Started On Windows Host
description: 'Detects the command line executed when TeamViewer starts a session started
  by a remote host.

  Once a connection has been started, an investigator can verify the connection details
  by viewing the "incoming_connections.txt" log file in the TeamViewer folder.'
severity: low
enabled: false
tags:
  mitre:
  - T1133
  categories:
  - endpoint
references:
- Internal Research
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image: TeamViewer_Desktop.exe
    ParentImage: TeamViewer_Service.exe
    CommandLine|endswith: TeamViewer_Desktop.exe --IPCport 5939 --Module 1
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: ab70c354-d9ac-4e11-bbb6-ec8e3b153357
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_remote_access_tools_teamviewer_incoming_connection.yml
falsepositives:
- Legitimate usage of TeamViewer
notes:
  quarantine_reason: 'upstream status: test'
