id: sigmahq-sigma-076ebe48-cc05-4d8f-9d41-89245cd93a14
name: Remote Access Tool - ScreenConnect Command Execution
description: Detects command execution via ScreenConnect RMM
severity: low
enabled: false
tags:
  mitre:
  - T1059.003
  categories:
  - endpoint
references:
- https://www.huntandhackett.com/blog/revil-the-usage-of-legitimate-remote-admin-tooling
- https://github.com/SigmaHQ/sigma/pull/4467
logsource:
  service: application
  product: windows
detection:
  selection:
    Provider_Name: ScreenConnect
    EventID: 200
    Data|contains: Executed command of length
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 076ebe48-cc05-4d8f-9d41-89245cd93a14
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/application/screenconnect/win_app_remote_access_tools_screenconnect_command_exec.yml
falsepositives:
- Legitimate use of ScreenConnect
notes:
  quarantine_reason: 'upstream status: test'
