id: sigmahq-sigma-41d1058a-aea7-4952-9293-29eaaf516465
name: Removal Of AMSI Provider Registry Keys
description: Detects the deletion of AMSI provider registry key entries in HKLM\Software\Microsoft\AMSI.
  This technique could be used by an attacker in order to disable AMSI inspection.
severity: high
enabled: false
tags:
  mitre:
  - T1685
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md
- https://seclists.org/fulldisclosure/2020/Mar/45
logsource:
  product: windows
  category: registry_delete
detection:
  selection:
    TargetObject|endswith:
    - '{2781761E-28E0-4109-99FE-B9D127C57AFE}'
    - '{A7C452EF-8E9F-42EB-9F2B-245613CA0DC9}'
  filter_main_defender:
    Image|startswith:
    - C:\ProgramData\Microsoft\Windows Defender\Platform\
    - C:\Program Files\Windows Defender\
    - C:\Program Files (x86)\Windows Defender\
    Image|endswith: \MsMpEng.exe
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 41d1058a-aea7-4952-9293-29eaaf516465
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_delete/registry_delete_removal_amsi_registry_key.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
