id: sigmahq-sigma-758ff488-18d5-4cbe-8ec4-02b6285a434f
name: Remote Access Tool - NetSupport Execution
description: 'An adversary may use legitimate desktop support and remote access software,
  such as Team Viewer, Go2Assist, LogMein, AmmyyAdmin, etc, to establish an interactive
  command and control channel to target systems within networks.

  These services are commonly used as legitimate technical support software, and may
  be allowed by application control within a target environment.

  Remote access tools like VNC, Ammyy, and Teamviewer are used frequently when compared
  with other legitimate software commonly used by adversaries. (Citation: Symantec
  Living off the Land)'
severity: medium
enabled: false
tags:
  mitre:
  - T1219.002
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1219/T1219.md
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Description: NetSupport Client Configurator
  - Product: NetSupport Remote Control
  - Company: NetSupport Ltd
  - OriginalFileName: PCICFGUI.EXE
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 758ff488-18d5-4cbe-8ec4-02b6285a434f
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_remote_access_tools_netsupport.yml
falsepositives:
- Legitimate use
notes:
  quarantine_reason: 'upstream status: test'
