id: sigmahq-sigma-264982dc-dbad-4dce-b707-1e0d3e0f73d9
name: Renamed NirCmd.EXE Execution
description: Detects the execution of a renamed "NirCmd.exe" binary based on the PE
  metadata fields.
severity: high
enabled: false
tags:
  mitre:
  - T1059
  - T1202
  categories:
  - endpoint
references:
- https://www.microsoft.com/en-us/security/blog/2024/01/17/new-ttps-observed-in-mint-sandstorm-campaign-targeting-high-profile-individuals-at-universities-and-research-orgs/
- https://www.nirsoft.net/utils/nircmd.html
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    OriginalFileName: NirCmd.exe
  filter_main_img:
    Image|endswith:
    - \nircmd.exe
    - \nircmdc.exe
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 264982dc-dbad-4dce-b707-1e0d3e0f73d9
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_renamed_nircmd.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
