id: sigmahq-sigma-0b0cd537-fc77-4e6e-a973-e53495c1083d
name: Renamed Office Binary Execution
description: Detects the execution of a renamed office binary
severity: high
enabled: false
tags:
  mitre:
  - T1036.003
  categories:
  - endpoint
references:
- https://infosec.exchange/@sbousseaden/109542254124022664
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - OriginalFileName:
    - Excel.exe
    - MSACCESS.EXE
    - MSPUB.EXE
    - OneNote.exe
    - OneNoteM.exe
    - OUTLOOK.EXE
    - POWERPNT.EXE
    - WinWord.exe
    - Olk.exe
  - Description:
    - Microsoft Access
    - Microsoft Excel
    - Microsoft OneNote
    - Microsoft Outlook
    - Microsoft PowerPoint
    - Microsoft Publisher
    - Microsoft Word
    - Sent to OneNote Tool
  filter_main_legit_names:
    Image|endswith:
    - \EXCEL.exe
    - \excelcnv.exe
    - \MSACCESS.exe
    - \MSPUB.EXE
    - \ONENOTE.EXE
    - \ONENOTEM.EXE
    - \OUTLOOK.EXE
    - \POWERPNT.EXE
    - \WINWORD.exe
    - \OLK.EXE
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 0b0cd537-fc77-4e6e-a973-e53495c1083d
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_renamed_office_processes.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
