id: sigmahq-sigma-7b4f794b-590a-4ad4-ba18-7964a2832205
name: Renamed Vmnat.exe Execution
description: Detects renamed vmnat.exe or portable version that can be used for DLL
  side-loading
severity: high
enabled: false
tags:
  mitre:
  - T1574.001
  categories:
  - endpoint
references:
- https://twitter.com/malmoeb/status/1525901219247845376
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    OriginalFileName: vmnat.exe
  filter_rename:
    Image|endswith: vmnat.exe
  condition: selection and not 1 of filter_*
provenance:
  source: SigmaHQ/sigma
  source_id: 7b4f794b-590a-4ad4-ba18-7964a2832205
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_renamed_vmnat.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
