id: sigmahq-sigma-340a090b-c4e9-412e-bb36-b4b16fe96f9b
name: Renamed ZOHO Dctask64 Execution
description: 'Detects a renamed "dctask64.exe" execution, a signed binary by ZOHO
  Corporation part of ManageEngine Endpoint Central.

  This binary can be abused for DLL injection, arbitrary command and process execution.'
severity: high
enabled: false
tags:
  mitre:
  - T1036
  - T1055.001
  - T1202
  - T1218
  categories:
  - endpoint
references:
- https://twitter.com/gN3mes1s/status/1222088214581825540
- https://twitter.com/gN3mes1s/status/1222095963789111296
- https://twitter.com/gN3mes1s/status/1222095371175911424
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Hashes|contains:
    - IMPHASH=6834B1B94E49701D77CCB3C0895E1AFD
    - IMPHASH=1BB6F93B129F398C7C4A76BB97450BBA
    - IMPHASH=FAA2AC19875FADE461C8D89DCF2710A3
    - IMPHASH=F1039CED4B91572AB7847D26032E6BBF
  filter_main_legit_name:
    Image|endswith: \dctask64.exe
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 340a090b-c4e9-412e-bb36-b4b16fe96f9b
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_renamed_dctask64.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
