id: sigmahq-sigma-51ae86a2-e2e1-4097-ad85-c46cb6851de4
name: Renamed PsExec Service Execution
description: Detects suspicious launch of a renamed version of the PSEXESVC service
  with, which is not often used by legitimate administrators
severity: high
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/sysinternals/downloads/psexec
- https://www.youtube.com/watch?v=ro2QuZTIMBM
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    OriginalFileName: psexesvc.exe
  filter:
    Image: C:\Windows\PSEXESVC.exe
  condition: selection and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: 51ae86a2-e2e1-4097-ad85-c46cb6851de4
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_renamed_sysinternals_psexec_service.yml
falsepositives:
- Legitimate administrative tasks
notes:
  quarantine_reason: 'upstream status: test'
