id: sigmahq-sigma-edd8a48c-1b9f-4ba1-83aa-490338cd1ccb
name: Renamed Jusched.EXE Execution
description: Detects the execution of a renamed "jusched.exe" as seen used by the
  cobalt group
severity: high
enabled: false
tags:
  mitre:
  - T1036.003
  categories:
  - endpoint
references:
- https://www.bitdefender.com/files/News/CaseStudies/study/262/Bitdefender-WhitePaper-An-APT-Blueprint-Gaining-New-Visibility-into-Financial-Threats-interactive.pdf
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Description:
    - Java Update Scheduler
    - Java(TM) Update Scheduler
  filter:
    Image|endswith: \jusched.exe
  condition: selection and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: edd8a48c-1b9f-4ba1-83aa-490338cd1ccb
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_renamed_jusched.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
