id: sigmahq-sigma-1a1ed54a-2ba4-4221-94d5-01dee560d71e
name: Renamed CreateDump Utility Execution
description: Detects uses of a renamed legitimate createdump.exe LOLOBIN utility to
  dump process memory
severity: high
enabled: false
tags:
  mitre:
  - T1036
  - T1003.001
  categories:
  - endpoint
references:
- https://www.crowdstrike.com/blog/overwatch-exposes-aquatic-panda-in-possession-of-log-4-shell-exploit-tools/
- https://twitter.com/bopin2020/status/1366400799199272960
logsource:
  category: process_creation
  product: windows
detection:
  selection_pe:
    OriginalFileName: FX_VER_INTERNALNAME_STR
  selection_cli:
  - CommandLine|contains|all:
    - ' -u '
    - ' -f '
    - .dmp
  - CommandLine|contains|all:
    - ' --full '
    - ' --name '
    - .dmp
  filter:
    Image|endswith: \createdump.exe
  condition: 1 of selection_* and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: 1a1ed54a-2ba4-4221-94d5-01dee560d71e
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_renamed_createdump.yml
falsepositives:
- Command lines that use the same flags
notes:
  quarantine_reason: 'upstream status: test'
