id: sigmahq-sigma-1c12727d-02bf-45ff-a9f3-d49806a3cf43
name: Renamed Plink Execution
description: Detects the execution of a renamed version of the Plink binary
severity: high
enabled: false
tags:
  mitre:
  - T1036
  categories:
  - endpoint
references:
- https://thedfirreport.com/2022/06/06/will-the-real-msiexec-please-stand-up-exploit-leads-to-data-exfiltration/
- https://the.earth.li/~sgtatham/putty/0.58/htmldoc/Chapter7.html
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - OriginalFileName: Plink
  - CommandLine|contains|all:
    - ' -l forward'
    - ' -P '
    - ' -R '
  filter:
    Image|endswith: \plink.exe
  condition: selection and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: 1c12727d-02bf-45ff-a9f3-d49806a3cf43
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_renamed_plink.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
