id: sigmahq-sigma-2433a154-bb3d-42e4-86c3-a26bdac91c45
name: Renamed PingCastle Binary Execution
description: Detects the execution of a renamed "PingCastle" binary based on the PE
  metadata fields.
severity: high
enabled: false
tags:
  mitre:
  - T1059
  - T1202
  categories:
  - endpoint
references:
- https://thedfirreport.com/2023/10/30/netsupport-intrusion-results-in-domain-compromise/
- https://www.pingcastle.com/documentation/scanner/
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - OriginalFileName:
    - PingCastleReporting.exe
    - PingCastleCloud.exe
    - PingCastle.exe
  - CommandLine|contains:
    - --scanner aclcheck
    - --scanner antivirus
    - --scanner computerversion
    - --scanner foreignusers
    - --scanner laps_bitlocker
    - --scanner localadmin
    - --scanner nullsession
    - --scanner nullsession-trust
    - --scanner oxidbindings
    - --scanner remote
    - --scanner share
    - --scanner smb
    - --scanner smb3querynetwork
    - --scanner spooler
    - --scanner startup
    - --scanner zerologon
  - CommandLine|contains: --no-enum-limit
  - CommandLine|contains|all:
    - --healthcheck
    - --level Full
  - CommandLine|contains|all:
    - --healthcheck
    - '--server '
  filter_main_img:
    Image|endswith:
    - \PingCastleReporting.exe
    - \PingCastleCloud.exe
    - \PingCastle.exe
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 2433a154-bb3d-42e4-86c3-a26bdac91c45
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_renamed_pingcastle.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
