id: sigmahq-sigma-2cf29f11-e356-4f61-98c0-1bdb9393d6da
name: Renamed Visual Studio Code Tunnel Execution
description: Detects renamed Visual Studio Code tunnel execution. Attackers can abuse
  this functionality to establish a C2 channel
severity: high
enabled: false
tags:
  mitre:
  - T1071.001
  - T1219
  categories:
  - endpoint
references:
- https://ipfyx.fr/post/visual-studio-code-tunnel/
- https://badoption.eu/blog/2023/01/31/code_c2.html
- https://code.visualstudio.com/docs/remote/tunnels
logsource:
  category: process_creation
  product: windows
detection:
  selection_image_only_tunnel:
    OriginalFileName: null
    CommandLine|endswith: .exe tunnel
  selection_image_tunnel_args:
    CommandLine|contains|all:
    - .exe tunnel
    - --accept-server-license-terms
  selection_image_tunnel_service:
    CommandLine|contains|all:
    - 'tunnel '
    - service
    - internal-run
    - tunnel-service.log
  selection_parent_tunnel:
    ParentCommandLine|endswith: ' tunnel'
    Image|endswith: \cmd.exe
    CommandLine|contains|all:
    - '/d /c '
    - \servers\Stable-
    - code-server.cmd
  filter_main_parent_code:
    ParentImage|endswith:
    - \code-tunnel.exe
    - \code.exe
  filter_main_image_code:
    Image|endswith:
    - \code-tunnel.exe
    - \code.exe
  condition: (1 of selection_image_* and not 1 of filter_main_image_*) or (selection_parent_tunnel
    and not 1 of filter_main_parent_*)
provenance:
  source: SigmaHQ/sigma
  source_id: 2cf29f11-e356-4f61-98c0-1bdb9393d6da
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_vscode_tunnel_renamed_execution.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
