id: sigmahq-sigma-643bdcac-8b82-49f4-9fd9-25a90b929f3b
name: Renamed MegaSync Execution
description: Detects the execution of a renamed MegaSync.exe as seen used by ransomware
  families like Nefilim, Sodinokibi, Pysa, and Conti.
severity: high
enabled: false
tags:
  mitre:
  - T1218
  categories:
  - endpoint
references:
- https://redcanary.com/blog/rclone-mega-extortion/
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    OriginalFileName: megasync.exe
  filter:
    Image|endswith: \megasync.exe
  condition: selection and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: 643bdcac-8b82-49f4-9fd9-25a90b929f3b
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_renamed_megasync.yml
falsepositives:
- Software that illegally integrates MegaSync in a renamed form
- Administrators that have renamed MegaSync
notes:
  quarantine_reason: 'upstream status: test'
