id: sigmahq-sigma-c4e49831-1496-40cf-8ce1-b53f942b02f9
name: Renamed PAExec Execution
description: Detects execution of renamed version of PAExec. Often used by attackers
severity: high
enabled: false
tags:
  mitre:
  - T1202
  categories:
  - endpoint
references:
- https://www.poweradmin.com/paexec/
- https://summit.fireeye.com/content/dam/fireeye-www/summit/cds-2018/presentations/cds18-technical-s05-att&cking-fin7.pdf
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Description: PAExec Application
  - OriginalFileName: PAExec.exe
  - Product|contains: PAExec
  - Hashes|contains:
    - IMPHASH=11D40A7B7876288F919AB819CC2D9802
    - IMPHASH=6444f8a34e99b8f7d9647de66aabe516
    - IMPHASH=dfd6aa3f7b2b1035b76b718f1ddc689f
    - IMPHASH=1a6cca4d5460b1710a12dea39e4a592c
  filter_main_known_location:
  - Image|endswith: \paexec.exe
  - Image|startswith: C:\Windows\PAExec-
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: c4e49831-1496-40cf-8ce1-b53f942b02f9
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_renamed_paexec.yml
falsepositives:
- Weird admins that rename their tools
- Software companies that bundle PAExec with their software and rename it, so that
  it is less embarrassing
- When executed with the "-s" flag. PAExec will copy itself to the "C:\Windows\" directory
  with a different name. Usually like this "PAExec-[XXXXX]-[ComputerName]"
notes:
  quarantine_reason: 'upstream status: test'
