id: sigmahq-sigma-30d07da2-83ab-45d8-ae75-ec7c0edcaffc
name: Renamed BOINC Client Execution
description: Detects the execution of a renamed BOINC binary.
severity: medium
enabled: false
tags:
  mitre:
  - T1553
  categories:
  - endpoint
references:
- https://boinc.berkeley.edu/
- https://www.virustotal.com/gui/file/91e405e8a527023fb8696624e70498ae83660fe6757cef4871ce9bcc659264d3/details
- https://www.huntress.com/blog/fake-browser-updates-lead-to-boinc-volunteer-computing-software
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    OriginalFileName: BOINC.exe
  filter_main_legit_name:
    Image|endswith: \BOINC.exe
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 30d07da2-83ab-45d8-ae75-ec7c0edcaffc
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_renamed_boinc.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
