id: sigmahq-sigma-f1086bf7-a0c4-4a37-9102-01e573caf4a0
name: Renamed Whoami Execution
description: Detects the execution of whoami that has been renamed to a different
  name to avoid detection
severity: critical
enabled: false
tags:
  mitre:
  - T1033
  categories:
  - endpoint
references:
- https://brica.de/alerts/alert/public/1247926/agent-tesla-keylogger-delivered-inside-a-power-iso-daa-archive/
- https://app.any.run/tasks/7eaba74e-c1ea-400f-9c17-5e30eee89906/
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    OriginalFileName: whoami.exe
  filter:
    Image|endswith: \whoami.exe
  condition: selection and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: f1086bf7-a0c4-4a37-9102-01e573caf4a0
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_renamed_whoami.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
