id: sigmahq-sigma-4a0b2c7e-7cb2-495d-8b63-5f268e7bfd67
name: Renamed ProcDump Execution
description: 'Detects the execution of a renamed ProcDump executable.

  This often done by attackers or malware in order to evade defensive mechanisms.'
severity: high
enabled: false
tags:
  mitre:
  - T1036.003
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/sysinternals/downloads/procdump
logsource:
  product: windows
  category: process_creation
detection:
  selection_ofn:
    OriginalFileName: procdump
  selection_cli_dump_flag:
    CommandLine|contains|windash:
    - ' -ma '
    - ' -mp '
  selection_cli_eula_flag:
    CommandLine|contains|windash: ' /accepteula'
  filter_main_known_names:
    Image|endswith:
    - \procdump.exe
    - \procdump64.exe
  condition: (selection_ofn or all of selection_cli_*) and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 4a0b2c7e-7cb2-495d-8b63-5f268e7bfd67
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_renamed_sysinternals_procdump.yml
falsepositives:
- Procdump illegally bundled with legitimate software.
- Administrators who rename binaries (should be investigated).
notes:
  quarantine_reason: 'upstream status: test'
