id: sigmahq-sigma-c3f265c7-ff03-4056-8ab2-d486227b4599
name: Restore Public AWS RDS Instance
description: Detects the recovery of a new public database instance from a snapshot.
  It may be a part of data exfiltration.
severity: high
enabled: false
tags:
  mitre:
  - T1020
  categories:
  - cloud
references:
- https://github.com/RhinoSecurityLabs/pacu/blob/866376cd711666c775bbfcde0524c817f2c5b181/pacu/modules/rds__explore_snapshots/main.py
logsource:
  product: aws
  service: cloudtrail
detection:
  selection_source:
    eventSource: rds.amazonaws.com
    responseElements.publiclyAccessible: 'true'
    eventName: RestoreDBInstanceFromDBSnapshot
  condition: selection_source
provenance:
  source: SigmaHQ/sigma
  source_id: c3f265c7-ff03-4056-8ab2-d486227b4599
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/aws/cloudtrail/aws_rds_public_db_restore.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
