id: sigmahq-sigma-b1bc08d1-8224-4758-a0e6-fbcfc98c73bb
name: Roles Assigned Outside PIM
description: Identifies when a privilege role assignment has taken place outside of
  PIM and may indicate an attack.
severity: high
enabled: false
tags:
  mitre:
  - T1078
  categories:
  - cloud
references:
- https://learn.microsoft.com/en-us/entra/id-governance/privileged-identity-management/pim-how-to-configure-security-alerts#roles-are-being-assigned-outside-of-privileged-identity-management
logsource:
  product: azure
  service: pim
detection:
  selection:
    riskEventType: rolesAssignedOutsidePrivilegedIdentityManagementAlertConfiguration
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: b1bc08d1-8224-4758-a0e6-fbcfc98c73bb
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/azure/privileged_identity_management/azure_pim_role_assigned_outside_of_pim.yml
falsepositives:
- Investigate where users are being assigned privileged roles outside of Privileged
  Identity Management and prohibit future assignments from there.
notes:
  quarantine_reason: 'upstream status: test'
