id: sigmahq-sigma-94a66f46-5b64-46ce-80b2-75dcbe627cc0
name: Roles Activation Doesn't Require MFA
description: Identifies when a privilege role can be activated without performing
  mfa.
severity: high
enabled: false
tags:
  mitre:
  - T1078
  categories:
  - cloud
references:
- https://learn.microsoft.com/en-us/entra/id-governance/privileged-identity-management/pim-how-to-configure-security-alerts#roles-dont-require-multi-factor-authentication-for-activation
logsource:
  product: azure
  service: pim
detection:
  selection:
    riskEventType: noMfaOnRoleActivationAlertIncident
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 94a66f46-5b64-46ce-80b2-75dcbe627cc0
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/azure/privileged_identity_management/azure_pim_role_no_mfa_required.yml
falsepositives:
- Investigate if user is performing MFA at sign-in.
notes:
  quarantine_reason: 'upstream status: test'
