id: sigmahq-sigma-42821614-9264-4761-acfc-5772c3286f76
name: Root Certificate Installed - PowerShell
description: Adversaries may install a root certificate on a compromised system to
  avoid warnings when connecting to adversary controlled web servers.
severity: medium
enabled: false
tags:
  mitre:
  - T1553.004
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1553.004/T1553.004.md
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection1:
    ScriptBlockText|contains|all:
    - Move-Item
    - Cert:\LocalMachine\Root
  selection2:
    ScriptBlockText|contains|all:
    - Import-Certificate
    - Cert:\LocalMachine\Root
  condition: 1 of selection*
provenance:
  source: SigmaHQ/sigma
  source_id: 42821614-9264-4761-acfc-5772c3286f76
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_root_certificate_installed.yml
falsepositives:
- Help Desk or IT may need to manually add a corporate Root CA on occasion. Need to
  test if GPO push doesn't trigger FP
notes:
  quarantine_reason: 'upstream status: test'
