id: sigmahq-sigma-5f6a601c-2ecb-498b-9c33-660362323afa
name: Root Certificate Installed From Susp Locations
description: Adversaries may install a root certificate on a compromised system to
  avoid warnings when connecting to adversary controlled web servers.
severity: high
enabled: false
tags:
  mitre:
  - T1553.004
  categories:
  - endpoint
references:
- https://www.microsoft.com/security/blog/2022/09/07/profiling-dev-0270-phosphorus-ransomware-operations/
- https://learn.microsoft.com/en-us/powershell/module/pki/import-certificate?view=windowsserver2022-ps
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains|all:
    - Import-Certificate
    - ' -FilePath '
    - Cert:\LocalMachine\Root
    CommandLine|contains:
    - \AppData\Local\Temp\
    - :\Windows\TEMP\
    - \Desktop\
    - \Downloads\
    - \Perflogs\
    - :\Users\Public\
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 5f6a601c-2ecb-498b-9c33-660362323afa
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_powershell_import_cert_susp_locations.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
