id: sigmahq-sigma-91c49341-e2ef-40c0-ac45-49ec5c3fe26c
name: RTCore Suspicious Service Installation
description: Detects the installation of RTCore service. Which could be an indication
  of Micro-Star MSI Afterburner vulnerable driver abuse
severity: high
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://github.com/br-sn/CheekyBlinder/blob/e1764a8a0e7cda8a3716aefa35799f560686e01c/CheekyBlinder/CheekyBlinder.cpp
logsource:
  product: windows
  service: system
detection:
  selection:
    Provider_Name: Service Control Manager
    EventID: 7045
    ServiceName: RTCore64
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 91c49341-e2ef-40c0-ac45-49ec5c3fe26c
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/system/service_control_manager/win_system_susp_rtcore64_service_install.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
