id: sigmahq-sigma-198effb6-6c98-4d0c-9ea3-451fa143c45c
name: Run Once Task Execution as Configured in Registry
description: This rule detects the execution of Run Once task as configured in the
  registry
severity: low
enabled: false
tags:
  mitre:
  - T1112
  categories:
  - endpoint
references:
- https://twitter.com/pabraeken/status/990717080805789697
- https://lolbas-project.github.io/lolbas/Binaries/Runonce/
- https://twitter.com/0gtweet/status/1602644163824156672?s=20&t=kuxbUnZPltpvFPZdCrqPXA
logsource:
  product: windows
  category: process_creation
detection:
  selection_img:
  - Image|endswith: \runonce.exe
  - Description: Run Once Wrapper
  selection_cli:
  - CommandLine|contains: /AlternateShellStartup
  - CommandLine|endswith: /r
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 198effb6-6c98-4d0c-9ea3-451fa143c45c
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_runonce_execution.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
