id: sigmahq-sigma-45a594aa-1fbd-4972-a809-ff5a99dd81b8
name: Run PowerShell Script from ADS
description: Detects PowerShell script execution from Alternate Data Stream (ADS)
severity: high
enabled: false
tags:
  mitre:
  - T1564.004
  categories:
  - endpoint
references:
- https://github.com/p0shkatz/Get-ADS/blob/1c3a3562e713c254edce1995a7d9879c687c7473/Get-ADS.ps1
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage|endswith:
    - \powershell.exe
    - \pwsh.exe
    Image|endswith:
    - \powershell.exe
    - \pwsh.exe
    CommandLine|contains|all:
    - Get-Content
    - -Stream
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 45a594aa-1fbd-4972-a809-ff5a99dd81b8
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_powershell_run_script_from_ads.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
