id: sigmahq-sigma-c74d7efc-8826-45d9-b8bb-f04fac9e4eff
name: Run Once Task Configuration in Registry
description: Rule to detect the configuration of Run Once registry key. Configured
  payload can be run by runonce.exe /AlternateShellStartup
severity: medium
enabled: false
tags:
  mitre:
  - T1112
  categories:
  - endpoint
references:
- https://twitter.com/pabraeken/status/990717080805789697
- https://lolbas-project.github.io/lolbas/Binaries/Runonce/
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    TargetObject|contains: \Microsoft\Active Setup\Installed Components
    TargetObject|endswith: \StubPath
  filter_optional_chrome:
    Details|contains|all:
    - C:\Program Files\Google\Chrome\Application\
    - \Installer\chrmstp.exe" --configure-user-settings --verbose-logging --system-level
  filter_optional_edge:
    Details|contains:
    - C:\Program Files (x86)\Microsoft\Edge\Application\
    - C:\Program Files\Microsoft\Edge\Application\
    Details|endswith: \Installer\setup.exe" --configure-user-settings --verbose-logging
      --system-level --msedge --channel=stable
  condition: selection and not 1 of filter_optional_*
provenance:
  source: SigmaHQ/sigma
  source_id: c74d7efc-8826-45d9-b8bb-f04fac9e4eff
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_event/registry_event_runonce_persistence.yml
falsepositives:
- Legitimate modification of the registry key by legitimate program
notes:
  quarantine_reason: 'upstream status: test'
