id: sigmahq-sigma-caa06de8-fdef-4c91-826a-7f9e163eef4b
name: RunDLL32 Spawning Explorer
description: Detects RunDLL32.exe spawning explorer.exe as child, which is very uncommon,
  often observes Gamarue spawning the explorer.exe process in an unusual way
severity: high
enabled: false
tags:
  mitre:
  - T1218.011
  categories:
  - endpoint
references:
- https://redcanary.com/blog/intelligence-insights-november-2021/
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage|endswith: \rundll32.exe
    Image|endswith: \explorer.exe
  filter:
    ParentCommandLine|contains: \shell32.dll,Control_RunDLL
  condition: selection and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: caa06de8-fdef-4c91-826a-7f9e163eef4b
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_rundll32_spawn_explorer.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
