id: sigmahq-sigma-c3a99af4-35a9-4668-879e-c09aeb4f2bdf
name: Rundll32 Execution With Uncommon DLL Extension
description: Detects the execution of rundll32 with a command line that doesn't contain
  a common extension
severity: medium
enabled: false
tags:
  mitre:
  - T1218.011
  categories:
  - endpoint
references:
- https://twitter.com/mrd0x/status/1481630810495139841?s=12
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Image|endswith: \rundll32.exe
  - OriginalFileName: RUNDLL32.EXE
  filter_main_null:
    CommandLine: null
  filter_main_empty:
    CommandLine: ''
  filter_main_known_extension:
  - CommandLine|contains:
    - '.cpl '
    - .cpl,
    - .cpl"
    - .cpl'
    - '.dll '
    - .dll,
    - .dll"
    - .dll'
    - '.inf '
    - .inf,
    - .inf"
    - .inf'
  - CommandLine|endswith:
    - .cpl
    - .dll
    - '.inf'
  filter_main_localserver:
    CommandLine|contains: ' -localserver '
  filter_main_zzzzInvokeManagedCustomActionOutOfProc:
    ParentImage|endswith: \msiexec.exe
    CommandLine|contains|all:
    - :\Windows\Installer\
    - .tmp
    - zzzzInvokeManagedCustomActionOutOfProc
  filter_optional_EdgeUpdate:
    ParentCommandLine|contains|all:
    - :\Users\
    - \AppData\Local\Microsoft\EdgeUpdate\Install\{
    - \EDGEMITMP_
    - .tmp\setup.exe
    - --install-archive=
    - --previous-version=
    - --msedgewebview --verbose-logging --do-not-launch-msedge --user-level
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
provenance:
  source: SigmaHQ/sigma
  source_id: c3a99af4-35a9-4668-879e-c09aeb4f2bdf
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_rundll32_uncommon_dll_extension.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
