id: sigmahq-sigma-1723e720-616d-4ddc-ab02-f7e3685a4713
name: Rundll32 Spawned Via Explorer.EXE
description: Detects execution of "rundll32.exe" with a parent process of Explorer.exe.
  This has been observed by variants of Raspberry Robin, as first reported by Red
  Canary.
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://redcanary.com/blog/raspberry-robin/
- https://thedfirreport.com/2022/09/26/bumblebee-round-two/
logsource:
  category: process_creation
  product: windows
detection:
  selection_parent:
    ParentImage|endswith: \explorer.exe
  selection_img:
  - Image|endswith: \rundll32.exe
  - OriginalFileName: RUNDLL32.EXE
  filter_main_generic:
  - CommandLine|contains: ' C:\Windows\System32\'
  - CommandLine|endswith: ' -localserver 22d8c27b-47a1-48d1-ad08-7da7abd79617'
  condition: all of selection_* and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 1723e720-616d-4ddc-ab02-f7e3685a4713
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_rundll32_parent_explorer.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
