id: sigmahq-sigma-5bb68627-3198-40ca-b458-49f973db8752
name: Rundll32 Execution Without Parameters
description: Detects rundll32 execution without parameters as observed when running
  Metasploit windows/smb/psexec exploit module
severity: high
enabled: false
tags:
  mitre:
  - T1021.002
  - T1570
  - T1569.002
  categories:
  - endpoint
references:
- https://bczyz1.github.io/2021/01/30/psexec.html
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine:
    - rundll32.exe
    - rundll32
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 5bb68627-3198-40ca-b458-49f973db8752
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_rundll32_without_parameters.yml
falsepositives:
- False positives may occur if a user called rundll32 from CLI with no options
notes:
  quarantine_reason: 'upstream status: test'
