id: sigmahq-sigma-fc0e89b5-adb0-43c1-b749-c12a10ec37de
name: SafeBoot Registry Key Deleted Via Reg.EXE
description: Detects execution of "reg.exe" commands with the "delete" flag on safe
  boot registry keys. Often used by attacker to prevent safeboot execution of security
  products
severity: high
enabled: false
tags:
  mitre:
  - T1685
  categories:
  - endpoint
references:
- https://www.trendmicro.com/en_us/research/22/e/avoslocker-ransomware-variant-abuses-driver-file-to-disable-anti-Virus-scans-log4shell.html
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: reg.exe
  - OriginalFileName: reg.exe
  selection_delete:
    CommandLine|contains|all:
    - ' delete '
    - \SYSTEM\CurrentControlSet\Control\SafeBoot
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: fc0e89b5-adb0-43c1-b749-c12a10ec37de
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_reg_delete_safeboot.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
