id: sigmahq-sigma-f8748f2c-89dc-4d95-afb0-5a2dfdbad332
name: SAM Registry Hive Handle Request
description: Detects handles requested to SAM registry hive
severity: high
enabled: false
tags:
  mitre:
  - T1012
  - T1552.002
  categories:
  - endpoint
references:
- https://threathunterplaybook.com/hunts/windows/190725-SAMRegistryHiveHandleRequest/notebook.html
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4656
    ObjectType: Key
    ObjectName|endswith: \SAM
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: f8748f2c-89dc-4d95-afb0-5a2dfdbad332
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/security/win_security_sam_registry_hive_handle_request.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
