id: sigmahq-sigma-e3393cba-31f0-4207-831e-aef90ab17a8c
name: SAML Token Issuer Anomaly
description: Indicates the SAML token issuer for the associated SAML token is potentially
  compromised. The claims included in the token are unusual or match known attacker
  patterns
severity: high
enabled: false
tags:
  mitre:
  - T1606
  categories:
  - cloud
references:
- https://learn.microsoft.com/en-us/entra/id-protection/concept-identity-protection-risks#token-issuer-anomaly
- https://learn.microsoft.com/en-us/entra/architecture/security-operations-user-accounts#unusual-sign-ins
logsource:
  product: azure
  service: riskdetection
detection:
  selection:
    riskEventType: tokenIssuerAnomaly
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: e3393cba-31f0-4207-831e-aef90ab17a8c
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/azure/identity_protection/azure_identity_protection_token_issuer_anomaly.yml
falsepositives:
- We recommend investigating the sessions flagged by this detection in the context
  of other sign-ins from the user.
notes:
  quarantine_reason: 'upstream status: test'
