id: sigmahq-sigma-1d174d38-8fda-4081-a9b6-56d9763c0cd8
name: Scheduled Task Creation with Curl and PowerShell Execution Combo
description: 'Detects the creation of a scheduled task using schtasks.exe, potentially
  in combination with curl for downloading payloads and PowerShell for executing them.

  This facilitates executing malicious payloads or connecting with C&C server persistently
  without dropping the malware sample on the host.'
severity: medium
enabled: false
tags:
  mitre:
  - T1053.005
  - T1218
  - T1105
  categories:
  - endpoint
references:
- https://tria.ge/241015-l98snsyeje/behavioral2
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
    Image|endswith: \schtasks.exe
    CommandLine|contains|windash: ' /create '
  selection_curl:
    CommandLine|contains|all:
    - 'curl '
    - http
    - -o
  selection_powershell:
    CommandLine|contains: powershell
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 1d174d38-8fda-4081-a9b6-56d9763c0cd8
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_schtasks_curl_and_powershell_combo.yml
falsepositives:
- Legitimate use of schtasks for administrative purposes.
- Automation scripts combining curl and PowerShell in controlled environments.
notes:
  quarantine_reason: 'upstream status: experimental'
