id: sigmahq-sigma-9f8573c9-22b4-40e3-89c1-72bc2b8d49ab
name: Scheduled Task Creation Masquerading as System Processes
description: Detects the creation of scheduled tasks that involve system processes,
  which may indicate malicious actors masquerading as or abusing these processes to
  execute payloads or maintain persistence.
severity: high
enabled: false
tags:
  mitre:
  - T1053.005
  - T1036.004
  - T1036.005
  categories:
  - endpoint
references:
- https://tria.ge/241015-l98snsyeje/behavioral2
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \schtasks.exe
  - OriginalFileName: schtasks.exe
  selection_cli:
    CommandLine|contains|windash: ' /create '
    CommandLine|contains:
    - ' audiodg'
    - ' conhost'
    - ' dwm.exe'
    - ' explorer'
    - ' lsass'
    - ' lsm'
    - ' mmc'
    - ' msiexec'
    - ' regsvr32'
    - ' rundll32'
    - ' services'
    - ' spoolsv'
    - ' svchost'
    - ' taskeng'
    - ' taskhost'
    - ' wininit'
    - ' winlogon'
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 9f8573c9-22b4-40e3-89c1-72bc2b8d49ab
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_schtasks_system_process.yml
falsepositives:
- Legitimate system administration tasks scheduling trusted system processes.
notes:
  quarantine_reason: 'upstream status: experimental'
