id: sigmahq-sigma-89ca78fd-b37c-4310-b3d3-81a023f83936
name: Schtasks Creation Or Modification With SYSTEM Privileges
description: Detects the creation or update of a scheduled task to run with "NT AUTHORITY\SYSTEM"
  privileges
severity: high
enabled: false
tags:
  mitre:
  - T1053.005
  categories:
  - endpoint
references:
- https://www.elastic.co/security-labs/exploring-the-qbot-attack-pattern
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/schtasks
logsource:
  product: windows
  category: process_creation
detection:
  selection_root:
    Image|endswith: \schtasks.exe
    CommandLine|contains:
    - ' /change '
    - ' /create '
  selection_run:
    CommandLine|contains: '/ru '
  selection_user:
    CommandLine|contains:
    - NT AUT
    - ' SYSTEM '
  filter_optional_teamviewer:
    Image|endswith: \schtasks.exe
    CommandLine|contains|all:
    - /TN TVInstallRestore
    - \TeamViewer_.exe
  filter_optional_office:
    CommandLine|contains|all:
    - Subscription Heartbeat
    - \HeartbeatConfig.xml
    - \Microsoft Shared\OFFICE
  filter_optional_avira:
    CommandLine|contains:
    - '/Create /F /RU System /SC WEEKLY /TN AviraSystemSpeedupVerify /TR '
    - :\Program Files (x86)\Avira\System Speedup\setup\avira_speedup_setup.exe
    - /VERIFY /VERYSILENT /NOSTART /NODOTNET /NORESTART" /RL HIGHEST
  condition: all of selection_* and not 1 of filter_optional_*
provenance:
  source: SigmaHQ/sigma
  source_id: 89ca78fd-b37c-4310-b3d3-81a023f83936
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_schtasks_system.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
