id: sigmahq-sigma-0877ed01-da46-4c49-8476-d49cdd80dfa7
name: Screen Capture - macOS
description: Detects attempts to use screencapture to collect macOS screenshots
severity: low
enabled: false
tags:
  mitre:
  - T1113
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1113/T1113.md
- https://github.com/EmpireProject/Empire/blob/08cbd274bef78243d7a8ed6443b8364acd1fc48b/lib/modules/python/collection/osx/screenshot.py
logsource:
  product: macos
  category: process_creation
detection:
  selection:
    Image: /usr/sbin/screencapture
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 0877ed01-da46-4c49-8476-d49cdd80dfa7
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/macos/process_creation/proc_creation_macos_screencapture.yml
falsepositives:
- Legitimate user activity taking screenshots
notes:
  quarantine_reason: 'upstream status: test'
