id: sigmahq-sigma-f6d1dd2f-b8ce-40ca-bc23-062efb686b34
name: Script Event Consumer Spawning Process
description: Detects a suspicious child process of Script Event Consumer (scrcons.exe).
severity: high
enabled: false
tags:
  mitre:
  - T1047
  categories:
  - endpoint
references:
- https://redcanary.com/blog/child-processes/
- https://docs.paloaltonetworks.com/cortex/cortex-xdr/cortex-xdr-analytics-alert-reference/cortex-xdr-analytics-alert-reference/scrcons-exe-rare-child-process.html
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage|endswith: \scrcons.exe
    Image|endswith:
    - \svchost.exe
    - \dllhost.exe
    - \powershell.exe
    - \pwsh.exe
    - \wscript.exe
    - \cscript.exe
    - \schtasks.exe
    - \regsvr32.exe
    - \mshta.exe
    - \rundll32.exe
    - \msiexec.exe
    - \msbuild.exe
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: f6d1dd2f-b8ce-40ca-bc23-062efb686b34
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_scrcons_susp_child_process.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
