id: sigmahq-sigma-da2738f2-fadb-4394-afa7-0a0674885afa
name: Sdclt Child Processes
description: A General detection for sdclt spawning new processes. This could be an
  indicator of sdclt being used for bypass UAC techniques.
severity: medium
enabled: false
tags:
  mitre:
  - T1548.002
  categories:
  - endpoint
references:
- https://github.com/OTRF/detection-hackathon-apt29/issues/6
- https://github.com/OTRF/ThreatHunter-Playbook/blob/2d4257f630f4c9770f78d0c1df059f891ffc3fec/docs/evals/apt29/detections/3.B.2_C36B49B5-DF58-4A34-9FE9-56189B9DEFEA.md
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage|endswith: \sdclt.exe
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: da2738f2-fadb-4394-afa7-0a0674885afa
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_sdclt_child_process.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
