id: sigmahq-sigma-f3d39c45-de1a-4486-a687-ab126124f744
name: Sdiagnhost Calling Suspicious Child Process
description: Detects sdiagnhost.exe calling a suspicious child process (e.g. used
  in exploits for Follina / CVE-2022-30190)
severity: high
enabled: false
tags:
  mitre:
  - T1036
  - T1218
  categories:
  - endpoint
references:
- https://twitter.com/nao_sec/status/1530196847679401984
- https://doublepulsar.com/follina-a-microsoft-office-code-execution-vulnerability-1a47fce5629e
- https://app.any.run/tasks/713f05d2-fe78-4b9d-a744-f7c133e3fafb/
- https://app.any.run/tasks/f420d295-0457-4e9b-9b9e-6732be227583/
- https://app.any.run/tasks/c4117d9a-f463-461a-b90f-4cd258746798/
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage|endswith: \sdiagnhost.exe
    Image|endswith:
    - \powershell.exe
    - \pwsh.exe
    - \cmd.exe
    - \mshta.exe
    - \cscript.exe
    - \wscript.exe
    - \taskkill.exe
    - \regsvr32.exe
    - \rundll32.exe
    - \calc.exe
  filter_main_cmd_bits:
    Image|endswith: \cmd.exe
    CommandLine|contains: bits
  filter_main_powershell_noprofile:
    Image|endswith: \powershell.exe
    CommandLine|endswith:
    - -noprofile -
    - -noprofile
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: f3d39c45-de1a-4486-a687-ab126124f744
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_sdiagnhost_susp_child.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
