id: sigmahq-sigma-8839e550-52d7-4958-9f2f-e13c1e736838
name: Security Event Logging Disabled via MiniNt Registry Key - Registry Set
description: 'Detects the addition of the ''MiniNt'' key to the registry. Upon a reboot,
  Windows Event Log service will stop writing events.

  Windows Event Log is a service that collects and stores event logs from the operating
  system and applications. It is an important component of Windows security and auditing.

  Adversary may want to disable this service to disable logging of security events
  which could be used to detect their activities.'
severity: high
enabled: false
tags:
  mitre:
  - T1685.001
  - T1112
  categories:
  - endpoint
references:
- https://www.hackingarticles.in/defense-evasion-windows-event-logging-t1562-002/
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject: HKLM\System\CurrentControlSet\Control\MiniNt\(Default)
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 8839e550-52d7-4958-9f2f-e13c1e736838
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_create_minint_key.yml
falsepositives:
- Highly Unlikely
notes:
  quarantine_reason: 'upstream status: experimental'
