id: sigmahq-sigma-97a80ec7-0e2f-4d05-9ef4-65760e634f6b
name: Security Privileges Enumeration Via Whoami.EXE
description: Detects a whoami.exe executed with the /priv command line flag instructing
  the tool to show all current user privileges. This is often used after a privilege
  escalation attempt.
severity: high
enabled: false
tags:
  mitre:
  - T1033
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/whoami
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \whoami.exe
  - OriginalFileName: whoami.exe
  selection_cli:
    CommandLine|contains:
    - ' /priv'
    - ' -priv'
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 97a80ec7-0e2f-4d05-9ef4-65760e634f6b
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_whoami_priv_discovery.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
