id: sigmahq-sigma-5e95028c-5229-4214-afae-d653d573d0ec
name: Security Service Disabled Via Reg.EXE
description: Detects execution of "reg.exe" to disable security services such as Windows
  Defender.
severity: high
enabled: false
tags:
  mitre:
  - T1685
  categories:
  - endpoint
references:
- https://twitter.com/JohnLaTwC/status/1415295021041979392
- https://github.com/gordonbay/Windows-On-Reins/blob/e587ac7a0407847865926d575e3c46f68cf7c68d/wor.ps1
- https://vms.drweb.fr/virus/?i=24144899
- https://bidouillesecurity.com/disable-windows-defender-in-powershell/
logsource:
  category: process_creation
  product: windows
detection:
  selection_reg_add:
    CommandLine|contains|all:
    - reg
    - add
  selection_cli_reg_start:
    CommandLine|contains|all:
    - d 4
    - v Start
    CommandLine|contains:
    - \AppIDSvc
    - \MsMpSvc
    - \NisSrv
    - \SecurityHealthService
    - \Sense
    - \UsoSvc
    - \WdBoot
    - \WdFilter
    - \WdNisDrv
    - \WdNisSvc
    - \WinDefend
    - \wscsvc
    - \wuauserv
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 5e95028c-5229-4214-afae-d653d573d0ec
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_reg_disable_sec_services.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
