id: sigmahq-sigma-1a4bd6af-99ac-4466-b5b2-7b72b4a05462
name: Security Event Logging Disabled via MiniNt Registry Key - Process
description: 'Detects attempts to disable security event logging by adding the `MiniNt`
  registry key.

  This key is used to disable the Windows Event Log service, which collects and stores
  event logs from the operating system and applications.

  Adversaries may want to disable this service to prevent logging of security events
  that could be used to detect their activities.'
severity: high
enabled: false
tags:
  mitre:
  - T1685.001
  - T1112
  categories:
  - endpoint
references:
- https://www.hackingarticles.in/defense-evasion-windows-event-logging-t1562-002/
logsource:
  category: process_creation
  product: windows
detection:
  selection_reg_img:
  - Image|endswith: \reg.exe
  - OriginalFileName: reg.exe
  selection_reg_cmd:
    CommandLine|contains|all:
    - ' add '
    - \SYSTEM\CurrentControlSet\Control\MiniNt
  selection_powershell_img:
  - Image|endswith:
    - \powershell.exe
    - \pwsh.exe
    - \powershell_ise.exe
  - OriginalFileName:
    - PowerShell.EXE
    - pwsh.dll
  selection_powershell_cmd1:
    CommandLine|contains:
    - 'New-Item '
    - 'ni '
  selection_powershell_cmd2:
    CommandLine|contains: \SYSTEM\CurrentControlSet\Control\MiniNt
  condition: all of selection_reg_* or all of selection_powershell_*
provenance:
  source: SigmaHQ/sigma
  source_id: 1a4bd6af-99ac-4466-b5b2-7b72b4a05462
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_event_logging_disable_via_key_minint.yml
falsepositives:
- Highly Unlikely
notes:
  quarantine_reason: 'upstream status: experimental'
