id: sigmahq-sigma-760e75d8-c3b5-409b-a9bf-6130b4c4603f
name: Self Extraction Directive File Created In Potentially Suspicious Location
description: 'Detects the creation of Self Extraction Directive files (.sed) in a
  potentially suspicious location.

  These files are used by the "iexpress.exe" utility in order to create self extracting
  packages.

  Attackers were seen abusing this utility and creating PE files with embedded ".sed"
  entries.'
severity: medium
enabled: false
tags:
  mitre:
  - T1218
  categories:
  - endpoint
references:
- https://strontic.github.io/xcyclopedia/library/iexpress.exe-D594B2A33EFAFD0EABF09E3FDC05FCEA.html
- https://en.wikipedia.org/wiki/IExpress
- https://www.virustotal.com/gui/file/602f4ae507fa8de57ada079adff25a6c2a899bd25cd092d0af7e62cdb619c93c/behavior
logsource:
  category: file_event
  product: windows
detection:
  selection:
    TargetFilename|contains:
    - :\ProgramData\
    - :\Temp\
    - :\Windows\System32\Tasks\
    - :\Windows\Tasks\
    - :\Windows\Temp\
    - \AppData\Local\Temp\
    TargetFilename|endswith: .sed
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 760e75d8-c3b5-409b-a9bf-6130b4c4603f
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_sed_file_creation.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
