id: sigmahq-sigma-b2b048b0-7857-4380-b0fb-d3f0ab820b71
name: Self Extracting Package Creation Via Iexpress.EXE From Potentially Suspicious
  Location
description: 'Detects the use of iexpress.exe to create binaries via Self Extraction
  Directive (SED) files located in potentially suspicious locations.

  This behavior has been observed in-the-wild by different threat actors.'
severity: high
enabled: false
tags:
  mitre:
  - T1218
  categories:
  - endpoint
references:
- https://strontic.github.io/xcyclopedia/library/iexpress.exe-D594B2A33EFAFD0EABF09E3FDC05FCEA.html
- https://en.wikipedia.org/wiki/IExpress
- https://decoded.avast.io/janvojtesek/raspberry-robins-roshtyak-a-little-lesson-in-trickery/
- https://www.virustotal.com/gui/file/602f4ae507fa8de57ada079adff25a6c2a899bd25cd092d0af7e62cdb619c93c/behavior
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \iexpress.exe
  - OriginalFileName: IEXPRESS.exe
  selection_cli:
    CommandLine|contains|windash: ' /n '
  selection_paths:
    CommandLine|contains:
    - :\ProgramData\
    - :\Temp\
    - :\Windows\System32\Tasks\
    - :\Windows\Tasks\
    - :\Windows\Temp\
    - \AppData\Local\Temp\
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: b2b048b0-7857-4380-b0fb-d3f0ab820b71
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_iexpress_susp_execution.yml
falsepositives:
- Administrators building packages using iexpress.exe
notes:
  quarantine_reason: 'upstream status: test'
