id: sigmahq-sigma-2fcda7e2-8c57-4904-86ac-37fc3157e09d
name: Sensitive File Dump Via Print.EXE
description: Detects the abuse of the Print.exe utility for credential harvesting
  which involves using Print.Exe to copy sensitive files such as ntds.dit, SAM, SECURITY,
  or SYSTEM from the Windows directory in order to extract credentials, locally or
  remotely.
severity: high
enabled: false
tags:
  mitre:
  - T1003.003
  - T1003.002
  - T1218
  categories:
  - endpoint
references:
- https://www.microsoft.com/en-us/security/blog/2026/02/06/active-exploitation-solarwinds-web-help-desk/
- https://www.huntress.com/blog/credential-theft-expanding-your-reach-pt-2
- https://lolbas-project.github.io/lolbas/Binaries/Print/
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \print.exe
  - OriginalFileName: Print.EXE
  selection_cli:
    CommandLine|contains|windash: /D
    CommandLine|contains:
    - \config\SAM
    - \config\SECURITY
    - \config\SYSTEM
    - \windows\ntds\ntds.dit
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 2fcda7e2-8c57-4904-86ac-37fc3157e09d
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_print_dump_sensitive_files.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
