id: sigmahq-sigma-84972c80-251c-4c3a-9079-4f00aad93938
name: Sensitive File Recovery From Backup Via Wbadmin.EXE
description: 'Detects the dump of highly sensitive files such as "NTDS.DIT" and "SECURITY"
  hive.

  Attackers can leverage the "wbadmin" utility in order to dump sensitive files that
  might contain credential or sensitive information.'
severity: high
enabled: false
tags:
  mitre:
  - T1003.003
  categories:
  - endpoint
references:
- https://github.com/LOLBAS-Project/LOLBAS/blob/2cc01b01132b5c304027a658c698ae09dd6a92bf/yml/OSBinaries/Wbadmin.yml
- https://lolbas-project.github.io/lolbas/Binaries/Wbadmin/
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/wbadmin-start-recovery
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/wbadmin-start-backup
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \wbadmin.exe
  - OriginalFileName: WBADMIN.EXE
  selection_backup:
    CommandLine|contains|all:
    - ' recovery'
    - recoveryTarget
    - itemtype:File
    CommandLine|contains:
    - \config\SAM
    - \config\SECURITY
    - \config\SYSTEM
    - \Windows\NTDS\NTDS.dit
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 84972c80-251c-4c3a-9079-4f00aad93938
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_wbadmin_restore_sensitive_files.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
