id: sigmahq-sigma-98c5aeef-32d5-492f-b174-64a691896d25
name: Service Security Descriptor Tampering Via Sc.EXE
description: Detection of sc.exe utility adding a new service with special permission
  which hides that service.
severity: medium
enabled: false
tags:
  mitre:
  - T1574.011
  categories:
  - endpoint
references:
- https://blog.talosintelligence.com/2021/10/threat-hunting-in-large-datasets-by.html
- https://www.sans.org/blog/red-team-tactics-hiding-windows-services/
- https://twitter.com/Alh4zr3d/status/1580925761996828672
- https://twitter.com/0gtweet/status/1628720819537936386
- https://itconnect.uw.edu/tools-services-support/it-systems-infrastructure/msinf/other-help/understanding-sddl-syntax/
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \sc.exe
  - OriginalFileName: sc.exe
  selection_cli:
    CommandLine|contains: sdset
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 98c5aeef-32d5-492f-b174-64a691896d25
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_sc_sdset_modification.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
