id: sigmahq-sigma-1b2ae822-6fe1-43ba-aa7c-d1a3b3d1d5f2
name: Service Installation with Suspicious Folder Pattern
description: Detects service installation with suspicious folder patterns
severity: high
enabled: false
tags:
  mitre:
  - T1543.003
  categories:
  - endpoint
references:
- Internal Research
logsource:
  product: windows
  service: system
detection:
  selection_eid:
    Provider_Name: Service Control Manager
    EventID: 7045
  selection_img_paths:
  - ImagePath|re: ^[Cc]:\\[Pp]rogram[Dd]ata\\.{1,9}\.exe
  - ImagePath|re: ^[Cc]:\\.{1,9}\.exe
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 1b2ae822-6fe1-43ba-aa7c-d1a3b3d1d5f2
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/system/service_control_manager/win_system_susp_service_installation_folder_pattern.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
