id: sigmahq-sigma-c0514f28-fdae-42df-b886-06e2b2bc5b37
name: Service Startup Type Change Via Wmic.EXE
description: Detects changes to service startup type to 'disabled' or 'manual' using
  the WMIC command-line utility.
severity: medium
enabled: false
tags:
  mitre:
  - T1047
  - T1685
  categories:
  - endpoint
references:
- https://blog.talosintelligence.com/uncovering-qilin-attack-methods-exposed-through-multiple-cases/
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \WMIC.exe
  - OriginalFileName: wmic.exe
  selection_cli:
    CommandLine|contains|all:
    - ' service '
    - ChangeStartMode
    CommandLine|contains:
    - Manual
    - Disabled
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: c0514f28-fdae-42df-b886-06e2b2bc5b37
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_wmic_service_startup_change.yml
falsepositives:
- Legitimate administrative changes to service startup types using WMIC, investigate
  accordingly.
notes:
  quarantine_reason: 'upstream status: experimental'
