id: sigmahq-sigma-a07f0359-4c90-4dc4-a681-8ffea40b4f47
name: Service Binary in Suspicious Folder
description: Detect the creation of a service with a service binary located in a suspicious
  directory
severity: high
enabled: false
tags:
  mitre:
  - T1112
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md
logsource:
  category: registry_set
  product: windows
detection:
  selection_service_start:
    TargetObject|startswith: HKLM\System\CurrentControlSet\Services\
    TargetObject|endswith: \Start
    Image|contains:
    - \Users\Public\
    - \Perflogs\
    - \ADMIN$\
    - \Temp\
    Details:
    - DWORD (0x00000000)
    - DWORD (0x00000001)
    - DWORD (0x00000002)
  selection_service_imagepath:
    TargetObject|startswith: HKLM\System\CurrentControlSet\Services\
    TargetObject|endswith: \ImagePath
    Details|contains:
    - \Users\Public\
    - \Perflogs\
    - \ADMIN$\
    - \Temp\
  filter_optional_avast:
    Image|contains|all:
    - \Common Files\
    - \Temp\
  filter_optional_mbamservice:
    TargetObject|endswith: \CurrentControlSet\Services\MBAMInstallerService\ImagePath
    Details|endswith: \AppData\Local\Temp\MBAMInstallerService.exe"
    Image: C:\Windows\system32\services.exe
  condition: 1 of selection_* and not 1 of filter_optional_*
provenance:
  source: SigmaHQ/sigma
  source_id: a07f0359-4c90-4dc4-a681-8ffea40b4f47
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_creation_service_susp_folder.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
