id: sigmahq-sigma-85c312b7-f44d-4a51-a024-d671c40b49fc
name: Service StartupType Change Via Sc.EXE
description: Detect the use of "sc.exe" to change the startup type of a service to
  "disabled" or "demand"
severity: medium
enabled: false
tags:
  mitre:
  - T1685
  categories:
  - endpoint
references:
- https://www.virustotal.com/gui/file/38283b775552da8981452941ea74191aa0d203edd3f61fb2dee7b0aea3514955
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \sc.exe
  - OriginalFileName: sc.exe
  selection_cli:
    CommandLine|contains|all:
    - ' config '
    - start
    CommandLine|contains:
    - disabled
    - demand
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 85c312b7-f44d-4a51-a024-d671c40b49fc
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_sc_disable_service.yml
falsepositives:
- False positives may occur with troubleshooting scripts
notes:
  quarantine_reason: 'upstream status: test'
