id: sigmahq-sigma-05b2aa93-1210-42c8-8d9a-2fcc13b284f5
name: Service Registry Key Deleted Via Reg.EXE
description: Detects execution of "reg.exe" commands with the "delete" flag on services
  registry key. Often used by attacker to remove AV software services
severity: high
enabled: false
tags:
  mitre:
  - T1685
  categories:
  - endpoint
references:
- https://www.virustotal.com/gui/file/2bcd5702a7565952c44075ac6fb946c7780526640d1264f692c7664c02c68465
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: reg.exe
  - OriginalFileName: reg.exe
  selection_delete:
    CommandLine|contains: ' delete '
  selection_key:
    CommandLine|contains: \SYSTEM\CurrentControlSet\services\
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 05b2aa93-1210-42c8-8d9a-2fcc13b284f5
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_reg_delete_services.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
