id: sigmahq-sigma-11d00fff-5dc3-428c-8184-801f292faec0
name: Service Registry Key Read Access Request
description: 'Detects "read access" requests on the services registry key.

  Adversaries may execute their own malicious payloads by hijacking the Registry entries
  used by services.

  Adversaries may use flaws in the permissions for Registry keys related to services
  to redirect from the originally specified executable to one that they control, in
  order to launch their own code when a service starts.'
severity: low
enabled: false
tags:
  mitre:
  - T1574.011
  categories:
  - endpoint
references:
- https://center-for-threat-informed-defense.github.io/summiting-the-pyramid/analytics/service_registry_permissions_weakness_check/
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1574.011/T1574.011.md#atomic-test-1---service-registry-permissions-weakness
logsource:
  product: windows
  service: security
  definition: 'Requirements: SACLs must be enabled for "READ_CONTROL" on the registry
    keys used in this rule'
detection:
  selection:
    EventID: 4663
    ObjectName|contains|all:
    - \SYSTEM\
    - ControlSet\Services\
    AccessList|contains: '%%1538'
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 11d00fff-5dc3-428c-8184-801f292faec0
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/security/win_security_registry_permissions_weakness_check.yml
falsepositives:
- Likely from legitimate applications reading their key. Requires heavy tuning
notes:
  quarantine_reason: 'upstream status: test'
