id: sigmahq-sigma-612e47e9-8a59-43a6-b404-f48683f45bd6
name: ServiceDll Hijack
description: 'Detects changes to the "ServiceDLL" value related to a service in the
  registry.

  This is often used as a method of persistence.'
severity: medium
enabled: false
tags:
  mitre:
  - T1543.003
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1543.003/T1543.003.md#atomic-test-4---tinyturla-backdoor-service-w64time
- https://www.hexacorn.com/blog/2013/09/19/beyond-good-ol-run-key-part-4/
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains|all:
    - \System\
    - ControlSet
    - \Services\
    TargetObject|endswith: \Parameters\ServiceDll
  filter_main_printextensionmanger:
    Details: C:\Windows\system32\spool\drivers\x64\3\PrintConfig.dll
  filter_main_domain_controller:
    Image: C:\Windows\system32\lsass.exe
    TargetObject|endswith: \Services\NTDS\Parameters\ServiceDll
    Details: '%%systemroot%%\system32\ntdsa.dll'
  filter_main_poqexec:
    Image: C:\Windows\System32\poqexec.exe
  filter_optional_safetica:
    Image|endswith: \regsvr32.exe
    Details: C:\Windows\System32\STAgent.dll
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
provenance:
  source: SigmaHQ/sigma
  source_id: 612e47e9-8a59-43a6-b404-f48683f45bd6
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_servicedll_hijack.yml
falsepositives:
- Administrative scripts
- Installation of a service
notes:
  quarantine_reason: 'upstream status: test'
