id: sigmahq-sigma-2625cc59-0634-40d0-821e-cb67382a3dd7
name: Service Reload or Start - Linux
description: Detects the start, reload or restart of a service.
severity: low
enabled: false
tags:
  mitre:
  - T1543.002
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1543.002/T1543.002.md
logsource:
  product: linux
  service: auditd
detection:
  selection:
    type: EXECVE
    a0|contains:
    - systemctl
    - service
    a1|contains:
    - reload
    - start
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 2625cc59-0634-40d0-821e-cb67382a3dd7
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/auditd/execve/lnx_auditd_susp_service_reload_or_restart.yml
falsepositives:
- Installation of legitimate service.
- Legitimate reconfiguration of service.
- Command line contains daemon-reload.
notes:
  quarantine_reason: 'upstream status: test'
