id: sigmahq-sigma-62b20d44-1546-4e61-afce-8e175eb9473c
name: Service StartupType Change Via PowerShell Set-Service
description: Detects the use of the PowerShell "Set-Service" cmdlet to change the
  startup type of a service to "disabled" or "manual"
severity: medium
enabled: false
tags:
  mitre:
  - T1685
  categories:
  - endpoint
references:
- https://www.virustotal.com/gui/file/38283b775552da8981452941ea74191aa0d203edd3f61fb2dee7b0aea3514955
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \powershell.exe
  - OriginalFileName: PowerShell.EXE
  selection_cli:
    CommandLine|contains|all:
    - Set-Service
    - -StartupType
    CommandLine|contains:
    - Disabled
    - Manual
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 62b20d44-1546-4e61-afce-8e175eb9473c
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_powershell_set_service_disabled.yml
falsepositives:
- False positives may occur with troubleshooting scripts
notes:
  quarantine_reason: 'upstream status: test'
