id: sigmahq-sigma-c21c4eaa-ba2e-419a-92b2-8371703cbe21
name: Setuid and Setgid
description: Detects suspicious change of file privileges with chown and chmod commands
severity: low
enabled: false
tags:
  mitre:
  - T1548.001
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1548.001/T1548.001.md
logsource:
  product: linux
  category: process_creation
detection:
  selection_root:
    CommandLine|contains: chown root
  selection_perm:
    CommandLine|contains:
    - ' chmod u+s'
    - ' chmod g+s'
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: c21c4eaa-ba2e-419a-92b2-8371703cbe21
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/process_creation/proc_creation_lnx_setgid_setuid.yml
falsepositives:
- Legitimate administration activities
notes:
  quarantine_reason: 'upstream status: test'
