id: sigmahq-sigma-9b5de532-a757-4d70-946c-1f3e44f48b4d
name: Shell Execution GCC  - Linux
description: Detects the use of the "gcc" utility to execute a shell. Such behavior
  may be associated with privilege escalation, unauthorized command execution, or
  to break out from restricted environments.
severity: high
enabled: false
tags:
  mitre:
  - T1083
  categories:
  - endpoint
references:
- https://gtfobins.github.io/gtfobins/gcc/#shell
- https://gtfobins.github.io/gtfobins/c89/#shell
- https://gtfobins.github.io/gtfobins/c99/#shell
- https://www.elastic.co/guide/en/security/current/linux-restricted-shell-breakout-via-linux-binary-s.html
logsource:
  category: process_creation
  product: linux
detection:
  selection_img:
    Image|endswith:
    - /c89
    - /c99
    - /gcc
    CommandLine|contains: -wrapper
  selection_cli:
    CommandLine|contains:
    - /bin/bash,-s
    - /bin/dash,-s
    - /bin/fish,-s
    - /bin/sh,-s
    - /bin/zsh,-s
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 9b5de532-a757-4d70-946c-1f3e44f48b4d
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/process_creation/proc_creation_lnx_gcc_shell_execution.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
