id: sigmahq-sigma-c67e0c98-4d39-46ee-8f6b-437ebf6b950e
name: Shellshock Expression
description: Detects shellshock expressions in log files
severity: high
enabled: false
tags:
  mitre:
  - T1505.003
  categories:
  - endpoint
references:
- https://owasp.org/www-pdf-archive/Shellshock_-_Tudor_Enache.pdf
logsource:
  product: linux
detection:
  keywords:
  - (){:;};
  - () {:;};
  - () { :;};
  - () { :; };
  condition: keywords
provenance:
  source: SigmaHQ/sigma
  source_id: c67e0c98-4d39-46ee-8f6b-437ebf6b950e
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/builtin/lnx_shellshock.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
