id: sigmahq-sigma-4b09c71e-4269-4111-9cdd-107d8867f0cc
name: Shell Execution via Flock - Linux
description: Detects the use of the "flock" command to execute a shell. Such behavior
  may be associated with privilege escalation, unauthorized command execution, or
  to break out from restricted environments.
severity: high
enabled: false
tags:
  mitre:
  - T1083
  categories:
  - endpoint
references:
- https://gtfobins.github.io/gtfobins/flock/#shell
- https://www.elastic.co/guide/en/security/current/linux-restricted-shell-breakout-via-linux-binary-s.html
logsource:
  category: process_creation
  product: linux
detection:
  selection_img:
    Image|endswith: /flock
    CommandLine|contains: ' -u '
  selection_cli:
    CommandLine|contains:
    - /bin/bash
    - /bin/dash
    - /bin/fish
    - /bin/sh
    - /bin/zsh
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 4b09c71e-4269-4111-9cdd-107d8867f0cc
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/process_creation/proc_creation_lnx_flock_shell_execution.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
