id: sigmahq-sigma-2fade0b6-7423-4835-9d4f-335b39b83867
name: Shell Execution Of Process Located In Tmp Directory
description: Detects execution of shells from a parent process located in a temporary
  (/tmp) directory
severity: high
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://blogs.jpcert.or.jp/en/2023/05/gobrat.html
- https://jstnk9.github.io/jstnk9/research/GobRAT-Malware/
- https://www.virustotal.com/gui/file/60bcd645450e4c846238cf0e7226dc40c84c96eba99f6b2cffcd0ab4a391c8b3/detection
- https://www.virustotal.com/gui/file/3e44c807a25a56f4068b5b8186eee5002eed6f26d665a8b791c472ad154585d1/detection
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    ParentImage|startswith: /tmp/
    Image|endswith:
    - /bash
    - /csh
    - /dash
    - /fish
    - /ksh
    - /sh
    - /zsh
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 2fade0b6-7423-4835-9d4f-335b39b83867
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/process_creation/proc_creation_lnx_susp_shell_child_process_from_parent_tmp_folder.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
