id: sigmahq-sigma-152f3630-77c1-4284-bcc0-4cc68ab2f6e7
name: Shell Open Registry Keys Manipulation
description: Detects the shell open key manipulation (exefile and ms-settings) used
  for persistence and the pattern of UAC Bypass using fodhelper.exe, computerdefaults.exe,
  slui.exe via registry keys (e.g. UACMe 33 or 62)
severity: high
enabled: false
tags:
  mitre:
  - T1548.002
  - T1546.001
  categories:
  - endpoint
references:
- https://github.com/hfiref0x/UACME
- https://winscripting.blog/2017/05/12/first-entry-welcome-and-uac-bypass/
- https://github.com/RhinoSecurityLabs/Aggressor-Scripts/tree/master/UACBypass
- https://tria.ge/211119-gs7rtshcfr/behavioral2 [Lokibot sample from Nov 2021]
logsource:
  category: registry_event
  product: windows
detection:
  selection1:
    EventType: SetValue
    TargetObject|endswith: Classes\ms-settings\shell\open\command\SymbolicLinkValue
    Details|contains: \Software\Classes\{
  selection2:
    TargetObject|endswith: Classes\ms-settings\shell\open\command\DelegateExecute
  selection3:
    EventType: SetValue
    TargetObject|endswith:
    - Classes\ms-settings\shell\open\command\(Default)
    - Classes\exefile\shell\open\command\(Default)
  filter_sel3:
    Details: (Empty)
  condition: selection1 or selection2 or (selection3 and not filter_sel3)
provenance:
  source: SigmaHQ/sigma
  source_id: 152f3630-77c1-4284-bcc0-4cc68ab2f6e7
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_event/registry_event_shell_open_keys_manipulation.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
