id: sigmahq-sigma-32b96012-7892-429e-b26c-ac2bf46066ff
name: Shell32 DLL Execution in Suspicious Directory
description: Detects shell32.dll executing a DLL in a suspicious directory
severity: high
enabled: false
tags:
  mitre:
  - T1218.011
  categories:
  - endpoint
references:
- https://www.group-ib.com/resources/threat-research/red-curl-2.html
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \rundll32.exe
  - OriginalFileName: RUNDLL32.EXE
  selection_cli:
    CommandLine|contains|all:
    - shell32.dll
    - Control_RunDLL
    CommandLine|contains:
    - '%AppData%'
    - '%LocalAppData%'
    - '%Temp%'
    - '%tmp%'
    - \AppData\
    - \Temp\
    - \Users\Public\
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 32b96012-7892-429e-b26c-ac2bf46066ff
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_rundll32_shell32_susp_execution.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
