id: sigmahq-sigma-e2326866-609f-4015-aea9-7ec634e8aa04
name: Shell Execution via Rsync - Linux
description: Detects the use of the "rsync" utility to execute a shell. Such behavior
  may be associated with privilege escalation, unauthorized command execution, or
  to break out from restricted environments.
severity: high
enabled: false
tags:
  mitre:
  - T1059
  categories:
  - endpoint
references:
- https://gtfobins.github.io/gtfobins/rsync/#shell
logsource:
  category: process_creation
  product: linux
detection:
  selection_img:
    Image|endswith:
    - /rsync
    - /rsyncd
    CommandLine|contains: ' -e '
  selection_cli:
    CommandLine|contains:
    - '/ash '
    - '/bash '
    - '/dash '
    - '/csh '
    - '/sh '
    - '/zsh '
    - '/tcsh '
    - '/ksh '
    - '''ash '
    - '''bash '
    - '''dash '
    - '''csh '
    - '''sh '
    - '''zsh '
    - '''tcsh '
    - '''ksh '
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: e2326866-609f-4015-aea9-7ec634e8aa04
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/process_creation/proc_creation_lnx_rsync_shell_execution.yml
falsepositives:
- Legitimate cases in which "rsync" is used to execute a shell
notes:
  quarantine_reason: 'upstream status: experimental'
