id: sigmahq-sigma-8737b7f6-8df3-4bb7-b1da-06019b99b687
name: Shell Invocation Via Ssh - Linux
description: Detects the use of the "ssh" utility to execute a shell. Such behavior
  may be associated with privilege escalation, unauthorized command execution, or
  to break out from restricted environments.
severity: high
enabled: false
tags:
  mitre:
  - T1059
  categories:
  - endpoint
references:
- https://gtfobins.github.io/gtfobins/ssh/
- https://www.elastic.co/guide/en/security/current/linux-restricted-shell-breakout-via-linux-binary-s.html
logsource:
  category: process_creation
  product: linux
detection:
  selection_img:
    Image|endswith: /ssh
    CommandLine|contains:
    - ProxyCommand=;
    - permitlocalcommand=yes
    - localhost
  selection_cli:
    CommandLine|contains:
    - /bin/bash
    - /bin/dash
    - /bin/fish
    - /bin/sh
    - /bin/zsh
    - sh 0<&2 1>&2
    - sh 1>&2 0<&2
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 8737b7f6-8df3-4bb7-b1da-06019b99b687
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/process_creation/proc_creation_lnx_ssh_shell_execution.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
