id: sigmahq-sigma-b4a6d707-9430-4f5f-af68-0337f52d5c42
name: Sign-in Failure Due to Conditional Access Requirements Not Met
description: Define a baseline threshold for failed sign-ins due to Conditional Access
  failures
severity: high
enabled: false
tags:
  mitre:
  - T1110
  - T1078.004
  categories:
  - cloud
references:
- https://learn.microsoft.com/en-gb/entra/architecture/security-operations-privileged-accounts
logsource:
  product: azure
  service: signinlogs
detection:
  selection:
    ResultType: 53003
    Resultdescription: Blocked by Conditional Access
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: b4a6d707-9430-4f5f-af68-0337f52d5c42
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/azure/signin_logs/azure_conditional_access_failure.yml
falsepositives:
- Service Account misconfigured
- Misconfigured Systems
- Vulnerability Scanners
notes:
  quarantine_reason: 'upstream status: test'
