id: sigmahq-sigma-31c51af6-e7aa-4da7-84d4-8f32cc580af2
name: Sliver C2 Default Service Installation
description: Detects known malicious service installation that appear in cases in
  which a Sliver implants execute the PsExec commands
severity: high
enabled: false
tags:
  mitre:
  - T1543.003
  - T1569.002
  categories:
  - endpoint
references:
- https://github.com/BishopFox/sliver/blob/79f2d48fcdfc2bee4713b78d431ea4b27f733f30/client/command/commands.go#L1231
- https://www.microsoft.com/security/blog/2022/08/24/looking-for-the-sliver-lining-hunting-for-emerging-command-and-control-frameworks/
logsource:
  product: windows
  service: system
detection:
  selection_eid:
    Provider_Name: Service Control Manager
    EventID: 7045
  selection_service_1:
    ImagePath|re: ^[a-zA-Z]:\\windows\\temp\\[a-zA-Z0-9]{10}\.exe
  selection_service_2:
    ServiceName:
    - Sliver
    - Sliver implant
  condition: selection_eid and 1 of selection_service_*
provenance:
  source: SigmaHQ/sigma
  source_id: 31c51af6-e7aa-4da7-84d4-8f32cc580af2
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/system/service_control_manager/win_system_service_install_sliver.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
