id: sigmahq-sigma-52a85084-6989-40c3-8f32-091e12e13f09
name: smbexec.py Service Installation
description: Detects the use of smbexec.py tool by detecting a specific service installation
severity: high
enabled: false
tags:
  mitre:
  - T1021.002
  - T1569.002
  categories:
  - endpoint
references:
- https://blog.ropnop.com/using-credentials-to-own-windows-boxes-part-2-psexec-and-services/
- https://github.com/fortra/impacket/blob/33058eb2fde6976ea62e04bc7d6b629d64d44712/examples/smbexec.py#L286-L296
- https://github.com/fortra/impacket/blob/edef71f17bc1240f9f8c957bbda98662951ac3ec/examples/smbexec.py#L60
logsource:
  product: windows
  service: system
detection:
  selection_eid:
    Provider_Name: Service Control Manager
    EventID: 7045
  selection_service_name:
    ServiceName: BTOBTO
  selection_service_image:
    ImagePath|contains:
    - '.bat & del '
    - __output 2^>^&1 >
  condition: selection_eid and 1 of selection_service_*
provenance:
  source: SigmaHQ/sigma
  source_id: 52a85084-6989-40c3-8f32-091e12e13f09
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/system/service_control_manager/win_system_hack_smbexec.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
