id: sigmahq-sigma-2dad0cba-c62a-4a4f-949f-5f6ecd619769
name: Split A File Into Pieces - Linux
description: Detection use of the command "split" to split files into parts and possible
  transfer.
severity: low
enabled: false
tags:
  mitre:
  - T1030
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1030/T1030.md
logsource:
  product: linux
  service: auditd
detection:
  selection:
    type: SYSCALL
    comm: split
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 2dad0cba-c62a-4a4f-949f-5f6ecd619769
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/auditd/syscall/lnx_auditd_split_file_into_pieces.yml
falsepositives:
- Legitimate administrative activity
notes:
  quarantine_reason: 'upstream status: test'
