id: sigmahq-sigma-5513deaf-f49a-46c2-a6c8-3f111b5cb453
name: SQL Injection Strings In URI
description: Detects potential SQL injection attempts via GET requests in access logs.
severity: high
enabled: false
tags:
  mitre:
  - T1190
  categories:
  - application
references:
- https://www.acunetix.com/blog/articles/exploiting-sql-injection-example/
- https://www.acunetix.com/blog/articles/using-logs-to-investigate-a-web-application-attack/
- https://brightsec.com/blog/sql-injection-payloads/
- https://github.com/payloadbox/sql-injection-payload-list
- https://book.hacktricks.xyz/pentesting-web/sql-injection/mysql-injection
logsource:
  category: webserver
detection:
  selection:
    cs-method: GET
  keywords:
  - '@@version'
  - '%271%27%3D%271'
  - '=select '
  - =select(
  - =select%20
  - concat_ws(
  - CONCAT(0x
  - from mysql.innodb_table_stats
  - from%20mysql.innodb_table_stats
  - group_concat(
  - information_schema.tables
  - json_arrayagg(
  - or 1=1#
  - or%201=1#
  - 'order by '
  - order%20by%20
  - 'select * '
  - select database()
  - select version()
  - select%20*%20
  - select%20database()
  - select%20version()
  - select%28sleep%2810%29
  - SELECTCHAR(
  - table_schema
  - UNION ALL SELECT
  - UNION SELECT
  - UNION%20ALL%20SELECT
  - UNION%20SELECT
  - '''1''=''1'
  filter_main_status:
    sc-status: 404
  condition: selection and keywords and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 5513deaf-f49a-46c2-a6c8-3f111b5cb453
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/web/webserver_generic/web_sql_injection_in_access_logs.yml
falsepositives:
- Java scripts and CSS Files
- User searches in search boxes of the respective website
- Internal vulnerability scanners can cause some serious FPs when used, if you experience
  a lot of FPs due to this think of adding more filters such as "User Agent" strings
  and more response codes
notes:
  quarantine_reason: 'upstream status: test'
