id: sigmahq-sigma-a746c9b8-a2fb-4ee5-a428-92bee9e99060
name: SQL Client Tools PowerShell Session Detection
description: 'This rule detects execution of a PowerShell code through the sqltoolsps.exe
  utility, which is included in the standard set of utilities supplied with the Microsoft
  SQL Server Management studio.

  Script blocks are not logged in this case, so this utility helps to bypass protection
  mechanisms based on the analysis of these logs.'
severity: medium
enabled: false
tags:
  mitre:
  - T1059.001
  - T1127
  categories:
  - endpoint
references:
- https://github.com/LOLBAS-Project/LOLBAS/blob/8283d8d91552213ded165fd36deb6cb9534cb443/yml/OtherMSBinaries/Sqltoolsps.yml
- https://twitter.com/pabraeken/status/993298228840992768
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Image|endswith: \sqltoolsps.exe
  - ParentImage|endswith: \sqltoolsps.exe
  - OriginalFileName: \sqltoolsps.exe
  filter:
    ParentImage|endswith: \smss.exe
  condition: selection and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: a746c9b8-a2fb-4ee5-a428-92bee9e99060
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_mssql_sqltoolsps_susp_execution.yml
falsepositives:
- Direct PS command execution through SQLToolsPS.exe is uncommon, childprocess sqltoolsps.exe
  spawned by smss.exe is a legitimate action.
notes:
  quarantine_reason: 'upstream status: test'
