id: sigmahq-sigma-24c77512-782b-448a-8950-eddb0785fc71
name: SQLite Chromium Profile Data DB Access
description: Detect usage of the "sqlite" binary to query databases in Chromium-based
  browsers for potential data stealing.
severity: high
enabled: false
tags:
  mitre:
  - T1539
  - T1555.003
  - T1005
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/84d9edaaaa2c5511144521b0e4af726d1c7276ce/atomics/T1539/T1539.md#atomic-test-2---steal-chrome-cookies-windows
- https://blog.cyble.com/2022/04/21/prynt-stealer-a-new-info-stealer-performing-clipper-and-keylogger-activities/
logsource:
  category: process_creation
  product: windows
detection:
  selection_sql:
  - Product: SQLite
  - Image|endswith:
    - \sqlite.exe
    - \sqlite3.exe
  selection_chromium:
    CommandLine|contains:
    - \User Data\
    - \Opera Software\
    - \ChromiumViewer\
  selection_data:
    CommandLine|contains:
    - Login Data
    - Cookies
    - Web Data
    - History
    - Bookmarks
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 24c77512-782b-448a-8950-eddb0785fc71
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_sqlite_chromium_profile_data.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
