id: sigmahq-sigma-7ac407cc-0f48-4328-aede-de1d2e6fef41
name: Standard User In High Privileged Group
description: Detect standard users login that are part of high privileged groups such
  as the Administrator group
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/windows-server/identity/ad-ds/manage/understand-security-identifiers
- https://learn.microsoft.com/en-us/windows-server/security/credentials-protection-and-management/configuring-additional-lsa-protection
- https://github.com/nasbench/EVTX-ETW-Resources/blob/7a806a148b3d9d381193d4a80356016e6e8b1ee8/ETWProvidersManifests/Windows11/22H2/W11_22H2_Pro_20221220_22621.963/WEPExplorer/LsaSrv.xml
logsource:
  product: windows
  service: lsa-server
  definition: 'Requirements: Microsoft-Windows-LSA/Operational (199FE037-2B82-40A9-82AC-E1D46C792B99)
    Event Log must be enabled and collected in order to use this rule.'
detection:
  selection:
    EventID: 300
    TargetUserSid|startswith: S-1-5-21-
    SidList|contains:
    - S-1-5-32-544
    - -500}
    - -518}
    - -519}
  filter_main_admin:
    TargetUserSid|endswith:
    - '-500'
    - '-518'
    - '-519'
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 7ac407cc-0f48-4328-aede-de1d2e6fef41
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/lsa_server/win_lsa_server_normal_user_admin.yml
falsepositives:
- Standard domain users who are part of the administrator group. These users shouldn't
  have these right. But in the case where it's necessary. They should be filtered
  out using the "TargetUserName" field
notes:
  quarantine_reason: 'upstream status: test'
