id: sigmahq-sigma-2aa0a6b4-a865-495b-ab51-c28249537b75
name: Startup Folder File Write
description: A General detection for files being created in the Windows startup directory.
  This could be an indicator of persistence.
severity: medium
enabled: false
tags:
  mitre:
  - T1547.001
  categories:
  - endpoint
references:
- https://github.com/OTRF/detection-hackathon-apt29/issues/12
- https://github.com/OTRF/ThreatHunter-Playbook/blob/2d4257f630f4c9770f78d0c1df059f891ffc3fec/docs/evals/apt29/detections/5.B.1_611FCA99-97D0-4873-9E51-1C1BA2DBB40D.md
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename|contains: \Microsoft\Windows\Start Menu\Programs\StartUp
  filter_main_update:
  - Image:
    - C:\Windows\System32\wuauclt.exe
    - C:\Windows\uus\ARM64\wuaucltcore.exe
  - TargetFilename|startswith:
    - C:\$WINDOWS.~BT\NewOS\
    - C:\$WinREAgent\Scratch\Mount\
  filter_optional_onenote:
    Image|endswith: \ONENOTE.EXE
    TargetFilename|endswith: \Send to OneNote.lnk
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
provenance:
  source: SigmaHQ/sigma
  source_id: 2aa0a6b4-a865-495b-ab51-c28249537b75
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_startup_folder_file_write.yml
falsepositives:
- FP could be caused by legitimate application writing shortcuts for example. This
  folder should always be inspected to make sure that all the files in there are legitimate
notes:
  quarantine_reason: 'upstream status: test'
