id: sigmahq-sigma-16905e21-66ee-42fe-b256-1318ada2d770
name: Start of NT Virtual DOS Machine
description: Ntvdm.exe allows the execution of 16-bit Windows applications on 32-bit
  Windows operating systems, as well as the execution of both 16-bit and 32-bit DOS
  applications
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/windows/compatibility/ntvdm-and-16-bit-app-support
- https://support.microsoft.com/fr-fr/topic/an-ms-dos-based-program-that-uses-the-ms-dos-protected-mode-interface-crashes-on-a-computer-that-is-running-windows-7-5dc739ea-987b-b458-15e4-d28d5cca63c7
- https://app.any.run/tasks/93fe92fa-8b2b-4d92-8c09-a841aed2e793/
- https://app.any.run/tasks/214094a7-0abc-4a7b-a564-1b757faed79d/
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith:
    - \ntvdm.exe
    - \csrstub.exe
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 16905e21-66ee-42fe-b256-1318ada2d770
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_susp_16bit_application.yml
falsepositives:
- Legitimate use
notes:
  quarantine_reason: 'upstream status: test'
