id: sigmahq-sigma-ce446a9e-30b9-4483-8e38-d2c9ad0a2280
name: Steganography Hide Files with Steghide
description: Detects embedding of files with usage of steghide binary, the adversaries
  may use this technique to prevent the detection of hidden information.
severity: low
enabled: false
tags:
  mitre:
  - T1027.003
  categories:
  - endpoint
references:
- https://vitux.com/how-to-hide-confidential-files-in-images-on-debian-using-steganography/
logsource:
  product: linux
  service: auditd
detection:
  selection:
    type: EXECVE
    a0: steghide
    a1: embed
    a2:
    - -cf
    - -ef
    a4:
    - -cf
    - -ef
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: ce446a9e-30b9-4483-8e38-d2c9ad0a2280
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/auditd/execve/lnx_auditd_steghide_embed_steganography.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
