id: sigmahq-sigma-c49c5062-0966-4170-9efd-9968c913a6cf
name: Stop Windows Service Via PowerShell Stop-Service
description: Detects the stopping of a Windows service via the PowerShell Cmdlet "Stop-Service"
severity: low
enabled: false
tags:
  mitre:
  - T1489
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/powershell/module/microsoft.powershell.management/stop-service?view=powershell-7.4
logsource:
  category: process_creation
  product: windows
detection:
  selection_sc_net_img:
  - OriginalFileName:
    - PowerShell.EXE
    - pwsh.dll
  - Image|endswith:
    - \powershell.exe
    - \pwsh.exe
  selection_cli:
    CommandLine|contains: 'Stop-Service '
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: c49c5062-0966-4170-9efd-9968c913a6cf
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_powershell_stop_service.yml
falsepositives:
- There are many legitimate reasons to stop a service. This rule isn't looking for
  any suspicious behaviour in particular. Filter legitimate activity accordingly
notes:
  quarantine_reason: 'upstream status: test'
