id: sigmahq-sigma-7cb02516-6d95-4ffc-8eee-162075e111ac
name: Successful IIS Shortname Fuzzing Scan
description: When IIS uses an old .Net Framework it's possible to enumerate folders
  with the symbol "~"
severity: medium
enabled: false
tags:
  mitre:
  - T1190
  categories:
  - application
references:
- https://github.com/projectdiscovery/nuclei-templates/blob/9d2889356eebba661c8407038e430759dfd4ec31/fuzzing/iis-shortname.yaml
- https://www.exploit-db.com/exploits/19525
- https://github.com/lijiejie/IIS_shortname_Scanner
logsource:
  category: webserver
detection:
  selection:
    cs-uri-query|contains: ~1
    cs-uri-query|endswith: a.aspx
    cs-method:
    - GET
    - OPTIONS
    sc-status:
    - 200
    - 301
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 7cb02516-6d95-4ffc-8eee-162075e111ac
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/web/webserver_generic/web_iis_tilt_shortname_scan.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
