id: sigmahq-sigma-192a0330-c20b-4356-90b6-7b7049ae0b87
name: Successful Overpass the Hash Attempt
description: Detects successful logon with logon type 9 (NewCredentials) which matches
  the Overpass the Hash behavior of e.g Mimikatz's sekurlsa::pth module.
severity: high
enabled: false
tags:
  mitre:
  - T1550.002
  categories:
  - endpoint
references:
- https://web.archive.org/web/20220419045003/https://cyberwardog.blogspot.com/2017/04/chronicles-of-threat-hunter-hunting-for.html
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4624
    LogonType: 9
    LogonProcessName: seclogo
    AuthenticationPackageName: Negotiate
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 192a0330-c20b-4356-90b6-7b7049ae0b87
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/security/account_management/win_security_overpass_the_hash.yml
falsepositives:
- Runas command-line tool using /netonly parameter
notes:
  quarantine_reason: 'upstream status: test'
