id: sigmahq-sigma-e6c54d94-498c-4562-a37c-b469d8e9a275
name: Suspicious PowerShell Download and Execute Pattern
description: Detects suspicious PowerShell download patterns that are often used in
  malicious scripts, stagers or downloaders (make sure that your backend applies the
  strings case-insensitive)
severity: high
enabled: false
tags:
  mitre:
  - T1059.001
  categories:
  - endpoint
references:
- https://gist.github.com/jivoi/c354eaaf3019352ce32522f916c03d70
- https://www.trendmicro.com/en_us/research/22/j/lv-ransomware-exploits-proxyshell-in-attack.html
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains:
    - IEX ((New-Object Net.WebClient).DownloadString
    - IEX (New-Object Net.WebClient).DownloadString
    - IEX((New-Object Net.WebClient).DownloadString
    - IEX(New-Object Net.WebClient).DownloadString
    - ' -command (New-Object System.Net.WebClient).DownloadFile('
    - ' -c (New-Object System.Net.WebClient).DownloadFile('
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: e6c54d94-498c-4562-a37c-b469d8e9a275
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_powershell_susp_download_patterns.yml
falsepositives:
- Software installers that pull packages from remote systems and execute them
notes:
  quarantine_reason: 'upstream status: test'
