id: sigmahq-sigma-700fb7e8-2981-401c-8430-be58e189e741
name: Suspicious Package Installed - Linux
description: Detects installation of suspicious packages using system installation
  utilities
severity: medium
enabled: false
tags:
  mitre:
  - T1553.004
  categories:
  - endpoint
references:
- https://gist.githubusercontent.com/MichaelKoczwara/12faba9c061c12b5814b711166de8c2f/raw/e2068486692897b620c25fde1ea258c8218fe3d3/history.txt
logsource:
  product: linux
  category: process_creation
detection:
  selection_tool_apt:
    Image|endswith:
    - /apt
    - /apt-get
    CommandLine|contains: install
  selection_tool_yum:
    Image|endswith: /yum
    CommandLine|contains:
    - localinstall
    - install
  selection_tool_rpm:
    Image|endswith: /rpm
    CommandLine|contains: -i
  selection_tool_dpkg:
    Image|endswith: /dpkg
    CommandLine|contains:
    - --install
    - -i
  selection_keyword:
    CommandLine|contains:
    - nmap
    - ' nc'
    - netcat
    - wireshark
    - tshark
    - openconnect
    - proxychains
    - socat
  condition: 1 of selection_tool_* and selection_keyword
provenance:
  source: SigmaHQ/sigma
  source_id: 700fb7e8-2981-401c-8430-be58e189e741
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/process_creation/proc_creation_lnx_install_suspicious_packages.yml
falsepositives:
- Legitimate administration activities
notes:
  quarantine_reason: 'upstream status: test'
