id: sigmahq-sigma-2782fbd8-b662-4eb5-9962-5bfbfb671e7b
name: Suspicious Usage of For Loop with Recursive Directory Search in CMD
description: 'Detects suspicious usage of the cmd.exe ''for /f'' loop combined with
  the ''tokens='' parameter and a recursive directory listing.

  This pattern may indicate an attempt to discover and execute system binaries dynamically,
  for example powershell, a technique sometimes used by attackers to evade detection.

  This behavior has been observed in various malicious lnk files.'
severity: medium
enabled: false
tags:
  mitre:
  - T1059.003
  - T1027.010
  categories:
  - endpoint
references:
- https://www.virustotal.com/gui/file/29837d0d3202758063185828c8f8d9e0b7b42b365c8941cc926d2d7c7bae2fb3
logsource:
  category: process_creation
  product: windows
detection:
  selection_tokens:
    CommandLine|contains|all:
    - for /f
    - tokens=
    - in (
    - dir
  selection_tokens_parent:
    ParentCommandLine|contains|all:
    - for /f
    - tokens=
    - in (
    - dir
  condition: 1 of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 2782fbd8-b662-4eb5-9962-5bfbfb671e7b
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_susp_cmd_for_loop_execution_with_recursive_directory_search.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: experimental'
