id: sigmahq-sigma-ee111937-1fe7-40f0-962a-0eb44d57d174
name: Suspicious OAuth App File Download Activities
description: Detects when a Microsoft Cloud App Security reported when an app downloads
  multiple files from Microsoft SharePoint or Microsoft OneDrive in a manner that
  is unusual for the user.
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - cloud
references:
- https://learn.microsoft.com/en-us/defender-cloud-apps/anomaly-detection-policy
- https://learn.microsoft.com/en-us/defender-cloud-apps/policy-template-reference
logsource:
  service: threat_management
  product: m365
detection:
  selection:
    eventSource: SecurityComplianceCenter
    eventName: Suspicious OAuth app file download activities
    status: success
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: ee111937-1fe7-40f0-962a-0eb44d57d174
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/m365/threat_management/microsoft365_susp_oauth_app_file_download_activities.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
