id: sigmahq-sigma-195626f3-5f1b-4403-93b7-e6cfd4d6a078
name: Suspicious SSL Connection
description: Adversaries may employ a known encryption algorithm to conceal command
  and control traffic rather than relying on any inherent protections provided by
  a communication protocol.
severity: low
enabled: false
tags:
  mitre:
  - T1573
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1573/T1573.md#atomic-test-1---openssl-c2
- https://medium.com/walmartglobaltech/openssl-server-reverse-shell-from-windows-client-aee2dbfa0926
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection:
    ScriptBlockText|contains|all:
    - System.Net.Security.SslStream
    - Net.Security.RemoteCertificateValidationCallback
    - .AuthenticateAsClient
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 195626f3-5f1b-4403-93b7-e6cfd4d6a078
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_susp_ssl_keyword.yml
falsepositives:
- Legitimate administrative script
notes:
  quarantine_reason: 'upstream status: test'
