id: sigmahq-sigma-09576804-7a05-458e-a817-eb718ca91f54
name: Suspicious PowerShell IEX Execution Patterns
description: Detects suspicious ways to run Invoke-Execution using IEX alias
severity: high
enabled: false
tags:
  mitre:
  - T1059.001
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/powershell/module/microsoft.powershell.utility/invoke-expression?view=powershell-7.2
- https://www.huntress.com/blog/slashandgrab-screen-connect-post-exploitation-in-the-wild-cve-2024-1709-cve-2024-1708
logsource:
  product: windows
  category: process_creation
detection:
  selection_combined_1:
    Image|endswith:
    - \powershell.exe
    - \pwsh.exe
    CommandLine|contains:
    - ' | iex;'
    - ' | iex '
    - ' | iex}'
    - ' | IEX ;'
    - ' | IEX -Error'
    - ' | IEX (new'
    - ');IEX '
  selection_combined_2:
    CommandLine|contains:
    - ::FromBase64String
    - '.GetString([System.Convert]::'
  selection_standalone:
    CommandLine|contains:
    - )|iex;$
    - );iex($
    - );iex $
    - ' | IEX | '
    - ' | iex\"'
  condition: all of selection_combined_* or selection_standalone
provenance:
  source: SigmaHQ/sigma
  source_id: 09576804-7a05-458e-a817-eb718ca91f54
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_powershell_iex_patterns.yml
falsepositives:
- Legitimate scripts that use IEX
notes:
  quarantine_reason: 'upstream status: test'
