id: sigmahq-sigma-aef9d1f1-7396-4e92-a927-4567c7a495c1
name: Suspicious Git Clone
description: Detects execution of "git" in order to clone a remote repository that
  contain suspicious keywords which might be suspicious
severity: medium
enabled: false
tags:
  mitre:
  - T1593.003
  categories:
  - endpoint
references:
- https://gist.githubusercontent.com/MichaelKoczwara/12faba9c061c12b5814b711166de8c2f/raw/e2068486692897b620c25fde1ea258c8218fe3d3/history.txt
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - \git.exe
    - \git-remote-https.exe
  - OriginalFileName: git.exe
  selection_cli:
    CommandLine|contains:
    - ' clone '
    - 'git-remote-https '
  selection_keyword:
    CommandLine|contains:
    - exploit
    - Vulns
    - vulnerability
    - RemoteCodeExecution
    - Invoke-
    - CVE-
    - poc-
    - ProofOfConcept
    - proxyshell
    - log4shell
    - eternalblue
    - eternal-blue
    - MS17-
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: aef9d1f1-7396-4e92-a927-4567c7a495c1
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_git_susp_clone.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
