id: sigmahq-sigma-a018fdc3-46a3-44e5-9afb-2cd4af1d4b39
name: Suspicious Execution From Outlook Temporary Folder
description: Detects a suspicious program execution in Outlook temp folder
severity: high
enabled: false
tags:
  mitre:
  - T1566.001
  categories:
  - endpoint
references:
- Internal Research
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|contains: \Temporary Internet Files\Content.Outlook\
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: a018fdc3-46a3-44e5-9afb-2cd4af1d4b39
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_office_outlook_execution_from_temp.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
