id: sigmahq-sigma-a29c1813-ab1f-4dde-b489-330b952e91ae
name: Suspicious Network Command
description: Adversaries may look for details about the network configuration and
  settings of systems they access or through information discovery of remote systems
severity: low
enabled: false
tags:
  mitre:
  - T1016
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1016/T1016.md#atomic-test-1---system-network-configuration-discovery-on-windows
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|re:
    - ipconfig\s+/all
    - netsh\s+interface show interface
    - arp\s+-a
    - nbtstat\s+-n
    - net\s+config
    - route\s+print
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: a29c1813-ab1f-4dde-b489-330b952e91ae
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_susp_network_command.yml
falsepositives:
- Administrator, hotline ask to user
notes:
  quarantine_reason: 'upstream status: test'
