id: sigmahq-sigma-208748f7-881d-47ac-a29c-07ea84bf691d
name: Suspicious Outlook Child Process
description: Detects a suspicious process spawning from an Outlook process.
severity: high
enabled: false
tags:
  mitre:
  - T1204.002
  categories:
  - endpoint
references:
- https://www.hybrid-analysis.com/sample/465aabe132ccb949e75b8ab9c5bda36d80cf2fd503d52b8bad54e295f28bbc21?environmentId=100
- https://mgreen27.github.io/posts/2018/04/02/DownloadCradle.html
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage|endswith: \OUTLOOK.EXE
    Image|endswith:
    - \AppVLP.exe
    - \bash.exe
    - \cmd.exe
    - \cscript.exe
    - \forfiles.exe
    - \hh.exe
    - \mftrace.exe
    - \msbuild.exe
    - \msdt.exe
    - \mshta.exe
    - \msiexec.exe
    - \powershell.exe
    - \pwsh.exe
    - \regsvr32.exe
    - \schtasks.exe
    - \scrcons.exe
    - \scriptrunner.exe
    - \sh.exe
    - \svchost.exe
    - \wmic.exe
    - \wscript.exe
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 208748f7-881d-47ac-a29c-07ea84bf691d
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_office_outlook_susp_child_processes.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
