id: sigmahq-sigma-590a5f4c-6c8c-4f10-8307-89afe9453a9d
name: Suspicious Child Process Created as System
description: Detection of child processes spawned with SYSTEM privileges by parents
  with LOCAL SERVICE or NETWORK SERVICE accounts
severity: high
enabled: false
tags:
  mitre:
  - T1134.002
  categories:
  - endpoint
references:
- https://speakerdeck.com/heirhabarov/hunting-for-privilege-escalation-in-windows-environment
- https://foxglovesecurity.com/2016/09/26/rotten-potato-privilege-escalation-from-service-accounts-to-system/
- https://github.com/antonioCoco/RogueWinRM
- https://twitter.com/Cyb3rWard0g/status/1453123054243024897
logsource:
  category: process_creation
  product: windows
  definition: 'Requirements: ParentUser field needs sysmon >= 13.30'
detection:
  selection:
    ParentUser|contains:
    - AUTHORI
    - AUTORI
    ParentUser|endswith:
    - \NETWORK SERVICE
    - \LOCAL SERVICE
    User|contains:
    - AUTHORI
    - AUTORI
    User|endswith:
    - \SYSTEM
    - \Système
    - \СИСТЕМА
    IntegrityLevel:
    - System
    - S-1-16-16384
  filter_rundll32:
    Image|endswith: \rundll32.exe
    CommandLine|contains: DavSetCookie
  condition: selection and not 1 of filter_*
provenance:
  source: SigmaHQ/sigma
  source_id: 590a5f4c-6c8c-4f10-8307-89afe9453a9d
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_susp_child_process_as_system_.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
