id: sigmahq-sigma-c462f537-a1e3-41a6-b5fc-b2c2cef9bf82
name: Suspicious PsExec Execution
description: detects execution of psexec or paexec with renamed service name, this
  rule helps to filter out the noise if psexec is used for legit purposes or if attacker
  uses a different psexec client other than sysinternal one
severity: high
enabled: false
tags:
  mitre:
  - T1021.002
  categories:
  - endpoint
references:
- https://web.archive.org/web/20230329171218/https://blog.menasec.net/2019/02/threat-hunting-3-detecting-psexec.html
logsource:
  product: windows
  service: security
  definition: The advanced audit policy setting "Object Access > Audit Detailed File
    Share" must be configured for Success/Failure
detection:
  selection1:
    EventID: 5145
    ShareName: \\\\\*\\IPC$
    RelativeTargetName|endswith:
    - -stdin
    - -stdout
    - -stderr
  filter:
    RelativeTargetName|startswith: PSEXESVC
  condition: selection1 and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: c462f537-a1e3-41a6-b5fc-b2c2cef9bf82
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/security/win_security_susp_psexec.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
