id: sigmahq-sigma-8c1a5675-cb85-452f-a298-b01b22a51856
name: Suspicious Invocation of Shell via AWK - Linux
description: 'Detects the execution of "awk" or it''s sibling commands, to invoke
  a shell using the system() function.

  This behavior is commonly associated with attempts to execute arbitrary commands
  or escalate privileges, potentially leading to unauthorized access or further exploitation.'
severity: high
enabled: false
tags:
  mitre:
  - T1059
  categories:
  - endpoint
references:
- https://gtfobins.github.io/gtfobins/awk/#shell
- https://gtfobins.github.io/gtfobins/gawk/#shell
- https://gtfobins.github.io/gtfobins/nawk/#shell
- https://gtfobins.github.io/gtfobins/mawk/#shell
logsource:
  category: process_creation
  product: linux
detection:
  selection_img:
    Image|endswith:
    - /awk
    - /gawk
    - /mawk
    - /nawk
    CommandLine|contains: BEGIN {system
  selection_cli:
    CommandLine|contains:
    - /bin/bash
    - /bin/dash
    - /bin/fish
    - /bin/sh
    - /bin/zsh
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 8c1a5675-cb85-452f-a298-b01b22a51856
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/process_creation/proc_creation_lnx_awk_shell_spawn.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
