id: sigmahq-sigma-ca2092a1-c273-4878-9b4b-0d60115bf5ea
name: Suspicious Encoded PowerShell Command Line
description: Detects suspicious powershell process starts with base64 encoded commands
  (e.g. Emotet)
severity: high
enabled: false
tags:
  mitre:
  - T1059.001
  categories:
  - endpoint
references:
- https://app.any.run/tasks/6217d77d-3189-4db2-a957-8ab239f3e01e
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - \powershell.exe
    - \pwsh.exe
  - OriginalFileName:
    - PowerShell.EXE
    - pwsh.dll
  selection_cli_enc:
    CommandLine|contains: ' -e'
  selection_cli_content:
    CommandLine|contains:
    - ' JAB'
    - ' SUVYI'
    - ' SQBFAFgA'
    - ' aQBlAHgA'
    - ' aWV4I'
    - ' IAA'
    - ' IAB'
    - ' UwB'
    - ' cwB'
  selection_standalone:
    CommandLine|contains:
    - '.exe -ENCOD '
    - ' BA^J e-'
  filter_optional_remote_signed:
    CommandLine|contains: ' -ExecutionPolicy remotesigned '
  condition: selection_img and (all of selection_cli_* or selection_standalone) and
    not 1 of filter_optional_*
provenance:
  source: SigmaHQ/sigma
  source_id: ca2092a1-c273-4878-9b4b-0d60115bf5ea
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_powershell_base64_encoded_cmd.yml
notes:
  quarantine_reason: 'upstream status: test'
