id: sigmahq-sigma-3b5b0213-0460-4e3f-8937-3abf98ff7dcc
name: Suspicious Workstation Locking via Rundll32
description: Detects a suspicious call to the user32.dll function that locks the user
  workstation
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://app.any.run/tasks/2aef9c63-f944-4763-b3ef-81eee209d128/
logsource:
  category: process_creation
  product: windows
detection:
  selection_call_img:
  - Image|endswith: \rundll32.exe
  - OriginalFileName: RUNDLL32.EXE
  selection_call_parent:
    ParentImage|endswith: \cmd.exe
  selection_call_cli:
    CommandLine|contains: user32.dll,
  selection_function:
    CommandLine|contains: LockWorkStation
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 3b5b0213-0460-4e3f-8937-3abf98ff7dcc
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_rundll32_user32_dll.yml
falsepositives:
- Scripts or links on the user desktop used to lock the workstation instead of Windows+L
  or the menu option
notes:
  quarantine_reason: 'upstream status: test'
