id: sigmahq-sigma-52182dfb-afb7-41db-b4bc-5336cb29b464
name: Suspicious File Download From File Sharing Websites -  File Stream
description: Detects the download of suspicious file type from a well-known file and
  paste sharing domain
severity: high
enabled: false
tags:
  mitre:
  - T1564.004
  categories:
  - endpoint
references:
- https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventid=90015
- https://www.cisa.gov/uscert/ncas/alerts/aa22-321a
- https://fabian-voith.de/2020/06/25/sysmon-v11-1-reads-alternate-data-streams/
- https://www.microsoft.com/en-us/security/blog/2024/01/17/new-ttps-observed-in-mint-sandstorm-campaign-targeting-high-profile-individuals-at-universities-and-research-orgs/
logsource:
  product: windows
  category: create_stream_hash
detection:
  selection_domain:
    Contents|contains:
    - .githubusercontent.com
    - anonfiles.com
    - cdn.discordapp.com
    - ddns.net
    - dl.dropboxusercontent.com
    - ghostbin.co
    - github.com
    - glitch.me
    - gofile.io
    - hastebin.com
    - mediafire.com
    - mega.nz
    - onrender.com
    - pages.dev
    - paste.ee
    - pastebin.com
    - pastebin.pl
    - pastetext.net
    - pixeldrain.com
    - privatlab.com
    - privatlab.net
    - send.exploit.in
    - sendspace.com
    - storage.googleapis.com
    - storjshare.io
    - supabase.co
    - temp.sh
    - transfer.sh
    - trycloudflare.com
    - ufile.io
    - w3spaces.com
    - workers.dev
  selection_extension:
    TargetFilename|contains:
    - .cpl:Zone
    - .dll:Zone
    - .exe:Zone
    - .hta:Zone
    - .lnk:Zone
    - .one:Zone
    - .vbe:Zone
    - .vbs:Zone
    - .xll:Zone
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 52182dfb-afb7-41db-b4bc-5336cb29b464
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/create_stream_hash/create_stream_hash_file_sharing_domains_download_susp_extension.yml
falsepositives:
- Some false positives might occur with binaries download via Github
notes:
  quarantine_reason: 'upstream status: test'
