id: sigmahq-sigma-138d3531-8793-4f50-a2cd-f291b2863d78
name: Suspicious Service Path Modification
description: Detects service path modification via the "sc" binary to a suspicious
  command or path
severity: high
enabled: false
tags:
  mitre:
  - T1543.003
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1543.003/T1543.003.md
- https://web.archive.org/web/20180331144337/https://www.fireeye.com/blog/threat-research/2018/03/sanny-malware-delivery-method-updated-in-recently-observed-attacks.html
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: \sc.exe
    CommandLine|contains|all:
    - config
    - binPath
    CommandLine|contains:
    - powershell
    - 'cmd '
    - mshta
    - wscript
    - cscript
    - rundll32
    - svchost
    - dllhost
    - cmd.exe /c
    - cmd.exe /k
    - cmd.exe /r
    - cmd /c
    - cmd /k
    - cmd /r
    - C:\Users\Public
    - \Downloads\
    - \Desktop\
    - \Microsoft\Windows\Start Menu\Programs\Startup\
    - C:\Windows\TEMP\
    - \AppData\Local\Temp
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 138d3531-8793-4f50-a2cd-f291b2863d78
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_sc_service_path_modification.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
