id: sigmahq-sigma-cd8b36ac-8e4a-4c2f-a402-a29b8fbd5bca
name: Suspicious File Creation Activity From Fake Recycle.Bin Folder
description: Detects file write event from/to a fake recycle bin folder that is often
  used as a staging directory for malware
severity: high
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://www.mandiant.com/resources/blog/infected-usb-steal-secrets
- https://unit42.paloaltonetworks.com/cloaked-ursa-phishing/
logsource:
  category: file_event
  product: windows
detection:
  selection:
  - Image|contains:
    - RECYCLERS.BIN\
    - RECYCLER.BIN\
  - TargetFilename|contains:
    - RECYCLERS.BIN\
    - RECYCLER.BIN\
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: cd8b36ac-8e4a-4c2f-a402-a29b8fbd5bca
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_susp_recycle_bin_fake_exec.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
