id: sigmahq-sigma-e890acee-d488-420e-8f20-d9b19b3c3d43
name: Suspicious File Created by ArcSOC.exe
description: 'Detects instances where the ArcGIS Server process ArcSOC.exe, which
  hosts REST services running on an ArcGIS

  server, creates a file with suspicious file type, indicating that it may be an executable,
  script file,

  or otherwise unusual.'
severity: high
enabled: false
tags:
  mitre:
  - T1127
  - T1105
  - T1133
  categories:
  - endpoint
references:
- https://reliaquest.com/blog/threat-spotlight-inside-flax-typhoons-arcgis-compromise/
- https://enterprise.arcgis.com/en/server/12.0/administer/windows/inside-an-arcgis-server-site.htm
logsource:
  category: file_event
  product: windows
detection:
  selection:
    Image|endswith: \ArcSOC.exe
    TargetFilename|endswith:
    - .ahk
    - .aspx
    - .au3
    - .bat
    - .cmd
    - .dll
    - .exe
    - .hta
    - .js
    - .ps1
    - .py
    - .vbe
    - .vbs
    - .wsf
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: e890acee-d488-420e-8f20-d9b19b3c3d43
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_arcsoc_susp_file_created.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: experimental'
