id: sigmahq-sigma-f0507c0f-a3a2-40f5-acc6-7f543c334993
name: Suspicious File Execution From Internet Hosted WebDav Share
description: Detects the execution of the "net use" command to mount a WebDAV server
  and then immediately execute some content in it. As seen being used in malicious
  LNK files
severity: high
enabled: false
tags:
  mitre:
  - T1059.001
  categories:
  - endpoint
references:
- https://twitter.com/ShadowChasing1/status/1552595370961944576
- https://www.virustotal.com/gui/file/a63376ee1dba76361df73338928e528ca5b20171ea74c24581605366dcaa0104/behavior
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|contains: \cmd.exe
  - OriginalFileName: Cmd.EXE
  selection_base:
    CommandLine|contains|all:
    - ' net use http'
    - '& start /b '
    - \DavWWWRoot\
  selection_ext:
    CommandLine|contains:
    - '.exe '
    - '.dll '
    - '.bat '
    - '.vbs '
    - '.ps1 '
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: f0507c0f-a3a2-40f5-acc6-7f543c334993
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_cmd_net_use_and_exec_combo.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
