id: sigmahq-sigma-13e6fe51-d478-4c7e-b0f2-6da9b400a829
name: Suspicious File Downloaded From Direct IP Via Certutil.EXE
description: Detects the execution of certutil with certain flags that allow the utility
  to download files from direct IPs.
severity: high
enabled: false
tags:
  mitre:
  - T1027
  - T1105
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/certutil
- https://forensicitguy.github.io/agenttesla-vba-certutil-download/
- https://news.sophos.com/en-us/2021/04/13/compromised-exchange-server-hosting-cryptojacker-targeting-other-exchange-servers/
- https://twitter.com/egre55/status/1087685529016193025
- https://lolbas-project.github.io/lolbas/Binaries/Certutil/
- https://twitter.com/_JohnHammond/status/1708910264261980634
- https://www.hexacorn.com/blog/2020/08/23/certutil-one-more-gui-lolbin
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \certutil.exe
  - OriginalFileName: CertUtil.exe
  selection_flags:
    CommandLine|contains:
    - 'urlcache '
    - 'verifyctl '
    - 'URL '
  selection_http:
    CommandLine|contains:
    - ://1
    - ://2
    - ://3
    - ://4
    - ://5
    - ://6
    - ://7
    - ://8
    - ://9
  filter_main_seven_zip:
    CommandLine|contains: ://7-
  condition: all of selection_* and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 13e6fe51-d478-4c7e-b0f2-6da9b400a829
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_certutil_download_direct_ip.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
