id: sigmahq-sigma-78f10490-f2f4-4d19-a75b-4e0683bf3b8d
name: Suspicious Speech Runtime Binary Child Process
description: 'Detects suspicious Speech Runtime Binary Execution by monitoring its
  child processes.

  Child processes spawned by SpeechRuntime.exe could indicate an attempt for lateral
  movement via COM & DCOM hijacking.'
severity: high
enabled: false
tags:
  mitre:
  - T1021.003
  - T1218
  categories:
  - endpoint
references:
- https://github.com/rtecCyberSec/SpeechRuntimeMove
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage|endswith: \SpeechRuntime.exe
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 78f10490-f2f4-4d19-a75b-4e0683bf3b8d
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_speechruntime_child_process.yml
falsepositives:
- Unlikely.
notes:
  quarantine_reason: 'upstream status: experimental'
