id: sigmahq-sigma-54786ddc-5b8a-11ed-9b6a-0242ac120002
name: Suspicious Ping/Del Command Combination
description: Detects a method often used by ransomware. Which combines the "ping"
  to wait a couple of seconds and then "del" to delete the file in question. Its used
  to hide the file responsible for the initial infection for example
severity: high
enabled: false
tags:
  mitre:
  - T1070.004
  categories:
  - endpoint
references:
- https://blog.sygnia.co/kaseya-ransomware-supply-chain-attack
- https://media.kasperskycontenthub.com/wp-content/uploads/sites/43/2022/06/23093553/Common-TTPs-of-the-modern-ransomware_low-res.pdf
- https://www.acronis.com/en-us/blog/posts/lockbit-ransomware/
- https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/blackbyte-exbyte-ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_count:
    CommandLine|contains|windash: ' -n '
  selection_nul:
    CommandLine|contains: Nul
  selection_del_param:
    CommandLine|contains|windash:
    - ' -f '
    - ' -q '
  selection_all:
    CommandLine|contains|all:
    - ping
    - 'del '
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 54786ddc-5b8a-11ed-9b6a-0242ac120002
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_cmd_ping_del_combined_execution.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
