id: sigmahq-sigma-941e5c45-cda7-4864-8cea-bbb7458d194a
name: Suspicious Remote Logon with Explicit Credentials
description: Detects suspicious processes logging on with explicit credentials
severity: medium
enabled: false
tags:
  mitre:
  - T1078
  categories:
  - endpoint
references:
- https://drive.google.com/file/d/1lKya3_mLnR3UQuCoiYruO3qgu052_iS_/view
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4648
    ProcessName|endswith:
    - \cmd.exe
    - \powershell.exe
    - \pwsh.exe
    - \winrs.exe
    - \wmic.exe
    - \net.exe
    - \net1.exe
    - \reg.exe
  filter1:
    TargetServerName: localhost
  filter2:
    SubjectUserName|endswith: $
    TargetUserName|endswith: $
  condition: selection and not 1 of filter*
provenance:
  source: SigmaHQ/sigma
  source_id: 941e5c45-cda7-4864-8cea-bbb7458d194a
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/security/win_security_susp_logon_explicit_credentials.yml
falsepositives:
- Administrators that use the RunAS command or scheduled tasks
notes:
  quarantine_reason: 'upstream status: test'
