id: sigmahq-sigma-e8a95b5e-c891-46e2-b33a-93937d3abc31
name: Suspicious HH.EXE Execution
description: Detects a suspicious execution of a Microsoft HTML Help (HH.exe)
severity: high
enabled: false
tags:
  mitre:
  - T1047
  - T1059.001
  - T1059.003
  - T1059.005
  - T1059.007
  - T1218
  - T1218.001
  - T1218.010
  - T1218.011
  - T1566
  - T1566.001
  categories:
  - endpoint
references:
- https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/chm-badness-delivers-a-banking-trojan/
- https://github.com/elastic/protections-artifacts/commit/746086721fd385d9f5c6647cada1788db4aea95f#diff-27939090904026cc396b0b629c8e4314acd6f5dac40a676edbc87f4567b47eb7
- https://www.ptsecurity.com/ww-en/analytics/pt-esc-threat-intelligence/higaisa-or-winnti-apt-41-backdoors-old-and-new/
- https://www.zscaler.com/blogs/security-research/unintentional-leak-glimpse-attack-vectors-apt37
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - OriginalFileName: HH.exe
  - Image|endswith: \hh.exe
  selection_paths:
    CommandLine|contains:
    - .application
    - \AppData\Local\Temp\
    - \Content.Outlook\
    - \Downloads\
    - \Users\Public\
    - \Windows\Temp\
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: e8a95b5e-c891-46e2-b33a-93937d3abc31
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_hh_susp_execution.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
