id: sigmahq-sigma-f72aa3e8-49f9-4c7d-bd74-f8ab84ff9bbb
name: Suspicious RDP Redirect Using TSCON
description: Detects a suspicious RDP session redirect using tscon.exe
severity: high
enabled: false
tags:
  mitre:
  - T1563.002
  - T1021.001
  categories:
  - endpoint
references:
- http://www.korznikov.com/2017/03/0-day-or-feature-privilege-escalation.html
- https://medium.com/@networksecurity/rdp-hijacking-how-to-hijack-rds-and-remoteapp-sessions-transparently-to-move-through-an-da2a1e73a5f6
- https://www.hackingarticles.in/rdp-session-hijacking-with-tscon/
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains: ' /dest:rdp-tcp#'
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: f72aa3e8-49f9-4c7d-bd74-f8ab84ff9bbb
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_tscon_rdp_redirect.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
