id: sigmahq-sigma-8de89e52-f6e1-4b5b-afd1-41ecfa300d48
name: Suspicious WindowsTerminal Child Processes
description: Detects suspicious children spawned via the Windows Terminal application
  which could be a sign of persistence via WindowsTerminal (see references section)
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://persistence-info.github.io/Data/windowsterminalprofile.html
- https://twitter.com/nas_bench/status/1550836225652686848
logsource:
  category: process_creation
  product: windows
detection:
  selection_parent:
    ParentImage|endswith:
    - \WindowsTerminal.exe
    - \wt.exe
  selection_susp:
  - Image|endswith:
    - \rundll32.exe
    - \regsvr32.exe
    - \certutil.exe
    - \cscript.exe
    - \wscript.exe
    - \csc.exe
  - Image|contains:
    - C:\Users\Public\
    - \Downloads\
    - \Desktop\
    - \AppData\Local\Temp\
    - \Windows\TEMP\
  - CommandLine|contains:
    - ' iex '
    - ' icm'
    - Invoke-
    - 'Import-Module '
    - 'ipmo '
    - DownloadString(
    - ' /c '
    - ' /k '
    - ' /r '
  filter_builtin_visual_studio_shell:
    CommandLine|contains|all:
    - Import-Module
    - Microsoft.VisualStudio.DevShell.dll
    - Enter-VsDevShell
  filter_open_settings:
    CommandLine|contains|all:
    - \AppData\Local\Packages\Microsoft.WindowsTerminal_
    - \LocalState\settings.json
  filter_vsdevcmd:
    CommandLine|contains|all:
    - C:\Program Files\Microsoft Visual Studio\
    - \Common7\Tools\VsDevCmd.bat
  condition: all of selection_* and not 1 of filter_*
provenance:
  source: SigmaHQ/sigma
  source_id: 8de89e52-f6e1-4b5b-afd1-41ecfa300d48
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_windows_terminal_susp_children.yml
falsepositives:
- Other legitimate "Windows Terminal" profiles
notes:
  quarantine_reason: 'upstream status: test'
