id: sigmahq-sigma-58f4ea09-0fc2-4520-ba18-b85c540b0eaf
name: Suspicious Serv-U Process Pattern
description: Detects a suspicious process pattern which could be a sign of an exploited
  Serv-U service
severity: high
enabled: false
tags:
  mitre:
  - T1555
  categories:
  - endpoint
references:
- https://www.microsoft.com/security/blog/2021/07/13/microsoft-discovers-threat-actor-targeting-solarwinds-serv-u-software-with-0-day-exploit/
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage|endswith: \Serv-U.exe
    Image|endswith:
    - \cmd.exe
    - \powershell.exe
    - \pwsh.exe
    - \wscript.exe
    - \cscript.exe
    - \sh.exe
    - \bash.exe
    - \schtasks.exe
    - \regsvr32.exe
    - \wmic.exe
    - \mshta.exe
    - \rundll32.exe
    - \msiexec.exe
    - \forfiles.exe
    - \scriptrunner.exe
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 58f4ea09-0fc2-4520-ba18-b85c540b0eaf
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_servu_susp_child_process.yml
falsepositives:
- Legitimate uses in which users or programs use the SSH service of Serv-U for remote
  command execution
notes:
  quarantine_reason: 'upstream status: test'
