id: sigmahq-sigma-f8d6a15e-4bc8-4c27-8e5d-2b10f0b73e5b
name: Suspicious Powercfg Execution To Change Lock Screen Timeout
description: Detects suspicious execution of 'Powercfg.exe' to change lock screen
  timeout
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://blogs.vmware.com/security/2022/11/batloader-the-evasive-downloader-malware.html
- https://learn.microsoft.com/en-us/windows-hardware/design/device-experiences/powercfg-command-line-options
logsource:
  category: process_creation
  product: windows
detection:
  selection_power:
  - Image|endswith: \powercfg.exe
  - OriginalFileName: PowerCfg.exe
  selection_standby:
  - CommandLine|contains|all:
    - '/setacvalueindex '
    - SCHEME_CURRENT
    - SUB_VIDEO
    - VIDEOCONLOCK
  - CommandLine|contains|all:
    - '-change '
    - -standby-timeout-
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: f8d6a15e-4bc8-4c27-8e5d-2b10f0b73e5b
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_powercfg_execution.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
