id: sigmahq-sigma-e76b413a-83d0-4b94-8e4c-85db4a5b8bdc
name: Suspicious OpenSSH Daemon Error
description: Detects suspicious SSH / SSHD error messages that indicate a fatal or
  suspicious error that could be caused by exploiting attempts
severity: medium
enabled: false
tags:
  mitre:
  - T1190
  categories:
  - endpoint
references:
- https://github.com/openssh/openssh-portable/blob/c483a5c0fb8e8b8915fad85c5f6113386a4341ca/ssherr.c
- https://github.com/ossec/ossec-hids/blob/1ecffb1b884607cb12e619f9ab3c04f530801083/etc/rules/sshd_rules.xml
logsource:
  product: linux
  service: sshd
detection:
  keywords:
  - unexpected internal error
  - unknown or unsupported key type
  - invalid certificate signing key
  - invalid elliptic curve value
  - incorrect signature
  - error in libcrypto
  - unexpected bytes remain after decoding
  - 'fatal: buffer_get_string: bad string'
  - 'Local: crc32 compensation attack'
  - bad client public DH value
  - Corrupted MAC on input
  condition: keywords
provenance:
  source: SigmaHQ/sigma
  source_id: e76b413a-83d0-4b94-8e4c-85db4a5b8bdc
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/builtin/sshd/lnx_sshd_susp_ssh.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
