id: sigmahq-sigma-90fb5e62-ca1f-4e22-b42e-cc521874c938
name: Suspicious Shells Spawn by Java Utility Keytool
description: Detects suspicious shell spawn from Java utility keytool process (e.g.
  adselfservice plus exploitation)
severity: high
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://redcanary.com/blog/intelligence-insights-december-2021
- https://www.synacktiv.com/en/publications/how-to-exploit-cve-2021-40539-on-manageengine-adselfservice-plus.html
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage|endswith: \keytool.exe
    Image|endswith:
    - \cmd.exe
    - \sh.exe
    - \bash.exe
    - \powershell.exe
    - \pwsh.exe
    - \schtasks.exe
    - \certutil.exe
    - \whoami.exe
    - \bitsadmin.exe
    - \wscript.exe
    - \cscript.exe
    - \scrcons.exe
    - \regsvr32.exe
    - \hh.exe
    - \wmic.exe
    - \mshta.exe
    - \rundll32.exe
    - \forfiles.exe
    - \scriptrunner.exe
    - \mftrace.exe
    - \AppVLP.exe
    - \systeminfo.exe
    - \reg.exe
    - \query.exe
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 90fb5e62-ca1f-4e22-b42e-cc521874c938
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_java_keytool_susp_child_process.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
