id: sigmahq-sigma-1d61f71d-59d2-479e-9562-4ff5f4ead16b
name: Suspicious Service Installation
description: Detects suspicious service installation commands
severity: high
enabled: false
tags:
  mitre:
  - T1543.003
  categories:
  - endpoint
references:
- Internal Research
logsource:
  product: windows
  service: system
detection:
  selection:
    Provider_Name: Service Control Manager
    EventID: 7045
    ImagePath|contains:
    - ' -nop '
    - ' -sta '
    - ' -w hidden '
    - :\Temp\
    - .downloadfile(
    - .downloadstring(
    - \ADMIN$\
    - \Perflogs\
    - '&&'
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 1d61f71d-59d2-479e-9562-4ff5f4ead16b
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/system/service_control_manager/win_system_service_install_susp.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
