id: sigmahq-sigma-5ce0f04e-3efc-42af-839d-5b3a543b76c0
name: Suspicious Process Execution From Fake Recycle.Bin Folder
description: Detects process execution from a fake recycle bin folder, often used
  to avoid security solution.
severity: high
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://www.mandiant.com/resources/blog/infected-usb-steal-secrets
- https://unit42.paloaltonetworks.com/cloaked-ursa-phishing/
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|contains:
    - RECYCLERS.BIN\
    - RECYCLER.BIN\
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 5ce0f04e-3efc-42af-839d-5b3a543b76c0
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_susp_recycle_bin_fake_execution.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
