id: sigmahq-sigma-c80e66d8-1780-48a9-b412-46663fd21ac0
name: Suspicious Autorun Registry Modified via WMI
description: Detects suspicious activity where the WMIC process is used to create
  an autorun registry entry via reg.exe, which is often indicative of persistence
  mechanisms employed by malware.
severity: high
enabled: false
tags:
  mitre:
  - T1547.001
  - T1047
  categories:
  - endpoint
references:
- Internal Research
- https://github.com/HackTricks-wiki/hacktricks/blob/e4c7b21b8f36c97c35b7c622732b38a189ce18f7/src/windows-hardening/windows-local-privilege-escalation/privilege-escalation-with-autorun-binaries.md
logsource:
  category: process_creation
  product: windows
detection:
  selection_execution_img:
  - Image|endswith: \wmic.exe
  - OriginalFileName: wmic.exe
  - ParentImage|endswith: \wmiprvse.exe
  selection_execution_cmd:
    CommandLine|contains|all:
    - reg
    - ' add '
    CommandLine|contains:
    - \Software\Microsoft\Windows\CurrentVersion\Run
    - \Software\WOW6432Node\Microsoft\Windows\CurrentVersion\Run
    - \Software\Microsoft\Windows\CurrentVersion\Policies\Explorer\Run
  selection_suspicious_paths_1:
    CommandLine|contains:
    - :\Perflogs
    - :\ProgramData'
    - :\Windows\Temp
    - :\Temp
    - \AppData\Local\Temp
    - \AppData\Roaming
    - :\$Recycle.bin
    - :\Users\Default
    - :\Users\public
    - '%temp%'
    - '%tmp%'
    - '%Public%'
    - '%AppData%'
  selection_suspicious_paths_user_1:
    CommandLine|contains: :\Users\
  selection_suspicious_paths_user_2:
    CommandLine|contains:
    - \Favorites
    - \Favourites
    - \Contacts
    - \Music
    - \Pictures
    - \Documents
    - \Photos
  condition: all of selection_execution_* and (selection_suspicious_paths_1 or (all
    of selection_suspicious_paths_user_*))
provenance:
  source: SigmaHQ/sigma
  source_id: c80e66d8-1780-48a9-b412-46663fd21ac0
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_autorun_registry_modified_via_wmic.yml
falsepositives:
- Legitimate administrative activity or software installations
notes:
  quarantine_reason: 'upstream status: experimental'
