id: sigmahq-sigma-ab9e3b40-0c85-4ba1-aede-455d226fd124
name: Suspicious Redirection to Local Admin Share
description: Detects a suspicious output redirection to the local admins share, this
  technique is often found in malicious scripts or hacktool stagers
severity: high
enabled: false
tags:
  mitre:
  - T1048
  categories:
  - endpoint
references:
- https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/
- http://blog.talosintelligence.com/2022/09/lazarus-three-rats.html
logsource:
  category: process_creation
  product: windows
detection:
  selection_redirect:
    CommandLine|contains: '>'
  selection_share:
    CommandLine|contains:
    - \\\\127.0.0.1\\admin$\\
    - \\\\localhost\\admin$\\
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: ab9e3b40-0c85-4ba1-aede-455d226fd124
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_susp_redirect_local_admin_share.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
