id: sigmahq-sigma-f1b3a22a-45e6-4004-afb5-4291f9c21166
name: Suspicious PsExec Execution - Zeek
description: detects execution of psexec or paexec with renamed service name, this
  rule helps to filter out the noise if psexec is used for legit purposes or if attacker
  uses a different psexec client other than sysinternal one
severity: high
enabled: false
tags:
  mitre:
  - T1021.002
  categories:
  - endpoint
references:
- https://web.archive.org/web/20230329171218/https://blog.menasec.net/2019/02/threat-hunting-3-detecting-psexec.html
logsource:
  product: zeek
  service: smb_files
detection:
  selection:
    path|contains|all:
    - \\
    - \IPC$
    name|endswith:
    - -stdin
    - -stdout
    - -stderr
  filter:
    name|startswith: PSEXESVC
  condition: selection and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: f1b3a22a-45e6-4004-afb5-4291f9c21166
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/network/zeek/zeek_smb_converted_win_susp_psexec.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
