id: sigmahq-sigma-c0b40568-b1e9-4b03-8d6c-b096da6da9ab
name: Suspicious AgentExecutor PowerShell Execution
description: Detects execution of the AgentExecutor.exe binary. Which can be abused
  as a LOLBIN to execute powershell scripts with the ExecutionPolicy "Bypass" or any
  binary named "powershell.exe" located in the path provided by 6th positional argument
severity: high
enabled: false
tags:
  mitre:
  - T1218
  categories:
  - endpoint
references:
- https://twitter.com/lefterispan/status/1286259016436514816
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Agentexecutor/
- https://learn.microsoft.com/en-us/mem/intune/apps/intune-management-extension
- https://twitter.com/jseerden/status/1247985304667066373/photo/1
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \AgentExecutor.exe
  - OriginalFileName: AgentExecutor.exe
  selection_cli:
    CommandLine|contains:
    - ' -powershell'
    - ' -remediationScript'
  filter_main_pwsh:
    CommandLine|contains:
    - C:\Windows\System32\WindowsPowerShell\v1.0\
    - C:\Windows\SysWOW64\WindowsPowerShell\v1.0\
  filter_main_intune:
    ParentImage|endswith: \Microsoft.Management.Services.IntuneWindowsAgent.exe
  condition: all of selection_* and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: c0b40568-b1e9-4b03-8d6c-b096da6da9ab
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_agentexecutor_susp_usage.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
