id: sigmahq-sigma-20384606-a124-4fec-acbb-8bd373728613
name: Suspicious Network Connection Binary No CommandLine
description: Detects suspicious network connections made by a well-known Windows binary
  run with no command line parameters
severity: high
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://redcanary.com/blog/raspberry-robin/
logsource:
  category: network_connection
  product: windows
detection:
  selection:
    Initiated: 'true'
    Image|endswith:
    - \regsvr32.exe
    - \rundll32.exe
    - \dllhost.exe
    CommandLine|endswith:
    - \regsvr32.exe
    - \rundll32.exe
    - \dllhost.exe
  filter_no_cmdline:
    CommandLine: ''
  filter_null:
    CommandLine: null
  condition: selection and not 1 of filter*
provenance:
  source: SigmaHQ/sigma
  source_id: 20384606-a124-4fec-acbb-8bd373728613
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/network_connection/net_connection_win_susp_binary_no_cmdline.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
