id: sigmahq-sigma-1ae64f96-72b6-48b3-ad3d-e71dff6c6398
name: Suspicious External WebDAV Execution
description: Detects executables launched from external WebDAV shares using the WebDAV
  Explorer integration, commonly seen in initial access campaigns.
severity: high
enabled: false
tags:
  mitre:
  - T1584
  - T1566
  categories:
  - network
references:
- https://dear-territory-023.notion.site/WebDav-Share-Testing-e4950fa0c00149c3aa430d779b9b1d0f?pvs=4
- https://micahbabinski.medium.com/search-ms-webdav-and-chill-99c5b23ac462
- https://www.trendmicro.com/en_no/research/24/b/cve202421412-water-hydra-targets-traders-with-windows-defender-s.html
- https://www.trellix.com/en-us/about/newsroom/stories/research/beyond-file-search-a-novel-method.html
logsource:
  category: proxy
detection:
  selection_webdav:
    c-useragent|startswith: Microsoft-WebDAV-MiniRedir/
    cs-method: GET
  selection_execution:
    c-uri|endswith:
    - .7z
    - .bat
    - .dat
    - .cmd
    - .exe
    - .js
    - .lnk
    - .ps1
    - .rar
    - .url
    - .vbe
    - .vbs
    - .zip
  filter_main_local_ips:
    dst_ip|cidr:
    - 127.0.0.0/8
    - 10.0.0.0/8
    - 172.16.0.0/12
    - 192.168.0.0/16
    - 169.254.0.0/16
    - ::1/128
    - fe80::/10
    - fc00::/7
  condition: all of selection_* and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 1ae64f96-72b6-48b3-ad3d-e71dff6c6398
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/web/proxy_generic/proxy_webdav_external_execution.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
