id: sigmahq-sigma-966315ef-c5e1-4767-ba25-fce9c8de3660
name: Suspicious Environment Variable Has Been Registered
description: Detects the creation of user-specific or system-wide environment variables
  via the registry. Which contains suspicious commands and strings
severity: high
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://infosec.exchange/@sbousseaden/109542254124022664
logsource:
  product: windows
  category: registry_set
detection:
  selection_main:
    TargetObject|contains: \Environment\
  selection_details:
  - Details:
    - powershell
    - pwsh
  - Details|contains:
    - \AppData\Local\Temp\
    - C:\Users\Public\
    - TVqQAAMAAAAEAAAA
    - TVpQAAIAAAAEAA8A
    - TVqAAAEAAAAEABAA
    - TVoAAAAAAAAAAAAA
    - TVpTAQEAAAAEAAAA
    - SW52b2tlL
    - ludm9rZS
    - JbnZva2Ut
    - SQBuAHYAbwBrAGUALQ
    - kAbgB2AG8AawBlAC0A
    - JAG4AdgBvAGsAZQAtA
  - Details|startswith:
    - SUVY
    - SQBFAF
    - SQBuAH
    - cwBhA
    - aWV4
    - aQBlA
    - R2V0
    - dmFy
    - dgBhA
    - dXNpbm
    - H4sIA
    - Y21k
    - cABhAH
    - Qzpc
    - Yzpc
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 966315ef-c5e1-4767-ba25-fce9c8de3660
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_suspicious_env_variables.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
