id: sigmahq-sigma-aae1243f-d8af-40d8-ab20-33fc6d0c55bc
name: Suspicious Use of PsLogList
description: Detects usage of the PsLogList utility to dump event log in order to
  extract admin accounts and perform account discovery or delete events logs
severity: medium
enabled: false
tags:
  mitre:
  - T1087
  - T1087.001
  - T1087.002
  categories:
  - endpoint
references:
- https://research.nccgroup.com/2021/01/12/abusing-cloud-services-to-fly-under-the-radar/
- https://www.cybereason.com/blog/deadringer-exposing-chinese-threat-actors-targeting-major-telcos
- https://github.com/3CORESec/MAL-CL/tree/master/Descriptors/Sysinternals/PsLogList
- https://twitter.com/EricaZelic/status/1614075109827874817
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - OriginalFileName: psloglist.exe
  - Image|endswith:
    - \psloglist.exe
    - \psloglist64.exe
  selection_cli_eventlog:
    CommandLine|contains:
    - ' security'
    - ' application'
    - ' system'
  selection_cli_flags:
    CommandLine|contains|windash:
    - ' -d'
    - ' -x'
    - ' -s'
    - ' -c'
    - ' -g'
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: aae1243f-d8af-40d8-ab20-33fc6d0c55bc
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_sysinternals_psloglist.yml
falsepositives:
- Another tool that uses the command line switches of PsLogList
- Legitimate use of PsLogList by an administrator
notes:
  quarantine_reason: 'upstream status: test'
