id: sigmahq-sigma-fe21810c-2a8c-478f-8dd3-5a287fb2a0e0
name: Suspicious Scripting in a WMI Consumer
description: Detects suspicious commands that are related to scripting/powershell
  in WMI Event Consumers
severity: high
enabled: false
tags:
  mitre:
  - T1059.005
  categories:
  - endpoint
references:
- https://in.security/an-intro-into-abusing-and-identifying-wmi-event-subscriptions-for-persistence/
- https://github.com/Neo23x0/signature-base/blob/615bf1f6bac3c1bdc417025c40c073e6c2771a76/yara/gen_susp_lnk_files.yar#L19
- https://github.com/RiccardoAncarani/LiquidSnake
logsource:
  product: windows
  category: wmi_event
detection:
  selection_destination:
  - Destination|contains|all:
    - new-object
    - net.webclient
    - .downloadstring
  - Destination|contains|all:
    - new-object
    - net.webclient
    - .downloadfile
  - Destination|contains:
    - ' iex('
    - ' -nop '
    - ' -noprofile '
    - ' -decode '
    - ' -enc '
    - WScript.Shell
    - System.Security.Cryptography.FromBase64Transform
  condition: selection_destination
provenance:
  source: SigmaHQ/sigma
  source_id: fe21810c-2a8c-478f-8dd3-5a287fb2a0e0
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/wmi_event/sysmon_wmi_susp_scripting.yml
falsepositives:
- Legitimate administrative scripts
notes:
  quarantine_reason: 'upstream status: test'
