id: sigmahq-sigma-631b22a4-70f4-4e2f-9ea8-42f84d9df6d8
name: Suspicious AddinUtil.EXE CommandLine Execution
description: Detects execution of the Add-In deployment cache updating utility (AddInutil.exe)
  with suspicious Addinroot or Pipelineroot paths. An adversary may execute AddinUtil.exe
  with uncommon Addinroot/Pipelineroot paths that point to the adversaries Addins.Store
  payload.
severity: high
enabled: false
tags:
  mitre:
  - T1218
  categories:
  - endpoint
references:
- https://www.blue-prints.blog/content/blog/posts/lolbin/addinutil-lolbas.html
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \addinutil.exe
  - OriginalFileName: AddInUtil.exe
  selection_susp_1_flags:
    CommandLine|contains:
    - '-AddInRoot:'
    - '-PipelineRoot:'
  selection_susp_1_paths:
    CommandLine|contains:
    - \AppData\Local\Temp\
    - \Desktop\
    - \Downloads\
    - \Users\Public\
    - \Windows\Temp\
  selection_susp_2:
    CommandLine|contains:
    - -AddInRoot:.
    - -AddInRoot:"."
    - -PipelineRoot:.
    - -PipelineRoot:"."
    CurrentDirectory|contains:
    - \AppData\Local\Temp\
    - \Desktop\
    - \Downloads\
    - \Users\Public\
    - \Windows\Temp\
  condition: selection_img and (all of selection_susp_1_* or selection_susp_2)
provenance:
  source: SigmaHQ/sigma
  source_id: 631b22a4-70f4-4e2f-9ea8-42f84d9df6d8
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_addinutil_suspicious_cmdline.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
