id: sigmahq-sigma-42d36aa1-3240-4db0-8257-e0118dcdd9cd
name: Suspicious Hyper-V Cmdlets
description: Adversaries may carry out malicious operations using a virtual instance
  to avoid detection
severity: medium
enabled: false
tags:
  mitre:
  - T1564.006
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/virtualization/hyper-v-on-windows/quick-start/enable-hyper-v
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1564.006/T1564.006.md#atomic-test-3---create-and-start-hyper-v-virtual-machine
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection:
    ScriptBlockText|contains:
    - New-VM
    - Set-VMFirmware
    - Start-VM
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 42d36aa1-3240-4db0-8257-e0118dcdd9cd
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_susp_hyper_v_condlet.yml
falsepositives:
- Legitimate PowerShell scripts
notes:
  quarantine_reason: 'upstream status: test'
