id: sigmahq-sigma-472159c5-31b9-4f56-b794-b766faa8b0a7
name: Suspicious LSASS Access Via MalSecLogon
description: Detects suspicious access to LSASS handle via a call trace to "seclogon.dll"
  with a suspicious access right.
severity: high
enabled: false
tags:
  mitre:
  - T1003.001
  categories:
  - endpoint
references:
- https://twitter.com/SBousseaden/status/1541920424635912196
- https://github.com/elastic/detection-rules/blob/2bc1795f3d7bcc3946452eb4f07ae799a756d94e/rules/windows/credential_access_lsass_handle_via_malseclogon.toml
- https://splintercod3.blogspot.com/p/the-hidden-side-of-seclogon-part-3.html
logsource:
  category: process_access
  product: windows
detection:
  selection:
    TargetImage|endswith: \lsass.exe
    SourceImage|endswith: \svchost.exe
    GrantedAccess: '0x14c0'
    CallTrace|contains: seclogon.dll
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 472159c5-31b9-4f56-b794-b766faa8b0a7
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_access/proc_access_win_lsass_seclogon_access.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
