id: sigmahq-sigma-52d097e2-063e-4c9c-8fbb-855c8948d135
name: Suspicious Windows Update Agent Empty Cmdline
description: Detects suspicious Windows Update Agent activity in which a wuauclt.exe
  process command line doesn't contain any command line flags
severity: high
enabled: false
tags:
  mitre:
  - T1036
  categories:
  - endpoint
references:
- https://redcanary.com/blog/blackbyte-ransomware/
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \Wuauclt.exe
  - OriginalFileName: Wuauclt.exe
  selection_cli:
    CommandLine|endswith:
    - Wuauclt
    - Wuauclt.exe
  condition: all of selection*
provenance:
  source: SigmaHQ/sigma
  source_id: 52d097e2-063e-4c9c-8fbb-855c8948d135
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_wuauclt_no_cli_flags_execution.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
