id: sigmahq-sigma-6b269392-9eba-40b5-acb6-55c882b20ba6
name: Suspicious File Drop by Exchange
description: Detects suspicious file type dropped by an Exchange component in IIS
severity: medium
enabled: false
tags:
  mitre:
  - T1190
  - T1505.003
  categories:
  - endpoint
references:
- https://www.microsoft.com/security/blog/2022/09/30/analyzing-attacks-using-the-exchange-vulnerabilities-cve-2022-41040-and-cve-2022-41082/
- https://www.gteltsc.vn/blog/canh-bao-chien-dich-tan-cong-su-dung-lo-hong-zero-day-tren-microsoft-exchange-server-12714.html
- https://en.gteltsc.vn/blog/cap-nhat-nhe-ve-lo-hong-bao-mat-0day-microsoft-exchange-dang-duoc-su-dung-de-tan-cong-cac-to-chuc-tai-viet-nam-9685.html
logsource:
  product: windows
  category: file_event
detection:
  selection:
    Image|endswith: \w3wp.exe
    CommandLine|contains: MSExchange
  selection_types:
    TargetFilename|endswith:
    - .aspx
    - .asp
    - .ashx
    - .ps1
    - .bat
    - .exe
    - .dll
    - .vbs
  condition: all of selection*
provenance:
  source: SigmaHQ/sigma
  source_id: 6b269392-9eba-40b5-acb6-55c882b20ba6
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_exchange_webshell_drop_suspicious.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
