id: sigmahq-sigma-d7eb979b-c2b5-4a6f-a3a7-c87ce6763819
name: Suspicious Control Panel DLL Load
description: Detects suspicious Rundll32 execution from control.exe as used by Equation
  Group and Exploit Kits
severity: high
enabled: false
tags:
  mitre:
  - T1218.011
  categories:
  - endpoint
references:
- https://twitter.com/rikvduijn/status/853251879320662017
- https://twitter.com/felixw3000/status/853354851128025088
logsource:
  category: process_creation
  product: windows
detection:
  selection_parent:
    ParentImage|endswith: \System32\control.exe
  selection_img:
  - Image|endswith: \rundll32.exe
  - OriginalFileName: RUNDLL32.EXE
  filter:
    CommandLine|contains: Shell32.dll
  condition: all of selection_* and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: d7eb979b-c2b5-4a6f-a3a7-c87ce6763819
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_rundll32_susp_control_dll_load.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
