id: sigmahq-sigma-c5c00f49-b3f9-45a6-997e-cfdecc6e1967
name: Suspicious Schtasks Execution AppData Folder
description: Detects the creation of a schtask that executes a file from C:\Users\<USER>\AppData\Local
severity: high
enabled: false
tags:
  mitre:
  - T1053.005
  - T1059.001
  categories:
  - endpoint
references:
- https://thedfirreport.com/2022/02/21/qbot-and-zerologon-lead-to-full-domain-compromise/
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image|endswith: \schtasks.exe
    CommandLine|contains|all:
    - /Create
    - /RU
    - /TR
    - C:\Users\
    - \AppData\Local\
    CommandLine|contains:
    - NT AUT
    - ' SYSTEM '
  filter:
    ParentImage|contains|all:
    - \AppData\Local\Temp\
    - TeamViewer_.exe
    Image|endswith: \schtasks.exe
    CommandLine|contains: /TN TVInstallRestore
  condition: selection and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: c5c00f49-b3f9-45a6-997e-cfdecc6e1967
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_schtasks_appdata_local_system.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
