id: sigmahq-sigma-ae7fbf8e-f3cb-49fd-8db4-5f3bed522c71
name: Suspicious PowerShell Invocations - Specific
description: Detects suspicious PowerShell invocation command parameters
severity: high
enabled: false
tags:
  mitre:
  - T1059.001
  categories:
  - endpoint
references:
- Internal Research
- https://github.com/HackTricks-wiki/hacktricks/blob/e4c7b21b8f36c97c35b7c622732b38a189ce18f7/src/windows-hardening/windows-local-privilege-escalation/privilege-escalation-with-autorun-binaries.md
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection_convert_b64:
    ScriptBlockText|contains|all:
    - -nop
    - ' -w '
    - hidden
    - ' -c '
    - '[Convert]::FromBase64String'
  selection_iex_selection:
    ScriptBlockText|contains|all:
    - ' -w '
    - hidden
    - -noni
    - -nop
    - ' -c '
    - iex
    - New-Object
  selection_enc_selection:
    ScriptBlockText|contains|all:
    - ' -w '
    - hidden
    - -ep
    - bypass
    - -Enc
  selection_reg_selection:
    ScriptBlockText|contains|all:
    - powershell
    - reg
    - add
    ScriptBlockText|contains:
    - \software\microsoft\windows\currentversion\run
    - \software\wow6432node\microsoft\windows\currentversion\run
    - \software\microsoft\windows\currentversion\policies\explorer\run
  selection_webclient_selection:
    ScriptBlockText|contains|all:
    - bypass
    - -noprofile
    - -windowstyle
    - hidden
    - new-object
    - system.net.webclient
    - .download
  selection_iex_webclient:
    ScriptBlockText|contains|all:
    - iex
    - New-Object
    - Net.WebClient
    - .Download
  filter_chocolatey:
    ScriptBlockText|contains:
    - (New-Object System.Net.WebClient).DownloadString('https://community.chocolatey.org/install.ps1
    - (New-Object System.Net.WebClient).DownloadString('https://chocolatey.org/install.ps1')
    - Write-ChocolateyWarning
  condition: 1 of selection_* and not 1 of filter_*
provenance:
  source: SigmaHQ/sigma
  source_id: ae7fbf8e-f3cb-49fd-8db4-5f3bed522c71
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_susp_invocation_specific.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
