id: sigmahq-sigma-62120148-6b7a-42be-8b91-271c04e281a3
name: Suspicious Camera and Microphone Access
description: Detects Processes accessing the camera and microphone from suspicious
  folder
severity: high
enabled: false
tags:
  mitre:
  - T1125
  - T1123
  categories:
  - endpoint
references:
- https://medium.com/@7a616368/can-you-track-processes-accessing-the-camera-and-microphone-7e6885b37072
logsource:
  category: registry_event
  product: windows
detection:
  selection_1:
    TargetObject|contains|all:
    - \Software\Microsoft\Windows\CurrentVersion\CapabilityAccessManager\ConsentStore\
    - \NonPackaged
  selection_2:
    TargetObject|contains:
    - microphone
    - webcam
  selection_3:
    TargetObject|contains:
    - :#Windows#Temp#
    - :#$Recycle.bin#
    - :#Temp#
    - :#Users#Public#
    - :#Users#Default#
    - :#Users#Desktop#
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 62120148-6b7a-42be-8b91-271c04e281a3
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_event/registry_event_susp_mic_cam_access.yml
falsepositives:
- Unlikely, there could be conferencing software running from a Temp folder accessing
  the devices
notes:
  quarantine_reason: 'upstream status: test'
