id: sigmahq-sigma-5e3cc4d8-3e68-43db-8656-eaaeefdec9cc
name: Suspicious Invoke-WebRequest Execution
description: Detects a suspicious call to Invoke-WebRequest cmdlet where the and output
  is located in a suspicious location
severity: high
enabled: false
tags:
  mitre:
  - T1105
  categories:
  - endpoint
references:
- https://www.sentinelone.com/blog/living-off-windows-defender-lockbit-ransomware-sideloads-cobalt-strike-through-microsoft-security-tool/
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - \powershell_ise.exe
    - \powershell.exe
    - \pwsh.exe
  - OriginalFileName:
    - powershell_ise.EXE
    - PowerShell.EXE
    - pwsh.dll
  selection_commands:
    CommandLine|contains:
    - 'curl '
    - Invoke-WebRequest
    - 'iwr '
    - 'wget '
  selection_flags:
    CommandLine|contains:
    - ' -ur'
    - ' -o'
  selection_susp_locations:
    CommandLine|contains:
    - \AppData\
    - \Desktop\
    - \Temp\
    - \Users\Public\
    - '%AppData%'
    - '%Public%'
    - '%Temp%'
    - '%tmp%'
    - :\Windows\
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 5e3cc4d8-3e68-43db-8656-eaaeefdec9cc
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_powershell_invoke_webrequest_download.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
