id: sigmahq-sigma-95eadcb2-92e4-4ed1-9031-92547773a6db
name: Suspicious PowerShell Invocation From Script Engines
description: Detects suspicious powershell invocations from interpreters or unusual
  programs
severity: medium
enabled: false
tags:
  mitre:
  - T1059.001
  categories:
  - endpoint
references:
- https://www.securitynewspaper.com/2017/03/20/attackers-leverage-excel-powershell-dns-latest-non-malware-attack/
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage|endswith:
    - \wscript.exe
    - \cscript.exe
    Image|endswith:
    - \powershell.exe
    - \pwsh.exe
  filter_health_service:
    CurrentDirectory|contains: \Health Service State\
  condition: selection and not 1 of filter_*
provenance:
  source: SigmaHQ/sigma
  source_id: 95eadcb2-92e4-4ed1-9031-92547773a6db
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_powershell_script_engine_parent.yml
falsepositives:
- Microsoft Operations Manager (MOM)
- Other scripts
notes:
  quarantine_reason: 'upstream status: test'
