id: sigmahq-sigma-e1693bc8-7168-4eab-8718-cdcaa68a1738
name: Suspicious WMIC Execution Via Office Process
description: Office application called wmic to proxye execution through a LOLBIN process.
  This is often used to break suspicious parent-child chain (Office app spawns LOLBin).
severity: high
enabled: false
tags:
  mitre:
  - T1204.002
  - T1047
  - T1218.010
  categories:
  - endpoint
references:
- https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware/
- https://github.com/vadim-hunter/Detection-Ideas-Rules/blob/02bcbfc2bfb8b4da601bb30de0344ae453aa1afe/Threat%20Intelligence/The%20DFIR%20Report/20210329_Sodinokibi_(aka_REvil)_Ransomware.yaml
logsource:
  product: windows
  category: process_creation
detection:
  selection_parent:
    ParentImage|endswith:
    - \WINWORD.EXE
    - \EXCEL.EXE
    - \POWERPNT.exe
    - \MSPUB.exe
    - \VISIO.exe
    - \MSACCESS.EXE
    - \EQNEDT32.EXE
    - \ONENOTE.EXE
    - \wordpad.exe
    - \wordview.exe
  selection_wmic_img:
  - Image|endswith: \wbem\WMIC.exe
  - OriginalFileName: wmic.exe
  selection_wmic_cli:
    CommandLine|contains|all:
    - process
    - create
    - call
    CommandLine|contains:
    - regsvr32
    - rundll32
    - msiexec
    - mshta
    - verclsid
    - wscript
    - cscript
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: e1693bc8-7168-4eab-8718-cdcaa68a1738
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_wmic_susp_execution_via_office_process.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
