id: sigmahq-sigma-7a74da6b-ea76-47db-92cc-874ad90df734
name: Suspicious MSDT Parent Process
description: Detects msdt.exe executed by a suspicious parent as seen in CVE-2022-30190
  / Follina exploitation
severity: high
enabled: false
tags:
  mitre:
  - T1036
  - T1218
  categories:
  - endpoint
references:
- https://twitter.com/nao_sec/status/1530196847679401984
- https://app.any.run/tasks/713f05d2-fe78-4b9d-a744-f7c133e3fafb/
logsource:
  category: process_creation
  product: windows
detection:
  selection_parent:
    ParentImage|endswith:
    - \cmd.exe
    - \cscript.exe
    - \mshta.exe
    - \powershell.exe
    - \pwsh.exe
    - \regsvr32.exe
    - \rundll32.exe
    - \schtasks.exe
    - \wmic.exe
    - \wscript.exe
    - \wsl.exe
  selection_msdt:
  - Image|endswith: \msdt.exe
  - OriginalFileName: msdt.exe
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 7a74da6b-ea76-47db-92cc-874ad90df734
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_msdt_susp_parent.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
