id: sigmahq-sigma-bb76d96b-821c-47cf-944b-7ce377864492
name: Suspicious NTLM Authentication on the Printer Spooler Service
description: Detects a privilege elevation attempt by coercing NTLM authentication
  on the Printer Spooler service
severity: high
enabled: false
tags:
  mitre:
  - T1212
  categories:
  - endpoint
references:
- https://twitter.com/med0x2e/status/1520402518685200384
- https://github.com/elastic/detection-rules/blob/dd224fb3f81d0b4bf8593c5f02a029d647ba2b2d/rules/windows/credential_access_relay_ntlm_auth_via_http_spoolss.toml
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \rundll32.exe
  - OriginalFileName: RUNDLL32.EXE
  selection_cli:
    CommandLine|contains|all:
    - C:\windows\system32\davclnt.dll,DavSetCookie
    - http
    CommandLine|contains:
    - spoolss
    - srvsvc
    - /print/pipe/
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: bb76d96b-821c-47cf-944b-7ce377864492
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_rundll32_ntlmrelay.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
