id: sigmahq-sigma-9637e8a5-7131-4f7f-bdc7-2b05d8670c43
name: Suspicious File Characteristics Due to Missing Fields
description: Detects Executables in the Downloads folder without FileVersion,Description,Product,Company
  likely created with py2exe
severity: medium
enabled: false
tags:
  mitre:
  - T1059.006
  categories:
  - endpoint
references:
- https://securelist.com/muddywater/88059/
- https://www.virustotal.com/#/file/276a765a10f98cda1a38d3a31e7483585ca3722ecad19d784441293acf1b7beb/detection
logsource:
  product: windows
  category: process_creation
detection:
  selection1:
    Description: \?
    FileVersion: \?
  selection2:
    Description: \?
    Product: \?
  selection3:
    Description: \?
    Company: \?
  folder:
    Image|contains: \Downloads\
  condition: (selection1 or selection2 or selection3) and folder
provenance:
  source: SigmaHQ/sigma
  source_id: 9637e8a5-7131-4f7f-bdc7-2b05d8670c43
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_susp_file_characteristics.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
