id: sigmahq-sigma-2aa1440c-9ae9-4d92-84a7-a9e5f5e31695
name: Suspicious Activity in Shell Commands
description: Detects suspicious shell commands used in various exploit codes (see
  references)
severity: high
enabled: false
tags:
  mitre:
  - T1059.004
  categories:
  - endpoint
references:
- https://web.archive.org/web/20170319121015/http://www.threatgeek.com/2017/03/widespread-exploitation-attempts-using-cve-2017-5638.html
- https://github.com/rapid7/metasploit-framework/blob/eb6535009f5fdafa954525687f09294918b5398d/modules/exploits/multi/http/struts_code_exec_exception_delegator.rb
- http://pastebin.com/FtygZ1cg
- https://artkond.com/2017/03/23/pivoting-guide/
logsource:
  product: linux
detection:
  keywords:
  - wget * - http* | perl
  - wget * - http* | sh
  - wget * - http* | bash
  - python -m SimpleHTTPServer
  - -m http.server
  - import pty; pty.spawn*
  - socat exec:*
  - socat -O /tmp/*
  - socat tcp-connect*
  - '*echo binary >>*'
  - '*wget *; chmod +x*'
  - '*wget *; chmod 777 *'
  - '*cd /tmp || cd /var/run || cd /mnt*'
  - '*stop;service iptables stop;*'
  - '*stop;SuSEfirewall2 stop;*'
  - chmod 777 2020*
  - '*>>/etc/rc.local'
  - '*base64 -d /tmp/*'
  - '* | base64 -d *'
  - '*/chmod u+s *'
  - '*chmod +s /tmp/*'
  - '*chmod u+s /tmp/*'
  - '* /tmp/haxhax*'
  - '* /tmp/ns_sploit*'
  - nc -l -p *
  - cp /bin/ksh *
  - cp /bin/sh *
  - '* /tmp/*.b64 *'
  - '*/tmp/ysocereal.jar*'
  - '*/tmp/x *'
  - '*; chmod +x /tmp/*'
  - '*;chmod +x /tmp/*'
  condition: keywords
provenance:
  source: SigmaHQ/sigma
  source_id: 2aa1440c-9ae9-4d92-84a7-a9e5f5e31695
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/builtin/lnx_shell_susp_commands.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
