id: sigmahq-sigma-b9d9cc83-380b-4ba3-8d8f-60c0e7e2930c
name: Suspicious PowerShell Encoded Command Patterns
description: Detects PowerShell command line patterns in combincation with encoded
  commands that often appear in malware infection chains
severity: high
enabled: false
tags:
  mitre:
  - T1059.001
  categories:
  - endpoint
references:
- https://app.any.run/tasks/b9040c63-c140-479b-ad59-f1bb56ce7a97/
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - \powershell.exe
    - \pwsh.exe
  - OriginalFileName:
    - PowerShell.Exe
    - pwsh.dll
  selection_flags:
    CommandLine|contains:
    - ' -e '
    - ' -en '
    - ' -enc '
    - ' -enco'
  selection_encoded:
    CommandLine|contains:
    - ' JAB'
    - ' SUVYI'
    - ' SQBFAFgA'
    - ' aWV4I'
    - ' IAB'
    - ' PAA'
    - ' aQBlAHgA'
  filter_gcworker:
    ParentImage|contains:
    - C:\Packages\Plugins\Microsoft.GuestConfiguration.ConfigurationforWindows\
    - \gc_worker.exe
  condition: all of selection_* and not 1 of filter_*
provenance:
  source: SigmaHQ/sigma
  source_id: b9d9cc83-380b-4ba3-8d8f-60c0e7e2930c
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_powershell_base64_encoded_cmd_patterns.yml
falsepositives:
- Other tools that work with encoded scripts in the command line instead of script
  files
notes:
  quarantine_reason: 'upstream status: test'
