id: sigmahq-sigma-8d85cf08-bf97-4260-ba49-986a2a65129c
name: Suspicious PowerShell In Registry Run Keys
description: Detects potential PowerShell commands or code within registry run keys
severity: medium
enabled: false
tags:
  mitre:
  - T1547.001
  categories:
  - endpoint
references:
- https://github.com/frack113/atomic-red-team/blob/a9051c38de8a5320b31c7039efcbd3b56cf2d65a/atomics/T1547.001/T1547.001.md#atomic-test-9---systembc-malware-as-a-service-registry
- https://www.trendmicro.com/en_us/research/22/j/lv-ransomware-exploits-proxyshell-in-attack.html
- https://github.com/HackTricks-wiki/hacktricks/blob/e4c7b21b8f36c97c35b7c622732b38a189ce18f7/src/windows-hardening/windows-local-privilege-escalation/privilege-escalation-with-autorun-binaries.md
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains:
    - \Software\Microsoft\Windows\CurrentVersion\Run
    - \Software\WOW6432Node\Microsoft\Windows\CurrentVersion\Run
    - \Software\Microsoft\Windows\CurrentVersion\Policies\Explorer\Run
    Details|contains:
    - powershell
    - 'pwsh '
    - FromBase64String
    - .DownloadFile(
    - .DownloadString(
    - ' -w hidden '
    - ' -w 1 '
    - -windowstyle hidden
    - -window hidden
    - ' -nop '
    - ' -encodedcommand '
    - -ExecutionPolicy Bypass
    - Invoke-Expression
    - IEX (
    - Invoke-Command
    - ICM -
    - Invoke-WebRequest
    - 'IWR '
    - Invoke-RestMethod
    - 'IRM '
    - ' -noni '
    - ' -noninteractive '
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 8d85cf08-bf97-4260-ba49-986a2a65129c
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_powershell_in_run_keys.yml
falsepositives:
- Legitimate admin or third party scripts. Baseline according to your environment
notes:
  quarantine_reason: 'upstream status: test'
