id: sigmahq-sigma-3c89a1e8-0fba-449e-8f1b-8409d6267ec8
name: Suspicious Process Created Via Wmic.EXE
description: Detects WMIC executing "process call create" with suspicious calls to
  processes such as "rundll32", "regsrv32", etc.
severity: high
enabled: false
tags:
  mitre:
  - T1047
  categories:
  - endpoint
references:
- https://thedfirreport.com/2020/10/08/ryuks-return/
- https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/ransomware-hive-conti-avoslocker
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains|all:
    - 'process '
    - 'call '
    - 'create '
    CommandLine|contains:
    - rundll32
    - bitsadmin
    - regsvr32
    - 'cmd.exe /c '
    - 'cmd.exe /k '
    - 'cmd.exe /r '
    - 'cmd /c '
    - 'cmd /k '
    - 'cmd /r '
    - powershell
    - pwsh
    - certutil
    - cscript
    - wscript
    - mshta
    - \Users\Public\
    - \Windows\Temp\
    - \AppData\Local\
    - '%temp%'
    - '%tmp%'
    - '%ProgramData%'
    - '%appdata%'
    - '%comspec%'
    - '%localappdata%'
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 3c89a1e8-0fba-449e-8f1b-8409d6267ec8
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_wmic_susp_process_creation.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
