id: sigmahq-sigma-ae215552-081e-44c7-805f-be16f975c8a2
name: Suspicious Debugger Registration Cmdline
description: Detects the registration of a debugger for a program that is available
  in the logon screen (sticky key backdoor).
severity: high
enabled: false
tags:
  mitre:
  - T1546.008
  categories:
  - endpoint
references:
- https://blogs.technet.microsoft.com/jonathantrull/2016/10/03/detecting-sticky-key-backdoors/
- https://bazaar.abuse.ch/sample/6f3aa9362d72e806490a8abce245331030d1ab5ac77e400dd475748236a6cc81/
logsource:
  category: process_creation
  product: windows
detection:
  selection1:
    CommandLine|contains: \CurrentVersion\Image File Execution Options\
  selection2:
    CommandLine|contains:
    - sethc.exe
    - utilman.exe
    - osk.exe
    - magnify.exe
    - narrator.exe
    - displayswitch.exe
    - atbroker.exe
    - HelpPane.exe
  condition: all of selection*
provenance:
  source: SigmaHQ/sigma
  source_id: ae215552-081e-44c7-805f-be16f975c8a2
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_registry_install_reg_debugger_backdoor.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
