id: sigmahq-sigma-5b768e71-86f2-4879-b448-81061cbae951
name: Suspicious Manipulation Of Default Accounts Via Net.EXE
description: Detects suspicious manipulations of default accounts such as 'administrator'
  and 'guest'. For example 'enable' or 'disable' accounts or change the password...etc
severity: high
enabled: false
tags:
  mitre:
  - T1560.001
  categories:
  - endpoint
references:
- https://www.trellix.com/en-sg/about/newsroom/stories/threat-labs/lockergoga-ransomware-family-used-in-targeted-attacks.html
- https://redacted.com/blog/bianlian-ransomware-gang-gives-it-a-go/
- https://www.microsoft.com/security/blog/2022/09/07/profiling-dev-0270-phosphorus-ransomware-operations/
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - \net.exe
    - \net1.exe
  - OriginalFileName:
    - net.exe
    - net1.exe
  selection_user_option:
    CommandLine|contains: ' user '
  selection_username:
    CommandLine|contains:
    - ' Järjestelmänvalvoja '
    - ' Rendszergazda '
    - ' Администратор '
    - ' Administrateur '
    - ' Administrador '
    - ' Administratör '
    - ' Administrator '
    - ' guest '
    - ' DefaultAccount '
    - ' "Järjestelmänvalvoja" '
    - ' "Rendszergazda" '
    - ' "Администратор" '
    - ' "Administrateur" '
    - ' "Administrador" '
    - ' "Administratör" '
    - ' "Administrator" '
    - ' "guest" '
    - ' "DefaultAccount" '
    - ' ''Järjestelmänvalvoja'' '
    - ' ''Rendszergazda'' '
    - ' ''Администратор'' '
    - ' ''Administrateur'' '
    - ' ''Administrador'' '
    - ' ''Administratör'' '
    - ' ''Administrator'' '
    - ' ''guest'' '
    - ' ''DefaultAccount'' '
  filter:
    CommandLine|contains|all:
    - guest
    - /active no
  condition: all of selection_* and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: 5b768e71-86f2-4879-b448-81061cbae951
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_net_user_default_accounts_manipulation.yml
falsepositives:
- Some false positives could occur with the admin or guest account. It depends on
  the scripts being used by the admins in your env. If you experience a lot of FP
  you could reduce the level to medium
notes:
  quarantine_reason: 'upstream status: test'
