id: sigmahq-sigma-7280c9f3-a5af-45d0-916a-bc01cb4151c9
name: Suspicious MSExchangeMailboxReplication ASPX Write
description: Detects suspicious activity in which the MSExchangeMailboxReplication
  process writes .asp and .apsx files to disk, which could be a sign of ProxyShell
  exploitation
severity: high
enabled: false
tags:
  mitre:
  - T1190
  - T1505.003
  categories:
  - endpoint
references:
- https://redcanary.com/blog/blackbyte-ransomware/
logsource:
  product: windows
  category: file_event
detection:
  selection:
    Image|endswith: \MSExchangeMailboxReplication.exe
    TargetFilename|endswith:
    - .aspx
    - .asp
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 7280c9f3-a5af-45d0-916a-bc01cb4151c9
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_susp_exchange_aspx_write.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
