id: sigmahq-sigma-9976fa64-2804-423c-8a5b-646ade840773
name: Suspicious Outbound SMTP Connections
description: 'Adversaries may steal data by exfiltrating it over an un-encrypted network
  protocol other than that of the existing command and control channel.

  The data may also be sent to an alternate network location from the main command
  and control server.'
severity: medium
enabled: false
tags:
  mitre:
  - T1048.003
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1048.003/T1048.003.md#atomic-test-5---exfiltration-over-alternative-protocol---smtp
- https://www.ietf.org/rfc/rfc2821.txt
logsource:
  category: network_connection
  product: windows
detection:
  selection:
    DestinationPort:
    - 25
    - 587
    - 465
    - 2525
    Initiated: 'true'
  filter_clients:
    Image|endswith:
    - \thunderbird.exe
    - \outlook.exe
  filter_mailserver:
    Image|startswith: C:\Program Files\Microsoft\Exchange Server\
  filter_outlook:
    Image|startswith: C:\Program Files\WindowsApps\microsoft.windowscommunicationsapps_
    Image|endswith: \HxTsr.exe
  condition: selection and not 1 of filter_*
provenance:
  source: SigmaHQ/sigma
  source_id: 9976fa64-2804-423c-8a5b-646ade840773
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/network_connection/net_connection_win_susp_outbound_smtp_connections.yml
falsepositives:
- Other SMTP tools
notes:
  quarantine_reason: 'upstream status: test'
