id: sigmahq-sigma-2d32dd6f-3196-4093-b9eb-1ad8ab088ca5
name: Suspicious Response File Execution Via Odbcconf.EXE
description: Detects execution of "odbcconf" with the "-f" flag in order to load a
  response file with a non-".rsp" extension.
severity: high
enabled: false
tags:
  mitre:
  - T1218.008
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/sql/odbc/odbcconf-exe?view=sql-server-ver16
- https://lolbas-project.github.io/lolbas/Binaries/Odbcconf/
- https://www.trendmicro.com/en_us/research/17/h/backdoor-carrying-emails-set-sights-on-russian-speaking-businesses.html
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \odbcconf.exe
  - OriginalFileName: odbcconf.exe
  selection_cli:
    CommandLine|contains|windash: ' -f '
  filter_main_rsp_ext:
    CommandLine|contains: .rsp
  filter_main_runonce_odbc:
    ParentImage: C:\Windows\System32\runonce.exe
    Image: C:\Windows\System32\odbcconf.exe
    CommandLine|contains: .exe /E /F "C:\WINDOWS\system32\odbcconf.tmp"
  condition: all of selection_* and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 2d32dd6f-3196-4093-b9eb-1ad8ab088ca5
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_odbcconf_response_file_susp.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
