id: sigmahq-sigma-5e6a80c8-2d45-4633-9ef4-fa2671a39c5c
name: Suspicious Parent Double Extension File Execution
description: Detect execution of suspicious double extension files in ParentCommandLine
severity: high
enabled: false
tags:
  mitre:
  - T1036.007
  categories:
  - endpoint
references:
- https://www.virustotal.com/gui/file/7872d8845a332dce517adae9c3389fde5313ff2fed38c2577f3b498da786db68/behavior
- https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/bluebottle-banks-targeted-africa
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - ParentImage|endswith:
    - .doc.lnk
    - .docx.lnk
    - .xls.lnk
    - .xlsx.lnk
    - .ppt.lnk
    - .pptx.lnk
    - .rtf.lnk
    - .pdf.lnk
    - .txt.lnk
    - .doc.js
    - .docx.js
    - .xls.js
    - .xlsx.js
    - .ppt.js
    - .pptx.js
    - .rtf.js
    - .pdf.js
    - .txt.js
  - ParentCommandLine|contains:
    - .doc.lnk
    - .docx.lnk
    - .xls.lnk
    - .xlsx.lnk
    - .ppt.lnk
    - .pptx.lnk
    - .rtf.lnk
    - .pdf.lnk
    - .txt.lnk
    - .doc.js
    - .docx.js
    - .xls.js
    - .xlsx.js
    - .ppt.js
    - .pptx.js
    - .rtf.js
    - .pdf.js
    - .txt.js
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 5e6a80c8-2d45-4633-9ef4-fa2671a39c5c
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_susp_double_extension_parent.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
