id: sigmahq-sigma-df69cb1d-b891-4cd9-90c7-d617d90100ce
name: Suspicious FromBase64String Usage On Gzip Archive - Ps Script
description: Detects attempts of decoding a base64 Gzip archive in a PowerShell script.
  This technique is often used as a method to load malicious content into memory afterward.
severity: medium
enabled: false
tags:
  mitre:
  - T1132.001
  categories:
  - endpoint
references:
- https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=43
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection:
    ScriptBlockText|contains|all:
    - FromBase64String
    - MemoryStream
    - H4sI
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: df69cb1d-b891-4cd9-90c7-d617d90100ce
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_frombase64string_archive.yml
falsepositives:
- Legitimate administrative script
notes:
  quarantine_reason: 'upstream status: test'
