id: sigmahq-sigma-554601fb-9b71-4bcc-abf4-21a611be4fde
name: Suspicious Recursive Takeown
description: Adversaries can interact with the DACLs using built-in Windows commands
  takeown which can grant adversaries higher permissions on specific files and folders
severity: medium
enabled: false
tags:
  mitre:
  - T1222.001
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/takeown
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1222.001/T1222.001.md#atomic-test-1---take-ownership-using-takeown-utility
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: \takeown.exe
    CommandLine|contains|all:
    - '/f '
    - /r
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 554601fb-9b71-4bcc-abf4-21a611be4fde
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_takeown_recursive_own.yml
falsepositives:
- Scripts created by developers and admins
- Administrative activity
notes:
  quarantine_reason: 'upstream status: test'
