id: sigmahq-sigma-4a2a2c3e-209f-4d01-b513-4155a540b469
name: Suspicious MsiExec Embedding Parent
description: Adversaries may abuse msiexec.exe to proxy the execution of malicious
  payloads
severity: medium
enabled: false
tags:
  mitre:
  - T1218.007
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218.007/T1218.007.md
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image|endswith:
    - \powershell.exe
    - \pwsh.exe
    - \cmd.exe
    ParentCommandLine|contains|all:
    - MsiExec.exe
    - '-Embedding '
  filter_splunk_ufw:
    Image|endswith: :\Windows\System32\cmd.exe
    CommandLine|contains: C:\Program Files\SplunkUniversalForwarder\bin\
  filter_vs:
  - CommandLine|contains: \DismFoDInstall.cmd
  - ParentCommandLine|contains|all:
    - '\MsiExec.exe -Embedding '
    - Global\MSI0000
  condition: selection and not 1 of filter*
provenance:
  source: SigmaHQ/sigma
  source_id: 4a2a2c3e-209f-4d01-b513-4155a540b469
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_msiexec_embedding.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
