id: sigmahq-sigma-403c2cc0-7f6b-4925-9423-bfa573bed7eb
name: Suspicious PowerShell Download - Powershell Script
description: Detects suspicious PowerShell download command
severity: medium
enabled: false
tags:
  mitre:
  - T1059.001
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/dotnet/api/system.net.webclient.downloadstring?view=net-8.0
- https://learn.microsoft.com/en-us/dotnet/api/system.net.webclient.downloadfile?view=net-8.0
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  webclient:
    ScriptBlockText|contains: System.Net.WebClient
  download:
    ScriptBlockText|contains:
    - .DownloadFile(
    - .DownloadFileAsync(
    - .DownloadString(
    - .DownloadStringAsync(
  condition: webclient and download
provenance:
  source: SigmaHQ/sigma
  source_id: 403c2cc0-7f6b-4925-9423-bfa573bed7eb
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_susp_download.yml
falsepositives:
- PowerShell scripts that download content from the Internet
notes:
  quarantine_reason: 'upstream status: test'
