id: sigmahq-sigma-e3818659-5016-4811-a73c-dde4679169d2
name: Suspicious Computer Machine Password by PowerShell
description: 'The Reset-ComputerMachinePassword cmdlet changes the computer account
  password that the computers use to authenticate to the domain controllers in the
  domain.

  You can use it to reset the password of the local computer.'
severity: medium
enabled: false
tags:
  mitre:
  - T1078
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/powershell/module/microsoft.powershell.management/reset-computermachinepassword?view=powershell-5.1
- https://thedfirreport.com/2022/02/21/qbot-and-zerologon-lead-to-full-domain-compromise/
logsource:
  product: windows
  category: ps_module
  definition: 0ad03ef1-f21b-4a79-8ce8-e6900c54b65b
detection:
  selection:
    ContextInfo|contains: Reset-ComputerMachinePassword
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: e3818659-5016-4811-a73c-dde4679169d2
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_module/posh_pm_susp_reset_computermachinepassword.yml
falsepositives:
- Administrator PowerShell scripts
notes:
  quarantine_reason: 'upstream status: test'
