id: sigmahq-sigma-6f4191bb-912b-48a8-9ce7-682769541e6d
name: Suspicious Msiexec Execute Arbitrary DLL
description: 'Adversaries may abuse msiexec.exe to proxy execution of malicious payloads.

  Msiexec.exe is the command-line utility for the Windows Installer and is thus commonly
  associated with executing installation packages (.msi)'
severity: medium
enabled: false
tags:
  mitre:
  - T1218.007
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/msiexec
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218.007/T1218.007.md
- https://twitter.com/_st0pp3r_/status/1583914515996897281
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: \msiexec.exe
    CommandLine|contains|windash: ' /Y'
  filter_main_legit_path:
    CommandLine|contains:
    - \MsiExec.exe" /Y "C:\Program Files\
    - \MsiExec.exe" /Y "C:\Program Files (x86)\
    - \MsiExec.exe" /Y "C:\Windows\System32\
    - \MsiExec.exe" /Y "C:\Windows\SysWOW64\
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 6f4191bb-912b-48a8-9ce7-682769541e6d
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_msiexec_execute_dll.yml
falsepositives:
- Legitimate script
notes:
  quarantine_reason: 'upstream status: test'
