id: sigmahq-sigma-b5aa7d60-c17e-4538-97de-09029d6cd76b
name: Suspicious Digital Signature Of AppX Package
description: Detects execution of AppX packages with known suspicious or malicious
  signature
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- Internal Research
- https://www.sentinelone.com/labs/inside-malicious-windows-apps-for-malware-deployment/
logsource:
  product: windows
  service: appxpackaging-om
detection:
  selection:
    EventID: 157
    subjectName: CN=Foresee Consulting Inc., O=Foresee Consulting Inc., L=North York,
      S=Ontario, C=CA, SERIALNUMBER=1004913-1, OID.1.3.6.1.4.1.311.60.2.1.3=CA, OID.2.5.4.15=Private
      Organization
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: b5aa7d60-c17e-4538-97de-09029d6cd76b
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/appxpackaging_om/win_appxpackaging_om_sups_appx_signature.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
