id: sigmahq-sigma-286b47ed-f6fe-40b3-b3a8-35129acd43bc
name: Suspicious Access to Sensitive File Extensions - Zeek
description: Detects known sensitive file extensions via Zeek
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- Internal Research
logsource:
  product: zeek
  service: smb_files
detection:
  selection:
    name|endswith:
    - .pst
    - .ost
    - .msg
    - .nst
    - .oab
    - .edb
    - .nsf
    - .bak
    - .dmp
    - .kirbi
    - .rdp
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 286b47ed-f6fe-40b3-b3a8-35129acd43bc
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/network/zeek/zeek_smb_converted_win_susp_raccess_sensitive_fext.yml
falsepositives:
- Help Desk operator doing backup or re-imaging end user machine or backup software
- Users working with these data types or exchanging message files
notes:
  quarantine_reason: 'upstream status: test'
