id: sigmahq-sigma-0fc35fc3-efe6-4898-8a37-0b233339524f
name: Suspicious ScreenSave Change by Reg.exe
description: 'Adversaries may establish persistence by executing malicious content
  triggered by user inactivity.

  Screensavers are programs that execute after a configurable time of user inactivity
  and consist of Portable Executable (PE) files with a .scr file extension'
severity: medium
enabled: false
tags:
  mitre:
  - T1546.002
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1546.002/T1546.002.md
- https://www.welivesecurity.com/wp-content/uploads/2017/08/eset-gazer.pdf
logsource:
  category: process_creation
  product: windows
detection:
  selection_reg:
    Image|endswith: \reg.exe
    CommandLine|contains:
    - HKEY_CURRENT_USER\Control Panel\Desktop
    - HKCU\Control Panel\Desktop
  selection_option_1:
    CommandLine|contains|all:
    - /v ScreenSaveActive
    - /t REG_SZ
    - /d 1
    - /f
  selection_option_2:
    CommandLine|contains|all:
    - /v ScreenSaveTimeout
    - /t REG_SZ
    - '/d '
    - /f
  selection_option_3:
    CommandLine|contains|all:
    - /v ScreenSaverIsSecure
    - /t REG_SZ
    - /d 0
    - /f
  selection_option_4:
    CommandLine|contains|all:
    - /v SCRNSAVE.EXE
    - /t REG_SZ
    - '/d '
    - .scr
    - /f
  condition: selection_reg and 1 of selection_option_*
provenance:
  source: SigmaHQ/sigma
  source_id: 0fc35fc3-efe6-4898-8a37-0b233339524f
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_reg_screensaver.yml
falsepositives:
- GPO
notes:
  quarantine_reason: 'upstream status: test'
