id: sigmahq-sigma-77946e79-97f1-45a2-84b4-f37b5c0d8682
name: Suspicious Registry Modification From ADS Via Regini.EXE
description: Detects the import of an alternate data stream with regini.exe, regini.exe
  can be used to modify registry keys.
severity: high
enabled: false
tags:
  mitre:
  - T1112
  categories:
  - endpoint
references:
- https://lolbas-project.github.io/lolbas/Binaries/Regini/
- https://gist.github.com/api0cradle/cdd2d0d0ec9abb686f0e89306e277b8f
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/regini
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \regini.exe
  - OriginalFileName: REGINI.EXE
  selection_re:
    CommandLine|re: :[^ \\]
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 77946e79-97f1-45a2-84b4-f37b5c0d8682
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_regini_ads.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
