id: sigmahq-sigma-aa3a6f94-890e-4e22-b634-ffdfd54792cc
name: Suspicious Binary In User Directory Spawned From Office Application
description: Detects an executable in the users directory started from one of the
  Microsoft Office suite applications (Word, Excel, PowerPoint, Publisher, Visio)
severity: high
enabled: false
tags:
  mitre:
  - T1204.002
  categories:
  - endpoint
references:
- https://blog.morphisec.com/fin7-not-finished-morphisec-spots-new-campaign
- https://www.virustotal.com/gui/file/23160972c6ae07f740800fa28e421a81d7c0ca5d5cab95bc082b4a986fbac57
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage|endswith:
    - \WINWORD.EXE
    - \EXCEL.EXE
    - \POWERPNT.exe
    - \MSPUB.exe
    - \VISIO.exe
    - \MSACCESS.exe
    - \EQNEDT32.exe
    Image|startswith: C:\users\
    Image|endswith: .exe
  filter:
    Image|endswith: \Teams.exe
  condition: selection and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: aa3a6f94-890e-4e22-b634-ffdfd54792cc
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_office_spawn_exe_from_users_directory.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
