id: sigmahq-sigma-22d80745-6f2c-46da-826b-77adaededd74
name: Suspicious Service DACL Modification Via Set-Service Cmdlet - PS
description: Detects usage of the "Set-Service" powershell cmdlet to configure a new
  SecurityDescriptor that allows a service to be hidden from other utilities such
  as "sc.exe", "Get-Service"...etc. (Works only in powershell 7)
severity: high
enabled: false
tags:
  mitre:
  - T1574.011
  categories:
  - endpoint
references:
- https://twitter.com/Alh4zr3d/status/1580925761996828672
- https://learn.microsoft.com/en-us/powershell/module/microsoft.powershell.management/set-service?view=powershell-7.2
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection_sddl_flag:
    ScriptBlockText|contains:
    - '-SecurityDescriptorSddl '
    - '-sd '
  selection_set_service:
    ScriptBlockText|contains|all:
    - 'Set-Service '
    - D;;
    ScriptBlockText|contains:
    - ;;;IU
    - ;;;SU
    - ;;;BA
    - ;;;SY
    - ;;;WD
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 22d80745-6f2c-46da-826b-77adaededd74
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_susp_service_dacl_modification_set_service.yml
falsepositives:
- Rare intended use of hidden services
- Rare FP could occur due to the non linearity of the ScriptBlockText log
notes:
  quarantine_reason: 'upstream status: test'
