id: sigmahq-sigma-16c37b52-b141-42a5-a3ea-bbe098444397
name: Suspect Svchost Activity
description: It is extremely abnormal for svchost.exe to spawn without any CLI arguments
  and is normally observed when a malicious process spawns the process and injects
  code into the process memory space.
severity: high
enabled: false
tags:
  mitre:
  - T1055
  categories:
  - endpoint
references:
- https://web.archive.org/web/20180718061628/https://securitybytes.io/blue-team-fundamentals-part-two-windows-processes-759fe15965e2
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|endswith: svchost.exe
    Image|endswith: \svchost.exe
  filter:
  - ParentImage|endswith:
    - \rpcnet.exe
    - \rpcnetp.exe
  - CommandLine: null
  condition: selection and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: 16c37b52-b141-42a5-a3ea-bbe098444397
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_svchost_execution_with_no_cli_flags.yml
falsepositives:
- Rpcnet.exe / rpcnetp.exe which is a lojack style software. https://www.blackhat.com/docs/us-14/materials/us-14-Kamlyuk-Kamluk-Computrace-Backdoor-Revisited.pdf
notes:
  quarantine_reason: 'upstream status: test'
