id: sigmahq-sigma-377f33a1-4b36-4ee1-acee-1dbe4b43cfbe
name: Suspicious VSFTPD Error Messages
description: Detects suspicious VSFTPD error messages that indicate a fatal or suspicious
  error that could be caused by exploiting attempts
severity: medium
enabled: false
tags:
  mitre:
  - T1190
  categories:
  - endpoint
references:
- https://github.com/dagwieers/vsftpd/
logsource:
  product: linux
  service: vsftpd
detection:
  keywords:
  - 'Connection refused: too many sessions for this address.'
  - 'Connection refused: tcp_wrappers denial.'
  - Bad HTTP verb.
  - port and pasv both active
  - pasv and port both active
  - Transfer done (but failed to open directory).
  - Could not set file modification time.
  - 'bug: pid active in ptrace_sandbox_free'
  - PTRACE_SETOPTIONS failure
  - 'weird status:'
  - couldn't handle sandbox event
  - syscall * out of bounds
  - 'syscall not permitted:'
  - 'syscall validate failed:'
  - Input line too long.
  - poor buffer accounting in str_netfd_alloc
  - vsf_sysutil_read_loop
  condition: keywords
provenance:
  source: SigmaHQ/sigma
  source_id: 377f33a1-4b36-4ee1-acee-1dbe4b43cfbe
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/builtin/vsftpd/lnx_vsftpd_susp_error_messages.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
