id: sigmahq-sigma-00d49ed5-4491-4271-a8db-650a4ef6f8c1
name: Suspicious Download from Office Domain
description: Detects suspicious ways to download files from Microsoft domains that
  are used to store attachments in Emails or OneNote documents
severity: high
enabled: false
tags:
  mitre:
  - T1105
  - T1608
  categories:
  - endpoint
references:
- https://twitter.com/an0n_r0/status/1474698356635193346?s=12
- https://twitter.com/mrd0x/status/1475085452784844803?s=12
logsource:
  product: windows
  category: process_creation
detection:
  selection_download:
  - Image|endswith:
    - \curl.exe
    - \wget.exe
  - CommandLine|contains:
    - Invoke-WebRequest
    - 'iwr '
    - 'curl '
    - 'wget '
    - Start-BitsTransfer
    - .DownloadFile(
    - .DownloadString(
  selection_domains:
    CommandLine|contains:
    - https://attachment.outlook.live.net/owa/
    - https://onenoteonlinesync.onenote.com/onenoteonlinesync/
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 00d49ed5-4491-4271-a8db-650a4ef6f8c1
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_susp_download_office_domain.yml
falsepositives:
- Scripts or tools that download attachments from these domains (OneNote, Outlook
  365)
notes:
  quarantine_reason: 'upstream status: test'
