id: sigmahq-sigma-d55b793d-f847-4eea-b59a-5ab09908ac90
name: Suspicious Child Process Of Veeam Dabatase
description: Detects suspicious child processes of the Veeam service process. This
  could indicate potential RCE or SQL Injection.
severity: critical
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://labs.withsecure.com/publications/fin7-target-veeam-servers
logsource:
  category: process_creation
  product: windows
detection:
  selection_parent:
    ParentImage|endswith: \sqlservr.exe
    ParentCommandLine|contains: VEEAMSQL
  selection_child_1:
    Image|endswith:
    - \cmd.exe
    - \powershell.exe
    - \pwsh.exe
    - \wsl.exe
    - \wt.exe
    CommandLine|contains:
    - '-ex '
    - bypass
    - cscript
    - DownloadString
    - http://
    - https://
    - mshta
    - regsvr32
    - rundll32
    - wscript
    - 'copy '
  selection_child_2:
    Image|endswith:
    - \net.exe
    - \net1.exe
    - \netstat.exe
    - \nltest.exe
    - \ping.exe
    - \tasklist.exe
    - \whoami.exe
  condition: selection_parent and 1 of selection_child_*
provenance:
  source: SigmaHQ/sigma
  source_id: d55b793d-f847-4eea-b59a-5ab09908ac90
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_mssql_veaam_susp_child_processes.yml
notes:
  quarantine_reason: 'upstream status: test'
