id: sigmahq-sigma-50d66fb0-03f8-4da0-8add-84e77d12a020
name: Suspicious RunAs-Like Flag Combination
description: Detects suspicious command line flags that let the user set a target
  user and command as e.g. seen in PsExec-like tools
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://www.trendmicro.com/en_us/research/22/k/hack-the-real-box-apt41-new-subgroup-earth-longzhi.html
logsource:
  category: process_creation
  product: windows
detection:
  selection_user:
    CommandLine|contains:
    - ' -u system '
    - ' --user system '
    - ' -u NT'
    - ' -u "NT'
    - ' -u ''NT'
    - ' --system '
    - ' -u administrator '
  selection_command:
    CommandLine|contains:
    - ' -c cmd'
    - ' -c "cmd'
    - ' -c powershell'
    - ' -c "powershell'
    - ' --command cmd'
    - ' --command powershell'
    - ' -c whoami'
    - ' -c wscript'
    - ' -c cscript'
  condition: all of selection*
provenance:
  source: SigmaHQ/sigma
  source_id: 50d66fb0-03f8-4da0-8add-84e77d12a020
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_susp_privilege_escalation_cli_patterns.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
