id: sigmahq-sigma-396f6630-f3ac-44e3-bfc8-1b161bc00c4e
name: Suspicious Child Process Of Wermgr.EXE
description: Detects suspicious Windows Error Reporting manager (wermgr.exe) child
  process
severity: high
enabled: false
tags:
  mitre:
  - T1055
  - T1036
  categories:
  - endpoint
references:
- https://www.trendmicro.com/en_us/research/22/j/black-basta-infiltrates-networks-via-qakbot-brute-ratel-and-coba.html
- https://www.echotrail.io/insights/search/wermgr.exe
- https://github.com/binderlabs/DirCreate2System
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage|endswith: \wermgr.exe
    Image|endswith:
    - \cmd.exe
    - \cscript.exe
    - \ipconfig.exe
    - \mshta.exe
    - \net.exe
    - \net1.exe
    - \netstat.exe
    - \nslookup.exe
    - \powershell_ise.exe
    - \powershell.exe
    - \pwsh.exe
    - \regsvr32.exe
    - \rundll32.exe
    - \systeminfo.exe
    - \whoami.exe
    - \wscript.exe
  filter_main_rundll32:
    Image|endswith: \rundll32.exe
    CommandLine|contains|all:
    - C:\Windows\system32\WerConCpl.dll
    - 'LaunchErcApp '
    CommandLine|contains:
    - -queuereporting
    - -responsepester
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 396f6630-f3ac-44e3-bfc8-1b161bc00c4e
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_wermgr_susp_child_process.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
