id: sigmahq-sigma-737e618a-a410-49b5-bec3-9e55ff7fbc15
name: Suspicious Calculator Usage
description: Detects suspicious use of 'calc.exe' with command line parameters or
  in a suspicious directory, which is likely caused by some PoC or detection evasion.
severity: high
enabled: false
tags:
  mitre:
  - T1036
  categories:
  - endpoint
references:
- https://twitter.com/ItsReallyNick/status/1094080242686312448
logsource:
  category: process_creation
  product: windows
detection:
  selection_1:
    CommandLine|contains: '\calc.exe '
  selection_2:
    Image|endswith: \calc.exe
  filter_main_known_locations:
    Image|contains:
    - :\Windows\System32\
    - :\Windows\SysWOW64\
    - :\Windows\WinSxS\
  condition: selection_1 or ( selection_2 and not filter_main_known_locations )
provenance:
  source: SigmaHQ/sigma
  source_id: 737e618a-a410-49b5-bec3-9e55ff7fbc15
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_calc_uncommon_exec.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
