id: sigmahq-sigma-1c563233-030e-4a07-af8c-ee0490a66d3a
name: Suspicious New-PSDrive to Admin Share
description: Adversaries may use to interact with a remote network share using Server
  Message Block (SMB). The adversary may then perform actions as the logged-on user.
severity: medium
enabled: false
tags:
  mitre:
  - T1021.002
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1021.002/T1021.002.md#atomic-test-2---map-admin-share-powershell
- https://learn.microsoft.com/en-us/powershell/module/microsoft.powershell.management/new-psdrive?view=powershell-7.2
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection:
    ScriptBlockText|contains|all:
    - New-PSDrive
    - '-psprovider '
    - filesystem
    - '-root '
    - \\\\
    - $
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 1c563233-030e-4a07-af8c-ee0490a66d3a
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_susp_new_psdrive.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
