id: sigmahq-sigma-e32f92d1-523e-49c3-9374-bdb13b46a3ba
name: Suspicious Mshta.EXE Execution Patterns
description: Detects suspicious mshta process execution patterns
severity: high
enabled: false
tags:
  mitre:
  - T1106
  categories:
  - endpoint
references:
- https://en.wikipedia.org/wiki/HTML_Application
- https://www.echotrail.io/insights/search/mshta.exe
- https://app.any.run/tasks/34221348-072d-4b70-93f3-aa71f6ebecad/
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \mshta.exe
  - OriginalFileName: MSHTA.EXE
  selection_susp:
    ParentImage|endswith:
    - \cmd.exe
    - \cscript.exe
    - \powershell.exe
    - \pwsh.exe
    - \regsvr32.exe
    - \rundll32.exe
    - \wscript.exe
    CommandLine|contains:
    - \AppData\Local\
    - C:\ProgramData\
    - C:\Users\Public\
    - C:\Windows\Temp\
  filter_img:
  - Image|startswith:
    - C:\Windows\System32\
    - C:\Windows\SysWOW64\
  - CommandLine|contains:
    - .htm
    - .hta
  - CommandLine|endswith:
    - mshta.exe
    - mshta
  condition: all of selection_* or (selection_img and not filter_img)
provenance:
  source: SigmaHQ/sigma
  source_id: e32f92d1-523e-49c3-9374-bdb13b46a3ba
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_mshta_susp_pattern.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
