id: sigmahq-sigma-0e0255bf-2548-47b8-9582-c0955c9283f5
name: Suspicious Reg Add BitLocker
description: Detects suspicious addition to BitLocker related registry keys via the
  reg.exe utility
severity: high
enabled: false
tags:
  mitre:
  - T1486
  categories:
  - endpoint
references:
- https://thedfirreport.com/2021/11/15/exchange-exploit-leads-to-domain-wide-ransomware/
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains|all:
    - REG
    - ADD
    - \SOFTWARE\Policies\Microsoft\FVE
    - /v
    - /f
    CommandLine|contains:
    - EnableBDEWithNoTPM
    - UseAdvancedStartup
    - UseTPM
    - UseTPMKey
    - UseTPMKeyPIN
    - RecoveryKeyMessageSource
    - UseTPMPIN
    - RecoveryKeyMessage
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 0e0255bf-2548-47b8-9582-c0955c9283f5
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_reg_bitlocker.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
