id: sigmahq-sigma-f5240972-3938-4e56-8e4b-e33893176c1f
name: Suspicious Query of MachineGUID
description: Use of reg to get MachineGuid information
severity: low
enabled: false
tags:
  mitre:
  - T1082
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1082/T1082.md#atomic-test-8---windows-machineguid-discovery
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: \reg.exe
    CommandLine|contains|all:
    - SOFTWARE\Microsoft\Cryptography
    - '/v '
    - MachineGuid
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: f5240972-3938-4e56-8e4b-e33893176c1f
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_reg_machineguid.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
