id: sigmahq-sigma-bd1212e5-78da-431e-95fa-c58e3237a8e6
name: Suspicious ASPX File Drop by Exchange
description: Detects suspicious file type dropped by an Exchange component in IIS
  into a suspicious folder
severity: high
enabled: false
tags:
  mitre:
  - T1505.003
  categories:
  - endpoint
references:
- https://www.microsoft.com/security/blog/2022/09/30/analyzing-attacks-using-the-exchange-vulnerabilities-cve-2022-41040-and-cve-2022-41082/
- https://www.gteltsc.vn/blog/canh-bao-chien-dich-tan-cong-su-dung-lo-hong-zero-day-tren-microsoft-exchange-server-12714.html
- https://en.gteltsc.vn/blog/cap-nhat-nhe-ve-lo-hong-bao-mat-0day-microsoft-exchange-dang-duoc-su-dung-de-tan-cong-cac-to-chuc-tai-viet-nam-9685.html
logsource:
  product: windows
  category: file_event
detection:
  selection:
    Image|endswith: \w3wp.exe
    CommandLine|contains: MSExchange
    TargetFilename|contains:
    - FrontEnd\HttpProxy\
    - \inetpub\wwwroot\aspnet_client\
  selection_types:
    TargetFilename|endswith:
    - .aspx
    - .asp
    - .ashx
  condition: all of selection*
provenance:
  source: SigmaHQ/sigma
  source_id: bd1212e5-78da-431e-95fa-c58e3237a8e6
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_exchange_webshell_drop.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
