id: sigmahq-sigma-d75d6b6b-adb9-48f7-824b-ac2e786efe1f
name: Suspicious FromBase64String Usage On Gzip Archive - Process Creation
description: Detects attempts of decoding a base64 Gzip archive via PowerShell. This
  technique is often used as a method to load malicious content into memory afterward.
severity: medium
enabled: false
tags:
  mitre:
  - T1132.001
  categories:
  - endpoint
references:
- https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=43
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    CommandLine|contains|all:
    - FromBase64String
    - MemoryStream
    - H4sI
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: d75d6b6b-adb9-48f7-824b-ac2e786efe1f
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_powershell_frombase64string_archive.yml
falsepositives:
- Legitimate administrative script
notes:
  quarantine_reason: 'upstream status: test'
