id: sigmahq-sigma-5394fcc7-aeb2-43b5-9a09-cac9fc5edcd5
name: Suspicious Execution Location Of Wermgr.EXE
description: Detects suspicious Windows Error Reporting manager (wermgr.exe) execution
  location.
severity: high
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://www.trendmicro.com/en_us/research/22/j/black-basta-infiltrates-networks-via-qakbot-brute-ratel-and-coba.html
- https://www.echotrail.io/insights/search/wermgr.exe
- https://github.com/binderlabs/DirCreate2System
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: \wermgr.exe
  filter_main_legit_location:
    Image|startswith:
    - C:\Windows\System32\
    - C:\Windows\SysWOW64\
    - C:\Windows\WinSxS\
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 5394fcc7-aeb2-43b5-9a09-cac9fc5edcd5
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_wermgr_susp_exec_location.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
