id: sigmahq-sigma-dc4576d4-7467-424f-9eee-fd2b02855fe0
name: Suspicious Cabinet File Execution Via Msdt.EXE
description: Detects execution of msdt.exe using the "cab" flag which could indicates
  suspicious diagcab files with embedded answer files leveraging CVE-2022-30190
severity: medium
enabled: false
tags:
  mitre:
  - T1202
  categories:
  - endpoint
references:
- https://twitter.com/nas_bench/status/1537896324837781506
- https://github.com/GossiTheDog/ThreatHunting/blob/e85884abbf05d5b41efc809ea6532b10b45bd05c/AdvancedHuntingQueries/DogWalk-DiagCab
- https://github.com/elastic/protections-artifacts/commit/746086721fd385d9f5c6647cada1788db4aea95f#diff-9015912909545e72ed42cbac4d1e96295e8964579c406d23fd9c47a8091576a0
- https://irsl.medium.com/the-trouble-with-microsofts-troubleshooters-6e32fc80b8bd
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \msdt.exe
  - OriginalFileName: msdt.exe
  selection_cmd:
    CommandLine|contains|windash: ' -cab '
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: dc4576d4-7467-424f-9eee-fd2b02855fe0
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_msdt_susp_cab_options.yml
falsepositives:
- Legitimate usage of ".diagcab" files
notes:
  quarantine_reason: 'upstream status: test'
