id: sigmahq-sigma-e212d415-0e93-435f-9e1a-f29005bb4723
name: Suspicious Remote Child Process From Outlook
description: Detects a suspicious child process spawning from Outlook where the image
  is located in a remote location (SMB/WebDav shares).
severity: high
enabled: false
tags:
  mitre:
  - T1059
  - T1202
  categories:
  - endpoint
references:
- https://github.com/sensepost/ruler
- https://www.fireeye.com/blog/threat-research/2018/12/overruled-containing-a-potentially-destructive-adversary.html
- https://speakerdeck.com/heirhabarov/hunting-for-persistence-via-microsoft-exchange-server-or-outlook?slide=49
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage|endswith: \outlook.exe
    Image|startswith: \\\\
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: e212d415-0e93-435f-9e1a-f29005bb4723
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_office_outlook_susp_child_processes_remote.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
