id: sigmahq-sigma-416bc4a2-7217-4519-8dc7-c3271817f1d5
name: Suspicious Loading of Dbgcore/Dbghelp DLLs from Uncommon Location
description: 'Detects loading of dbgcore.dll or dbghelp.dll from uncommon locations
  such as user directories.

  These DLLs contain the MiniDumpWriteDump function, which can be abused for credential
  dumping purposes or in some cases for evading EDR/AV detection by suspending processes.'
severity: high
enabled: false
tags:
  mitre:
  - T1003
  - T1685
  categories:
  - endpoint
references:
- https://blog.axelarator.net/hunting-for-edr-freeze/
- https://www.zerosalarium.com/2025/09/EDR-Freeze-Puts-EDRs-Antivirus-Into-Coma.html
- https://www.splunk.com/en_us/blog/security/you-bet-your-lsass-hunting-lsass-access.html
logsource:
  category: image_load
  product: windows
detection:
  selection_img:
    Image|contains:
    - :\Perflogs\
    - :\Temp\
    - :\Users\Public\
    - \$Recycle.Bin\
    - \Contacts\
    - \Documents\
    - \Favorites\
    - \Favourites\
    - \inetpub\wwwroot\
    - \Music\
    - \Pictures\
    - \Start Menu\Programs\Startup\
    - \Users\Default\
    - \Videos\
  selection_dll:
    ImageLoaded|endswith:
    - \dbgcore.dll
    - \dbghelp.dll
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 416bc4a2-7217-4519-8dc7-c3271817f1d5
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/image_load/image_load_win_susp_dbgcore_dbghelp_load.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: experimental'
