id: sigmahq-sigma-cfec9d29-64ec-4a0f-9ffe-0fdb856d5446
name: Suspicious Git Clone - Linux
description: Detects execution of "git" in order to clone a remote repository that
  contain suspicious keywords which might be suspicious
severity: medium
enabled: false
tags:
  mitre:
  - T1593.003
  categories:
  - endpoint
references:
- https://gist.githubusercontent.com/MichaelKoczwara/12faba9c061c12b5814b711166de8c2f/raw/e2068486692897b620c25fde1ea258c8218fe3d3/history.txt
logsource:
  category: process_creation
  product: linux
detection:
  selection_img:
    Image|endswith: /git
    CommandLine|contains: ' clone '
  selection_keyword:
    CommandLine|contains:
    - exploit
    - Vulns
    - vulnerability
    - RCE
    - RemoteCodeExecution
    - Invoke-
    - CVE-
    - poc-
    - ProofOfConcept
    - proxyshell
    - log4shell
    - eternalblue
    - eternal-blue
    - MS17-
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: cfec9d29-64ec-4a0f-9ffe-0fdb856d5446
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/process_creation/proc_creation_lnx_susp_git_clone.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
