id: sigmahq-sigma-786cdae8-fefb-4eb2-9227-04e34060db01
name: Suspicious Wordpad Outbound Connections
description: 'Detects a network connection initiated by "wordpad.exe" over uncommon
  destination ports.

  This might indicate potential process injection activity from a beacon or similar
  mechanisms.'
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://blogs.blackberry.com/en/2023/07/romcom-targets-ukraine-nato-membership-talks-at-nato-summit
logsource:
  category: network_connection
  product: windows
detection:
  selection:
    Initiated: 'true'
    Image|endswith: \wordpad.exe
  filter_main_ports:
    DestinationPort:
    - 80
    - 139
    - 443
    - 445
    - 465
    - 587
    - 993
    - 995
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 786cdae8-fefb-4eb2-9227-04e34060db01
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/network_connection/net_connection_win_wordpad_uncommon_ports.yml
falsepositives:
- Other ports can be used, apply additional filters accordingly
notes:
  quarantine_reason: 'upstream status: test'
