id: sigmahq-sigma-9c5037d1-c568-49b3-88c7-9846a5bdc2be
name: Suspicious Run Key from Download
description: Detects the suspicious RUN keys created by software located in Download
  or temporary Outlook/Internet Explorer directories
severity: high
enabled: false
tags:
  mitre:
  - T1547.001
  categories:
  - endpoint
references:
- https://app.any.run/tasks/c5bef5b7-f484-4c43-9cf3-d5c5c7839def/
- https://github.com/HackTricks-wiki/hacktricks/blob/e4c7b21b8f36c97c35b7c622732b38a189ce18f7/src/windows-hardening/windows-local-privilege-escalation/privilege-escalation-with-autorun-binaries.md
logsource:
  category: registry_event
  product: windows
detection:
  selection:
    Image|contains:
    - \AppData\Local\Packages\Microsoft.Outlook_
    - \AppData\Local\Microsoft\Olk\Attachments\
    - \Downloads\
    - \Temporary Internet Files\Content.Outlook\
    - \Local Settings\Temporary Internet Files\
    TargetObject|contains:
    - \Software\Microsoft\Windows\CurrentVersion\Run
    - \Software\WOW6432Node\Microsoft\Windows\CurrentVersion\Run
    - \Software\Microsoft\Windows\CurrentVersion\Policies\Explorer\Run
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 9c5037d1-c568-49b3-88c7-9846a5bdc2be
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_event/registry_event_susp_download_run_key.yml
falsepositives:
- Software installers downloaded and used by users
notes:
  quarantine_reason: 'upstream status: test'
