id: sigmahq-sigma-17a1be64-8d88-40bf-b5ff-a4f7a50ebcc8
name: Suspicious New Service Creation
description: Detects creation of a new service via "sc" command or the powershell
  "new-service" cmdlet with suspicious binary paths
severity: high
enabled: false
tags:
  mitre:
  - T1543.003
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1543.003/T1543.003.md
- https://web.archive.org/web/20180331144337/https://www.fireeye.com/blog/threat-research/2018/03/sanny-malware-delivery-method-updated-in-recently-observed-attacks.html
logsource:
  category: process_creation
  product: windows
detection:
  selection_sc:
    Image|endswith: \sc.exe
    CommandLine|contains|all:
    - create
    - binPath=
  selection_posh:
    CommandLine|contains|all:
    - New-Service
    - -BinaryPathName
  susp_binpath:
    CommandLine|contains:
    - powershell
    - mshta
    - wscript
    - cscript
    - svchost
    - dllhost
    - 'cmd '
    - cmd.exe /c
    - cmd.exe /k
    - cmd.exe /r
    - rundll32
    - C:\Users\Public
    - \Downloads\
    - \Desktop\
    - \Microsoft\Windows\Start Menu\Programs\Startup\
    - C:\Windows\TEMP\
    - \AppData\Local\Temp
  condition: 1 of selection* and susp_binpath
provenance:
  source: SigmaHQ/sigma
  source_id: 17a1be64-8d88-40bf-b5ff-a4f7a50ebcc8
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_susp_service_creation.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
