id: sigmahq-sigma-496a0e47-0a33-4dca-b009-9e6ca3591f39
name: Suspicious Kerberos RC4 Ticket Encryption
description: Detects service ticket requests using RC4 encryption type
severity: medium
enabled: false
tags:
  mitre:
  - T1558.003
  categories:
  - endpoint
references:
- https://adsecurity.org/?p=3458
- https://www.trimarcsecurity.com/single-post/TrimarcResearch/Detecting-Kerberoasting-Activity
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4769
    TicketOptions: '0x40810000'
    TicketEncryptionType: '0x17'
  reduction:
    ServiceName|endswith: $
  condition: selection and not reduction
provenance:
  source: SigmaHQ/sigma
  source_id: 496a0e47-0a33-4dca-b009-9e6ca3591f39
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/security/win_security_susp_rc4_kerberos.yml
falsepositives:
- Service accounts used on legacy systems (e.g. NetApp)
- Windows Domains with DFL 2003 and legacy systems
notes:
  quarantine_reason: 'upstream status: test'
