id: sigmahq-sigma-00b90cc1-17ec-402c-96ad-3a8117d7a582
name: Suspicious Curl File Upload - Linux
description: Detects a suspicious curl process start the adds a file to a web request
severity: medium
enabled: false
tags:
  mitre:
  - T1567
  - T1105
  categories:
  - endpoint
references:
- https://twitter.com/d1r4c/status/1279042657508081664
- https://medium.com/@petehouston/upload-files-with-curl-93064dcccc76
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1105/T1105.md#atomic-test-19---curl-upload-file
- https://curl.se/docs/manpage.html
- https://www.trendmicro.com/en_us/research/22/i/how-malicious-actors-abuse-native-linux-tools-in-their-attacks.html
logsource:
  category: process_creation
  product: linux
detection:
  selection_img:
    Image|endswith: /curl
  selection_cli:
  - CommandLine|contains:
    - ' --form'
    - ' --upload-file '
    - ' --data '
    - ' --data-'
  - CommandLine|re: \s-[FTd]\s
  filter_optional_localhost:
    CommandLine|contains:
    - ://localhost
    - ://127.0.0.1
  condition: all of selection_* and not 1 of filter_optional_*
provenance:
  source: SigmaHQ/sigma
  source_id: 00b90cc1-17ec-402c-96ad-3a8117d7a582
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/process_creation/proc_creation_lnx_susp_curl_fileupload.yml
falsepositives:
- Scripts created by developers and admins
notes:
  quarantine_reason: 'upstream status: test'
