id: sigmahq-sigma-99c840f2-2012-46fd-9141-c761987550ef
name: Suspicious Download From Direct IP Via Bitsadmin
description: Detects usage of bitsadmin downloading a file using an URL that contains
  an IP
severity: high
enabled: false
tags:
  mitre:
  - T1197
  - T1036.003
  categories:
  - endpoint
references:
- https://blog.netspi.com/15-ways-to-download-a-file/#bitsadmin
- https://isc.sans.edu/diary/22264
- https://lolbas-project.github.io/lolbas/Binaries/Bitsadmin/
- https://blog.talosintelligence.com/breaking-the-silence-recent-truebot-activity/
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \bitsadmin.exe
  - OriginalFileName: bitsadmin.exe
  selection_flags:
    CommandLine|contains:
    - ' /transfer '
    - ' /create '
    - ' /addfile '
  selection_extension:
    CommandLine|contains:
    - ://1
    - ://2
    - ://3
    - ://4
    - ://5
    - ://6
    - ://7
    - ://8
    - ://9
  filter_seven_zip:
    CommandLine|contains: ://7-
  condition: all of selection_* and not 1 of filter_*
provenance:
  source: SigmaHQ/sigma
  source_id: 99c840f2-2012-46fd-9141-c761987550ef
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_bitsadmin_download_direct_ip.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
