id: sigmahq-sigma-19aa4f58-94ca-45ff-bc34-92e533c0994a
name: Suspicious User-Agents Related To Recon Tools
description: Detects known suspicious (default) user-agents related to scanning/recon
  tools
severity: medium
enabled: false
tags:
  mitre:
  - T1190
  categories:
  - application
references:
- https://github.com/wpscanteam/wpscan/blob/196fbab5b1ce3870a43515153d4f07878a89d410/lib/wpscan/browser.rb
- https://github.com/xmendez/wfuzz/blob/1b695ee9a87d66a7d7bf6cae70d60a33fae51541/docs/user/basicusage.rst
- https://github.com/lanmaster53/recon-ng/blob/9e907dfe09fce2997f0301d746796408e01a60b7/recon/core/base.py#L92
logsource:
  category: webserver
detection:
  selection:
    cs-user-agent|contains:
    - Wfuzz/
    - WPScan v
    - Recon-ng/v
    - GIS - AppSec Team - Project Vision
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 19aa4f58-94ca-45ff-bc34-92e533c0994a
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/web/webserver_generic/web_susp_useragents.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
