id: sigmahq-sigma-504d63cb-0dba-4d02-8531-e72981aace2c
name: Suspicious X509Enrollment - Ps Script
description: Detect use of X509Enrollment
severity: medium
enabled: false
tags:
  mitre:
  - T1553.004
  categories:
  - endpoint
references:
- https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=42
- https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=41
- https://learn.microsoft.com/en-us/dotnet/api/microsoft.hpc.scheduler.store.cx509enrollmentwebclassfactoryclass?view=hpc-sdk-5.1.6115
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection:
    ScriptBlockText|contains:
    - X509Enrollment.CBinaryConverter
    - 884e2002-217d-11da-b2a4-000e7bbb2b09
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 504d63cb-0dba-4d02-8531-e72981aace2c
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_x509enrollment.yml
falsepositives:
- Legitimate administrative script
notes:
  quarantine_reason: 'upstream status: test'
