id: sigmahq-sigma-ef61af62-bc74-4f58-b49b-626448227652
name: Suspicious Active Directory Database Snapshot Via ADExplorer
description: Detects the execution of Sysinternals ADExplorer with the "-snapshot"
  flag in order to save a local copy of the active directory database to a suspicious
  directory. This can be used by attackers to extract data for Bloodhound, usernames
  for password spraying or use the meta data for social engineering. The snapshot
  doesn't contain password hashes but there have been cases, where administrators
  put passwords in the comment field.
severity: high
enabled: false
tags:
  mitre:
  - T1087.002
  - T1069.002
  - T1482
  categories:
  - endpoint
references:
- https://www.documentcloud.org/documents/5743766-Global-Threat-Report-2019.html
- https://learn.microsoft.com/de-de/sysinternals/downloads/adexplorer
- https://github.com/c3c/ADExplorerSnapshot.py/tree/f700904defac330802bbfedd1d8ffd9248f4ee24
- https://www.packetlabs.net/posts/scattered-spider-is-a-young-ransomware-gang-exploiting-large-corporations/
- https://www.nccgroup.com/us/research-blog/lapsus-recent-techniques-tactics-and-procedures/
- https://trustedsec.com/blog/adexplorer-on-engagements
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - \ADExp.exe
    - \ADExplorer.exe
    - \ADExplorer64.exe
    - \ADExplorer64a.exe
  - OriginalFileName: AdExp
  - Description: Active Directory Editor
  - Product: Sysinternals ADExplorer
  selection_flag:
    CommandLine|contains: snapshot
  selection_paths:
    CommandLine|contains:
    - \Downloads\
    - \Users\Public\
    - \AppData\
    - \Windows\Temp\
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: ef61af62-bc74-4f58-b49b-626448227652
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_sysinternals_adexplorer_susp_execution.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
