id: sigmahq-sigma-9d8f9bb8-01af-4e15-a3a2-349071530530
name: Suspicious Path In Keyboard Layout IME File Registry Value
description: 'Detects usage of Windows Input Method Editor (IME) keyboard layout feature,
  which allows an attacker to load a DLL into the process after sending the WM_INPUTLANGCHANGEREQUEST
  message.

  Before doing this, the client needs to register the DLL in a special registry key
  that is assumed to implement this keyboard layout. This registry key should store
  a value named "Ime File" with a DLL path.

  IMEs are essential for languages that have more characters than can be represented
  on a standard keyboard, such as Chinese, Japanese, and Korean.'
severity: high
enabled: false
tags:
  mitre:
  - T1685
  categories:
  - endpoint
references:
- https://www.linkedin.com/pulse/guntior-story-advanced-bootkit-doesnt-rely-windows-disk-baranov-wue8e/
logsource:
  product: windows
  category: registry_set
detection:
  selection_registry:
    TargetObject|contains|all:
    - \Control\Keyboard Layouts\
    - Ime File
  selection_folders_1:
    Details|contains:
    - :\Perflogs\
    - :\Users\Public\
    - :\Windows\Temp\
    - \AppData\Local\Temp\
    - \AppData\Roaming\
    - \Temporary Internet
  selection_folders_2:
  - Details|contains|all:
    - :\Users\
    - \Favorites\
  - Details|contains|all:
    - :\Users\
    - \Favourites\
  - Details|contains|all:
    - :\Users\
    - \Contacts\
  condition: selection_registry and 1 of selection_folders_*
provenance:
  source: SigmaHQ/sigma
  source_id: 9d8f9bb8-01af-4e15-a3a2-349071530530
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_ime_suspicious_paths.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
