id: sigmahq-sigma-9ccba514-7cb6-4c5c-b377-700758f2f120
name: Suspicious Child Process of AspNetCompiler
description: Detects potentially suspicious child processes of "aspnet_compiler.exe".
severity: high
enabled: false
tags:
  mitre:
  - T1127
  categories:
  - endpoint
references:
- https://lolbas-project.github.io/lolbas/Binaries/Aspnet_Compiler/
- https://ijustwannared.team/2020/08/01/the-curious-case-of-aspnet_compiler-exe/
logsource:
  category: process_creation
  product: windows
detection:
  selection_parent:
    ParentImage|endswith: \aspnet_compiler.exe
  selection_child:
  - Image|endswith:
    - \calc.exe
    - \notepad.exe
  - Image|contains:
    - \Users\Public\
    - \AppData\Local\Temp\
    - \AppData\Local\Roaming\
    - :\Temp\
    - :\Windows\Temp\
    - :\Windows\System32\Tasks\
    - :\Windows\Tasks\
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 9ccba514-7cb6-4c5c-b377-700758f2f120
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_aspnet_compiler_susp_child_process.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
