id: sigmahq-sigma-d95de845-b83c-4a9a-8a6a-4fc802ebf6c0
name: Suspicious Group And Account Reconnaissance Activity Using Net.EXE
description: 'Detects suspicious reconnaissance command line activity on Windows systems
  using Net.EXE

  Check if the user that executed the commands is suspicious (e.g. service accounts,
  LOCAL_SYSTEM)'
severity: medium
enabled: false
tags:
  mitre:
  - T1087.001
  - T1087.002
  categories:
  - endpoint
references:
- https://redcanary.com/blog/how-one-hospital-thwarted-a-ryuk-ransomware-outbreak/
- https://thedfirreport.com/2020/10/18/ryuk-in-5-hours/
- https://research.nccgroup.com/2022/08/19/back-in-black-unlocking-a-lockbit-3-0-ransomware-attack/
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - \net.exe
    - \net1.exe
  - OriginalFileName:
    - net.exe
    - net1.exe
  selection_group_root:
    CommandLine|contains:
    - ' group '
    - ' localgroup '
  selection_group_flags:
    CommandLine|contains:
    - domain admins
    - ' administrator'
    - ' administrateur'
    - enterprise admins
    - Exchange Trusted Subsystem
    - Remote Desktop Users
    - Utilisateurs du Bureau à distance
    - Usuarios de escritorio remoto
    - ' /do'
  filter_group_add:
    CommandLine|contains: ' /add'
  selection_accounts_root:
    CommandLine|contains: ' accounts '
  selection_accounts_flags:
    CommandLine|contains: ' /do'
  condition: selection_img and ((all of selection_group_* and not filter_group_add)
    or all of selection_accounts_*)
provenance:
  source: SigmaHQ/sigma
  source_id: d95de845-b83c-4a9a-8a6a-4fc802ebf6c0
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_net_groups_and_accounts_recon.yml
falsepositives:
- Inventory tool runs
- Administrative activity
notes:
  quarantine_reason: 'upstream status: test'
