id: sigmahq-sigma-1f1a8509-2cbb-44f5-8751-8e1571518ce2
name: Suspicious Splwow64 Without Params
description: Detects suspicious Splwow64.exe process without any command line parameters
severity: high
enabled: false
tags:
  mitre:
  - T1202
  categories:
  - endpoint
references:
- https://twitter.com/sbousseaden/status/1429401053229891590?s=12
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: \splwow64.exe
    CommandLine|endswith: splwow64.exe
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 1f1a8509-2cbb-44f5-8751-8e1571518ce2
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_splwow64_cli_anomaly.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
