id: sigmahq-sigma-0d18728b-f5bf-4381-9dcf-915539fff6c2
name: Suspicious Cobalt Strike DNS Beaconing - DNS Client
description: Detects a program that invoked suspicious DNS queries known from Cobalt
  Strike beacons
severity: critical
enabled: false
tags:
  mitre:
  - T1071.004
  categories:
  - endpoint
references:
- https://www.icebrg.io/blog/footprints-of-fin7-tracking-actor-patterns
- https://www.sekoia.io/en/hunting-and-detecting-cobalt-strike/
logsource:
  product: windows
  service: dns-client
  definition: 'Requirements: Microsoft-Windows-DNS Client Events/Operational Event
    Log must be enabled/collected in order to receive the events.'
detection:
  selection_eid:
    EventID: 3008
  selection_query_1:
    QueryName|startswith:
    - aaa.stage.
    - post.1
  selection_query_2:
    QueryName|contains: .stage.123456.
  condition: selection_eid and 1 of selection_query_*
provenance:
  source: SigmaHQ/sigma
  source_id: 0d18728b-f5bf-4381-9dcf-915539fff6c2
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/dns_client/win_dns_client_mal_cobaltstrike.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
