id: sigmahq-sigma-be58d2e2-06c8-4f58-b666-b99f6dc3b6cd
name: Suspicious Process Masquerading As SvcHost.EXE
description: 'Detects a suspicious process that is masquerading as the legitimate
  "svchost.exe" by naming its binary "svchost.exe" and executing from an uncommon
  location.

  Adversaries often disguise their malicious binaries by naming them after legitimate
  system processes like "svchost.exe" to evade detection.'
severity: high
enabled: false
tags:
  mitre:
  - T1036.005
  categories:
  - endpoint
references:
- https://tria.ge/240731-jh4crsycnb/behavioral2
- https://redcanary.com/blog/threat-detection/process-masquerading/
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: \svchost.exe
  filter_main_img_location:
    Image:
    - C:\Windows\System32\svchost.exe
    - C:\Windows\SysWOW64\svchost.exe
  filter_main_ofn:
    OriginalFileName: svchost.exe
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: be58d2e2-06c8-4f58-b666-b99f6dc3b6cd
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_svchost_masqueraded_execution.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
