id: sigmahq-sigma-7124aebe-4cd7-4ccb-8df0-6d6b93c96795
name: Suspicious Kernel Dump Using Dtrace
description: Detects suspicious way to dump the kernel on Windows systems using dtrace.exe,
  which is available on Windows systems since Windows 10 19H1
severity: high
enabled: false
tags:
  mitre:
  - T1082
  categories:
  - endpoint
references:
- https://twitter.com/0gtweet/status/1474899714290208777?s=12
- https://learn.microsoft.com/en-us/windows-hardware/drivers/devtest/dtrace
logsource:
  product: windows
  category: process_creation
detection:
  selection_plain:
    Image|endswith: \dtrace.exe
    CommandLine|contains: lkd(0)
  selection_obfuscated:
    CommandLine|contains|all:
    - syscall:::return
    - lkd(
  condition: 1 of selection*
provenance:
  source: SigmaHQ/sigma
  source_id: 7124aebe-4cd7-4ccb-8df0-6d6b93c96795
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_dtrace_kernel_dump.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
