id: sigmahq-sigma-9f38c1db-e2ae-40bf-81d0-5b68f73fb512
name: Suspicious BitLocker Access Agent Update Utility Execution
description: 'Detects the execution of the BitLocker Access Agent Update Utility (baaupdate.exe)
  which is not a common parent process for other processes.

  Suspicious child processes spawned by baaupdate.exe could indicate an attempt at
  lateral movement via BitLocker DCOM & COM Hijacking.'
severity: high
enabled: false
tags:
  mitre:
  - T1218
  - T1021.003
  categories:
  - endpoint
references:
- https://github.com/rtecCyberSec/BitlockMove
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage|endswith: \baaupdate.exe
    Image|endswith:
    - \bitsadmin.exe
    - \cmd.exe
    - \cscript.exe
    - \mshta.exe
    - \powershell_ise.exe
    - \powershell.exe
    - \regsvr32.exe
    - \rundll32.exe
    - \schtasks.exe
    - \wmic.exe
    - \wscript.exe
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 9f38c1db-e2ae-40bf-81d0-5b68f73fb512
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_baaupdate_susp_child_process.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: experimental'
