id: sigmahq-sigma-725a9768-0f5e-4cb3-aec2-bc5719c6831a
name: Suspicious Where Execution
description: 'Adversaries may enumerate browser bookmarks to learn more about compromised
  hosts.

  Browser bookmarks may reveal personal information about users (ex: banking sites,
  interests, social media, etc.) as well as details about

  internal network resources such as servers, tools/dashboards, or other related infrastructure.'
severity: low
enabled: false
tags:
  mitre:
  - T1217
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1217/T1217.md
logsource:
  category: process_creation
  product: windows
detection:
  where_exe:
  - Image|endswith: \where.exe
  - OriginalFileName: where.exe
  where_opt:
    CommandLine|contains:
    - places.sqlite
    - cookies.sqlite
    - formhistory.sqlite
    - logins.json
    - key4.db
    - key3.db
    - sessionstore.jsonlz4
    - History
    - Bookmarks
    - Cookies
    - Login Data
  condition: all of where_*
provenance:
  source: SigmaHQ/sigma
  source_id: 725a9768-0f5e-4cb3-aec2-bc5719c6831a
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_where_browser_data_recon.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
