id: sigmahq-sigma-3037d961-21e9-4732-b27a-637bcc7bf539
name: Suspicious High IntegrityLevel Conhost Legacy Option
description: ForceV1 asks for information directly from the kernel space. Conhost
  connects to the console application. High IntegrityLevel means the process is running
  with elevated privileges, such as an Administrator context.
severity: low
enabled: false
tags:
  mitre:
  - T1202
  categories:
  - endpoint
references:
- https://cybercryptosec.medium.com/covid-19-cyber-infection-c615ead7c29
- https://thedfirreport.com/2022/04/04/stolen-images-campaign-ends-in-conti-ransomware/
- https://learn.microsoft.com/en-us/windows/win32/secauthz/mandatory-integrity-control
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    IntegrityLevel:
    - High
    - S-1-16-12288
    CommandLine|contains|all:
    - conhost.exe
    - '0xffffffff'
    - -ForceV1
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 3037d961-21e9-4732-b27a-637bcc7bf539
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_conhost_legacy_option.yml
falsepositives:
- Very Likely, including launching cmd.exe via Run As Administrator
notes:
  quarantine_reason: 'upstream status: test'
