id: sigmahq-sigma-8150732a-0c9d-4a99-82b9-9efb9b90c40c
name: Suspicious Msiexec Quiet Install From Remote Location
description: Detects usage of Msiexec.exe to install packages hosted remotely quietly
severity: medium
enabled: false
tags:
  mitre:
  - T1218.007
  categories:
  - endpoint
references:
- https://www.microsoft.com/en-us/security/blog/2022/10/27/raspberry-robin-worm-part-of-larger-ecosystem-facilitating-pre-ransomware-activity/
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \msiexec.exe
  - OriginalFileName: msiexec.exe
  selection_cli:
    CommandLine|contains|windash:
    - -i
    - -package
    - -a
    - -j
  selection_quiet:
    CommandLine|contains|windash: -q
  selection_remote:
    CommandLine|contains:
    - http
    - \\\\
  filter_optional_openoffice:
    CommandLine|contains|all:
    - \AppData\Local\Temp\OpenOffice
    - Installation Files\openoffice
  condition: all of selection_* and not 1 of filter_optional_*
provenance:
  source: SigmaHQ/sigma
  source_id: 8150732a-0c9d-4a99-82b9-9efb9b90c40c
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_msiexec_install_remote.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
