id: sigmahq-sigma-8a582fe2-0882-4b89-a82a-da6b2dc32937
name: Suspicious WmiPrvSE Child Process
description: Detects suspicious and uncommon child processes of WmiPrvSE
severity: high
enabled: false
tags:
  mitre:
  - T1047
  - T1204.002
  - T1218.010
  categories:
  - endpoint
references:
- https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware/
- https://github.com/vadim-hunter/Detection-Ideas-Rules/blob/02bcbfc2bfb8b4da601bb30de0344ae453aa1afe/Threat%20Intelligence/The%20DFIR%20Report/20210329_Sodinokibi_(aka_REvil)_Ransomware.yaml
- https://blog.osarmor.com/319/onenote-attachment-delivers-asyncrat-malware/
- https://twitter.com/ForensicITGuy/status/1334734244120309760
logsource:
  product: windows
  category: process_creation
detection:
  selection_parent:
    ParentImage|endswith: \wbem\WmiPrvSE.exe
  selection_children_1:
    Image|endswith:
    - \certutil.exe
    - \cscript.exe
    - \mshta.exe
    - \msiexec.exe
    - \regsvr32.exe
    - \rundll32.exe
    - \verclsid.exe
    - \wscript.exe
  selection_children_2:
    Image|endswith: \cmd.exe
    CommandLine|contains:
    - cscript
    - mshta
    - powershell
    - pwsh
    - regsvr32
    - rundll32
    - wscript
  filter_main_werfault:
    Image|endswith: \WerFault.exe
  filter_main_wmiprvse:
    Image|endswith: \WmiPrvSE.exe
  filter_main_msiexec:
    Image|endswith: \msiexec.exe
    CommandLine|contains: '/i '
  condition: selection_parent and 1 of selection_children_* and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 8a582fe2-0882-4b89-a82a-da6b2dc32937
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_wmiprvse_susp_child_processes.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
