id: sigmahq-sigma-2d367498-5112-4ae5-a06a-96e7bc33a211
name: Suspicious Binary Writes Via AnyDesk
description: 'Detects AnyDesk writing binary files to disk other than "gcapi.dll".

  According to RedCanary research it is highly abnormal for AnyDesk to write executable
  files to disk besides gcapi.dll,

  which is a legitimate DLL that is part of the Google Chrome web browser used to
  interact with the Google Cloud API. (See reference section for more details)'
severity: high
enabled: false
tags:
  mitre:
  - T1219.002
  categories:
  - endpoint
references:
- https://redcanary.com/blog/misbehaving-rats/
- https://thedfirreport.com/2025/02/24/confluence-exploit-leads-to-lockbit-ransomware/
logsource:
  product: windows
  category: file_event
detection:
  selection:
    Image|endswith:
    - \AnyDesk.exe
    - \AnyDeskMSI.exe
    TargetFilename|endswith:
    - .dll
    - .exe
  filter_dlls:
    TargetFilename|endswith: \gcapi.dll
  condition: selection and not 1 of filter_*
provenance:
  source: SigmaHQ/sigma
  source_id: 2d367498-5112-4ae5-a06a-96e7bc33a211
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_anydesk_writing_susp_binaries.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
