id: sigmahq-sigma-efdd8dd5-cee8-4e59-9390-7d4d5e4dd6f6
name: Suspicious Program Names
description: Detects suspicious patterns in program names or folders that are often
  found in malicious samples or hacktools
severity: high
enabled: false
tags:
  mitre:
  - T1059
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1560.001/T1560.001.md
logsource:
  category: process_creation
  product: windows
detection:
  selection_image:
  - Image|contains:
    - \CVE-202
    - \CVE202
  - Image|endswith:
    - \poc.exe
    - \artifact.exe
    - \artifact64.exe
    - \artifact_protected.exe
    - \artifact32.exe
    - \artifact32big.exe
    - obfuscated.exe
    - obfusc.exe
    - \meterpreter
  selection_commandline:
    CommandLine|contains:
    - inject.ps1
    - Invoke-CVE
    - pupy.ps1
    - payload.ps1
    - beacon.ps1
    - PowerView.ps1
    - bypass.ps1
    - obfuscated.ps1
    - obfusc.ps1
    - obfus.ps1
    - obfs.ps1
    - evil.ps1
    - MiniDogz.ps1
    - _enc.ps1
    - \shell.ps1
    - \rshell.ps1
    - revshell.ps1
    - \av.ps1
    - \av_test.ps1
    - adrecon.ps1
    - mimikatz.ps1
    - \PowerUp_
    - powerup.ps1
    - \Temp\a.ps1
    - \Temp\p.ps1
    - \Temp\1.ps1
    - Hound.ps1
    - encode.ps1
    - powercat.ps1
  condition: 1 of selection*
provenance:
  source: SigmaHQ/sigma
  source_id: efdd8dd5-cee8-4e59-9390-7d4d5e4dd6f6
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_susp_progname.yml
falsepositives:
- Legitimate tools that accidentally match on the searched patterns
notes:
  quarantine_reason: 'upstream status: test'
