id: sigmahq-sigma-d7b50671-d1ad-4871-aa60-5aa5b331fe04
name: Suspicious File Creation In Uncommon AppData Folder
description: Detects the creation of suspicious files and folders inside the user's
  AppData folder but not inside any of the common and well known directories (Local,
  Romaing, LocalLow). This method could be used as a method to bypass detection who
  exclude the AppData folder in fear of FPs
severity: high
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- Internal Research
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename|startswith: C:\Users\
    TargetFilename|contains: \AppData\
    TargetFilename|endswith:
    - .bat
    - .cmd
    - .cpl
    - .dll
    - .exe
    - .hta
    - .iso
    - .lnk
    - .msi
    - .ps1
    - .psm1
    - .scr
    - .vbe
    - .vbs
  filter_main:
    TargetFilename|startswith: C:\Users\
    TargetFilename|contains:
    - \AppData\Local\
    - \AppData\LocalLow\
    - \AppData\Roaming\
  condition: selection and not filter_main
provenance:
  source: SigmaHQ/sigma
  source_id: d7b50671-d1ad-4871-aa60-5aa5b331fe04
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_new_files_in_uncommon_appdata_folder.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
