id: sigmahq-sigma-7195a772-4b3f-43a4-a210-6a003d65caa1
name: Suspicious User Agent
description: Detects suspicious malformed user agent strings in proxy logs
severity: high
enabled: false
tags:
  mitre:
  - T1071.001
  categories:
  - network
references:
- https://github.com/fastly/waf_testbed/blob/8bfc406551f3045e418cbaad7596cff8da331dfc/templates/default/scanners-user-agents.data.erb
logsource:
  category: proxy
detection:
  selection1:
    c-useragent|startswith:
    - user-agent
    - 'Mozilla/3.0 '
    - 'Mozilla/2.0 '
    - 'Mozilla/1.0 '
    - 'Mozilla '
    - ' Mozilla/'
    - Mozila/
    - Mozilla/4.0 (compatible; MSIE 6.0; MS Web Services Client Protocol
  selection2:
    c-useragent|contains:
    - ' (compatible;MSIE '
    - '.0;Windows NT '
    - loader
  selection3:
    c-useragent:
    - _
    - CertUtil URL Agent
    - Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:60.0)
    - Mozilla/5.0 (Windows NT 6.3; WOW64; rv:28.0) Gecko/20100101 Firefox/28.0
    - HTTPS
    - Erbium-UA-4ce7c27cb4be9d32e333bf032c88235a
    - x
    - xxx
  falsepositives:
  - c-useragent: Mozilla/3.0 * Acrobat *
  - cs-host|endswith:
    - .acrobat.com
    - .adobe.com
    - .adobe.io
  condition: 1 of selection* and not falsepositives
provenance:
  source: SigmaHQ/sigma
  source_id: 7195a772-4b3f-43a4-a210-6a003d65caa1
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/web/proxy_generic/proxy_ua_susp.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
