id: sigmahq-sigma-d87bd452-6da1-456e-8155-7dc988157b7d
name: Suspicious Usage Of ShellExec_RunDLL
description: Detects suspicious usage of the ShellExec_RunDLL function to launch other
  commands as seen in the the raspberry-robin attack
severity: high
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://redcanary.com/blog/raspberry-robin/
- https://www.microsoft.com/en-us/security/blog/2022/10/27/raspberry-robin-worm-part-of-larger-ecosystem-facilitating-pre-ransomware-activity/
- https://github.com/SigmaHQ/sigma/issues/1009
logsource:
  category: process_creation
  product: windows
detection:
  selection_openasrundll:
    CommandLine|contains: ShellExec_RunDLL
  selection_suspcli:
    CommandLine|contains:
    - \Desktop\
    - \Temp\
    - \Users\Public\
    - comspec
    - iex
    - Invoke-
    - msiexec
    - odbcconf
    - regsvr32
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: d87bd452-6da1-456e-8155-7dc988157b7d
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_rundll32_susp_shellexec_execution.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
