id: sigmahq-sigma-dd2a821e-3b07-4d3b-a9ac-929fe4c6ca0c
name: Suspicious Scheduled Task Creation via Masqueraded XML File
description: Detects the creation of a scheduled task using the "-XML" flag with a
  file without the '.xml' extension. This behavior could be indicative of potential
  defense evasion attempt during persistence
severity: medium
enabled: false
tags:
  mitre:
  - T1036.005
  - T1053.005
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/windows/win32/taskschd/daily-trigger-example--xml-
- https://github.com/elastic/protections-artifacts/blob/084067123d3328a823b1c3fdde305b694275c794/behavior/rules/persistence_suspicious_scheduled_task_creation_via_masqueraded_xml_file.toml
logsource:
  product: windows
  category: process_creation
detection:
  selection_img:
  - Image|endswith: \schtasks.exe
  - OriginalFileName: schtasks.exe
  selection_cli_create:
    CommandLine|contains:
    - /create
    - -create
  selection_cli_xml:
    CommandLine|contains:
    - /xml
    - -xml
  filter_main_extension_xml:
    CommandLine|contains: .xml
  filter_main_system_process:
    IntegrityLevel:
    - System
    - S-1-16-16384
  filter_main_rundll32:
    ParentImage|endswith: \rundll32.exe
    ParentCommandLine|contains|all:
    - :\WINDOWS\Installer\MSI
    - .tmp,zzzzInvokeManagedCustomActionOutOfProc
  filter_optional_third_party:
    ParentImage|endswith:
    - :\ProgramData\OEM\UpgradeTool\CareCenter_*\BUnzip\Setup_msi.exe
    - :\Program Files\Axis Communications\AXIS Camera Station\SetupActions.exe
    - :\Program Files\Axis Communications\AXIS Device Manager\AdmSetupActions.exe
    - :\Program Files (x86)\Zemana\AntiMalware\AntiMalware.exe
    - :\Program Files\Dell\SupportAssist\pcdrcui.exe
  condition: all of selection_* and not 1 of filter_main_* and not 1 of filter_optional_*
provenance:
  source: SigmaHQ/sigma
  source_id: dd2a821e-3b07-4d3b-a9ac-929fe4c6ca0c
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_schtasks_schedule_via_masqueraded_xml_file.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
