id: sigmahq-sigma-67f113fa-e23d-4271-befa-30113b3e08b1
name: Suspicious JavaScript Execution Via Mshta.EXE
description: Detects execution of javascript code using "mshta.exe".
severity: high
enabled: false
tags:
  mitre:
  - T1218.005
  categories:
  - endpoint
references:
- https://eqllib.readthedocs.io/en/latest/analytics/6bc283c4-21f2-4aed-a05c-a9a3ffa95dd4.html
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218.005/T1218.005.md
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \mshta.exe
  - OriginalFileName: MSHTA.EXE
  selection_cli:
    CommandLine|contains: javascript
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 67f113fa-e23d-4271-befa-30113b3e08b1
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_mshta_javascript.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
