id: sigmahq-sigma-b140afd9-474b-4072-958e-2ebb435abd68
name: Suspicious Get-ADDBAccount Usage
description: Detects suspicious invocation of the Get-ADDBAccount script that reads
  from a ntds.dit file and may be used to get access to credentials without using
  any credential dumpers
severity: high
enabled: false
tags:
  mitre:
  - T1003.003
  categories:
  - endpoint
references:
- https://www.n00py.io/2022/03/manipulating-user-passwords-without-mimikatz/
- https://github.com/MichaelGrafnetter/DSInternals/blob/7ba59c12ee9a1cb430d7dc186a3366842dd612c8/Documentation/PowerShell/Get-ADDBAccount.md
logsource:
  product: windows
  category: ps_module
  definition: 0ad03ef1-f21b-4a79-8ce8-e6900c54b65b
detection:
  selection:
    Payload|contains|all:
    - Get-ADDBAccount
    - 'BootKey '
    - 'DatabasePath '
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: b140afd9-474b-4072-958e-2ebb435abd68
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_module/posh_pm_get_addbaccount.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
