id: sigmahq-sigma-eb1c4225-1c23-4241-8dd4-051389fde4ce
name: Suspicious DumpMinitool Execution
description: Detects suspicious ways to use the "DumpMinitool.exe" binary
severity: high
enabled: false
tags:
  mitre:
  - T1036
  - T1003.001
  categories:
  - endpoint
references:
- https://twitter.com/mrd0x/status/1511415432888131586
- https://twitter.com/mrd0x/status/1511489821247684615
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/DumpMinitool/
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Image|endswith:
    - \DumpMinitool.exe
    - \DumpMinitool.x86.exe
    - \DumpMinitool.arm64.exe
  - OriginalFileName:
    - DumpMinitool.exe
    - DumpMinitool.x86.exe
    - DumpMinitool.arm64.exe
  filter_folder:
    Image|contains:
    - \Microsoft Visual Studio\
    - \Extensions\
  susp_flags:
    CommandLine|contains: .txt
  cmd_has_flags:
    CommandLine|contains:
    - ' Full'
    - ' Mini'
    - ' WithHeap'
  filter_cmd_misses_flags:
    CommandLine|contains: --dumpType
  condition: selection and ( ( not filter_folder ) or susp_flags or ( cmd_has_flags
    and not filter_cmd_misses_flags ) )
provenance:
  source: SigmaHQ/sigma
  source_id: eb1c4225-1c23-4241-8dd4-051389fde4ce
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_dumpminitool_susp_execution.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
