id: sigmahq-sigma-0a4f6091-223b-41f6-8743-f322ec84930b
name: Suspicious GUP Usage
description: Detects execution of the Notepad++ updater in a suspicious directory,
  which is often used in DLL side-loading attacks
severity: high
enabled: false
tags:
  mitre:
  - T1574.001
  categories:
  - endpoint
references:
- https://www.fireeye.com/blog/threat-research/2018/09/apt10-targeting-japanese-corporations-using-updated-ttps.html
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: \GUP.exe
  filter_programfiles:
    Image|endswith:
    - \Program Files\Notepad++\updater\GUP.exe
    - \Program Files (x86)\Notepad++\updater\GUP.exe
  filter_user:
    Image|contains: \Users\
    Image|endswith:
    - \AppData\Local\Notepad++\updater\GUP.exe
    - \AppData\Roaming\Notepad++\updater\GUP.exe
  condition: selection and not 1 of filter_*
provenance:
  source: SigmaHQ/sigma
  source_id: 0a4f6091-223b-41f6-8743-f322ec84930b
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_gup_suspicious_execution.yml
falsepositives:
- Execution of tools named GUP.exe and located in folders different than Notepad++\updater
notes:
  quarantine_reason: 'upstream status: test'
