id: sigmahq-sigma-a95b9b42-1308-4735-a1af-abb1c5e6f5ac
name: Suspicious Service DACL Modification Via Set-Service Cmdlet
description: Detects suspicious DACL modifications via the "Set-Service" cmdlet using
  the "SecurityDescriptorSddl" flag (Only available with PowerShell 7) that can be
  used to hide services or make them unstopable
severity: high
enabled: false
tags:
  mitre:
  - T1543.003
  categories:
  - endpoint
references:
- https://www.sans.org/blog/red-team-tactics-hiding-windows-services/
- https://learn.microsoft.com/pt-br/windows/win32/secauthz/sid-strings
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \pwsh.exe
  - OriginalFileName: pwsh.dll
  selection_sddl_flag:
    CommandLine|contains:
    - '-SecurityDescriptorSddl '
    - '-sd '
  selection_set_service:
    CommandLine|contains|all:
    - 'Set-Service '
    - D;;
    CommandLine|contains:
    - ;;;IU
    - ;;;SU
    - ;;;BA
    - ;;;SY
    - ;;;WD
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: a95b9b42-1308-4735-a1af-abb1c5e6f5ac
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_powershell_service_dacl_modification_set_service.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
