id: sigmahq-sigma-0ef56343-059e-4cb6-adc1-4c3c967c5e46
name: Suspicious Execution of Systeminfo
description: Detects usage of the "systeminfo" command to retrieve information
severity: low
enabled: false
tags:
  mitre:
  - T1082
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1082/T1082.md#atomic-test-1---system-information-discovery
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/systeminfo
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Image|endswith: \systeminfo.exe
  - OriginalFileName: sysinfo.exe
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 0ef56343-059e-4cb6-adc1-4c3c967c5e46
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_systeminfo_execution.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
