id: sigmahq-sigma-07aa184a-870d-413d-893a-157f317f6f58
name: Suspicious Reconnaissance Activity Via GatherNetworkInfo.VBS
description: Detects execution of the built-in script located in "C:\Windows\System32\gatherNetworkInfo.vbs".
  Which can be used to gather information about the target machine
severity: high
enabled: false
tags:
  mitre:
  - T1615
  - T1059.005
  categories:
  - endpoint
references:
- https://posts.slayerlabs.com/living-off-the-land/#gathernetworkinfovbs
- https://www.mandiant.com/resources/blog/trojanized-windows-installers-ukrainian-government
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains: gatherNetworkInfo.vbs
  filter:
    Image|endswith:
    - \cscript.exe
    - \wscript.exe
  condition: selection and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: 07aa184a-870d-413d-893a-157f317f6f58
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_susp_gather_network_info_execution.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
