id: sigmahq-sigma-cbec226f-63d9-4eca-9f52-dfb6652f24df
name: Suspicious Process Parents
description: Detects suspicious parent processes that should not have any children
  or should only have a single possible child program
severity: high
enabled: false
tags:
  mitre:
  - T1036
  categories:
  - endpoint
references:
- https://twitter.com/x86matthew/status/1505476263464607744?s=12
- https://svch0st.medium.com/stats-from-hunting-cobalt-strike-beacons-c17e56255f9b
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage|endswith:
    - \minesweeper.exe
    - \winver.exe
    - \bitsadmin.exe
  selection_special:
    ParentImage|endswith:
    - \csrss.exe
    - \certutil.exe
    - \eventvwr.exe
    - \calc.exe
    - \notepad.exe
  filter_special:
    Image|endswith:
    - \WerFault.exe
    - \wermgr.exe
    - \conhost.exe
    - \mmc.exe
    - \win32calc.exe
    - \notepad.exe
  filter_null:
    Image: null
  condition: selection or ( selection_special and not 1 of filter_* )
provenance:
  source: SigmaHQ/sigma
  source_id: cbec226f-63d9-4eca-9f52-dfb6652f24df
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_susp_parents.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
