id: sigmahq-sigma-6b369ced-4b1d-48f1-b427-fdc0de0790bd
name: Suspicious Diantz Alternate Data Stream Execution
description: Compress target file into a cab file stored in the Alternate Data Stream
  (ADS) of the target file.
severity: medium
enabled: false
tags:
  mitre:
  - T1564.004
  categories:
  - endpoint
references:
- https://lolbas-project.github.io/lolbas/Binaries/Diantz/
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains|all:
    - diantz.exe
    - .cab
    CommandLine|re: :[^\\]
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 6b369ced-4b1d-48f1-b427-fdc0de0790bd
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_lolbin_diantz_ads.yml
falsepositives:
- Very Possible
notes:
  quarantine_reason: 'upstream status: test'
