id: sigmahq-sigma-902cedee-0398-4e3a-8183-6f3a89773a96
name: Suspicious Invoke-Item From Mount-DiskImage
description: Adversaries may abuse container files such as disk image (.iso, .vhd)
  file formats to deliver malicious payloads that may not be tagged with MOTW.
severity: medium
enabled: false
tags:
  mitre:
  - T1553.005
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1553.005/T1553.005.md#atomic-test-2---mount-an-iso-image-and-run-executable-from-the-iso
- https://learn.microsoft.com/en-us/powershell/module/storage/mount-diskimage?view=windowsserver2022-ps
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection:
    ScriptBlockText|contains|all:
    - 'Mount-DiskImage '
    - '-ImagePath '
    - Get-Volume
    - .DriveLetter
    - 'invoke-item '
    - ):\
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 902cedee-0398-4e3a-8183-6f3a89773a96
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_run_from_mount_diskimage.yml
falsepositives:
- Legitimate PowerShell scripts
notes:
  quarantine_reason: 'upstream status: test'
