id: sigmahq-sigma-37774c23-25a1-4adb-bb6d-8bb9fd59c0f8
name: Suspicious Volume Shadow Copy Vssapi.dll Load
description: Detects the image load of VSS DLL by uncommon executables
severity: high
enabled: false
tags:
  mitre:
  - T1490
  categories:
  - endpoint
references:
- https://github.com/ORCx41/DeleteShadowCopies
logsource:
  category: image_load
  product: windows
detection:
  selection:
    ImageLoaded|endswith: \vssapi.dll
  filter_main_windows:
  - Image:
    - C:\Windows\explorer.exe
    - C:\Windows\ImmersiveControlPanel\SystemSettings.exe
  - Image|startswith:
    - C:\Windows\System32\
    - C:\Windows\SysWOW64\
    - C:\Windows\Temp\{
    - C:\Windows\WinSxS\
  filter_main_program_files:
    Image|startswith:
    - C:\Program Files\
    - C:\Program Files (x86)\
  filter_main_null_image:
    Image: null
  filter_optional_programdata_packagecache:
    Image|startswith: C:\ProgramData\Package Cache\
  filter_optional_avira:
    Image|contains|all:
    - \temp\is-
    - \avira_system_speedup.tmp
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
provenance:
  source: SigmaHQ/sigma
  source_id: 37774c23-25a1-4adb-bb6d-8bb9fd59c0f8
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/image_load/image_load_dll_vssapi_susp_load.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
