id: sigmahq-sigma-b4926b47-a9d7-434c-b3a0-adc3fa0bd13e
name: Suspicious Double Extension Files
description: Detects dropped files with double extensions, which is often used by
  malware as a method to abuse the fact that Windows hide default extensions by default.
severity: high
enabled: false
tags:
  mitre:
  - T1036.007
  categories:
  - endpoint
references:
- https://www.crowdstrike.com/blog/meet-crowdstrikes-adversary-of-the-month-for-june-mustang-panda/
- https://www.anomali.com/blog/china-based-apt-mustang-panda-targets-minority-groups-public-and-private-sector-organizations
- https://www.cybereason.com/blog/research/a-bazar-of-tricks-following-team9s-development-cycles
- https://twitter.com/malwrhunterteam/status/1235135745611960321
- https://twitter.com/luc4m/status/1073181154126254080
- https://cloud.google.com/blog/topics/threat-intelligence/cybercriminals-weaponize-fake-ai-websites
- https://vipre.com/blog/svg-phishing-attacks-the-new-trick-in-the-cybercriminals-playbook/
logsource:
  category: file_event
  product: windows
detection:
  selection_gen:
    TargetFilename|endswith:
    - .exe
    - .iso
    - .rar
    - .svg
    - .zip
    TargetFilename|contains:
    - .doc.
    - .docx.
    - .gif.
    - .jpeg.
    - .jpg.
    - .mp3.
    - .mp4.
    - .pdf.
    - .png.
    - .ppt.
    - .pptx.
    - .rtf.
    - .svg.
    - .txt.
    - .xls.
    - .xlsx.
  selection_exe:
    TargetFilename|endswith:
    - .rar.exe
    - .zip.exe
  filter_icons_linux:
    TargetFilename|startswith: /usr/share/icons/
  condition: 1 of selection_* and not 1 of filter_*
provenance:
  source: SigmaHQ/sigma
  source_id: b4926b47-a9d7-434c-b3a0-adc3fa0bd13e
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_susp_double_extension.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
