id: sigmahq-sigma-572b12d4-9062-11ed-a1eb-0242ac120002
name: Suspicious SignIns From A Non Registered Device
description: Detects risky authentication from a non AD registered device without
  MFA being required.
severity: high
enabled: false
tags:
  mitre:
  - T1078
  categories:
  - cloud
references:
- https://learn.microsoft.com/en-us/entra/architecture/security-operations-devices#non-compliant-device-sign-in
logsource:
  product: azure
  service: signinlogs
detection:
  selection_main:
    Status: Success
    AuthenticationRequirement: singleFactorAuthentication
    RiskState: atRisk
  selection_empty1:
    DeviceDetail.trusttype: ''
  selection_empty2:
    DeviceDetail.trusttype: null
  condition: selection_main and 1 of selection_empty*
provenance:
  source: SigmaHQ/sigma
  source_id: 572b12d4-9062-11ed-a1eb-0242ac120002
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/azure/signin_logs/azure_ad_risky_sign_ins_with_singlefactorauth_from_unknown_devices.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
