id: sigmahq-sigma-f2485272-a156-4773-82d7-1d178bc4905b
name: Suspicious Service Installed
description: 'Detects installation of NalDrv or PROCEXP152 services via registry-keys
  to non-system32 folders.

  Both services are used in the tool Ghost-In-The-Logs (https://github.com/bats3c/Ghost-In-The-Logs),
  which uses KDU (https://github.com/hfiref0x/KDU)'
severity: medium
enabled: false
tags:
  mitre:
  - T1685
  categories:
  - endpoint
references:
- https://web.archive.org/web/20200419024230/https://blog.dylan.codes/evading-sysmon-and-windows-event-logging/
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject:
    - HKLM\System\CurrentControlSet\Services\NalDrv\ImagePath
    - HKLM\System\CurrentControlSet\Services\PROCEXP152\ImagePath
  filter:
    Image|endswith:
    - \procexp64.exe
    - \procexp.exe
    - \procmon64.exe
    - \procmon.exe
    - \handle.exe
    - \handle64.exe
    Details|contains: \WINDOWS\system32\Drivers\PROCEXP152.SYS
  condition: selection and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: f2485272-a156-4773-82d7-1d178bc4905b
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_susp_service_installed.yml
falsepositives:
- Other legimate tools using this service names and drivers. Note - clever attackers
  may easily bypass this detection by just renaming the services. Therefore just Medium-level
  and don't rely on it.
notes:
  quarantine_reason: 'upstream status: test'
