id: sigmahq-sigma-e3f673b3-65d1-4d80-9146-466f8b63fa99
name: Suspicious Appended Extension
description: Detects file renames where the target filename uses an uncommon double
  extension. Could indicate potential ransomware activity renaming files and adding
  a custom extension to the encrypted files, such as ".jpg.crypted", ".docx.locky",
  etc.
severity: medium
enabled: false
tags:
  mitre:
  - T1486
  categories:
  - endpoint
references:
- https://app.any.run/tasks/d66ead5a-faf4-4437-93aa-65785afaf9e5/
- https://blog.cyble.com/2022/08/10/onyx-ransomware-renames-its-leak-site-to-vsop/
logsource:
  product: windows
  category: file_rename
  definition: 'Requirements: Microsoft-Windows-Kernel-File Provider with at least
    the KERNEL_FILE_KEYWORD_RENAME_SETLINK_PATH keyword'
detection:
  selection:
    SourceFilename|endswith:
    - .doc
    - .docx
    - .jpeg
    - .jpg
    - .lnk
    - .pdf
    - .png
    - .pst
    - .rtf
    - .xls
    - .xlsx
    TargetFilename|contains:
    - .doc.
    - .docx.
    - .jpeg.
    - .jpg.
    - .lnk.
    - .pdf.
    - .png.
    - .pst.
    - .rtf.
    - .xls.
    - .xlsx.
  filter_main_generic:
    TargetFilename|endswith:
    - .backup
    - .bak
    - .old
    - .orig
    - .temp
    - .tmp
  filter_optional_anaconda:
    TargetFilename|contains: :\ProgramData\Anaconda3\
    TargetFilename|endswith: .c~
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
provenance:
  source: SigmaHQ/sigma
  source_id: e3f673b3-65d1-4d80-9146-466f8b63fa99
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_rename/file_rename_win_ransomware.yml
falsepositives:
- Backup software
notes:
  quarantine_reason: 'upstream status: test'
