id: sigmahq-sigma-97aa2e88-555c-450d-85a6-229bcd87efb8
name: Suspicious Screensaver Binary File Creation
description: 'Adversaries may establish persistence by executing malicious content
  triggered by user inactivity.

  Screensavers are programs that execute after a configurable time of user inactivity
  and consist of Portable Executable (PE) files with a .scr file extension'
severity: medium
enabled: false
tags:
  mitre:
  - T1546.002
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1546.002/T1546.002.md
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename|endswith: .scr
  filter_generic:
    Image|endswith:
    - \Kindle.exe
    - \Bin\ccSvcHst.exe
  filter_tiworker:
    Image|endswith: \TiWorker.exe
    TargetFilename|endswith: \uwfservicingscr.scr
  condition: selection and not 1 of filter_*
provenance:
  source: SigmaHQ/sigma
  source_id: 97aa2e88-555c-450d-85a6-229bcd87efb8
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_creation_scr_binary_file.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
