id: sigmahq-sigma-5cb299fc-5fb1-4d07-b989-0644c68b6043
name: Suspicious File Download From IP Via Curl.EXE
description: Detects potentially suspicious file downloads directly from IP addresses
  using curl.exe
severity: high
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://labs.withsecure.com/publications/fin7-target-veeam-servers
- https://github.com/WithSecureLabs/iocs/blob/344203de742bb7e68bd56618f66d34be95a9f9fc/FIN7VEEAM/iocs.csv
- https://github.com/pr0xylife/IcedID/blob/8dd1e218460db4f750d955b4c65b2f918a1db906/icedID_09.28.2023.txt
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \curl.exe
  - OriginalFileName: curl.exe
  selection_ip:
    CommandLine|re: ://[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}
  selection_http:
    CommandLine|contains: http
  selection_flag:
    CommandLine|contains:
    - ' -O'
    - --remote-name
    - --output
  selection_ext:
    CommandLine|endswith:
    - .bat
    - .bat"
    - .dat
    - .dat"
    - .dll
    - .dll"
    - .exe
    - .exe"
    - .gif
    - .gif"
    - .hta
    - .hta"
    - .jpeg
    - .jpeg"
    - .log
    - .log"
    - .msi
    - .msi"
    - .png
    - .png"
    - .ps1
    - .ps1"
    - .psm1
    - .psm1"
    - .vbe
    - .vbe"
    - .vbs
    - .vbs"
    - .bat'
    - .dat'
    - .dll'
    - .exe'
    - .gif'
    - .hta'
    - .jpeg'
    - .log'
    - .msi'
    - .png'
    - .ps1'
    - .psm1'
    - .vbe'
    - .vbs'
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 5cb299fc-5fb1-4d07-b989-0644c68b6043
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_curl_download_direct_ip_susp_extensions.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
