id: sigmahq-sigma-4bc90587-e6ca-4b41-be0b-ed4d04e4ed0c
name: Suspicious Velociraptor Child Process
description: Detects the suspicious use of the Velociraptor DFIR tool to execute other
  tools or download additional payloads, as seen in a campaign where it was abused
  for remote access and to stage further attacks.
severity: high
enabled: false
tags:
  mitre:
  - T1219
  categories:
  - endpoint
references:
- https://news.sophos.com/en-us/2025/08/26/velociraptor-incident-response-tool-abused-for-remote-access/
logsource:
  category: process_creation
  product: windows
detection:
  selection_parent:
    ParentImage|endswith: \Velociraptor.exe
  selection_child_vscode_tunnel:
    CommandLine|contains|all:
    - code.exe
    - tunnel
    - --accept-server-license-terms
  selection_child_msiexec:
    CommandLine|contains|all:
    - msiexec
    - /i
    - http
  selection_child_powershell:
    Image|endswith:
    - \powershell.exe
    - \powershell_ise.exe
    - \pwsh.exe
    CommandLine|contains:
    - 'Invoke-WebRequest '
    - 'IWR '
    - .DownloadFile
    - .DownloadString
  condition: selection_parent and 1 of selection_child_*
provenance:
  source: SigmaHQ/sigma
  source_id: 4bc90587-e6ca-4b41-be0b-ed4d04e4ed0c
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_susp_velociraptor_child_process.yml
falsepositives:
- Legitimate administrators or incident responders might use Velociraptor to execute
  scripts or tools. However, the combination of Velociraptor spawning these specific
  processes with these command lines is suspicious. Tuning may be required to exclude
  known administrative actions or specific scripts.
notes:
  quarantine_reason: 'upstream status: experimental'
