id: sigmahq-sigma-f8ad2e2c-40b6-4117-84d7-20b89896ab23
name: Suspicious Scan Loop Network
description: Adversaries may attempt to get a listing of other systems by IP address,
  hostname, or other logical identifier on a network that may be used for Lateral
  Movement from the current system
severity: medium
enabled: false
tags:
  mitre:
  - T1059
  - T1018
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1018/T1018.md
- https://ss64.com/nt/for.html
- https://ss64.com/ps/foreach-object.html
logsource:
  category: process_creation
  product: windows
detection:
  selection_loop:
    CommandLine|contains:
    - 'for '
    - 'foreach '
  selection_tools:
    CommandLine|contains:
    - nslookup
    - ping
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: f8ad2e2c-40b6-4117-84d7-20b89896ab23
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_susp_network_scan_loop.yml
falsepositives:
- Legitimate script
notes:
  quarantine_reason: 'upstream status: test'
