id: sigmahq-sigma-3da70954-0f2c-4103-adff-b7440368f50e
name: Suspicious PROCEXP152.sys File Created In TMP
description: 'Detects the creation of the PROCEXP152.sys file in the application-data
  local temporary folder.

  This driver is used by Sysinternals Process Explorer but also by KDU (https://github.com/hfiref0x/KDU)
  or Ghost-In-The-Logs (https://github.com/bats3c/Ghost-In-The-Logs), which uses KDU.'
severity: medium
enabled: false
tags:
  mitre:
  - T1685
  categories:
  - endpoint
references:
- https://web.archive.org/web/20230331181619/https://blog.dylan.codes/evading-sysmon-and-windows-event-logging/
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename|contains: \AppData\Local\Temp\
    TargetFilename|endswith: PROCEXP152.sys
  filter:
    Image|contains:
    - \procexp64.exe
    - \procexp.exe
    - \procmon64.exe
    - \procmon.exe
  condition: selection and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: 3da70954-0f2c-4103-adff-b7440368f50e
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_susp_procexplorer_driver_created_in_tmp_folder.yml
falsepositives:
- Other legimate tools using this driver and filename (like Sysinternals). Note -
  Clever attackers may easily bypass this detection by just renaming the driver filename.
  Therefore just Medium-level and don't rely on it.
notes:
  quarantine_reason: 'upstream status: test'
