id: sigmahq-sigma-4480827a-9799-4232-b2c4-ccc6c4e9e12b
name: Suspicious CertReq Command to Download
description: 'Detects a suspicious CertReq execution downloading a file.

  This behavior is often used by attackers to download additional payloads or configuration
  files.

  Certreq is a built-in Windows utility used to request and retrieve certificates
  from a certification authority (CA). However, it can be abused by threat actors
  for malicious purposes.'
severity: high
enabled: false
tags:
  mitre:
  - T1105
  categories:
  - endpoint
references:
- https://lolbas-project.github.io/lolbas/Binaries/Certreq/
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \certreq.exe
  - OriginalFileName: CertReq.exe
  selection_cli_flag_post:
    CommandLine|contains|windash: -Post
  selection_cli_flag_config:
    CommandLine|contains|windash: -config
  selection_cli_http:
    CommandLine|contains: http
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 4480827a-9799-4232-b2c4-ccc6c4e9e12b
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_certreq_download.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: experimental'
