id: sigmahq-sigma-a9e416a8-e613-4f8b-88b8-a7d1d1af2f61
name: Suspicious Use of CSharp Interactive Console
description: Detects the execution of CSharp interactive console by PowerShell
severity: high
enabled: false
tags:
  mitre:
  - T1127
  categories:
  - endpoint
references:
- https://redcanary.com/blog/detecting-attacks-leveraging-the-net-framework/
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: \csi.exe
    ParentImage|endswith:
    - \powershell.exe
    - \pwsh.exe
    - \powershell_ise.exe
    OriginalFileName: csi.exe
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: a9e416a8-e613-4f8b-88b8-a7d1d1af2f61
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_csi_use_of_csharp_console.yml
falsepositives:
- Possible depending on environment. Pair with other factors such as net connections,
  command-line args, etc.
notes:
  quarantine_reason: 'upstream status: test'
