id: sigmahq-sigma-7c8af9b2-dcae-41a2-a9db-b28c288b5f08
name: Suspicious IIS URL GlobalRules Rewrite Via AppCmd
description: Detects usage of "appcmd" to create new global URL rewrite rules. This
  behaviour has been observed being used by threat actors to add new rules so they
  can access their webshells.
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://twitter.com/malmoeb/status/1616702107242971144
- https://learn.microsoft.com/en-us/answers/questions/739120/how-to-add-re-write-global-rule-with-action-type-r
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \appcmd.exe
  - OriginalFileName: appcmd.exe
  selection_cli:
    CommandLine|contains|all:
    - set
    - config
    - section:system.webServer/rewrite/globalRules
    - 'commit:'
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 7c8af9b2-dcae-41a2-a9db-b28c288b5f08
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_iis_appcmd_susp_rewrite_rule.yml
falsepositives:
- Legitimate usage of appcmd to add new URL rewrite rules
notes:
  quarantine_reason: 'upstream status: test'
