id: sigmahq-sigma-ed965133-513f-41d9-a441-e38076a0798f
name: Suspicious PowerShell Invocations - Generic
description: Detects suspicious PowerShell invocation command parameters
severity: high
enabled: false
tags:
  mitre:
  - T1059.001
  categories:
  - endpoint
references:
- Internal Research
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection_encoded:
    ScriptBlockText|contains:
    - ' -enc '
    - ' -EncodedCommand '
    - ' -ec '
  selection_hidden:
    ScriptBlockText|contains:
    - ' -w hidden '
    - ' -window hidden '
    - ' -windowstyle hidden '
    - ' -w 1 '
  selection_noninteractive:
    ScriptBlockText|contains:
    - ' -noni '
    - ' -noninteractive '
  condition: all of selection*
provenance:
  source: SigmaHQ/sigma
  source_id: ed965133-513f-41d9-a441-e38076a0798f
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_susp_invocation_generic.yml
falsepositives:
- Very special / sneaky PowerShell scripts
notes:
  quarantine_reason: 'upstream status: test'
