id: sigmahq-sigma-33be4333-2c6b-44f4-ae28-102cdbde0a31
name: Suspicious Msbuild Execution By Uncommon Parent Process
description: Detects suspicious execution of 'Msbuild.exe' by a uncommon parent process
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://app.any.run/tasks/abdf586e-df0c-4d39-89a7-06bf24913401/
- https://www.echotrail.io/insights/search/msbuild.exe
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Image|endswith: \MSBuild.exe
  - OriginalFileName: MSBuild.exe
  filter_parent:
    ParentImage|endswith:
    - \devenv.exe
    - \cmd.exe
    - \msbuild.exe
    - \python.exe
    - \explorer.exe
    - \nuget.exe
  condition: selection and not filter_parent
provenance:
  source: SigmaHQ/sigma
  source_id: 33be4333-2c6b-44f4-ae28-102cdbde0a31
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_msbuild_susp_parent_process.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
