id: sigmahq-sigma-1f0489be-b496-4ddf-b3a9-5900f2044e9c
name: Suspicious File Write to SharePoint Layouts Directory
description: 'Detects suspicious file writes to SharePoint layouts directory which
  could indicate webshell activity or post-exploitation.

  This behavior has been observed in the exploitation of SharePoint vulnerabilities
  such as CVE-2025-49704, CVE-2025-49706 or CVE-2025-53770.'
severity: high
enabled: false
tags:
  mitre:
  - T1190
  - T1505.003
  categories:
  - endpoint
references:
- https://unit42.paloaltonetworks.com/microsoft-sharepoint-cve-2025-49704-cve-2025-49706-cve-2025-53770/
- https://www.microsoft.com/en-us/security/blog/2025/07/22/disrupting-active-exploitation-of-on-premises-sharepoint-vulnerabilities/
logsource:
  product: windows
  category: file_event
detection:
  selection:
    Image|endswith:
    - \cmd.exe
    - \powershell_ise.exe
    - \powershell.exe
    - \pwsh.exe
    - \w3wp.exe
    TargetFilename|startswith:
    - C:\Program Files\Common Files\Microsoft Shared\Web Server Extensions\
    - C:\Program Files (x86)\Common Files\Microsoft Shared\Web Server Extensions\
    TargetFilename|contains:
    - \15\TEMPLATE\LAYOUTS\
    - \16\TEMPLATE\LAYOUTS\
    TargetFilename|endswith:
    - .asax
    - .ascx
    - .ashx
    - .asmx
    - .asp
    - .aspx
    - .bat
    - .cmd
    - .cer
    - .config
    - .hta
    - .js
    - .jsp
    - .jspx
    - .php
    - .ps1
    - .vbs
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 1f0489be-b496-4ddf-b3a9-5900f2044e9c
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_susp_filewrite_in_sharepoint_layouts_dir.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: experimental'
