id: sigmahq-sigma-731231b9-0b5d-4219-94dd-abb6959aa7ea
name: Suspicious Rundll32 Activity Invoking Sys File
description: Detects suspicious process related to rundll32 based on command line
  that includes a *.sys file as seen being used by UNC2452
severity: high
enabled: false
tags:
  mitre:
  - T1218.011
  categories:
  - endpoint
references:
- https://www.microsoft.com/security/blog/2021/03/04/goldmax-goldfinder-sibot-analyzing-nobelium-malware/
logsource:
  category: process_creation
  product: windows
detection:
  selection1:
    CommandLine|contains: rundll32.exe
  selection2:
    CommandLine|contains:
    - .sys,
    - '.sys '
  condition: all of selection*
provenance:
  source: SigmaHQ/sigma
  source_id: 731231b9-0b5d-4219-94dd-abb6959aa7ea
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_rundll32_sys.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
