id: sigmahq-sigma-883faa95-175a-4e22-8181-e5761aeb373c
name: Suspicious Service Binary Directory
description: Detects a service binary running in a suspicious directory
severity: high
enabled: false
tags:
  mitre:
  - T1202
  categories:
  - endpoint
references:
- https://blog.truesec.com/2021/03/07/exchange-zero-day-proxylogon-and-hafnium/
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|contains:
    - \Users\Public\
    - \$Recycle.bin
    - \Users\All Users\
    - \Users\Default\
    - \Users\Contacts\
    - \Users\Searches\
    - C:\Perflogs\
    - \config\systemprofile\
    - \Windows\Fonts\
    - \Windows\IME\
    - \Windows\addins\
    ParentImage|endswith:
    - \services.exe
    - \svchost.exe
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 883faa95-175a-4e22-8181-e5761aeb373c
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_susp_service_dir.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
