id: sigmahq-sigma-313fbb0a-a341-4682-848d-6d6f8c4fab7c
name: Suspicious PowerShell WindowStyle Option
description: 'Adversaries may use hidden windows to conceal malicious activity from
  the plain sight of users.

  In some cases, windows that would typically be displayed when an application carries
  out an operation can be hidden'
severity: medium
enabled: false
tags:
  mitre:
  - T1564.003
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1564.003/T1564.003.md
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection:
    ScriptBlockText|contains|all:
    - powershell
    - WindowStyle
    - Hidden
  filter:
    ScriptBlockText|contains|all:
    - :\Program Files\Amazon\WorkSpacesConfig\Scripts\
    - $PSScriptRoot\Module\WorkspaceScriptModule\WorkspaceScriptModule
  condition: selection and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: 313fbb0a-a341-4682-848d-6d6f8c4fab7c
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_susp_windowstyle.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
