id: sigmahq-sigma-bb0e87ce-c89f-4857-84fa-095e4483e9cb
name: Suspicious Child Process of Notepad++ Updater - GUP.Exe
description: 'Detects suspicious child process creation by the Notepad++ updater process
  (gup.exe).

  This could indicate potential exploitation of the updater component to deliver unwanted
  malware.'
severity: high
enabled: false
tags:
  mitre:
  - T1195.002
  - T1557
  categories:
  - endpoint
references:
- https://notepad-plus-plus.org/news/v889-released/
- https://www.heise.de/en/news/Notepad-updater-installed-malware-11109726.html
- https://www.rapid7.com/blog/post/tr-chrysalis-backdoor-dive-into-lotus-blossoms-toolkit/
- https://www.validin.com/blog/exploring_notepad_plus_plus_network_indicators/
- https://securelist.com/notepad-supply-chain-attack/118708/
logsource:
  category: process_creation
  product: windows
detection:
  selection_parent:
    ParentImage|endswith: \gup.exe
  selection_child_img:
    Image|endswith:
    - \cmd.exe
    - \powershell.exe
    - \pwsh.exe
    - \cscript.exe
    - \wscript.exe
    - \mshta.exe
  selection_child_cli:
    CommandLine|contains:
    - bitsadmin
    - certutil
    - curl
    - finger
    - forfiles
    - regsvr32
    - rundll32
    - wget
  condition: selection_parent and 1 of selection_child_*
provenance:
  source: SigmaHQ/sigma
  source_id: bb0e87ce-c89f-4857-84fa-095e4483e9cb
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_gup_susp_child_process.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: experimental'
