id: sigmahq-sigma-c443012c-7928-43bf-ac20-7eda5efe61ad
name: Suspicious Uninstall of Windows Defender Feature via PowerShell
description: Detects the use of PowerShell with Uninstall-WindowsFeature or Remove-WindowsFeature
  cmdlets to disable or remove the Windows Defender GUI feature, a common technique
  used by adversaries to evade defenses.
severity: high
enabled: false
tags:
  mitre:
  - T1685
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/powershell/module/microsoft.windows.servermanager.migration/uninstall-windowsfeature
- https://thedfirreport.com/2023/04/03/malicious-iso-file-leads-to-domain-wide-ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - \powershell_ise.exe
    - \powershell.exe
    - \pwsh.exe
  - OriginalFileName:
    - PowerShell_ISE.EXE
    - PowerShell.EXE
    - pwsh.dll
  selection_cli_uninstall:
    CommandLine|contains:
    - Uninstall-WindowsFeature
    - Remove-WindowsFeature
  selection_cli_defender_feature:
    CommandLine|contains: Windows-Defender
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: c443012c-7928-43bf-ac20-7eda5efe61ad
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_powershell_uninstall_defender_feature.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: experimental'
