id: sigmahq-sigma-9a4ff3b8-6187-4fd2-8e8b-e0eae1129495
name: SysKey Registry Keys Access
description: Detects handle requests and access operations to specific registry keys
  to calculate the SysKey
severity: high
enabled: false
tags:
  mitre:
  - T1012
  categories:
  - endpoint
references:
- https://threathunterplaybook.com/hunts/windows/190625-RegKeyAccessSyskey/notebook.html
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID:
    - 4656
    - 4663
    ObjectType: key
    ObjectName|endswith:
    - lsa\JD
    - lsa\GBG
    - lsa\Skew1
    - lsa\Data
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 9a4ff3b8-6187-4fd2-8e8b-e0eae1129495
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/security/win_security_syskey_registry_access.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
