id: sigmahq-sigma-3fcc9b35-39e4-44c0-a2ad-9e82b6902b31
name: Syslog Clearing or Removal Via System Utilities
description: Detects specific commands commonly used to remove or empty the syslog.
  Which is a technique often used by attacker as a method to hide their tracks
severity: high
enabled: false
tags:
  mitre:
  - T1685.006
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1070.002/T1070.002.md
- https://www.virustotal.com/gui/file/54d60fd58d7fa3475fa123985bfc1594df26da25c1f5fbc7dfdba15876dd8ac5/behavior
logsource:
  product: linux
  category: process_creation
detection:
  selection_file:
    CommandLine|contains: /var/log/syslog
  selection_command_rm:
    Image|endswith: /rm
    CommandLine|contains:
    - ' -r '
    - ' -f '
    - ' -rf '
    - /var/log/syslog
  selection_command_unlink:
    Image|endswith: /unlink
  selection_command_mv:
    Image|endswith: /mv
  selection_command_truncate:
    Image|endswith: /truncate
    CommandLine|contains|all:
    - '0 '
    - /var/log/syslog
    CommandLine|contains:
    - '-s '
    - '-c '
    - --size
  selection_command_ln:
    Image|endswith: /ln
    CommandLine|contains|all:
    - '/dev/null '
    - /var/log/syslog
    CommandLine|contains:
    - '-sf '
    - '-sfn '
    - '-sfT '
  selection_command_cp:
    Image|endswith: /cp
    CommandLine|contains: /dev/null
  selection_command_shred:
    Image|endswith: /shred
    CommandLine|contains: '-u '
  selection_unique_other:
    CommandLine|contains:
    - ' > /var/log/syslog'
    - ' >/var/log/syslog'
    - ' >| /var/log/syslog'
    - ': > /var/log/syslog'
    - :> /var/log/syslog
    - :>/var/log/syslog
    - '>|/var/log/syslog'
  selection_unique_journalctl:
    CommandLine|contains:
    - journalctl --vacuum
    - journalctl --rotate
  condition: (selection_file and 1 of selection_command_*) or 1 of selection_unique_*
provenance:
  source: SigmaHQ/sigma
  source_id: 3fcc9b35-39e4-44c0-a2ad-9e82b6902b31
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/process_creation/proc_creation_lnx_clear_syslog.yml
falsepositives:
- Log rotation.
- Maintenance.
notes:
  quarantine_reason: 'upstream status: test'
