id: sigmahq-sigma-693a44e9-7f26-4cb6-b787-214867672d3a
name: Sysmon File Executable Creation Detected
description: Triggers on any Sysmon "FileExecutableDetected" event, which triggers
  every time a PE that is monitored by the config is created.
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/sysinternals/downloads/sysmon
- https://medium.com/@olafhartong/sysmon-15-0-file-executable-detected-40fd64349f36
logsource:
  product: windows
  service: sysmon
detection:
  selection:
    EventID: 29
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 693a44e9-7f26-4cb6-b787-214867672d3a
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/sysmon/sysmon_file_executable_detected.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
