id: sigmahq-sigma-8ac03a65-6c84-4116-acad-dc1558ff7a77
name: Sysmon Configuration Change
description: Detects a Sysmon configuration change, which could be the result of a
  legitimate reconfiguration or someone trying manipulate the configuration
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/sysinternals/downloads/sysmon
logsource:
  product: windows
  service: sysmon
detection:
  selection:
    EventID: 16
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 8ac03a65-6c84-4116-acad-dc1558ff7a77
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/sysmon/sysmon_config_modification.yml
falsepositives:
- Legitimate administrative action
notes:
  quarantine_reason: 'upstream status: test'
