id: sigmahq-sigma-37db85d1-b089-490a-a59a-c7b6f984f480
name: Sysmon Discovery Via Default Driver Altitude Using Findstr.EXE
description: Detects usage of "findstr" with the argument "385201". Which could indicate
  potential discovery of an installed Sysinternals Sysmon service using the default
  driver altitude (even if the name is changed).
severity: high
enabled: false
tags:
  mitre:
  - T1518.001
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1518.001/T1518.001.md#atomic-test-5---security-software-discovery---sysmon-service
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - \find.exe
    - \findstr.exe
  - OriginalFileName:
    - FIND.EXE
    - FINDSTR.EXE
  selection_cli:
    CommandLine|contains: ' 385201'
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 37db85d1-b089-490a-a59a-c7b6f984f480
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_findstr_sysmon_discovery_via_default_altitude.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
