id: sigmahq-sigma-23b71bc5-953e-4971-be4c-c896cda73fc2
name: Sysmon Blocked Executable
description: Triggers on any Sysmon "FileBlockExecutable" event, which indicates a
  violation of the configured block policy
severity: high
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://medium.com/@olafhartong/sysmon-14-0-fileblockexecutable-13d7ba3dff3e
logsource:
  product: windows
  service: sysmon
detection:
  selection:
    EventID: 27
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 23b71bc5-953e-4971-be4c-c896cda73fc2
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/sysmon/sysmon_file_block_executable.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
