id: sigmahq-sigma-4d7f1827-1637-4def-8d8a-fd254f9454df
name: Sysmon Application Crashed
description: Detects application popup reporting a failure of the Sysmon service
severity: high
enabled: false
tags:
  mitre:
  - T1685
  categories:
  - endpoint
references:
- https://github.com/nasbench/EVTX-ETW-Resources/blob/f1b010ce0ee1b71e3024180de1a3e67f99701fe4/ETWProvidersManifests/Windows10/1803/W10_1803_Pro_19700101_17134.1/WEPExplorer/Application%20Popup.xml#L36
logsource:
  product: windows
  service: system
detection:
  selection:
    Provider_Name: Application Popup
    EventID: 26
    Caption:
    - sysmon64.exe - Application Error
    - sysmon.exe - Application Error
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 4d7f1827-1637-4def-8d8a-fd254f9454df
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/system/application_popup/win_system_application_sysmon_crash.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
