id: sigmahq-sigma-4916a35e-bfc4-47d0-8e25-a003d7067061
name: Sysmon Driver Altitude Change
description: 'Detects changes in Sysmon driver altitude value.

  If the Sysmon driver is configured to load at an altitude of another registered
  service, it will fail to load at boot.'
severity: high
enabled: false
tags:
  mitre:
  - T1685
  categories:
  - endpoint
references:
- https://posts.specterops.io/shhmon-silencing-sysmon-via-driver-unload-682b5be57650
- https://youtu.be/zSihR3lTf7g
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains: \Services\
    TargetObject|endswith: \Instances\Sysmon Instance\Altitude
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 4916a35e-bfc4-47d0-8e25-a003d7067061
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_change_sysmon_driver_altitude.yml
falsepositives:
- Legitimate driver altitude change to hide sysmon
notes:
  quarantine_reason: 'upstream status: test'
