id: sigmahq-sigma-c3e5c1b1-45e9-4632-b242-27939c170239
name: Sysmon Blocked File Shredding
description: Triggers on any Sysmon "FileBlockShredding" event, which indicates a
  violation of the configured shredding policy.
severity: high
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/sysinternals/downloads/sysmon
logsource:
  product: windows
  service: sysmon
detection:
  selection:
    EventID: 28
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: c3e5c1b1-45e9-4632-b242-27939c170239
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/sysmon/sysmon_file_block_shredding.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
