id: sigmahq-sigma-5de06a6f-673a-4fc0-8d48-bcfe3837b033
name: System Information Discovery Using sw_vers
description: Detects the use of "sw_vers" for system information discovery
severity: medium
enabled: false
tags:
  mitre:
  - T1082
  categories:
  - endpoint
references:
- https://www.virustotal.com/gui/file/d3fa64f63563fe958b75238742d1e473800cb5f49f5cb79d38d4aa3c93709026/behavior
- https://www.virustotal.com/gui/file/03b71eaceadea05bc0eea5cddecaa05f245126d6b16cfcd0f3ba0442ac58dab3/behavior
- https://ss64.com/osx/sw_vers.html
logsource:
  product: macos
  category: process_creation
detection:
  selection_image:
    Image|endswith: /sw_vers
  selection_options:
    CommandLine|contains:
    - -buildVersion
    - -productName
    - -productVersion
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 5de06a6f-673a-4fc0-8d48-bcfe3837b033
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/macos/process_creation/proc_creation_macos_swvers_discovery.yml
falsepositives:
- Legitimate administrative activities
notes:
  quarantine_reason: 'upstream status: test'
