id: sigmahq-sigma-0022869c-49f7-4ff2-ba03-85ac42ddac58
name: System Information Discovery via Registry Queries
description: Detects attempts to query system information directly from the Windows
  Registry.
severity: low
enabled: false
tags:
  mitre:
  - T1082
  categories:
  - endpoint
references:
- https://cert.gov.ua/article/6277849
- https://github.com/redcanaryco/atomic-red-team/blob/75fa21076dcefa348a7521403cdd6bfc4e88623c/atomics/T1082/T1082.md
- https://github.com/redcanaryco/atomic-red-team/blob/75fa21076dcefa348a7521403cdd6bfc4e88623c/atomics/T1124/T1124.md
logsource:
  category: process_creation
  product: windows
detection:
  selection_cmd_reg:
    Image|endswith: \reg.exe
    CommandLine|contains: query
    CommandLine|contains|windash: -v
  selection_cmd_powershell:
    Image|endswith:
    - \powershell.exe
    - \pwsh.exe
    CommandLine|contains:
    - Get-ItemPropertyValue
    - gpv
  selection_keys:
    CommandLine|contains:
    - \SOFTWARE\Microsoft\Windows Defender
    - \SOFTWARE\Microsoft\Windows NT\CurrentVersion
    - \SOFTWARE\Microsoft\Windows\CurrentVersion\Uninstall
    - \SYSTEM\CurrentControlSet\Control\TimeZoneInformation
    - \SYSTEM\CurrentControlSet\Services
  condition: 1 of selection_cmd_* and selection_keys
provenance:
  source: SigmaHQ/sigma
  source_id: 0022869c-49f7-4ff2-ba03-85ac42ddac58
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_discovery_via_reg_queries.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: experimental'
