id: sigmahq-sigma-1c67a717-32ba-409b-a45d-0fb704a73a81
name: System Network Connections Discovery Via Net.EXE
description: Adversaries may attempt to get a listing of network connections to or
  from the compromised system they are currently accessing or from remote systems
  by querying for information over the network.
severity: low
enabled: false
tags:
  mitre:
  - T1049
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1049/T1049.md#atomic-test-1---system-network-connections-discovery
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - \net.exe
    - \net1.exe
  - OriginalFileName:
    - net.exe
    - net1.exe
  selection_cli:
  - CommandLine|endswith:
    - ' use'
    - ' sessions'
  - CommandLine|contains:
    - ' use '
    - ' sessions '
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 1c67a717-32ba-409b-a45d-0fb704a73a81
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_net_use_network_connections_discovery.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
