id: sigmahq-sigma-4c519226-f0cd-4471-bd2f-6fbb2bb68a79
name: System Network Connections Discovery - Linux
description: Detects usage of system utilities to discover system network connections
severity: low
enabled: false
tags:
  mitre:
  - T1049
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1049/T1049.md
logsource:
  category: process_creation
  product: linux
detection:
  selection:
    Image|endswith:
    - /who
    - /w
    - /last
    - /lsof
    - /netstat
  filter_landscape_sysinfo:
    ParentCommandLine|contains: /usr/bin/landscape-sysinfo
    Image|endswith: /who
  condition: selection and not 1 of filter_*
provenance:
  source: SigmaHQ/sigma
  source_id: 4c519226-f0cd-4471-bd2f-6fbb2bb68a79
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/process_creation/proc_creation_lnx_system_network_connections_discovery.yml
falsepositives:
- Legitimate activities
notes:
  quarantine_reason: 'upstream status: test'
