id: sigmahq-sigma-b207d563-a1d9-4275-b349-77d1eb55aa6d
name: System Info Discovery via Sysinfo Syscall
description: 'Detects use of the sysinfo system call in Linux, which provides a snapshot
  of key system statistics such as uptime, load averages, memory usage, and the number
  of running processes.

  Malware or reconnaissance tools might leverage sysinfo to fingerprint the system
  - gathering data to determine if it''s a viable target.'
severity: low
enabled: false
tags:
  mitre:
  - T1057
  - T1082
  categories:
  - endpoint
references:
- https://github.com/CheraghiMilad/bypass-Neo23x0-auditd-config/blob/f1c478a37911a5447d5ffcd580f22b167bf3df14/sysinfo-syscall/README.md
- https://man7.org/linux/man-pages/man2/sysinfo.2.html
logsource:
  product: linux
  service: auditd
  definition: 'Required auditd configuration:

    -a always,exit -F arch=b64 -S sysinfo -k discovery_sysinfo_syscall

    -a always,exit -F arch=b32 -S sysinfo -k discovery_sysinfo_syscall

    '
detection:
  selection:
    type: SYSCALL
    SYSCALL: sysinfo
  filter_optional_splunk:
    exe|endswith: /bin/splunkd
  condition: selection and not 1 of filter_optional_*
provenance:
  source: SigmaHQ/sigma
  source_id: b207d563-a1d9-4275-b349-77d1eb55aa6d
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/auditd/syscall/lnx_auditd_susp_discovery_sysinfo_syscall.yml
falsepositives:
- Legitimate administrative activity
notes:
  quarantine_reason: 'upstream status: experimental'
