id: sigmahq-sigma-40b1fbe2-18ea-4ee7-be47-0294285811de
name: System Shutdown/Reboot - MacOs
description: Adversaries may shutdown/reboot systems to interrupt access to, or aid
  in the destruction of, those systems.
severity: low
enabled: false
tags:
  mitre:
  - T1529
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1529/T1529.md
logsource:
  product: macos
  category: process_creation
detection:
  selection:
    Image|endswith:
    - /shutdown
    - /reboot
    - /halt
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 40b1fbe2-18ea-4ee7-be47-0294285811de
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/macos/process_creation/proc_creation_macos_system_shutdown_reboot.yml
falsepositives:
- Legitimate administrative activity
notes:
  quarantine_reason: 'upstream status: test'
