id: sigmahq-sigma-1bac86ba-41aa-4f62-9d6b-405eac99b485
name: Systemd Service Creation
description: Detects a creation of systemd services which could be used by adversaries
  to execute malicious code.
severity: medium
enabled: false
tags:
  mitre:
  - T1543.002
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1543.002/T1543.002.md
logsource:
  product: linux
  service: auditd
detection:
  path:
    type: PATH
    nametype: CREATE
  name_1:
    name|startswith:
    - /usr/lib/systemd/system/
    - /etc/systemd/system/
  name_2:
    name|contains: /.config/systemd/user/
  condition: path and 1 of name_*
provenance:
  source: SigmaHQ/sigma
  source_id: 1bac86ba-41aa-4f62-9d6b-405eac99b485
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/auditd/path/lnx_auditd_systemd_service_creation.yml
falsepositives:
- Admin work like legit service installs.
notes:
  quarantine_reason: 'upstream status: test'
