id: sigmahq-sigma-58800443-f9fc-4d55-ae0c-98a3966dfb97
name: System Network Discovery - macOS
description: Detects enumeration of local network configuration
severity: low
enabled: false
tags:
  mitre:
  - T1016
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1016/T1016.md
logsource:
  product: macos
  category: process_creation
detection:
  selection_1:
    Image|endswith:
    - /arp
    - /ifconfig
    - /netstat
    - /networksetup
    - /socketfilterfw
  selection_2:
    Image: /usr/bin/defaults
    CommandLine|contains|all:
    - /Library/Preferences/com.apple.alf
    - read
  filter_main_wifivelocityd:
    ParentImage|endswith: /wifivelocityd
  condition: 1 of selection_* and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 58800443-f9fc-4d55-ae0c-98a3966dfb97
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/macos/process_creation/proc_creation_macos_susp_system_network_discovery.yml
falsepositives:
- Legitimate administration activities
notes:
  quarantine_reason: 'upstream status: test'
