id: sigmahq-sigma-9a0d8ca0-2385-4020-b6c6-cb6153ca56f3
name: System Owner or User Discovery - Linux
description: 'Detects the execution of host or user discovery utilities such as "whoami",
  "hostname", "id", etc.

  Adversaries may use the information from System Owner/User Discovery during automated
  discovery to shape follow-on behaviors, including whether or not the adversary fully
  infects the target and/or attempts specific actions.'
severity: low
enabled: false
tags:
  mitre:
  - T1033
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1033/T1033.md
logsource:
  product: linux
  service: auditd
detection:
  selection:
    type: EXECVE
    a0:
    - hostname
    - id
    - last
    - uname
    - users
    - w
    - who
    - whoami
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 9a0d8ca0-2385-4020-b6c6-cb6153ca56f3
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/auditd/execve/lnx_auditd_user_discovery.yml
falsepositives:
- Admin activity
notes:
  quarantine_reason: 'upstream status: test'
