id: sigmahq-sigma-f6c68d5f-e101-4b86-8c84-7d96851fd65c
name: T1047 Wmiprvse Wbemcomn DLL Hijack
description: Detects a threat actor creating a file named `wbemcomn.dll` in the `C:\Windows\System32\wbem\`
  directory over the network for a WMI DLL Hijack scenario.
severity: high
enabled: false
tags:
  mitre:
  - T1047
  - T1021.002
  categories:
  - endpoint
references:
- https://threathunterplaybook.com/hunts/windows/201009-RemoteWMIWbemcomnDLLHijack/notebook.html
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 5145
    RelativeTargetName|endswith: \wbem\wbemcomn.dll
  filter:
    SubjectUserName|endswith: $
  condition: selection and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: f6c68d5f-e101-4b86-8c84-7d96851fd65c
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/security/win_security_wmiprvse_wbemcomn_dll_hijack.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
