id: sigmahq-sigma-4bb79b62-ef12-4861-981d-2aab43fab642
name: TacticalRMM Service Installation
description: Detects a TacticalRMM service installation. Tactical RMM is a remote
  monitoring & management tool.
severity: medium
enabled: false
tags:
  mitre:
  - T1219.002
  categories:
  - endpoint
references:
- https://thedfirreport.com/2022/11/28/emotet-strikes-again-lnk-file-leads-to-domain-wide-ransomware/
logsource:
  product: windows
  service: system
detection:
  selection_root:
    Provider_Name: Service Control Manager
    EventID: 7045
  selection_service:
  - ImagePath|contains: tacticalrmm.exe
  - ServiceName|contains: TacticalRMM Agent Service
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 4bb79b62-ef12-4861-981d-2aab43fab642
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/system/service_control_manager/win_system_service_install_tacticalrmm.yml
falsepositives:
- Legitimate use of the tool
notes:
  quarantine_reason: 'upstream status: test'
