id: sigmahq-sigma-ec19ebab-72dc-40e1-9728-4c0b805d722c
name: Tamper Windows Defender - PSClassic
description: Attempting to disable scheduled scanning and other parts of Windows Defender
  ATP or set default actions to allow.
severity: high
enabled: false
tags:
  mitre:
  - T1685
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md
logsource:
  product: windows
  category: ps_classic_provider_start
detection:
  selection_set_mppreference:
    Data|contains: Set-MpPreference
  selection_options_bool_allow:
    Data|contains:
    - -dbaf $true
    - -dbaf 1
    - -dbm $true
    - -dbm 1
    - -dips $true
    - -dips 1
    - -DisableArchiveScanning $true
    - -DisableArchiveScanning 1
    - -DisableBehaviorMonitoring $true
    - -DisableBehaviorMonitoring 1
    - -DisableBlockAtFirstSeen $true
    - -DisableBlockAtFirstSeen 1
    - -DisableCatchupFullScan $true
    - -DisableCatchupFullScan 1
    - -DisableCatchupQuickScan $true
    - -DisableCatchupQuickScan 1
    - -DisableIntrusionPreventionSystem $true
    - -DisableIntrusionPreventionSystem 1
    - -DisableIOAVProtection $true
    - -DisableIOAVProtection 1
    - -DisableRealtimeMonitoring $true
    - -DisableRealtimeMonitoring 1
    - -DisableRemovableDriveScanning $true
    - -DisableRemovableDriveScanning 1
    - -DisableScanningMappedNetworkDrivesForFullScan $true
    - -DisableScanningMappedNetworkDrivesForFullScan 1
    - -DisableScanningNetworkFiles $true
    - -DisableScanningNetworkFiles 1
    - -DisableScriptScanning $true
    - -DisableScriptScanning 1
    - -MAPSReporting $false
    - -MAPSReporting 0
    - -drdsc $true
    - -drdsc 1
    - -drtm $true
    - -drtm 1
    - -dscrptsc $true
    - -dscrptsc 1
    - -dsmndf $true
    - -dsmndf 1
    - -dsnf $true
    - -dsnf 1
    - -dss $true
    - -dss 1
  selection_options_actions_func:
    Data|contains:
    - HighThreatDefaultAction Allow
    - htdefac Allow
    - LowThreatDefaultAction Allow
    - ltdefac Allow
    - ModerateThreatDefaultAction Allow
    - mtdefac Allow
    - SevereThreatDefaultAction Allow
    - stdefac Allow
  condition: selection_set_mppreference and 1 of selection_options_*
provenance:
  source: SigmaHQ/sigma
  source_id: ec19ebab-72dc-40e1-9728-4c0b805d722c
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_classic/posh_pc_tamper_windows_defender_set_mp.yml
falsepositives:
- Legitimate PowerShell scripts that disable Windows Defender for troubleshooting
  purposes. Must be investigated.
notes:
  quarantine_reason: 'upstream status: test'
