id: sigmahq-sigma-ae2bdd58-0681-48ac-be7f-58ab4e593458
name: Tamper Windows Defender Remove-MpPreference - ScriptBlockLogging
description: Detects attempts to remove Windows Defender configuration using the 'MpPreference'
  cmdlet
severity: high
enabled: false
tags:
  mitre:
  - T1685
  categories:
  - endpoint
references:
- https://techcommunity.microsoft.com/t5/core-infrastructure-and-security/windows-10-controlled-folder-access-event-search/ba-p/2326088
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection_remove:
    ScriptBlockText|contains: Remove-MpPreference
  selection_tamper:
    ScriptBlockText|contains:
    - '-ControlledFolderAccessProtectedFolders '
    - '-AttackSurfaceReductionRules_Ids '
    - '-AttackSurfaceReductionRules_Actions '
    - '-CheckForSignaturesBeforeRunningScan '
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: ae2bdd58-0681-48ac-be7f-58ab4e593458
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_tamper_windows_defender_rem_mp.yml
falsepositives:
- Legitimate PowerShell scripts
notes:
  quarantine_reason: 'upstream status: test'
