id: sigmahq-sigma-9fff585c-c33e-4a86-b3cd-39312079a65f
name: Taskmgr as LOCAL_SYSTEM
description: Detects the creation of taskmgr.exe process in context of LOCAL_SYSTEM
severity: high
enabled: false
tags:
  mitre:
  - T1036
  categories:
  - endpoint
references:
- Internal Research
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    User|contains:
    - AUTHORI
    - AUTORI
    Image|endswith: \taskmgr.exe
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 9fff585c-c33e-4a86-b3cd-39312079a65f
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_taskmgr_localsystem.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
