id: sigmahq-sigma-b494b165-6634-483d-8c47-2026a6c52372
name: Telegram API Access
description: Detects suspicious requests to Telegram API without the usual Telegram
  User-Agent
severity: medium
enabled: false
tags:
  mitre:
  - T1071.001
  - T1102.002
  categories:
  - network
references:
- https://researchcenter.paloaltonetworks.com/2018/03/unit42-telerat-another-android-trojan-leveraging-telegrams-bot-api-to-target-iranian-users/
- https://blog.malwarebytes.com/threat-analysis/2016/11/telecrypt-the-ransomware-abusing-telegram-api-defeated/
- https://www.welivesecurity.com/2016/12/13/rise-telebots-analyzing-disruptive-killdisk-attacks/
logsource:
  category: proxy
detection:
  selection:
    cs-host: api.telegram.org
  filter:
    c-useragent|contains:
    - Telegram
    - Bot
  condition: selection and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: b494b165-6634-483d-8c47-2026a6c52372
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/web/proxy_generic/proxy_telegram_api.yml
falsepositives:
- Legitimate use of Telegram bots in the company
notes:
  quarantine_reason: 'upstream status: test'
