id: sigmahq-sigma-fa84aaf5-8142-43cd-9ec2-78cfebf878ce
name: Temporary Access Pass Added To An Account
description: Detects when a temporary access pass (TAP) is added to an account. TAPs
  added to priv accounts should be investigated
severity: high
enabled: false
tags:
  mitre:
  - T1078.004
  categories:
  - cloud
references:
- https://learn.microsoft.com/en-us/entra/architecture/security-operations-privileged-accounts#changes-to-privileged-accounts
logsource:
  product: azure
  service: auditlogs
detection:
  selection:
    properties.message: Admin registered security info
    Status: Admin registered temporary access pass method for user
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: fa84aaf5-8142-43cd-9ec2-78cfebf878ce
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/azure/audit_logs/azure_tap_added.yml
falsepositives:
- Administrator adding a legitimate temporary access pass
notes:
  quarantine_reason: 'upstream status: test'
