id: sigmahq-sigma-1012f107-b8f1-4271-af30-5aed2de89b39
name: Terminal Service Process Spawn
description: Detects a process spawned by the terminal service server process (this
  could be an indicator for an exploitation of CVE-2019-0708)
severity: high
enabled: false
tags:
  mitre:
  - T1190
  - T1210
  categories:
  - endpoint
references:
- https://securingtomorrow.mcafee.com/other-blogs/mcafee-labs/rdp-stands-for-really-do-patch-understanding-the-wormable-rdp-vulnerability-cve-2019-0708/
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    ParentCommandLine|contains|all:
    - \svchost.exe
    - termsvcs
  filter_img:
    Image|endswith:
    - \rdpclip.exe
    - :\Windows\System32\csrss.exe
    - :\Windows\System32\wininit.exe
    - :\Windows\System32\winlogon.exe
  filter_null:
    Image: null
  condition: selection and not 1 of filter_*
provenance:
  source: SigmaHQ/sigma
  source_id: 1012f107-b8f1-4271-af30-5aed2de89b39
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_svchost_termserv_proc_spawn.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
