id: sigmahq-sigma-452df256-da78-427a-866f-49fa04417d74
name: Time Machine Backup Deletion Attempt Via Tmutil - MacOS
description: 'Detects deletion attempts of MacOS Time Machine backups via the native
  backup utility "tmutil".

  An adversary may perform this action before launching a ransonware attack to prevent
  the victim from restoring their files.'
severity: medium
enabled: false
tags:
  mitre:
  - T1490
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1490/T1490.md#atomic-test-12---disable-time-machine
- https://www.loobins.io/binaries/tmutil/
logsource:
  category: process_creation
  product: macos
detection:
  selection_img:
  - Image|endswith: /tmutil
  - CommandLine|contains: tmutil
  selection_cmd:
    CommandLine|contains: delete
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 452df256-da78-427a-866f-49fa04417d74
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/macos/process_creation/proc_creation_macos_tmutil_delete_backup.yml
falsepositives:
- Legitimate activities
notes:
  quarantine_reason: 'upstream status: test'
