id: sigmahq-sigma-62f7c9bf-9135-49b2-8aeb-1e54a6ecc13c
name: Tor Client/Browser Execution
description: Detects the use of Tor or Tor-Browser to connect to onion routing networks
severity: high
enabled: false
tags:
  mitre:
  - T1090.003
  categories:
  - endpoint
references:
- https://www.logpoint.com/en/blog/detecting-tor-use-with-logpoint/
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Description: Tor Browser
  - Product: Tor Browser
  - Image|endswith:
    - \tor.exe
    - \Tor Browser\Browser\firefox.exe
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 62f7c9bf-9135-49b2-8aeb-1e54a6ecc13c
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_browsers_tor_execution.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
