id: sigmahq-sigma-31545105-3444-4584-bebf-c466353230d2
name: Touch Suspicious Service File
description: Detects usage of the "touch" process in service file.
severity: medium
enabled: false
tags:
  mitre:
  - T1070.006
  categories:
  - endpoint
references:
- https://blogs.blackberry.com/
- https://twitter.com/Joseliyo_Jstnk/status/1620131033474822144
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    Image|endswith: /touch
    CommandLine|contains: ' -t '
    CommandLine|endswith: .service
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 31545105-3444-4584-bebf-c466353230d2
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/process_creation/proc_creation_lnx_touch_susp.yml
falsepositives:
- Admin changing date of files.
notes:
  quarantine_reason: 'upstream status: test'
