id: sigmahq-sigma-2e69f167-47b5-4ae7-a390-47764529eff5
name: Transferring Files with Credential Data via Network Shares - Zeek
description: Transferring files with well-known filenames (sensitive files with credential
  data) using network shares
severity: medium
enabled: false
tags:
  mitre:
  - T1003.002
  - T1003.001
  - T1003.003
  categories:
  - endpoint
references:
- https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
logsource:
  product: zeek
  service: smb_files
detection:
  selection:
    name:
    - \mimidrv
    - \lsass
    - \windows\minidump\
    - \hiberfil
    - \sqldmpr
    - \sam
    - \ntds.dit
    - \security
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 2e69f167-47b5-4ae7-a390-47764529eff5
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/network/zeek/zeek_smb_converted_win_transferring_files_with_credential_data.yml
falsepositives:
- Transferring sensitive files for legitimate administration work by legitimate administrator
notes:
  quarantine_reason: 'upstream status: test'
