id: sigmahq-sigma-910ab938-668b-401b-b08c-b596e80fdca5
name: Transferring Files with Credential Data via Network Shares
description: Transferring files with well-known filenames (sensitive files with credential
  data) using network shares
severity: medium
enabled: false
tags:
  mitre:
  - T1003.002
  - T1003.001
  - T1003.003
  categories:
  - endpoint
references:
- https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
logsource:
  product: windows
  service: security
detection:
  selection_eid:
    EventID: 5145
  selection_object:
  - RelativeTargetName|contains:
    - \mimidrv
    - \lsass
    - \windows\minidump\
    - \hiberfil
    - \sqldmpr
  - RelativeTargetName:
    - Windows\NTDS\ntds.dit
    - Windows\System32\config\SAM
    - Windows\System32\config\SECURITY
    - Windows\System32\config\SYSTEM
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 910ab938-668b-401b-b08c-b596e80fdca5
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/security/win_security_transf_files_with_cred_data_via_network_shares.yml
falsepositives:
- Transferring sensitive files for legitimate administration work by legitimate administrator
notes:
  quarantine_reason: 'upstream status: test'
