id: sigmahq-sigma-22236d75-d5a0-4287-bf06-c93b1770860f
name: Triple Cross eBPF Rootkit Install Commands
description: Detects default install commands of the Triple Cross eBPF rootkit based
  on the "deployer.sh" script
severity: high
enabled: false
tags:
  mitre:
  - T1014
  categories:
  - endpoint
references:
- https://github.com/h3xduck/TripleCross/blob/1f1c3e0958af8ad9f6ebe10ab442e75de33e91de/apps/deployer.sh
logsource:
  category: process_creation
  product: linux
detection:
  selection:
    Image|endswith: /sudo
    CommandLine|contains|all:
    - ' tc '
    - ' enp0s3 '
    CommandLine|contains:
    - ' qdisc '
    - ' filter '
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 22236d75-d5a0-4287-bf06-c93b1770860f
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/process_creation/proc_creation_lnx_triple_cross_rootkit_install.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
