id: sigmahq-sigma-c0239255-822c-4630-b7f1-35362bcb8f44
name: Triple Cross eBPF Rootkit Default LockFile
description: Detects the creation of the file "rootlog" which is used by the TripleCross
  rootkit as a way to check if the backdoor is already running.
severity: high
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://github.com/h3xduck/TripleCross/blob/1f1c3e0958af8ad9f6ebe10ab442e75de33e91de/src/helpers/execve_hijack.c#L33
logsource:
  product: linux
  category: file_event
detection:
  selection:
    TargetFilename: /tmp/rootlog
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: c0239255-822c-4630-b7f1-35362bcb8f44
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/file_event/file_event_lnx_triple_cross_rootkit_lock_file.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
