id: sigmahq-sigma-03409c93-a7c7-49ba-9a4c-a00badf2a153
name: Troubleshooting Pack Cmdlet Execution
description: Detects execution of "TroubleshootingPack" cmdlets to leverage CVE-2022-30190
  or action similar to "msdt" lolbin (as described in LOLBAS)
severity: medium
enabled: false
tags:
  mitre:
  - T1202
  categories:
  - endpoint
references:
- https://twitter.com/nas_bench/status/1537919885031772161
- https://lolbas-project.github.io/lolbas/Binaries/Msdt/
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection:
    ScriptBlockText|contains|all:
    - Invoke-TroubleshootingPack
    - C:\Windows\Diagnostics\System\PCW
    - -AnswerFile
    - -Unattended
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 03409c93-a7c7-49ba-9a4c-a00badf2a153
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_susp_follina_execution.yml
falsepositives:
- Legitimate usage of "TroubleshootingPack" cmdlet for troubleshooting purposes
notes:
  quarantine_reason: 'upstream status: test'
