id: sigmahq-sigma-89a9a0e0-f61a-42e5-8957-b1479565a658
name: UAC Bypass WSReset
description: Detects the pattern of UAC Bypass via WSReset usable by default sysmon-config
severity: high
enabled: false
tags:
  mitre:
  - T1548.002
  categories:
  - endpoint
references:
- https://lolbas-project.github.io/lolbas/Binaries/Wsreset/
- https://github.com/hfiref0x/UACME
- https://medium.com/falconforce/falconfriday-detecting-uac-bypasses-0xff16-86c2a9107abf
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: \wsreset.exe
    IntegrityLevel:
    - High
    - System
    - S-1-16-16384
    - S-1-16-12288
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 89a9a0e0-f61a-42e5-8957-b1479565a658
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_uac_bypass_wsreset_integrity_level.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
