id: sigmahq-sigma-5b872a46-3b90-45c1-8419-f675db8053aa
name: UAC Bypass via Sdclt
description: Detects the pattern of UAC Bypass using registry key manipulation of
  sdclt.exe (e.g. UACMe 53)
severity: high
enabled: false
tags:
  mitre:
  - T1548.002
  categories:
  - endpoint
references:
- https://enigma0x3.net/2017/03/17/fileless-uac-bypass-using-sdclt-exe/
- https://github.com/hfiref0x/UACME
logsource:
  category: registry_set
  product: windows
detection:
  selection1:
    TargetObject|endswith: Software\Classes\exefile\shell\runas\command\isolatedCommand
  selection2:
    TargetObject|endswith: Software\Classes\Folder\shell\open\command\SymbolicLinkValue
    Details|re: -1[0-9]{3}\\Software\\Classes\\
  condition: 1 of selection*
provenance:
  source: SigmaHQ/sigma
  source_id: 5b872a46-3b90-45c1-8419-f675db8053aa
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_uac_bypass_sdclt.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
