id: sigmahq-sigma-7c81fec3-1c1d-43b0-996a-46753041b1b6
name: UAC Bypass via Event Viewer
description: Detects UAC bypass method using Windows event viewer
severity: high
enabled: false
tags:
  mitre:
  - T1548.002
  categories:
  - endpoint
references:
- https://enigma0x3.net/2016/08/15/fileless-uac-bypass-using-eventvwr-exe-and-registry-hijacking/
- https://www.hybrid-analysis.com/sample/e122bc8bf291f15cab182a5d2d27b8db1e7019e4e96bb5cdbd1dfe7446f3f51f?environmentId=100
logsource:
  product: windows
  category: registry_set
detection:
  selection:
    TargetObject|endswith: \mscfile\shell\open\command
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 7c81fec3-1c1d-43b0-996a-46753041b1b6
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_uac_bypass_eventvwr.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
