id: sigmahq-sigma-0058b9e5-bcd7-40d4-9205-95ca5a16d7b2
name: UAC Bypass Using Windows Media Player - Process
description: Detects the pattern of UAC Bypass using Windows Media Player osksupport.dll
  (UACMe 32)
severity: high
enabled: false
tags:
  mitre:
  - T1548.002
  categories:
  - endpoint
references:
- https://github.com/hfiref0x/UACME
logsource:
  category: process_creation
  product: windows
detection:
  selection_img_1:
    Image: C:\Program Files\Windows Media Player\osk.exe
  selection_img_2:
    Image: C:\Windows\System32\cmd.exe
    ParentCommandLine: '"C:\Windows\system32\mmc.exe" "C:\Windows\system32\eventvwr.msc"
      /s'
  selection_integrity:
    IntegrityLevel:
    - High
    - System
    - S-1-16-16384
    - S-1-16-12288
  condition: 1 of selection_img_* and selection_integrity
provenance:
  source: SigmaHQ/sigma
  source_id: 0058b9e5-bcd7-40d4-9205-95ca5a16d7b2
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_uac_bypass_wmp.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
