id: sigmahq-sigma-4f6c43e2-f989-4ea5-bcd8-843b49a0317c
name: UAC Bypass Using WOW64 Logger DLL Hijack
description: Detects the pattern of UAC Bypass using a WoW64 logger DLL hijack (UACMe
  30)
severity: high
enabled: false
tags:
  mitre:
  - T1548.002
  categories:
  - endpoint
references:
- https://github.com/hfiref0x/UACME
logsource:
  category: process_access
  product: windows
detection:
  selection:
    SourceImage|contains: :\Windows\SysWOW64\
    GrantedAccess: '0x1fffff'
    CallTrace|startswith: UNKNOWN(0000000000000000)|UNKNOWN(0000000000000000)|
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 4f6c43e2-f989-4ea5-bcd8-843b49a0317c
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_access/proc_access_win_uac_bypass_wow64_logger.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
