id: sigmahq-sigma-7a01183d-71a2-46ad-ad5c-acd989ac1793
name: UAC Bypass Abusing Winsat Path Parsing - Process
description: Detects the pattern of UAC Bypass using a path parsing issue in winsat.exe
  (UACMe 52)
severity: high
enabled: false
tags:
  mitre:
  - T1548.002
  categories:
  - endpoint
references:
- https://github.com/hfiref0x/UACME
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    IntegrityLevel:
    - High
    - System
    - S-1-16-16384
    - S-1-16-12288
    ParentImage|endswith: \AppData\Local\Temp\system32\winsat.exe
    ParentCommandLine|contains: C:\Windows \system32\winsat.exe
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 7a01183d-71a2-46ad-ad5c-acd989ac1793
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_uac_bypass_winsat.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
