id: sigmahq-sigma-30fc8de7-d833-40c4-96b6-28319fbc4f6c
name: UAC Bypass Using Event Viewer RecentViews
description: Detects the pattern of UAC Bypass using Event Viewer RecentViews
severity: high
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://twitter.com/orange_8361/status/1518970259868626944
- https://lolbas-project.github.io/lolbas/Binaries/Eventvwr/#execute
logsource:
  category: process_creation
  product: windows
detection:
  selection_path:
    CommandLine|contains:
    - \Event Viewer\RecentViews
    - \EventV~1\RecentViews
  selection_redirect:
    CommandLine|contains: '>'
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 30fc8de7-d833-40c4-96b6-28319fbc4f6c
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_uac_bypass_eventvwr_recentviews.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
