id: sigmahq-sigma-6597be7b-ac61-4ac8-bef4-d3ec88174853
name: UAC Bypass Abusing Winsat Path Parsing - Registry
description: Detects the pattern of UAC Bypass using a path parsing issue in winsat.exe
  (UACMe 52)
severity: high
enabled: false
tags:
  mitre:
  - T1548.002
  categories:
  - endpoint
references:
- https://github.com/hfiref0x/UACME
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains: \Root\InventoryApplicationFile\winsat.exe|
    TargetObject|endswith: \LowerCaseLongPath
    Details|startswith: c:\users\
    Details|endswith: \appdata\local\temp\system32\winsat.exe
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 6597be7b-ac61-4ac8-bef4-d3ec88174853
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_uac_bypass_winsat.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
