id: sigmahq-sigma-b697e69c-746f-4a86-9f59-7bfff8eab881
name: UAC Bypass Using Disk Cleanup
description: Detects the pattern of UAC Bypass using scheduled tasks and variable
  expansion of cleanmgr.exe (UACMe 34)
severity: high
enabled: false
tags:
  mitre:
  - T1548.002
  categories:
  - endpoint
references:
- https://github.com/hfiref0x/UACME
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|endswith: '"\system32\cleanmgr.exe /autoclean /d C:'
    ParentCommandLine: C:\Windows\system32\svchost.exe -k netsvcs -p -s Schedule
    IntegrityLevel:
    - High
    - System
    - S-1-16-16384
    - S-1-16-12288
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: b697e69c-746f-4a86-9f59-7bfff8eab881
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_uac_bypass_cleanmgr.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
