id: sigmahq-sigma-c5f6a85d-b647-40f7-bbad-c10b66bab038
name: UAC Notification Disabled
description: 'Detects when an attacker tries to disable User Account Control (UAC)
  notification by tampering with the "UACDisableNotify" value.

  UAC is a critical security feature in Windows that prevents unauthorized changes
  to the operating system. It prompts the user for permission or an administrator
  password before allowing actions that could affect the system''s operation or change
  settings that affect other users.

  When "UACDisableNotify" is set to 1, UAC prompts are suppressed.'
severity: medium
enabled: false
tags:
  mitre:
  - T1548.002
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/7e11e9b79583545f208a6dc3fa062f2ed443d999/atomics/T1548.002/T1548.002.md
- https://securityintelligence.com/x-force/x-force-hive0129-targeting-financial-institutions-latam-banking-trojan/
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains: \Microsoft\Security Center\UACDisableNotify
    Details: DWORD (0x00000001)
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: c5f6a85d-b647-40f7-bbad-c10b66bab038
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_uac_disable_notification.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
