id: sigmahq-sigma-0d7ceeef-3539-4392-8953-3dc664912714
name: UAC Secure Desktop Prompt Disabled
description: 'Detects when an attacker tries to change User Account Control (UAC)
  elevation request destination via the "PromptOnSecureDesktop" value.

  The "PromptOnSecureDesktop" setting specifically determines whether UAC prompts
  are displayed on the secure desktop. The secure desktop is a separate desktop environment
  that''s isolated from other processes running on the system. It''s designed to prevent
  malicious software from intercepting or tampering with UAC prompts.

  When "PromptOnSecureDesktop" is set to 0, UAC prompts are displayed on the user''s
  current desktop instead of the secure desktop. This reduces the level of security
  because it potentially exposes the prompts to manipulation by malicious software.'
severity: medium
enabled: false
tags:
  mitre:
  - T1548.002
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/7e11e9b79583545f208a6dc3fa062f2ed443d999/atomics/T1548.002/T1548.002.md
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains: \Microsoft\Windows\CurrentVersion\Policies\System\PromptOnSecureDesktop
    Details: DWORD (0x00000000)
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 0d7ceeef-3539-4392-8953-3dc664912714
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_uac_disable_secure_desktop_prompt.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
