id: sigmahq-sigma-7fff6773-2baa-46de-a24a-b6eec1aba2d1
name: UAC Bypass Using NTFS Reparse Point - File
description: Detects the pattern of UAC Bypass using NTFS reparse point and wusa.exe
  DLL hijacking (UACMe 36)
severity: high
enabled: false
tags:
  mitre:
  - T1548.002
  categories:
  - endpoint
references:
- https://github.com/hfiref0x/UACME
logsource:
  category: file_event
  product: windows
detection:
  selection:
    TargetFilename|startswith: C:\Users\
    TargetFilename|endswith: \AppData\Local\Temp\api-ms-win-core-kernel32-legacy-l1.DLL
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 7fff6773-2baa-46de-a24a-b6eec1aba2d1
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_uac_bypass_ntfs_reparse_point.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
