id: sigmahq-sigma-9ed5959a-c43c-4c59-84e3-d28628429456
name: UAC Bypass Using Iscsicpl - ImageLoad
description: Detects the "iscsicpl.exe" UAC bypass technique that leverages a DLL
  Search Order hijacking technique to load a custom DLL's from temp or a any user
  controlled location in the users %PATH%
severity: high
enabled: false
tags:
  mitre:
  - T1548.002
  categories:
  - endpoint
references:
- https://github.com/hackerhouse-opensource/iscsicpl_bypassUAC
- https://twitter.com/wdormann/status/1547583317410607110
logsource:
  product: windows
  category: image_load
detection:
  selection:
    Image: C:\Windows\SysWOW64\iscsicpl.exe
    ImageLoaded|endswith: \iscsiexe.dll
  filter:
    ImageLoaded|contains|all:
    - C:\Windows\
    - iscsiexe.dll
  condition: selection and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: 9ed5959a-c43c-4c59-84e3-d28628429456
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/image_load/image_load_uac_bypass_iscsicpl.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
