id: sigmahq-sigma-503d581c-7df0-4bbe-b9be-5840c0ecc1fc
name: UAC Bypass Using ChangePK and SLUI
description: Detects an UAC bypass that uses changepk.exe and slui.exe (UACMe 61)
severity: high
enabled: false
tags:
  mitre:
  - T1548.002
  categories:
  - endpoint
references:
- https://mattharr0ey.medium.com/privilege-escalation-uac-bypass-in-changepk-c40b92818d1b
- https://github.com/hfiref0x/UACME
- https://medium.com/falconforce/falconfriday-detecting-uac-bypasses-0xff16-86c2a9107abf
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: \changepk.exe
    ParentImage|endswith: \slui.exe
    IntegrityLevel:
    - High
    - System
    - S-1-16-16384
    - S-1-16-12288
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 503d581c-7df0-4bbe-b9be-5840c0ecc1fc
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_uac_bypass_changepk_slui.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
