id: sigmahq-sigma-e94b9ddc-eec5-4bb8-8a58-b9dc5f4e185f
name: UEFI Persistence Via Wpbbin - FileCreation
description: Detects creation of a file named "wpbbin" in the "%systemroot%\system32\"
  directory. Which could be indicative of UEFI based persistence method
severity: high
enabled: false
tags:
  mitre:
  - T1542.001
  categories:
  - endpoint
references:
- https://grzegorztworek.medium.com/using-uefi-to-inject-executable-files-into-bitlocker-protected-drives-8ff4ca59c94c
- https://persistence-info.github.io/Data/wpbbin.html
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename: C:\Windows\System32\wpbbin.exe
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: e94b9ddc-eec5-4bb8-8a58-b9dc5f4e185f
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_wpbbin_persistence.yml
falsepositives:
- Legitimate usage of the file by hardware manufacturer such as lenovo (Thanks @0gtweet
  for the tip)
notes:
  quarantine_reason: 'upstream status: test'
