id: sigmahq-sigma-faa031b5-21ed-4e02-8881-2591f98d82ed
name: Unauthorized System Time Modification
description: Detect scenarios where a potentially unauthorized application or user
  is modifying the system time.
severity: low
enabled: false
tags:
  mitre:
  - T1070.006
  categories:
  - endpoint
references:
- Private Cuckoo Sandbox (from many years ago, no longer have hash, NDA as well)
- Live environment caused by malware
- https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-10/security/threat-protection/auditing/event-4616
logsource:
  product: windows
  service: security
  definition: 'Requirements: Audit Policy : System > Audit Security State Change,
    Group Policy : Computer Configuration\Windows Settings\Security Settings\Advanced
    Audit Policy Configuration\Audit Policies\System\Audit Security State Change'
detection:
  selection:
    EventID: 4616
  filter_main_svchost:
    ProcessName: C:\Windows\System32\svchost.exe
    SubjectUserSid: S-1-5-19
  filter_optional_vmtools:
    ProcessName:
    - C:\Program Files\VMware\VMware Tools\vmtoolsd.exe
    - C:\Program Files (x86)\VMware\VMware Tools\vmtoolsd.exe
    - C:\Windows\System32\VBoxService.exe
    - C:\Windows\System32\oobe\msoobe.exe
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
provenance:
  source: SigmaHQ/sigma
  source_id: faa031b5-21ed-4e02-8881-2591f98d82ed
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/security/win_security_susp_time_modification.yml
falsepositives:
- HyperV or other virtualization technologies with binary not listed in filter portion
  of detection
notes:
  quarantine_reason: 'upstream status: test'
