id: sigmahq-sigma-835e75bf-4bfd-47a4-b8a6-b766cac8bcb7
name: Uncommon Child Process Of Setres.EXE
description: 'Detects uncommon child process of Setres.EXE.

  Setres.EXE is a Windows server only process and tool that can be used to set the
  screen resolution.

  It can potentially be abused in order to launch any arbitrary file with a name containing
  the word "choice" from the current execution path.'
severity: high
enabled: false
tags:
  mitre:
  - T1218
  - T1202
  categories:
  - endpoint
references:
- https://lolbas-project.github.io/lolbas/Binaries/Setres/
- https://twitter.com/0gtweet/status/1583356502340870144
- https://strontic.github.io/xcyclopedia/library/setres.exe-0E30E4C09637D7A128A37B59A3BC4D09.html
- https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/cc731033(v=ws.11)
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage|endswith: \setres.exe
    Image|contains: \choice
  filter_main_legit_location:
    Image|endswith:
    - C:\Windows\System32\choice.exe
    - C:\Windows\SysWOW64\choice.exe
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 835e75bf-4bfd-47a4-b8a6-b766cac8bcb7
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_setres_uncommon_child_process.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
