id: sigmahq-sigma-9d5a1274-922a-49d0-87f3-8c653483b909
name: Uncommon System Information Discovery Via Wmic.EXE
description: 'Detects the use of the WMI command-line (WMIC) utility to identify and
  display various system information,

  including OS, CPU, GPU, and disk drive names; memory capacity; display resolution;
  and baseboard, BIOS,

  and GPU driver products/versions.

  Some of these commands were used by Aurora Stealer in late 2022/early 2023.'
severity: medium
enabled: false
tags:
  mitre:
  - T1082
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/a2ccd19c37d0278b4ffa8583add3cf52060a5418/atomics/T1082/T1082.md#atomic-test-25---system-information-discovery-with-wmic
- https://nwgat.ninja/getting-system-information-with-wmic-on-windows/
- https://blog.sekoia.io/aurora-a-rising-stealer-flying-under-the-radar
- https://blog.cyble.com/2023/01/18/aurora-a-stealer-using-shapeshifting-tactics/
- https://app.any.run/tasks/a6aa0057-82ec-451f-8f99-55650ca537da/
- https://www.virustotal.com/gui/file/d6f6bc10ae0e634ed4301d584f61418cee18e5d58ad9af72f8aa552dc4aaeca3/behavior
logsource:
  category: process_creation
  product: windows
detection:
  selection_wmic:
  - Description: WMI Commandline Utility
  - OriginalFileName: wmic.exe
  - Image|endswith: \WMIC.exe
  selection_commands:
    CommandLine|contains:
    - LOGICALDISK get Name,Size,FreeSpace
    - os get Caption,OSArchitecture,Version
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 9d5a1274-922a-49d0-87f3-8c653483b909
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_wmic_recon_system_info_uncommon.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
