id: sigmahq-sigma-f742bde7-9528-42e5-bd82-84f51a8387d2
name: Uncommon Microsoft Office Trusted Location Added
description: Detects changes to registry keys related to "Trusted Location" of Microsoft
  Office where the path is set to something uncommon. Attackers might add additional
  trusted locations to avoid macro security restrictions.
severity: high
enabled: false
tags:
  mitre:
  - T1112
  categories:
  - endpoint
references:
- Internal Research
- https://admx.help/?Category=Office2016&Policy=excel16.Office.Microsoft.Policies.Windows::L_TrustedLoc01
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains: Security\Trusted Locations\Location
    TargetObject|endswith: \Path
  filter_exclude_known_paths:
    Details|contains:
    - '%APPDATA%\Microsoft\Templates'
    - '%%APPDATA%%\Microsoft\Templates'
    - '%APPDATA%\Microsoft\Word\Startup'
    - '%%APPDATA%%\Microsoft\Word\Startup'
    - :\Program Files (x86)\Microsoft Office\root\Templates\
    - :\Program Files\Microsoft Office (x86)\Templates
    - :\Program Files\Microsoft Office\root\Templates\
    - :\Program Files\Microsoft Office\Templates\
  filter_main_office_click_to_run:
    Image|contains: :\Program Files\Common Files\Microsoft Shared\ClickToRun\
    Image|endswith: \OfficeClickToRun.exe
  filter_main_office_apps:
    Image|contains:
    - :\Program Files\Microsoft Office\
    - :\Program Files (x86)\Microsoft Office\
  condition: selection and not 1 of filter_main_* and not 1 of filter_exclude_*
provenance:
  source: SigmaHQ/sigma
  source_id: f742bde7-9528-42e5-bd82-84f51a8387d2
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_office_trusted_location_uncommon.yml
falsepositives:
- Other unknown legitimate or custom paths need to be filtered to avoid false positives
notes:
  quarantine_reason: 'upstream status: test'
