id: sigmahq-sigma-01d2e2a1-5f09-44f7-9fc1-24faa7479b6d
name: Uncommon Svchost Parent Process
description: Detects an uncommon svchost parent process
severity: medium
enabled: false
tags:
  mitre:
  - T1036.005
  categories:
  - endpoint
references:
- Internal Research
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: \svchost.exe
  filter_main_generic:
    ParentImage|endswith:
    - \Mrt.exe
    - \MsMpEng.exe
    - \ngen.exe
    - \rpcnet.exe
    - \services.exe
    - \TiWorker.exe
  filter_main_parent_null:
    ParentImage: null
  filter_main_parent_empty:
    ParentImage:
    - '-'
    - ''
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 01d2e2a1-5f09-44f7-9fc1-24faa7479b6d
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_svchost_uncommon_parent_process.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
