id: sigmahq-sigma-4f2cd9b6-4a17-440f-bb2a-687abb65993a
name: Uncommon AddinUtil.EXE CommandLine Execution
description: Detects execution of the Add-In deployment cache updating utility (AddInutil.exe)
  with uncommon Addinroot or Pipelineroot paths. An adversary may execute AddinUtil.exe
  with uncommon Addinroot/Pipelineroot paths that point to the adversaries Addins.Store
  payload.
severity: medium
enabled: false
tags:
  mitre:
  - T1218
  categories:
  - endpoint
references:
- https://www.blue-prints.blog/content/blog/posts/lolbin/addinutil-lolbas.html
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \addinutil.exe
  - OriginalFileName: AddInUtil.exe
  selection_cli:
    CommandLine|contains:
    - '-AddInRoot:'
    - '-PipelineRoot:'
  filter_main_addinroot:
    CommandLine|contains:
    - -AddInRoot:"C:\Program Files (x86)\Common Files\Microsoft Shared\VSTA
    - -AddInRoot:C:\Program Files (x86)\Common Files\Microsoft Shared\VSTA
    - -PipelineRoot:"C:\Program Files (x86)\Common Files\Microsoft Shared\VSTA
    - -PipelineRoot:C:\Program Files (x86)\Common Files\Microsoft Shared\VSTA
  condition: all of selection_* and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 4f2cd9b6-4a17-440f-bb2a-687abb65993a
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_addinutil_uncommon_cmdline.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
