id: sigmahq-sigma-f24bcaea-0cd1-11eb-adc1-0242ac120002
name: Uncommon  Assistive Technology Applications Execution Via AtBroker.EXE
description: Detects the start of a non built-in assistive technology applications
  via "Atbroker.EXE".
severity: medium
enabled: false
tags:
  mitre:
  - T1218
  categories:
  - endpoint
references:
- http://www.hexacorn.com/blog/2016/07/22/beyond-good-ol-run-key-part-42/
- https://lolbas-project.github.io/lolbas/Binaries/Atbroker/
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \AtBroker.exe
  - OriginalFileName: AtBroker.exe
  selection_cli:
    CommandLine|contains: start
  filter_main_builtin:
    CommandLine|contains:
    - animations
    - audiodescription
    - caretbrowsing
    - caretwidth
    - colorfiltering
    - cursorindicator
    - cursorscheme
    - filterkeys
    - focusborderheight
    - focusborderwidth
    - highcontrast
    - keyboardcues
    - keyboardpref
    - livecaptions
    - magnifierpane
    - messageduration
    - minimumhitradius
    - mousekeys
    - Narrator
    - osk
    - overlappedcontent
    - showsounds
    - soundsentry
    - speechreco
    - stickykeys
    - togglekeys
    - voiceaccess
    - windowarranging
    - windowtracking
    - windowtrackingtimeout
    - windowtrackingzorder
  filter_optional_java:
    CommandLine|contains: Oracle_JavaAccessBridge
  condition: all of selection_* and not 1 of filter_main_* and not 1 of filter_optional_*
provenance:
  source: SigmaHQ/sigma
  source_id: f24bcaea-0cd1-11eb-adc1-0242ac120002
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_atbroker_uncommon_ats_execution.yml
falsepositives:
- Legitimate, non-default assistive technology applications execution
notes:
  quarantine_reason: 'upstream status: test'
