id: sigmahq-sigma-970823b7-273b-460a-8afc-3a6811998529
name: Uncommon One Time Only Scheduled Task At 00:00
description: Detects scheduled task creation events that include suspicious actions,
  and is run once at 00:00
severity: high
enabled: false
tags:
  mitre:
  - T1053.005
  categories:
  - endpoint
references:
- https://www.trendmicro.com/vinfo/us/security/news/ransomware-spotlight/ransomware-spotlight-blackbyte
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|contains: \schtasks.exe
  - OriginalFileName: schtasks.exe
  selection_cli:
    CommandLine|contains:
    - wscript
    - vbscript
    - cscript
    - 'wmic '
    - wmic.exe
    - regsvr32.exe
    - powershell
    - \AppData\
  selection_time:
    CommandLine|contains|all:
    - once
    - 00:00
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 970823b7-273b-460a-8afc-3a6811998529
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_schtasks_one_time_only_midnight_task.yml
falsepositives:
- Software installation
notes:
  quarantine_reason: 'upstream status: test'
