id: sigmahq-sigma-eca91c7c-9214-47b9-b4c5-cb1d7e4f2350
name: Uncommon Outbound Kerberos Connection - Security
description: Detects uncommon outbound network activity via Kerberos default port
  indicating possible lateral movement or first stage PrivEsc via delegation.
severity: medium
enabled: false
tags:
  mitre:
  - T1558.003
  categories:
  - endpoint
references:
- https://github.com/GhostPack/Rubeus
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 5156
    DestPort: 88
  filter_main_lsass:
    Application|startswith:
    - \device\harddiskvolume
    - 'C:'
    Application|endswith: \Windows\System32\lsass.exe
  filter_optional_chrome:
    Application|startswith:
    - \device\harddiskvolume
    - 'C:'
    Application|endswith:
    - \Program Files (x86)\Google\Chrome\Application\chrome.exe
    - \Program Files\Google\Chrome\Application\chrome.exe
  filter_optional_firefox:
    Application|startswith:
    - \device\harddiskvolume
    - 'C:'
    Application|endswith:
    - \Program Files (x86)\Mozilla Firefox\firefox.exe
    - \Program Files\Mozilla Firefox\firefox.exe
  filter_optional_tomcat:
    Application|endswith: \tomcat\bin\tomcat8.exe
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
provenance:
  source: SigmaHQ/sigma
  source_id: eca91c7c-9214-47b9-b4c5-cb1d7e4f2350
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/security/win_security_susp_outbound_kerberos_connection.yml
falsepositives:
- Web Browsers and third party application might generate similar activity. An initial
  baseline is required.
notes:
  quarantine_reason: 'upstream status: test'
