id: sigmahq-sigma-a10a2c40-2c4d-49f8-b557-1a946bc55d9d
name: Uncommon File Created In Office Startup Folder
description: Detects the creation of a file with an uncommon extension in an Office
  application startup folder
severity: high
enabled: false
tags:
  mitre:
  - T1587.001
  categories:
  - endpoint
references:
- https://app.any.run/tasks/d6fe6624-6ef8-485d-aa75-3d1bdda2a08c/
- http://addbalance.com/word/startup.htm
- https://answers.microsoft.com/en-us/msoffice/forum/all/document-in-word-startup-folder-doesnt-open-when/44ab0932-2917-4150-8cdc-2f2cf39e86f3
- https://en.wikipedia.org/wiki/List_of_Microsoft_Office_filename_extensions
logsource:
  product: windows
  category: file_event
detection:
  selection_word_paths:
  - TargetFilename|contains: \Microsoft\Word\STARTUP
  - TargetFilename|contains|all:
    - \Office
    - \Program Files
    - \STARTUP
  filter_exclude_word_ext:
    TargetFilename|endswith:
    - .docb
    - .docm
    - .docx
    - .dotm
    - .mdb
    - .mdw
    - .pdf
    - .wll
    - .wwl
  selection_excel_paths:
  - TargetFilename|contains: \Microsoft\Excel\XLSTART
  - TargetFilename|contains|all:
    - \Office
    - \Program Files
    - \XLSTART
  filter_exclude_excel_ext:
    TargetFilename|endswith:
    - .xll
    - .xls
    - .xlsm
    - .xlsx
    - .xlt
    - .xltm
    - .xlw
  filter_main_office_click_to_run:
    Image|contains: :\Program Files\Common Files\Microsoft Shared\ClickToRun\
    Image|endswith: \OfficeClickToRun.exe
  filter_main_office_apps:
    Image|contains:
    - :\Program Files\Microsoft Office\
    - :\Program Files (x86)\Microsoft Office\
    Image|endswith:
    - \winword.exe
    - \excel.exe
  condition: ((selection_word_paths and not filter_exclude_word_ext) or (selection_excel_paths
    and not filter_exclude_excel_ext)) and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: a10a2c40-2c4d-49f8-b557-1a946bc55d9d
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_office_uncommon_file_startup.yml
falsepositives:
- False positive might stem from rare extensions used by other Office utilities.
notes:
  quarantine_reason: 'upstream status: test'
