id: sigmahq-sigma-9fb6b26e-7f9e-4517-a48b-8cac4a1b6c60
name: Uncommon FileSystem Load Attempt By Format.com
description: Detects the execution of format.com with an uncommon filesystem selection
  that could indicate a defense evasion activity in which "format.com" is used to
  load malicious DLL files or other programs.
severity: high
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://twitter.com/0gtweet/status/1477925112561209344
- https://twitter.com/wdormann/status/1478011052130459653?s=20
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: \format.com
    CommandLine|contains: '/fs:'
  filter_main_known_fs:
    CommandLine|contains:
    - /fs:exFAT
    - /fs:FAT
    - /fs:NTFS
    - /fs:ReFS
    - /fs:UDF
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 9fb6b26e-7f9e-4517-a48b-8cac4a1b6c60
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_format_uncommon_filesystem_load.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
