id: sigmahq-sigma-7d4aaec2-08ed-4430-8b96-28420e030e04
name: Uncommon Sigverif.EXE Child Process
description: Detects uncommon child processes spawning from "sigverif.exe", which
  could indicate potential abuse of the latter as a living of the land binary in order
  to proxy execution.
severity: medium
enabled: false
tags:
  mitre:
  - T1216
  categories:
  - endpoint
references:
- https://www.hexacorn.com/blog/2018/04/27/i-shot-the-sigverif-exe-the-gui-based-lolbin/
- https://twitter.com/0gtweet/status/1457676633809330184
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage|endswith: \sigverif.exe
  filter_main_werfault:
    Image:
    - C:\Windows\System32\WerFault.exe
    - C:\Windows\SysWOW64\WerFault.exe
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 7d4aaec2-08ed-4430-8b96-28420e030e04
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_sigverif_uncommon_child_process.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
