id: sigmahq-sigma-128faeef-79dd-44ca-b43c-a9e236a60f49
name: Unfamiliar Sign-In Properties
description: Detects sign-in with properties that are unfamiliar to the user. The
  detection considers past sign-in history to look for anomalous sign-ins.
severity: high
enabled: false
tags:
  mitre:
  - T1078
  categories:
  - cloud
references:
- https://learn.microsoft.com/en-us/entra/id-protection/concept-identity-protection-risks#unfamiliar-sign-in-properties
- https://learn.microsoft.com/en-us/entra/architecture/security-operations-user-accounts#unusual-sign-ins
logsource:
  product: azure
  service: riskdetection
detection:
  selection:
    riskEventType: unfamiliarFeatures
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 128faeef-79dd-44ca-b43c-a9e236a60f49
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/azure/identity_protection/azure_identity_protection_unfamilar_sign_in.yml
falsepositives:
- User changing to a new device, location, browser, etc.
notes:
  quarantine_reason: 'upstream status: test'
