id: sigmahq-sigma-cb7c4a03-2871-43c0-9bbb-18bbdb079896
name: Unmount Share Via Net.EXE
description: Detects when when a mounted share is removed. Adversaries may remove
  share connections that are no longer useful in order to clean up traces of their
  operation
severity: low
enabled: false
tags:
  mitre:
  - T1070.005
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1070.005/T1070.005.md
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - \net.exe
    - \net1.exe
  - OriginalFileName:
    - net.exe
    - net1.exe
  selection_cli:
    CommandLine|contains|all:
    - share
    - /delete
  condition: all of selection*
provenance:
  source: SigmaHQ/sigma
  source_id: cb7c4a03-2871-43c0-9bbb-18bbdb079896
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_net_share_unmount.yml
falsepositives:
- Administrators or Power users may remove their shares via cmd line
notes:
  quarantine_reason: 'upstream status: test'
