id: sigmahq-sigma-b5de0c9a-6f19-43e0-af4e-55ad01f550af
name: Unsigned DLL Loaded by Windows Utility
description: 'Detects windows utilities loading an unsigned or untrusted DLL.

  Adversaries often abuse those programs to proxy execution of malicious code.'
severity: medium
enabled: false
tags:
  mitre:
  - T1218.011
  - T1218.010
  categories:
  - endpoint
references:
- https://www.elastic.co/security-labs/Hunting-for-Suspicious-Windows-Libraries-for-Execution-and-Evasion
- https://akhere.hashnode.dev/hunting-unsigned-dlls-using-kql
- https://unit42.paloaltonetworks.com/unsigned-dlls/?web_view=true
logsource:
  product: windows
  category: image_load
detection:
  selection:
    Image|endswith:
    - \InstallUtil.exe
    - \RegAsm.exe
    - \RegSvcs.exe
    - \regsvr32.exe
    - \rundll32.exe
  filter_main_signed:
    Signed: 'true'
  filter_main_sig_status:
    SignatureStatus:
    - errorChaining
    - errorCode_endpoint
    - errorExpired
    - trusted
    - Valid
  filter_main_signed_null:
    Signed: null
  filter_main_signed_empty:
    Signed:
    - ''
    - '-'
  filter_main_sig_status_null:
    SignatureStatus: null
  filter_main_sig_status_empty:
    SignatureStatus:
    - ''
    - '-'
  filter_main_windows_installer:
    Image:
    - C:\Windows\SysWOW64\rundll32.exe
    - C:\Windows\System32\rundll32.exe
    ImageLoaded|startswith: C:\Windows\Installer\
    ImageLoaded|endswith:
    - .tmp-\Microsoft.Deployment.WindowsInstaller.dll
    - .tmp-\Avira.OE.Setup.CustomActions.dll
  filter_main_assembly:
    Image|startswith:
    - C:\Windows\SysWOW64\
    - C:\Windows\System32\
    - C:\Windows\Microsoft.NET\Framework64
    Image|endswith: \RegAsm.exe
    ImageLoaded|endswith: .dll
    ImageLoaded|startswith: C:\Windows\assembly\NativeImages
  filter_optional_klite_codec:
    Image:
    - C:\Windows\SysWOW64\regsvr32.exe
    - C:\Windows\System32\regsvr32.exe
    ImageLoaded|startswith:
    - C:\Program Files (x86)\K-Lite Codec Pack\
    - C:\Program Files\K-Lite Codec Pack\
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
provenance:
  source: SigmaHQ/sigma
  source_id: b5de0c9a-6f19-43e0-af4e-55ad01f550af
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/image_load/image_load_susp_unsigned_dll.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
