id: sigmahq-sigma-8289bf8c-4aca-4f5a-9db3-dc3d7afe5c10
name: Unsigned Binary Loaded From Suspicious Location
description: Detects Code Integrity (CI) engine blocking processes from loading unsigned
  DLLs residing in suspicious locations
severity: high
enabled: false
tags:
  mitre:
  - T1574.001
  categories:
  - endpoint
references:
- https://github.com/nasbench/EVTX-ETW-Resources/blob/45fd5be71a51aa518b1b36d4e1f36af498084e27/ETWEventsList/CSV/Windows11/21H2/W11_21H2_Pro_20220719_22000.795/Providers/Microsoft-Windows-Security-Mitigations.csv
logsource:
  product: windows
  service: security-mitigations
detection:
  selection:
    EventID:
    - 11
    - 12
    ImageName|contains:
    - \Users\Public\
    - \PerfLogs\
    - \Desktop\
    - \Downloads\
    - \AppData\Local\Temp\
    - C:\Windows\TEMP\
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 8289bf8c-4aca-4f5a-9db3-dc3d7afe5c10
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/security_mitigations/win_security_mitigations_unsigned_dll_from_susp_location.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
