id: sigmahq-sigma-060d5ad4-3153-47bb-8382-43e5e29eda92
name: Unsigned Module Loaded by ClickOnce Application
description: Detects unsigned module load by ClickOnce application.
severity: medium
enabled: false
tags:
  mitre:
  - T1574.001
  categories:
  - endpoint
references:
- https://posts.specterops.io/less-smartscreen-more-caffeine-ab-using-clickonce-for-trusted-code-execution-1446ea8051c5
logsource:
  category: image_load
  product: windows
detection:
  selection_path:
    Image|contains: \AppData\Local\Apps\2.0\
  selection_sig_status:
  - Signed: 'false'
  - SignatureStatus: Expired
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 060d5ad4-3153-47bb-8382-43e5e29eda92
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/image_load/image_load_susp_clickonce_unsigned_module_loaded.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
