id: sigmahq-sigma-e5f5c693-52d7-4de5-88ae-afbfbce85595
name: Unsigned .node File Loaded
description: 'Detects the loading of unsigned .node files.

  Adversaries may abuse a lack of .node integrity checking to execute arbitrary code
  inside of trusted applications such as Slack.

  .node files are native add-ons for Electron-based applications, which are commonly
  used for desktop applications like Slack, Discord, and Visual Studio Code.

  This technique has been observed in the DripLoader malware, which uses unsigned
  .node files to load malicious native code into Electron applications.'
severity: medium
enabled: false
tags:
  mitre:
  - T1129
  - T1574.001
  - T1036.005
  categories:
  - endpoint
references:
- https://www.coreycburton.com/blog/driploader-case-study
- https://github.com/CoreyCBurton/DripLoaderNG
- https://www.electronjs.org/docs/latest/tutorial/native-code-and-electron
logsource:
  category: image_load
  product: windows
detection:
  selection_node_extension:
    ImageLoaded|endswith: .node
  selection_status:
  - Signed: 'false'
  - SignatureStatus: Unavailable
  filter_optional_vscode_jupyter:
    Image|endswith: \Code.exe
    ImageLoaded|contains: .vscode\extensions\ms-toolsai.jupyter-
    ImageLoaded|endswith:
    - \electron.napi.node
    - \node.napi.glibc.node
  condition: all of selection_* and not 1 of filter_optional_*
provenance:
  source: SigmaHQ/sigma
  source_id: e5f5c693-52d7-4de5-88ae-afbfbce85595
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/image_load/image_load_dll_unsigned_node_load.yml
falsepositives:
- VsCode extensions or similar legitimate tools might use unsigned .node files. These
  should be investigated on a case-by-case basis, and whitelisted if determined to
  be benign.
notes:
  quarantine_reason: 'upstream status: experimental'
