id: sigmahq-sigma-37651c2a-42cd-4a69-ae0d-22a4349aa04a
name: Unsigned AppX Installation Attempt Using Add-AppxPackage
description: Detects usage of the "Add-AppxPackage" or it's alias "Add-AppPackage"
  to install unsigned AppX packages
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/windows/msix/package/unsigned-package
- https://twitter.com/WindowsDocs/status/1620078135080325122
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - \powershell.exe
    - \pwsh.exe
  - OriginalFileName:
    - PowerShell.EXE
    - pwsh.dll
  selection_cmdlet:
    CommandLine|contains:
    - 'Add-AppPackage '
    - 'Add-AppxPackage '
  selection_flag:
    CommandLine|contains: ' -AllowUnsigned'
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 37651c2a-42cd-4a69-ae0d-22a4349aa04a
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_powershell_install_unsigned_appx_packages.yml
falsepositives:
- Installation of unsigned packages for testing purposes
notes:
  quarantine_reason: 'upstream status: test'
