id: sigmahq-sigma-a4e3d776-f12e-42c2-8510-9e6ed1f43ec3
name: Unusual Child Process of dns.exe
description: Detects an unexpected process spawning from dns.exe which may indicate
  activity related to remote code execution or other forms of exploitation as seen
  in CVE-2020-1350 (SigRed)
severity: high
enabled: false
tags:
  mitre:
  - T1133
  categories:
  - endpoint
references:
- https://www.elastic.co/guide/en/security/current/unusual-child-process-of-dns-exe.html
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage|endswith: \dns.exe
  filter:
    Image|endswith: \conhost.exe
  condition: selection and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: a4e3d776-f12e-42c2-8510-9e6ed1f43ec3
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_dns_susp_child_process.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
