id: sigmahq-sigma-ae02ed70-11aa-4a22-b397-c0d0e8f6ea99
name: Unusual File Download From File Sharing Websites - File Stream
description: Detects the download of suspicious file type from a well-known file and
  paste sharing domain
severity: medium
enabled: false
tags:
  mitre:
  - T1564.004
  categories:
  - endpoint
references:
- https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventid=90015
- https://www.cisa.gov/uscert/ncas/alerts/aa22-321a
- https://www.microsoft.com/en-us/security/blog/2024/01/17/new-ttps-observed-in-mint-sandstorm-campaign-targeting-high-profile-individuals-at-universities-and-research-orgs/
logsource:
  product: windows
  category: create_stream_hash
detection:
  selection_domain:
    Contents|contains:
    - .githubusercontent.com
    - anonfiles.com
    - cdn.discordapp.com
    - ddns.net
    - dl.dropboxusercontent.com
    - ghostbin.co
    - github.com
    - glitch.me
    - gofile.io
    - hastebin.com
    - mediafire.com
    - mega.nz
    - onrender.com
    - pages.dev
    - paste.ee
    - pastebin.com
    - pastebin.pl
    - pastetext.net
    - pixeldrain.com
    - privatlab.com
    - privatlab.net
    - send.exploit.in
    - sendspace.com
    - storage.googleapis.com
    - storjshare.io
    - supabase.co
    - temp.sh
    - transfer.sh
    - trycloudflare.com
    - ufile.io
    - w3spaces.com
    - workers.dev
  selection_extension:
    TargetFilename|contains:
    - .bat:Zone
    - .cmd:Zone
    - .ps1:Zone
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: ae02ed70-11aa-4a22-b397-c0d0e8f6ea99
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/create_stream_hash/create_stream_hash_file_sharing_domains_download_unusual_extension.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
