id: sigmahq-sigma-a85ffc3a-e8fd-4040-93bf-78aff284d801
name: Use Of The SFTP.EXE Binary As A LOLBIN
description: Detects the usage of the "sftp.exe" binary as a LOLBIN by abusing the
  "-D" flag
severity: medium
enabled: false
tags:
  mitre:
  - T1218
  categories:
  - endpoint
references:
- https://github.com/LOLBAS-Project/LOLBAS/pull/264
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: \sftp.exe
    CommandLine|contains:
    - ' -D ..'
    - ' -D C:\'
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: a85ffc3a-e8fd-4040-93bf-78aff284d801
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_lolbin_sftp.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
