id: sigmahq-sigma-145322e4-0fd3-486b-81ca-9addc75736d8
name: Use of UltraVNC Remote Access Software
description: An adversary may use legitimate desktop support and remote access software,to
  establish an interactive command and control channel to target systems within networks
severity: medium
enabled: false
tags:
  mitre:
  - T1219.002
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/9e5b12c4912c07562aec7500447b11fa3e17e254/atomics/T1219/T1219.md
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Description: VNCViewer
  - Product: UltraVNC VNCViewer
  - Company: UltraVNC
  - OriginalFileName: VNCViewer.exe
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 145322e4-0fd3-486b-81ca-9addc75736d8
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_ultravnc.yml
falsepositives:
- Legitimate use
notes:
  quarantine_reason: 'upstream status: test'
