id: sigmahq-sigma-dd6b39d9-d9be-4a3b-8fe0-fe3c6a5c1795
name: Use NTFS Short Name in Command Line
description: Detect use of the Windows 8.3 short name. Which could be used as a method
  to avoid command-line detection
severity: medium
enabled: false
tags:
  mitre:
  - T1564.004
  categories:
  - endpoint
references:
- https://www.acunetix.com/blog/articles/windows-short-8-3-filenames-web-security-problem/
- https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-2000-server/cc959352(v=technet.10)
- https://twitter.com/jonasLyk/status/1555914501802921984
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains:
    - ~1.exe
    - ~1.bat
    - ~1.msi
    - ~1.vbe
    - ~1.vbs
    - ~1.dll
    - ~1.ps1
    - ~1.js
    - ~1.hta
    - ~2.exe
    - ~2.bat
    - ~2.msi
    - ~2.vbe
    - ~2.vbs
    - ~2.dll
    - ~2.ps1
    - ~2.js
    - ~2.hta
  filter:
  - ParentImage|endswith:
    - \WebEx\WebexHost.exe
    - \thor\thor64.exe
  - CommandLine|contains: C:\xampp\vcredist\VCREDI~1.EXE
  condition: selection and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: dd6b39d9-d9be-4a3b-8fe0-fe3c6a5c1795
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_susp_ntfs_short_name_use_cli.yml
falsepositives:
- Applications could use this notation occasionally which might generate some false
  positives. In that case Investigate the parent and child process.
notes:
  quarantine_reason: 'upstream status: test'
