id: sigmahq-sigma-b27077d6-23e6-45d2-81a0-e2b356eea5fd
name: Use of TTDInject.exe
description: Detects the executiob of TTDInject.exe, which is used by Windows 10 v1809
  and newer to debug time travel (underlying call of tttracer.exe)
severity: medium
enabled: false
tags:
  mitre:
  - T1127
  categories:
  - endpoint
references:
- https://lolbas-project.github.io/lolbas/Binaries/Ttdinject/
logsource:
  product: windows
  category: process_creation
detection:
  selection:
  - Image|endswith: ttdinject.exe
  - OriginalFileName: TTDInject.EXE
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: b27077d6-23e6-45d2-81a0-e2b356eea5fd
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_lolbin_ttdinject.yml
falsepositives:
- Legitimate use
notes:
  quarantine_reason: 'upstream status: test'
