id: sigmahq-sigma-814c95cc-8192-4378-a70a-f1aafd877af1
name: Use of OpenConsole
description: Detects usage of OpenConsole binary as a LOLBIN to launch other binaries
  to bypass application Whitelisting
severity: medium
enabled: false
tags:
  mitre:
  - T1059
  categories:
  - endpoint
references:
- https://twitter.com/nas_bench/status/1537563834478645252
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - OriginalFileName: OpenConsole.exe
  - Image|endswith: \OpenConsole.exe
  filter:
    Image|startswith: C:\Program Files\WindowsApps\Microsoft.WindowsTerminal
  condition: selection and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: 814c95cc-8192-4378-a70a-f1aafd877af1
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_lolbin_openconsole.yml
falsepositives:
- Legitimate use by an administrator
notes:
  quarantine_reason: 'upstream status: test'
