id: sigmahq-sigma-4eddc365-79b4-43ff-a9d7-99422dc34b93
name: Use of Remote.exe
description: Remote.exe is part of WinDbg in the Windows SDK and can be used for AWL
  bypass and running remote files.
severity: medium
enabled: false
tags:
  mitre:
  - T1127
  categories:
  - endpoint
references:
- https://blog.thecybersecuritytutor.com/Exeuction-AWL-Bypass-Remote-exe-LOLBin/
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Remote/
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Image|endswith: \remote.exe
  - OriginalFileName: remote.exe
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 4eddc365-79b4-43ff-a9d7-99422dc34b93
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_lolbin_remote.yml
falsepositives:
- Approved installs of Windows SDK with Debugging Tools for Windows (WinDbg).
notes:
  quarantine_reason: 'upstream status: test'
