id: sigmahq-sigma-b96b2031-7c17-4473-afe7-a30ce714db29
name: Use of FSharp Interpreters
description: 'Detects the execution of FSharp Interpreters "FsiAnyCpu.exe" and "FSi.exe"

  Both can be used for AWL bypass and to execute F# code via scripts or inline.'
severity: medium
enabled: false
tags:
  mitre:
  - T1059
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/windows/security/application-security/application-control/windows-defender-application-control/design/applications-that-can-bypass-wdac
- https://bohops.com/2020/11/02/exploring-the-wdac-microsoft-recommended-block-rules-part-ii-wfc-fsi/
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/FsiAnyCpu/
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Fsi/
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Image|endswith:
    - \fsi.exe
    - \fsianycpu.exe
  - OriginalFileName:
    - fsi.exe
    - fsianycpu.exe
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: b96b2031-7c17-4473-afe7-a30ce714db29
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_fsi_fsharp_code_execution.yml
falsepositives:
- Legitimate use by a software developer.
notes:
  quarantine_reason: 'upstream status: test'
