id: sigmahq-sigma-3ef5605c-9eb9-47b0-9a71-b727e6aa5c3b
name: Use NTFS Short Name in Image
description: Detect use of the Windows 8.3 short name. Which could be used as a method
  to avoid Image based detection
severity: medium
enabled: false
tags:
  mitre:
  - T1564.004
  categories:
  - endpoint
references:
- https://www.acunetix.com/blog/articles/windows-short-8-3-filenames-web-security-problem/
- https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-2000-server/cc959352(v=technet.10)
- https://twitter.com/jonasLyk/status/1555914501802921984
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|contains:
    - ~1.bat
    - ~1.dll
    - ~1.exe
    - ~1.hta
    - ~1.js
    - ~1.msi
    - ~1.ps1
    - ~1.tmp
    - ~1.vbe
    - ~1.vbs
    - ~2.bat
    - ~2.dll
    - ~2.exe
    - ~2.hta
    - ~2.js
    - ~2.msi
    - ~2.ps1
    - ~2.tmp
    - ~2.vbe
    - ~2.vbs
  filter_main_generic_parent:
    ParentImage: C:\Windows\explorer.exe
  filter_optional_webex:
    ParentImage|endswith: \WebEx\WebexHost.exe
  filter_optional_thor:
    ParentImage|endswith: \thor\thor64.exe
  filter_optional_winzip:
    Image: C:\PROGRA~1\WinZip\WZPREL~1.EXE
  filter_optional_vcred:
    Image|endswith: \VCREDI~1.EXE
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
provenance:
  source: SigmaHQ/sigma
  source_id: 3ef5605c-9eb9-47b0-9a71-b727e6aa5c3b
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_susp_ntfs_short_name_use_image.yml
falsepositives:
- Software Installers
notes:
  quarantine_reason: 'upstream status: test'
