id: sigmahq-sigma-60f6535a-760f-42a9-be3f-c9a0a025906e
name: Use of Legacy Authentication Protocols
description: Alert on when legacy authentication has been used on an account
severity: high
enabled: false
tags:
  mitre:
  - T1078.004
  - T1110
  categories:
  - cloud
references:
- https://learn.microsoft.com/en-gb/entra/architecture/security-operations-privileged-accounts
logsource:
  product: azure
  service: signinlogs
detection:
  selection:
    ActivityDetails: Sign-ins
    ClientApp:
    - Other client
    - IMAP
    - POP3
    - MAPI
    - SMTP
    - Exchange ActiveSync
    - Exchange Web Services
    Username: UPN
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 60f6535a-760f-42a9-be3f-c9a0a025906e
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/azure/signin_logs/azure_legacy_authentication_protocols.yml
falsepositives:
- User has been put in acception group so they can use legacy authentication
notes:
  quarantine_reason: 'upstream status: test'
