id: sigmahq-sigma-8dee7a0d-43fd-4b3c-8cd1-605e189d195e
name: User State Changed From Guest To Member
description: Detects the change of user type from "Guest" to "Member" for potential
  elevation of privilege.
severity: medium
enabled: false
tags:
  mitre:
  - T1078.004
  categories:
  - cloud
references:
- https://learn.microsoft.com/en-gb/entra/architecture/security-operations-user-accounts#monitoring-external-user-sign-ins
logsource:
  product: azure
  service: auditlogs
detection:
  selection:
    Category: UserManagement
    OperationName: Update user
    properties.message: '"displayName":"UserType","oldValue":"[\"Guest\"]","newValue":"[\"Member\"]"'
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 8dee7a0d-43fd-4b3c-8cd1-605e189d195e
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/azure/audit_logs/azure_guest_to_member.yml
falsepositives:
- If this was approved by System Administrator.
notes:
  quarantine_reason: 'upstream status: test'
