id: sigmahq-sigma-665e2d43-70dc-4ccc-9d27-026c9dd7ed9c
name: User Removed From Group With CA Policy Modification Access
description: Monitor and alert on group membership removal of groups that have CA
  policy modification access
severity: medium
enabled: false
tags:
  mitre:
  - T1548
  - T1556
  categories:
  - cloud
references:
- https://learn.microsoft.com/en-us/entra/architecture/security-operations-infrastructure#conditional-access
logsource:
  product: azure
  service: auditlogs
detection:
  selection:
    properties.message: Remove member from group
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 665e2d43-70dc-4ccc-9d27-026c9dd7ed9c
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/azure/audit_logs/azure_group_user_removal_ca_modification.yml
falsepositives:
- User removed from the group is approved
notes:
  quarantine_reason: 'upstream status: test'
