id: sigmahq-sigma-ffa28e60-bdb1-46e0-9f82-05f7a61cc06e
name: User Added to Remote Desktop Users Group
description: Detects addition of users to the local Remote Desktop Users group via
  "Net" or "Add-LocalGroupMember".
severity: high
enabled: false
tags:
  mitre:
  - T1133
  - T1136.001
  - T1021.001
  categories:
  - endpoint
references:
- https://www.microsoft.com/security/blog/2021/11/16/evolving-trends-in-iranian-threat-actor-activity-mstic-presentation-at-cyberwarcon-2021/
logsource:
  category: process_creation
  product: windows
detection:
  selection_main:
  - CommandLine|contains|all:
    - 'localgroup '
    - ' /add'
  - CommandLine|contains|all:
    - 'Add-LocalGroupMember '
    - ' -Group '
  selection_group:
    CommandLine|contains:
    - Remote Desktop Users
    - Utilisateurs du Bureau à distance
    - Usuarios de escritorio remoto
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: ffa28e60-bdb1-46e0-9f82-05f7a61cc06e
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_susp_add_user_remote_desktop_group.yml
falsepositives:
- Administrative activity
notes:
  quarantine_reason: 'upstream status: test'
