id: sigmahq-sigma-5f521e4b-0105-4b72-845b-2198a54487b9
name: Users Authenticating To Other Azure AD Tenants
description: Detect when users in your Azure AD tenant are authenticating to other
  Azure AD Tenants.
severity: medium
enabled: false
tags:
  mitre:
  - T1078.004
  categories:
  - cloud
references:
- https://learn.microsoft.com/en-gb/entra/architecture/security-operations-user-accounts#monitoring-external-user-sign-ins
logsource:
  product: azure
  service: signinlogs
detection:
  selection:
    Status: Success
    HomeTenantId: HomeTenantID
  filter:
    ResourceTenantId|contains: HomeTenantID
  condition: selection and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: 5f521e4b-0105-4b72-845b-2198a54487b9
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/azure/signin_logs/azure_users_authenticating_to_other_azure_ad_tenants.yml
falsepositives:
- If this was approved by System Administrator.
notes:
  quarantine_reason: 'upstream status: test'
