id: sigmahq-sigma-5d0fdb62-f225-42fb-8402-3dfe64da468a
name: User Added To Admin Group Via DseditGroup
description: Detects attempts to create and/or add an account to the admin group,
  thus granting admin privileges.
severity: medium
enabled: false
tags:
  mitre:
  - T1078.003
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1078.003/T1078.003.md#atomic-test-5---add-a-newexisting-user-to-the-admin-group-using-dseditgroup-utility---macos
- https://ss64.com/osx/dseditgroup.html
logsource:
  category: process_creation
  product: macos
detection:
  selection:
    Image|endswith: /dseditgroup
    CommandLine|contains|all:
    - ' -o edit '
    - ' -a '
    - ' -t user'
    - admin
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 5d0fdb62-f225-42fb-8402-3dfe64da468a
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/macos/process_creation/proc_creation_macos_dseditgroup_add_to_admin_group.yml
falsepositives:
- Legitimate administration activities
notes:
  quarantine_reason: 'upstream status: test'
