id: sigmahq-sigma-ebbeb024-5b1d-4e16-9c0c-917f86c708a7
name: User Added to an Administrator's Azure AD Role
description: User Added to an Administrator's Azure AD Role
severity: medium
enabled: false
tags:
  mitre:
  - T1098.003
  - T1078
  categories:
  - cloud
references:
- https://m365internals.com/2021/07/13/what-ive-learned-from-doing-a-year-of-cloud-forensics-in-azure-ad/
logsource:
  product: azure
  service: activitylogs
detection:
  selection:
    Operation: Add member to role.
    Workload: AzureActiveDirectory
    ModifiedProperties{}.NewValue|endswith:
    - Admins
    - Administrator
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: ebbeb024-5b1d-4e16-9c0c-917f86c708a7
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/azure/activity_logs/azure_ad_user_added_to_admin_role.yml
falsepositives:
- PIM (Privileged Identity Management) generates this event each time 'eligible role'
  is enabled.
notes:
  quarantine_reason: 'upstream status: test'
