id: sigmahq-sigma-c2993223-6da8-4b1a-88ee-668b8bf315e9
name: User Discovery And Export Via Get-ADUser Cmdlet - PowerShell
description: Detects usage of the Get-ADUser cmdlet to collect user information and
  output it to a file
severity: medium
enabled: false
tags:
  mitre:
  - T1033
  categories:
  - endpoint
references:
- http://blog.talosintelligence.com/2022/09/lazarus-three-rats.html
- https://www.microsoft.com/en-us/security/blog/2022/10/18/defenders-beware-a-case-for-post-ransomware-investigations/
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection:
    ScriptBlockText|contains|all:
    - 'Get-ADUser '
    - ' -Filter \*'
    ScriptBlockText|contains:
    - ' > '
    - ' | Select '
    - Out-File
    - Set-Content
    - Add-Content
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: c2993223-6da8-4b1a-88ee-668b8bf315e9
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_user_discovery_get_aduser.yml
falsepositives:
- Legitimate admin scripts may use the same technique, it's better to exclude specific
  computers or users who execute these commands or scripts often
notes:
  quarantine_reason: 'upstream status: test'
