id: sigmahq-sigma-10fb649c-3600-4d37-b1e6-56ea90bb7e09
name: User Added To Highly Privileged Group
description: Detects addition of users to highly privileged groups via "Net" or "Add-LocalGroupMember".
severity: high
enabled: false
tags:
  mitre:
  - T1098
  categories:
  - endpoint
references:
- https://www.huntress.com/blog/slashandgrab-screen-connect-post-exploitation-in-the-wild-cve-2024-1709-cve-2024-1708
logsource:
  category: process_creation
  product: windows
detection:
  selection_main:
  - CommandLine|contains|all:
    - 'localgroup '
    - ' /add'
  - CommandLine|contains|all:
    - 'Add-LocalGroupMember '
    - ' -Group '
  selection_group:
    CommandLine|contains:
    - Group Policy Creator Owners
    - Schema Admins
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 10fb649c-3600-4d37-b1e6-56ea90bb7e09
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_susp_add_user_privileged_group.yml
falsepositives:
- Administrative activity that must be investigated
notes:
  quarantine_reason: 'upstream status: test'
