id: sigmahq-sigma-b2ddd389-f676-4ac4-845a-e00781a48e5f
name: Using SettingSyncHost.exe as LOLBin
description: Detects using SettingSyncHost.exe to run hijacked binary
severity: high
enabled: false
tags:
  mitre:
  - T1574.008
  categories:
  - endpoint
references:
- https://www.hexacorn.com/blog/2020/02/02/settingsynchost-exe-as-a-lolbin
logsource:
  category: process_creation
  product: windows
detection:
  system_utility:
    Image|startswith:
    - C:\Windows\System32\
    - C:\Windows\SysWOW64\
  parent_is_settingsynchost:
    ParentCommandLine|contains|all:
    - cmd.exe /c
    - RoamDiag.cmd
    - -outputpath
  condition: not system_utility and parent_is_settingsynchost
provenance:
  source: SigmaHQ/sigma
  source_id: b2ddd389-f676-4ac4-845a-e00781a48e5f
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_lolbin_settingsynchost.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
