id: sigmahq-sigma-46490193-1b22-4c29-bdd6-5bf63907216f
name: VBScript Payload Stored in Registry
description: Detects VBScript content stored into registry keys as seen being used
  by UNC2452 group
severity: high
enabled: false
tags:
  mitre:
  - T1547.001
  categories:
  - endpoint
references:
- https://www.microsoft.com/security/blog/2021/03/04/goldmax-goldfinder-sibot-analyzing-nobelium-malware/
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains: Software\Microsoft\Windows\CurrentVersion
    Details|contains:
    - 'vbscript:'
    - 'jscript:'
    - mshtml,
    - RunHTMLApplication
    - Execute(
    - CreateObject
    - window.close
  filter:
    TargetObject|contains: Software\Microsoft\Windows\CurrentVersion\Run
  filter_dotnet:
    Image|endswith: \msiexec.exe
    TargetObject|contains: \SOFTWARE\Microsoft\Windows\CurrentVersion\Installer\UserData\
    Details|contains:
    - \Microsoft.NET\Primary Interop Assemblies\Microsoft.mshtml.dll
    - <\Microsoft.mshtml,fileVersion=
    - _mshtml_dll_
    - <\Microsoft.mshtml,culture=
  condition: selection and not 1 of filter*
provenance:
  source: SigmaHQ/sigma
  source_id: 46490193-1b22-4c29-bdd6-5bf63907216f
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_vbs_payload_stored.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
