id: sigmahq-sigma-b57ba453-b384-4ab9-9f40-1038086b4e53
name: VeeamBackup Database Credentials Dump Via Sqlcmd.EXE
description: Detects dump of credentials in VeeamBackup dbo
severity: high
enabled: false
tags:
  mitre:
  - T1005
  categories:
  - endpoint
references:
- https://thedfirreport.com/2021/12/13/diavol-ransomware/
- https://forums.veeam.com/veeam-backup-replication-f2/recover-esxi-password-in-veeam-t34630.html
logsource:
  category: process_creation
  product: windows
detection:
  selection_tools:
    Image|endswith: \sqlcmd.exe
  selection_query:
    CommandLine|contains|all:
    - SELECT
    - TOP
    - '[VeeamBackup].[dbo].[Credentials]'
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: b57ba453-b384-4ab9-9f40-1038086b4e53
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_sqlcmd_veeam_dump.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
