id: sigmahq-sigma-7ab8f73a-fcff-428b-84aa-6a5ff7877dea
name: Vim GTFOBin Abuse - Linux
description: 'Detects the use of "vim" and it''s siblings commands to execute a shell
  or proxy commands.

  Such behavior may be associated with privilege escalation, unauthorized command
  execution, or to break out from restricted environments.'
severity: high
enabled: false
tags:
  mitre:
  - T1083
  categories:
  - endpoint
references:
- https://gtfobins.github.io/gtfobins/vim/
- https://gtfobins.github.io/gtfobins/rvim/
- https://gtfobins.github.io/gtfobins/vimdiff/
logsource:
  category: process_creation
  product: linux
detection:
  selection_img:
    Image|endswith:
    - /rvim
    - /vim
    - /vimdiff
    CommandLine|contains:
    - ' --cmd'
    - ' -c '
  selection_cli:
    CommandLine|contains:
    - :!/
    - ':lua '
    - ':py '
    - /bin/bash
    - /bin/dash
    - /bin/fish
    - /bin/sh
    - /bin/zsh
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 7ab8f73a-fcff-428b-84aa-6a5ff7877dea
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/process_creation/proc_creation_lnx_vim_shell_execution.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
