id: sigmahq-sigma-f4a623c2-4ef5-4c33-b811-0642f702c9f1
name: Visual Studio Code Tunnel Shell Execution
description: Detects the execution of a shell (powershell, bash, wsl...) via Visual
  Studio Code tunnel. Attackers can abuse this functionality to establish a C2 channel
  and execute arbitrary commands on the system.
severity: medium
enabled: false
tags:
  mitre:
  - T1071.001
  categories:
  - endpoint
references:
- https://ipfyx.fr/post/visual-studio-code-tunnel/
- https://badoption.eu/blog/2023/01/31/code_c2.html
- https://code.visualstudio.com/docs/remote/tunnels
logsource:
  category: process_creation
  product: windows
detection:
  selection_parent:
    ParentImage|contains: \servers\Stable-
    ParentImage|endswith: \server\node.exe
    ParentCommandLine|contains: .vscode-server
  selection_child_1:
    Image|endswith:
    - \powershell.exe
    - \pwsh.exe
    CommandLine|contains: \terminal\browser\media\shellIntegration.ps1
  selection_child_2:
    Image|endswith:
    - \wsl.exe
    - \bash.exe
  condition: selection_parent and 1 of selection_child_*
provenance:
  source: SigmaHQ/sigma
  source_id: f4a623c2-4ef5-4c33-b811-0642f702c9f1
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_vscode_tunnel_remote_shell_.yml
falsepositives:
- Legitimate use of Visual Studio Code tunnel and running code from there
notes:
  quarantine_reason: 'upstream status: test'
