id: sigmahq-sigma-65c3ca2c-525f-4ced-968e-246a713d164f
name: Visual Studio NodejsTools PressAnyKey Renamed Execution
description: Detects renamed execution of "Microsoft.NodejsTools.PressAnyKey.exe",
  which can be abused as a LOLBIN to execute arbitrary binaries
severity: medium
enabled: false
tags:
  mitre:
  - T1218
  categories:
  - endpoint
references:
- https://twitter.com/mrd0x/status/1463526834918854661
- https://gist.github.com/nasbench/a989ce64cefa8081bd50cf6ad8c491b5
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    OriginalFileName: Microsoft.NodejsTools.PressAnyKey.exe
  filter_main_legit_name:
    Image|endswith: \Microsoft.NodejsTools.PressAnyKey.exe
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 65c3ca2c-525f-4ced-968e-246a713d164f
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_renamed_pressanykey.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
