id: sigmahq-sigma-7b10f171-7f04-47c7-9fa2-5be43c76e535
name: Visual Basic Command Line Compiler Usage
description: Detects successful code compilation via Visual Basic Command Line Compiler
  that utilizes Windows Resource to Object Converter.
severity: high
enabled: false
tags:
  mitre:
  - T1027.004
  categories:
  - endpoint
references:
- https://lolbas-project.github.io/lolbas/Binaries/Vbc/
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage|endswith: \vbc.exe
    Image|endswith: \cvtres.exe
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 7b10f171-7f04-47c7-9fa2-5be43c76e535
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_lolbin_visual_basic_compiler.yml
falsepositives:
- Utilization of this tool should not be seen in enterprise environment
notes:
  quarantine_reason: 'upstream status: test'
