id: sigmahq-sigma-56e05d41-ce99-4ecd-912d-93f019ee0b71
name: Visual Studio Code Tunnel Remote File Creation
description: Detects the creation of file by the "node.exe" process in the ".vscode-server"
  directory. Could be a sign of remote file creation via VsCode tunnel feature
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- Internal Research
logsource:
  category: file_event
  product: windows
detection:
  selection:
    Image|contains: \servers\Stable-
    Image|endswith: \server\node.exe
    TargetFilename|contains: \.vscode-server\data\User\History\
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 56e05d41-ce99-4ecd-912d-93f019ee0b71
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_vscode_tunnel_remote_creation_artefacts.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
