id: sigmahq-sigma-90d6bd71-dffb-4989-8d86-a827fedd6624
name: Visual Studio Code Tunnel Execution
description: Detects Visual Studio Code tunnel execution. Attackers can abuse this
  functionality to establish a C2 channel
severity: medium
enabled: false
tags:
  mitre:
  - T1071.001
  - T1219
  categories:
  - endpoint
references:
- https://ipfyx.fr/post/visual-studio-code-tunnel/
- https://badoption.eu/blog/2023/01/31/code_c2.html
- https://code.visualstudio.com/docs/remote/tunnels
logsource:
  category: process_creation
  product: windows
detection:
  selection_only_tunnel:
    OriginalFileName: null
    CommandLine|endswith: .exe tunnel
  selection_tunnel_args:
    CommandLine|contains|all:
    - .exe tunnel
    - --accept-server-license-terms
  selection_parent_tunnel:
    ParentCommandLine|endswith: ' tunnel'
    Image|endswith: \cmd.exe
    CommandLine|contains|all:
    - '/d /c '
    - \servers\Stable-
    - code-server.cmd
  condition: 1 of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 90d6bd71-dffb-4989-8d86-a827fedd6624
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_vscode_tunnel_execution.yml
falsepositives:
- Legitimate use of Visual Studio Code tunnel
notes:
  quarantine_reason: 'upstream status: test'
