id: sigmahq-sigma-a20391f8-76fb-437b-abc0-dba2df1952c6
name: Visual Studio NodejsTools PressAnyKey Arbitrary Binary Execution
description: Detects child processes of Microsoft.NodejsTools.PressAnyKey.exe that
  can be used to execute any other binary
severity: medium
enabled: false
tags:
  mitre:
  - T1218
  categories:
  - endpoint
references:
- https://twitter.com/mrd0x/status/1463526834918854661
- https://gist.github.com/nasbench/a989ce64cefa8081bd50cf6ad8c491b5
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage|endswith: \Microsoft.NodejsTools.PressAnyKey.exe
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: a20391f8-76fb-437b-abc0-dba2df1952c6
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_pressanykey_lolbin_execution.yml
falsepositives:
- Legitimate use by developers as part of NodeJS development with Visual Studio Tools
notes:
  quarantine_reason: 'upstream status: test'
