id: sigmahq-sigma-98ffaed4-aec2-4e04-9b07-31492fe68b3d
name: VMMap Signed Dbghelp.DLL Potential Sideloading
description: Detects potential DLL sideloading of a signed dbghelp.dll by the Sysinternals
  VMMap.
severity: medium
enabled: false
tags:
  mitre:
  - T1574.001
  categories:
  - endpoint
references:
- https://techcommunity.microsoft.com/t5/sysinternals-blog/zoomit-v7-1-procdump-2-0-for-linux-process-explorer-v17-05/ba-p/3884766
logsource:
  category: image_load
  product: windows
detection:
  selection:
    ImageLoaded|contains: C:\Debuggers\dbghelp.dll
    Image|endswith:
    - \vmmap.exe
    - \vmmap64.exe
    Signed: 'true'
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 98ffaed4-aec2-4e04-9b07-31492fe68b3d
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/image_load/image_load_side_load_vmmap_dbghelp_signed.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
