id: sigmahq-sigma-273a8dd8-3742-4302-bcc7-7df5a80fe425
name: VMMap Unsigned Dbghelp.DLL Potential Sideloading
description: Detects potential DLL sideloading of an unsigned dbghelp.dll by the Sysinternals
  VMMap.
severity: high
enabled: false
tags:
  mitre:
  - T1574.001
  categories:
  - endpoint
references:
- https://techcommunity.microsoft.com/t5/sysinternals-blog/zoomit-v7-1-procdump-2-0-for-linux-process-explorer-v17-05/ba-p/3884766
logsource:
  category: image_load
  product: windows
detection:
  selection:
    ImageLoaded|contains: C:\Debuggers\dbghelp.dll
    Image|endswith:
    - \vmmap.exe
    - \vmmap64.exe
  filter_main_signed:
    Signed: 'true'
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 273a8dd8-3742-4302-bcc7-7df5a80fe425
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/image_load/image_load_side_load_vmmap_dbghelp_unsigned.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
