id: sigmahq-sigma-f512acbf-e662-4903-843e-97ce4652b740
name: Volume Shadow Copy Mount
description: Detects volume shadow copy mount via Windows event log
severity: low
enabled: false
tags:
  mitre:
  - T1003.002
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1003.002/T1003.002.md#atomic-test-3---esentutlexe-sam-copy
logsource:
  product: windows
  service: system
detection:
  selection:
    Provider_Name: Microsoft-Windows-Ntfs
    EventID: 98
    DeviceName|contains: HarddiskVolumeShadowCopy
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: f512acbf-e662-4903-843e-97ce4652b740
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/system/microsoft_windows_ntfs/win_system_volume_shadow_copy_mount.yml
falsepositives:
- Legitimate use of volume shadow copy mounts (backups maybe).
notes:
  quarantine_reason: 'upstream status: test'
