id: sigmahq-sigma-1a42dfa6-6cb2-4df9-9b48-295be477e835
name: Vulnerable WinRing0 Driver Load
description: Detects the load of a signed WinRing0 driver often used by threat actors,
  crypto miners (XMRIG) or malware for privilege escalation
severity: high
enabled: false
tags:
  mitre:
  - T1543.003
  categories:
  - endpoint
references:
- https://github.com/xmrig/xmrig/tree/master/bin/WinRing0
- https://www.rapid7.com/blog/post/2021/12/13/driver-based-attacks-past-and-present/
logsource:
  product: windows
  category: driver_load
detection:
  selection:
  - Hashes|contains: IMPHASH=D41FA95D4642DC981F10DE36F4DC8CD7
  - ImageLoaded|endswith:
    - \WinRing0x64.sys
    - \WinRing0.sys
    - \WinRing0.dll
    - \WinRing0x64.dll
    - \winring00x64.sys
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 1a42dfa6-6cb2-4df9-9b48-295be477e835
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/driver_load/driver_load_win_vuln_winring0_driver.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
