id: sigmahq-sigma-a0cb7110-edf0-47a4-9177-541a4083128a
name: Vulnerable Netlogon Secure Channel Connection Allowed
description: Detects that a vulnerable Netlogon secure channel connection was allowed,
  which could be an indicator of CVE-2020-1472.
severity: high
enabled: false
tags:
  mitre:
  - T1548
  categories:
  - endpoint
references:
- https://support.microsoft.com/en-us/help/4557222/how-to-manage-the-changes-in-netlogon-secure-channel-connections-assoc
logsource:
  product: windows
  service: system
detection:
  selection:
    Provider_Name: NetLogon
    EventID: 5829
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: a0cb7110-edf0-47a4-9177-541a4083128a
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/system/netlogon/win_system_vul_cve_2020_1472.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
