id: sigmahq-sigma-22154f0e-5132-4a54-aa78-cc62f6def531
name: Vulnerable Driver Blocklist Registry Tampering Via CommandLine
description: 'Detects tampering of the Vulnerable Driver Blocklist registry via command
  line tools such as PowerShell or REG.EXE.

  The Vulnerable Driver Blocklist is a security feature that helps prevent the loading
  of known vulnerable drivers.

  Disabling this feature may indicate an attempt to bypass security controls, often
  targeted by threat actors

  to facilitate the installation of malicious or vulnerable drivers, particularly
  in scenarios involving Endpoint Detection and Response'
severity: high
enabled: false
tags:
  mitre:
  - T1685
  categories:
  - endpoint
references:
- https://www.sophos.com/en-us/blog/sharpening-the-knife-gold-blades-strategic-evolution
- https://learn.microsoft.com/en-us/windows/security/application-security/application-control/app-control-for-business/design/microsoft-recommended-driver-block-rules
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - \powershell.exe
    - \pwsh.exe
    - \reg.exe
  - OriginalFileName:
    - PowerShell.EXE
    - pwsh.dll
    - reg.exe
  selection_cli_1:
    CommandLine|contains:
    - 'add '
    - 'New-ItemProperty '
    - 'Set-ItemProperty '
    - 'si '
  selection_cli_2:
    CommandLine|contains|all:
    - \Control\CI\Config
    - VulnerableDriverBlocklistEnable
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 22154f0e-5132-4a54-aa78-cc62f6def531
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_vulnerable_driver_blocklist_registry_tampering.yml
falsepositives:
- It is very unlikely for legitimate activities to disable the Vulnerable Driver Blocklist
  via command line tools; thus it is recommended to investigate promptly.
notes:
  quarantine_reason: 'upstream status: experimental'
