id: sigmahq-sigma-395907ee-96e5-4666-af2e-2ca91688e151
name: Wab Execution From Non Default Location
description: Detects execution of wab.exe (Windows Contacts) and Wabmig.exe (Microsoft
  Address Book Import Tool) from non default locations as seen with bumblebee activity
severity: high
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://thedfirreport.com/2022/08/08/bumblebee-roasts-its-way-to-domain-admin/
- https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/bumblebee-loader-cybercrime
- https://thedfirreport.com/2022/09/26/bumblebee-round-two/
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith:
    - \wab.exe
    - \wabmig.exe
  filter:
    Image|startswith:
    - C:\Windows\WinSxS\
    - C:\Program Files\Windows Mail\
    - C:\Program Files (x86)\Windows Mail\
  condition: selection and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: 395907ee-96e5-4666-af2e-2ca91688e151
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_wab_execution_from_non_default_location.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
