id: sigmahq-sigma-c0d3734d-330f-4a03-aae2-65dacc6a8222
name: Webshell Remote Command Execution
description: Detects possible command execution by web application/web shell
severity: critical
enabled: false
tags:
  mitre:
  - T1505.003
  categories:
  - endpoint
references:
- Personal Experience of the Author
- https://www.vaadata.com/blog/what-is-command-injection-exploitations-and-security-best-practices/
logsource:
  product: linux
  service: auditd
  definition: 'Required auditd configuration:

    -a always,exit -F arch=b32 -S execve -F euid=33 -k detect_execve_www

    -a always,exit -F arch=b64 -S execve -F euid=33 -k detect_execve_www

    -a always,exit -F arch=b32 -S execveat -F euid=33 -k detect_execve_www

    -a always,exit -F arch=b64 -S execveat -F euid=33 -k detect_execve_www

    Change the number "33" to the ID of your WebServer user. Default: www-data:x:33:33

    '
detection:
  selection:
    type: SYSCALL
    SYSCALL:
    - execve
    - execveat
    euid: 33
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: c0d3734d-330f-4a03-aae2-65dacc6a8222
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/auditd/syscall/lnx_auditd_web_rce.yml
falsepositives:
- Admin activity
- Crazy web applications
notes:
  quarantine_reason: 'upstream status: test'
