id: sigmahq-sigma-4ebc877f-4612-45cb-b3a5-8e3834db36c9
name: Webshell Hacking Activity Patterns
description: Detects certain parent child patterns found in cases in which a web shell
  is used to perform certain credential dumping or exfiltration activities on a compromised
  system
severity: high
enabled: false
tags:
  mitre:
  - T1505.003
  - T1018
  - T1033
  - T1087
  categories:
  - endpoint
references:
- https://youtu.be/7aemGhaE9ds?t=641
logsource:
  category: process_creation
  product: windows
detection:
  selection_webserver_image:
    ParentImage|endswith:
    - \caddy.exe
    - \httpd.exe
    - \nginx.exe
    - \php-cgi.exe
    - \w3wp.exe
    - \ws_tomcatservice.exe
  selection_webserver_characteristics_tomcat1:
    ParentImage|endswith:
    - \java.exe
    - \javaw.exe
    ParentImage|contains:
    - -tomcat-
    - \tomcat
  selection_webserver_characteristics_tomcat2:
    ParentImage|endswith:
    - \java.exe
    - \javaw.exe
    CommandLine|contains:
    - catalina.jar
    - CATALINA_HOME
  selection_child_1:
    CommandLine|contains|all:
    - rundll32
    - comsvcs
  selection_child_2:
    CommandLine|contains|all:
    - ' -hp'
    - ' a '
    - ' -m'
  selection_child_3:
    CommandLine|contains|all:
    - net
    - ' user '
    - ' /add'
  selection_child_4:
    CommandLine|contains|all:
    - net
    - ' localgroup '
    - ' administrators '
    - /add
  selection_child_5:
    Image|endswith:
    - \ntdsutil.exe
    - \ldifde.exe
    - \adfind.exe
    - \procdump.exe
    - \Nanodump.exe
    - \vssadmin.exe
    - \fsutil.exe
  selection_child_6:
    CommandLine|contains:
    - ' -decode '
    - ' -NoP '
    - ' -W Hidden '
    - ' /decode '
    - ' /ticket:'
    - ' sekurlsa'
    - .dmp full
    - .downloadfile(
    - .downloadstring(
    - FromBase64String
    - process call create
    - 'reg save '
    - whoami /priv
  condition: 1 of selection_webserver_* and 1 of selection_child_*
provenance:
  source: SigmaHQ/sigma
  source_id: 4ebc877f-4612-45cb-b3a5-8e3834db36c9
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_webshell_hacking.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: test'
