id: sigmahq-sigma-1f1d8209-636e-4c6c-a137-781cca8b82f9
name: WFP Filter Added via Registry
description: Detects registry modifications that add Windows Filtering Platform (WFP)
  filters, which may be used to block security tools and EDR agents from reporting
  events.
severity: medium
enabled: false
tags:
  mitre:
  - T1685
  - T1569.002
  categories:
  - endpoint
references:
- https://github.com/netero1010/EDRSilencer/blob/0e73a7037ec65c52894d8208e6f605a7da0a34a6/EDRSilencer.c
- https://www.huntress.com/blog/silencing-the-edr-silencers
- https://www.trendmicro.com/en_us/research/24/j/edrsilencer-disrupting-endpoint-security-solutions.html
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains: \BFE\Parameters\Policy\Persistent\Filter\
  filter_main_svchost:
    Image:
    - C:\Windows\System32\svchost.exe
    - C:\Windows\SysWOW64\svchost.exe
  condition: selection and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 1f1d8209-636e-4c6c-a137-781cca8b82f9
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_susp_wfp_filter_added.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: experimental'
