id: sigmahq-sigma-35a05c60-9012-49b6-a11f-6bab741c9f74
name: Wget Creating Files in Tmp Directory
description: Detects the use of wget to download content in a temporary directory
  such as "/tmp" or "/var/tmp"
severity: medium
enabled: false
tags:
  mitre:
  - T1105
  categories:
  - endpoint
references:
- https://blogs.jpcert.or.jp/en/2023/05/gobrat.html
- https://jstnk9.github.io/jstnk9/research/GobRAT-Malware/
- https://www.virustotal.com/gui/file/60bcd645450e4c846238cf0e7226dc40c84c96eba99f6b2cffcd0ab4a391c8b3/detection
- https://www.virustotal.com/gui/file/3e44c807a25a56f4068b5b8186eee5002eed6f26d665a8b791c472ad154585d1/detection
logsource:
  product: linux
  category: file_event
detection:
  selection:
    Image|endswith: /wget
    TargetFilename|startswith:
    - /tmp/
    - /var/tmp/
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 35a05c60-9012-49b6-a11f-6bab741c9f74
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/file_event/file_event_lnx_wget_download_file_in_tmp_dir.yml
falsepositives:
- Legitimate downloads of files in the tmp folder.
notes:
  quarantine_reason: 'upstream status: test'
