id: sigmahq-sigma-c30fb093-1109-4dc8-88a8-b30d11c95a5d
name: Whoami.EXE Execution With Output Option
description: Detects the execution of "whoami.exe" with the "/FO" flag to choose CSV
  as output format or with redirection options to export the results to a file for
  later use.
severity: medium
enabled: false
tags:
  mitre:
  - T1033
  categories:
  - endpoint
references:
- https://brica.de/alerts/alert/public/1247926/agent-tesla-keylogger-delivered-inside-a-power-iso-daa-archive/
- https://app.any.run/tasks/7eaba74e-c1ea-400f-9c17-5e30eee89906/
- https://www.youtube.com/watch?v=DsJ9ByX84o4&t=6s
logsource:
  category: process_creation
  product: windows
detection:
  selection_main_img:
  - Image|endswith: \whoami.exe
  - OriginalFileName: whoami.exe
  selection_main_cli:
    CommandLine|contains:
    - ' /FO CSV'
    - ' -FO CSV'
  selection_special:
    CommandLine|contains: whoami*>
  condition: all of selection_main_* or selection_special
provenance:
  source: SigmaHQ/sigma
  source_id: c30fb093-1109-4dc8-88a8-b30d11c95a5d
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_whoami_output.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
