id: sigmahq-sigma-e9142d84-fbe0-401d-ac50-3e519fb00c89
name: WhoAmI as Parameter
description: Detects a suspicious process command line that uses whoami as first parameter
  (as e.g. used by EfsPotato)
severity: high
enabled: false
tags:
  mitre:
  - T1033
  categories:
  - endpoint
references:
- https://twitter.com/blackarrowsec/status/1463805700602224645?s=12
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains: .exe whoami
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: e9142d84-fbe0-401d-ac50-3e519fb00c89
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_susp_whoami_as_param.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
