id: sigmahq-sigma-7e6237fe-3ddb-438f-9381-9bf9de5af8d0
name: Windows Internet Hosted WebDav Share Mount Via Net.EXE
description: Detects when an internet hosted webdav share is mounted using the "net.exe"
  utility
severity: high
enabled: false
tags:
  mitre:
  - T1021.002
  categories:
  - endpoint
references:
- https://drive.google.com/file/d/1lKya3_mLnR3UQuCoiYruO3qgu052_iS_/view
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - \net.exe
    - \net1.exe
  - OriginalFileName:
    - net.exe
    - net1.exe
  selection_cli:
    CommandLine|contains|all:
    - ' use '
    - ' http'
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 7e6237fe-3ddb-438f-9381-9bf9de5af8d0
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_net_use_mount_internet_share.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
