id: sigmahq-sigma-58f50261-c53b-4c88-bd12-1d71f12eda4c
name: Windows Credential Manager Access via VaultCmd
description: List credentials currently stored in Windows Credential Manager via the
  native Windows utility vaultcmd.exe
severity: medium
enabled: false
tags:
  mitre:
  - T1555.004
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1555.004/T1555.004.md#atomic-test-1---access-saved-credentials-via-vaultcmd
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \VaultCmd.exe
  - OriginalFileName: VAULTCMD.EXE
  selection_cli:
    CommandLine|contains: '/listcreds:'
  condition: all of selection*
provenance:
  source: SigmaHQ/sigma
  source_id: 58f50261-c53b-4c88-bd12-1d71f12eda4c
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_vaultcmd_list_creds.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
