id: sigmahq-sigma-a6b33c02-8305-488f-8585-03cb2a7763f2
name: Windows Credential Editor Registry
description: Detects the use of Windows Credential Editor (WCE)
severity: critical
enabled: false
tags:
  mitre:
  - T1003.001
  categories:
  - endpoint
references:
- https://www.ampliasecurity.com/research/windows-credentials-editor/
logsource:
  category: registry_event
  product: windows
detection:
  selection:
    TargetObject|contains: Services\WCESERVICE\Start
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: a6b33c02-8305-488f-8585-03cb2a7763f2
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_event/registry_event_hack_wce_reg.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
