id: sigmahq-sigma-ba226dcf-d390-4642-b9af-b534872f1156
name: Windows Event Log Access Tampering Via Registry
description: Detects changes to the Windows EventLog channel permission values. It
  focuses on changes to the Security Descriptor Definition Language (SDDL) string,
  as modifications to these values can restrict access to specific users or groups,
  potentially aiding in defense evasion by controlling who can view or modify a event
  log channel. Upon execution, the user shouldn't be able to access the event log
  channel via the event viewer or via utilities such as "Get-EventLog" or "wevtutil".
severity: high
enabled: false
tags:
  mitre:
  - T1547.001
  - T1112
  categories:
  - endpoint
references:
- https://www.atomicredteam.io/atomic-red-team/atomics/T1562.002#atomic-test-8---modify-event-log-channel-access-permissions-via-registry---powershell
- https://www.youtube.com/watch?v=uSYvHUVU8xY
- https://learn.microsoft.com/en-us/windows/win32/secauthz/security-descriptor-definition-language
logsource:
  category: registry_set
  product: windows
detection:
  selection_key_1:
    TargetObject|contains: \SYSTEM\CurrentControlSet\Services\EventLog\
    TargetObject|endswith: \CustomSD
  selection_key_2:
    TargetObject|contains:
    - \Policies\Microsoft\Windows\EventLog\
    - \Microsoft\Windows\CurrentVersion\WINEVT\Channels
    TargetObject|endswith: \ChannelAccess
  selection_details:
  - Details|contains: D:(D;
  - Details|contains|all:
    - D:(
    - )(D;
  filter_main_trustedinstaller:
    Image: C:\Windows\servicing\TrustedInstaller.exe
  filter_main_tiworker:
    Image|startswith: C:\Windows\WinSxS\
    Image|endswith: \TiWorker.exe
  filter_optional_empty:
    Image: ''
  filter_optional_null:
    Image: null
  condition: 1 of selection_key_* and selection_details and not 1 of filter_main_*
    and not 1 of filter_optional_*
provenance:
  source: SigmaHQ/sigma
  source_id: ba226dcf-d390-4642-b9af-b534872f1156
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_disable_windows_event_log_access.yml
falsepositives:
- Administrative activity, still unlikely
notes:
  quarantine_reason: 'upstream status: experimental'
