id: sigmahq-sigma-d7b81144-b866-48a4-9bcc-275dc69d870e
name: Windows EventLog Autologger Session Registry Modification Via CommandLine
description: 'Detects attempts to disable Windows EventLog autologger sessions via
  registry modification.

  The AutoLogger event tracing session records events that occur early in the operating
  system boot process.

  Applications and device drivers can use the AutoLogger session to capture traces
  before the user logs in.

  Adversaries may disable these sessions to evade detection and prevent security monitoring
  of early boot activities and system events.'
severity: high
enabled: false
tags:
  mitre:
  - T1685.001
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/windows/win32/etw/configuring-and-starting-an-autologger-session
- https://ptylu.github.io/content/report/report.html?report=25
- https://blog.palantir.com/tampering-with-windows-event-tracing-background-offense-and-defense-4be7ac62ac63
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - \reg.exe
    - \powershell.exe
    - \pwsh.exe
  - OriginalFileName:
    - reg.exe
    - PowerShell.EXE
    - pwsh.dll
  selection_cli_action:
    CommandLine|contains:
    - 'add '
    - Set-ItemProperty
    - New-ItemProperty
    - 'si '
  selection_cli_base:
    CommandLine|contains: \Control\WMI\Autologger\
  selection_cli_key:
    CommandLine|contains:
    - Start
    - Enabled
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: d7b81144-b866-48a4-9bcc-275dc69d870e
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_autologger_session_registry_modification.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: experimental'
