id: sigmahq-sigma-3a6586ad-127a-4d3b-a677-1e6eacdf8fde
name: Windows Shell/Scripting Processes Spawning Suspicious Programs
description: Detects suspicious child processes of a Windows shell and scripting processes
  such as wscript, rundll32, powershell, mshta...etc.
severity: high
enabled: false
tags:
  mitre:
  - T1059.005
  - T1059.001
  - T1218
  categories:
  - endpoint
references:
- https://mgreen27.github.io/posts/2018/04/02/DownloadCradle.html
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage|endswith:
    - \mshta.exe
    - \powershell.exe
    - \pwsh.exe
    - \rundll32.exe
    - \cscript.exe
    - \wscript.exe
    - \wmiprvse.exe
    - \regsvr32.exe
    Image|endswith:
    - \schtasks.exe
    - \nslookup.exe
    - \certutil.exe
    - \bitsadmin.exe
    - \mshta.exe
  filter_ccmcache:
    CurrentDirectory|contains: \ccmcache\
  filter_amazon:
    ParentCommandLine|contains:
    - \Program Files\Amazon\WorkSpacesConfig\Scripts\setup-scheduledtask.ps1
    - \Program Files\Amazon\WorkSpacesConfig\Scripts\set-selfhealing.ps1
    - \Program Files\Amazon\WorkSpacesConfig\Scripts\check-workspacehealth.ps1
    - \nessus_
  filter_nessus:
    CommandLine|contains: \nessus_
  filter_sccm_install:
    ParentImage|endswith: \mshta.exe
    Image|endswith: \mshta.exe
    ParentCommandLine|contains|all:
    - C:\MEM_Configmgr_
    - \splash.hta
    - '{1E460BD7-F1C3-4B2E-88BF-4E770A288AF5}'
    CommandLine|contains|all:
    - C:\MEM_Configmgr_
    - \SMSSETUP\BIN\
    - \autorun.hta
    - '{1E460BD7-F1C3-4B2E-88BF-4E770A288AF5}'
  condition: selection and not 1 of filter_*
provenance:
  source: SigmaHQ/sigma
  source_id: 3a6586ad-127a-4d3b-a677-1e6eacdf8fde
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_susp_shell_spawn_susp_program.yml
falsepositives:
- Administrative scripts
- Microsoft SCCM
notes:
  quarantine_reason: 'upstream status: test'
