id: sigmahq-sigma-e54279c7-4910-4e2c-902c-c56a25b549f6
name: Windows AppX Deployment Full Trust Package Installation
description: Detects the installation of MSIX/AppX packages with full trust privileges
  which run with elevated privileges outside normal AppX container restrictions
severity: medium
enabled: false
tags:
  mitre:
  - T1204.002
  - T1553.005
  categories:
  - endpoint
references:
- https://www.splunk.com/en_us/blog/security/msix-weaponization-threat-detection-splunk.html
logsource:
  product: windows
  service: appxdeployment-server
detection:
  selection:
    EventID: 400
    HasFullTrust: true
  filter_main_legitpath:
    PackageSourceUri|startswith:
    - file:///C:/Program%20Files/
    - file:///C:/Program%20Files%20(x86)/
  filter_main_microsoft:
  - PackageSourceUri|startswith: https://go.microsoft.com/fwlink/?linkid
  - PackageSourceUri|contains:
    - .cdn.microsoft.com
    - .cdn.office.net/
  filter_main_callerprocess:
    CallingProcess|startswith:
    - sysprep.exe
    - svchost.exe,AppReadiness
  filter_optional_x_update:
    PackageSourceUri|startswith: x-windowsupdate://
  filter_optional_microsoftclient:
    PackageFullName|startswith: MicrosoftWindows.Client.
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
provenance:
  source: SigmaHQ/sigma
  source_id: e54279c7-4910-4e2c-902c-c56a25b549f6
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/appxdeployment_server/win_appxpackaging_server_full_trust_package_installation.yml
falsepositives:
- Some legitimate applications installation which have been missed from filtering
  can generate fps, thus baselining and tuning is recommended before deploying to
  production
notes:
  quarantine_reason: 'upstream status: experimental'
