id: sigmahq-sigma-488b44e7-3781-4a71-888d-c95abfacf44d
name: Windows Firewall Profile Disabled
description: Detects when a user disables the Windows Firewall via a Profile to help
  evade defense.
severity: medium
enabled: false
tags:
  mitre:
  - T1686.003
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/powershell/module/netsecurity/set-netfirewallprofile?view=windowsserver2022-ps
- https://www.tutorialspoint.com/how-to-get-windows-firewall-profile-settings-using-powershell
- https://web.archive.org/web/20230929023836/http://powershellhelp.space/commands/set-netfirewallrule-psv5.php
- http://woshub.com/manage-windows-firewall-powershell/
- https://www.elastic.co/guide/en/security/current/windows-firewall-disabled-via-powershell.html
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection_args:
    ScriptBlockText|contains|all:
    - 'Set-NetFirewallProfile '
    - ' -Enabled '
    - ' False'
  selection_opt:
    ScriptBlockText|contains:
    - ' -All '
    - Public
    - Domain
    - Private
  condition: all of selection*
provenance:
  source: SigmaHQ/sigma
  source_id: 488b44e7-3781-4a71-888d-c95abfacf44d
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_windows_firewall_profile_disabled.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
