id: sigmahq-sigma-46a68649-f218-4f86-aea1-16a759d81820
name: Windows Defender Exclusion List Modified
description: Detects modifications to the Windows Defender exclusion registry key.
  This could indicate a potentially suspicious or even malicious activity by an attacker
  trying to add a new exclusion in order to bypass security.
severity: medium
enabled: false
tags:
  mitre:
  - T1685
  categories:
  - endpoint
references:
- https://www.bleepingcomputer.com/news/security/gootkit-malware-bypasses-windows-defender-by-setting-path-exclusions/
logsource:
  product: windows
  service: security
  definition: 'Requirements: Audit Policy : Security Settings/Local Policies/Audit
    Policy, Registry System Access Control (SACL): Auditing/User'
detection:
  selection:
    EventID: 4657
    ObjectName|contains: \Microsoft\Windows Defender\Exclusions\
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 46a68649-f218-4f86-aea1-16a759d81820
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/security/win_security_windows_defender_exclusions_registry_modified.yml
falsepositives:
- Intended exclusions by administrators
notes:
  quarantine_reason: 'upstream status: test'
