id: sigmahq-sigma-5dfc1465-8f65-4fde-8eb5-6194380c6a62
name: Windows Recall Feature Enabled - DisableAIDataAnalysis Value Deleted
description: 'Detects the enabling of the Windows Recall feature via registry manipulation.
  Windows Recall can be enabled by deleting the existing "DisableAIDataAnalysis" registry
  value.

  Adversaries may enable Windows Recall as part of post-exploitation discovery and
  collection activities.

  This rule assumes that Recall is already explicitly disabled on the host, and subsequently
  enabled by the adversary.'
severity: medium
enabled: false
tags:
  mitre:
  - T1113
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/windows/client-management/manage-recall
- https://learn.microsoft.com/en-us/windows/client-management/mdm/policy-csp-windowsai#disableaidataanalysis
logsource:
  category: registry_delete
  product: windows
detection:
  selection:
    EventType: DeleteValue
    TargetObject|endswith: \Microsoft\Windows\WindowsAI\DisableAIDataAnalysis
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 5dfc1465-8f65-4fde-8eb5-6194380c6a62
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_delete/registry_delete_enable_windows_recall.yml
falsepositives:
- Legitimate use/activation of Windows Recall
notes:
  quarantine_reason: 'upstream status: test'
