id: sigmahq-sigma-27ee9438-90dc-4bef-904b-d3ef927f5e7e
name: Windows Kernel Debugger Execution
description: Detects execution of the Windows Kernel Debugger "kd.exe".
severity: medium
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- Internal Research
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Image|endswith: \kd.exe
  - OriginalFileName: kd.exe
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 27ee9438-90dc-4bef-904b-d3ef927f5e7e
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_kd_execution.yml
falsepositives:
- Rare occasions of legitimate cases where kernel debugging is necessary in production.
  Investigation is required
notes:
  quarantine_reason: 'upstream status: test'
