id: sigmahq-sigma-d526c60a-e236-4011-b165-831ffa52ab70
name: Windows Vulnerable Driver Blocklist Disabled
description: 'Detects when the Windows Vulnerable Driver Blocklist is set to disabled.
  This setting is crucial for preventing the loading of known vulnerable drivers,

  and its modification may indicate an attempt to bypass security controls. It is
  often targeted by threat actors to facilitate the installation of malicious or vulnerable
  drivers,

  particularly in scenarios involving Endpoint Detection and Response (EDR) bypass
  techniques.

  This rule applies to systems that support the Vulnerable Driver Blocklist feature,
  including Windows 10 version 1903 and later, and Windows Server 2022 and later.

  Note that this change will require a reboot to take effect, and this rule only detects
  the registry modification action.'
severity: high
enabled: false
tags:
  mitre:
  - T1685
  categories:
  - endpoint
references:
- https://docs.microsoft.com/en-us/windows/security/threat-protection/windows-defender-application-control/microsoft-recommended-driver-block-rules
- https://www.sophos.com/en-us/blog/sharpening-the-knife-gold-blades-strategic-evolution
- https://learn.microsoft.com/en-us/windows/security/application-security/application-control/app-control-for-business/design/microsoft-recommended-driver-block-rules
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|endswith: \Control\CI\Config\VulnerableDriverBlocklistEnable
    Details: DWORD (0x00000000)
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: d526c60a-e236-4011-b165-831ffa52ab70
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_vulnerable_driver_blocklist_disable.yml
falsepositives:
- Unlikely and should be investigated immediately.
notes:
  quarantine_reason: 'upstream status: experimental'
