id: sigmahq-sigma-d645ef86-2396-48a1-a2b6-b629ca3f57ff
name: Windows Credential Guard Related Registry Value Deleted - Registry
description: 'Detects attempts to disable Windows Credential Guard by deleting registry
  values. Credential Guard uses virtualization-based security to isolate secrets so
  that only privileged system software can access them.

  Adversaries may disable Credential Guard to gain access to sensitive credentials
  stored in the system, such as NTLM hashes and Kerberos tickets, which can be used
  for lateral movement and privilege escalation.'
severity: high
enabled: false
tags:
  mitre:
  - T1685
  categories:
  - endpoint
references:
- https://github.com/DambergC/SaveFolder/blob/90e945eba80fae85f2d54b4616e05a44ec90c500/Cygate%20Installation%20tool%206.22/Script/OSD/OSDeployment-CredentialGuardDisable.ps1#L50
- https://learn.microsoft.com/en-us/windows/security/identity-protection/credential-guard/configure
logsource:
  category: registry_delete
  product: windows
detection:
  selection:
    TargetObject|endswith:
    - \DeviceGuard\EnableVirtualizationBasedSecurity
    - \DeviceGuard\LsaCfgFlags
    - \DeviceGuard\RequirePlatformSecurityFeatures
    - \Lsa\LsaCfgFlags
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: d645ef86-2396-48a1-a2b6-b629ca3f57ff
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_delete/registry_delete_disable_credential_guard.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: experimental'
