id: sigmahq-sigma-9b64de98-9db3-4033-bd7a-f51430105f00
name: Windows Terminal Profile Settings Modification By Uncommon Process
description: Detects the creation or modification of the Windows Terminal Profile
  settings file "settings.json" by an uncommon process.
severity: medium
enabled: false
tags:
  mitre:
  - T1547.015
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/74438b0237d141ee9c99747976447dc884cb1a39/atomics/T1547.015/T1547.015.md#atomic-test-1---persistence-by-modifying-windows-terminal-profile
- https://twitter.com/nas_bench/status/1550836225652686848
logsource:
  product: windows
  category: file_event
detection:
  selection:
    Image|endswith:
    - \cmd.exe
    - \cscript.exe
    - \mshta.exe
    - \powershell.exe
    - \pwsh.exe
    - \wscript.exe
    TargetFilename|endswith: \AppData\Local\Packages\Microsoft.WindowsTerminal_8wekyb3d8bbwe\LocalState\settings.json
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 9b64de98-9db3-4033-bd7a-f51430105f00
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_susp_windows_terminal_profile.yml
falsepositives:
- Some false positives may occur with admin scripts that set WT settings.
notes:
  quarantine_reason: 'upstream status: test'
