id: sigmahq-sigma-04b60639-39c0-412a-9fbe-e82499c881a3
name: Windows Defender Firewall Has Been Reset To Its Default Configuration
description: Detects activity when Windows Defender Firewall has been reset to its
  default configuration
severity: low
enabled: false
tags:
  mitre:
  - T1686.003
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2008-r2-and-2008/dd364427(v=ws.10)
logsource:
  product: windows
  service: firewall-as
detection:
  selection:
    EventID:
    - 2032
    - 2060
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 04b60639-39c0-412a-9fbe-e82499c881a3
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/firewall_as/win_firewall_as_reset_config.yml
notes:
  quarantine_reason: 'upstream status: test'
