id: sigmahq-sigma-ed825c86-c009-4014-b413-b76003e33d35
name: Windows Binary Executed From WSL
description: 'Detects the execution of Windows binaries from within a WSL instance.

  This could be used to masquerade parent-child relationships'
severity: medium
enabled: false
tags:
  mitre:
  - T1202
  categories:
  - endpoint
references:
- Internal Research
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|re: '[a-zA-Z]:\\'
    CurrentDirectory|contains: \\\\wsl.localhost
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: ed825c86-c009-4014-b413-b76003e33d35
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_wsl_windows_binaries_execution.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
