id: sigmahq-sigma-a4b25073-8947-489c-a8dd-93b41c23f26d
name: Windows LAPS Credential Dump From Entra ID
description: Detects when an account dumps the LAPS password from Entra ID.
severity: high
enabled: false
tags:
  mitre:
  - T1098.005
  categories:
  - cloud
references:
- https://twitter.com/NathanMcNulty/status/1785051227568632263
- https://www.cloudcoffee.ch/microsoft-365/configure-windows-laps-in-microsoft-intune/
- https://techcommunity.microsoft.com/t5/microsoft-entra-blog/introducing-windows-local-administrator-password-solution-with/ba-p/1942487
logsource:
  product: azure
  service: auditlogs
detection:
  selection:
    category: Device
    activityType|contains: Recover device local administrator password
    additionalDetails.additionalInfo|contains: Successfully recovered local credential
      by device id
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: a4b25073-8947-489c-a8dd-93b41c23f26d
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/cloud/azure/audit_logs/azure_auditlogs_laps_credential_dumping.yml
falsepositives:
- Approved activity performed by an Administrator.
notes:
  quarantine_reason: 'upstream status: test'
