id: sigmahq-sigma-73921b9c-cafd-4446-b0c6-fdb0ace42bc0
name: Windows Credential Guard Disabled - Registry
description: 'Detects attempts to disable Windows Credential Guard by setting registry
  values to 0. Credential Guard uses virtualization-based security to isolate secrets
  so that only privileged system software can access them.

  Adversaries may disable Credential Guard to gain access to sensitive credentials
  stored in the system, such as NTLM hashes and Kerberos tickets, which can be used
  for lateral movement and privilege escalation.'
severity: high
enabled: false
tags:
  mitre:
  - T1685
  categories:
  - endpoint
references:
- https://woshub.com/disable-credential-guard-windows/
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|endswith:
    - \DeviceGuard\EnableVirtualizationBasedSecurity
    - \DeviceGuard\LsaCfgFlags
    - \Lsa\LsaCfgFlags
    Details: DWORD (0x00000000)
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 73921b9c-cafd-4446-b0c6-fdb0ace42bc0
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_credential_guard_disabled.yml
falsepositives:
- Unlikely
notes:
  quarantine_reason: 'upstream status: experimental'
