id: sigmahq-sigma-e1aa95de-610a-427d-b9e7-9b46cfafbe6a
name: Windows Defender Service Disabled - Registry
description: Detects when an attacker or tool disables the  Windows Defender service
  (WinDefend) via the registry
severity: high
enabled: false
tags:
  mitre:
  - T1685
  categories:
  - endpoint
references:
- https://thedfirreport.com/2021/10/18/icedid-to-xinglocker-ransomware-in-24-hours/
- https://gist.github.com/anadr/7465a9fde63d41341136949f14c21105
logsource:
  product: windows
  category: registry_set
detection:
  selection:
    TargetObject|endswith: \Services\WinDefend\Start
    Details: DWORD (0x00000004)
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: e1aa95de-610a-427d-b9e7-9b46cfafbe6a
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_disable_windows_defender_service.yml
falsepositives:
- Administrator actions
notes:
  quarantine_reason: 'upstream status: test'
