id: sigmahq-sigma-dfd2fcb7-8bd5-4daa-b132-5adb61d6ad45
name: Windows Hotfix Updates Reconnaissance Via Wmic.EXE
description: Detects the execution of wmic with the "qfe" flag in order to obtain
  information about installed hotfix updates on the system. This is often used by
  pentester and attacker enumeration scripts
severity: medium
enabled: false
tags:
  mitre:
  - T1047
  categories:
  - endpoint
references:
- https://github.com/carlospolop/PEASS-ng/blob/fa0f2e17fbc1d86f1fd66338a40e665e7182501d/winPEAS/winPEASbat/winPEAS.bat
- https://sushant747.gitbooks.io/total-oscp-guide/content/privilege_escalation_windows.html
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - OriginalFileName: wmic.exe
  - Image|endswith: \WMIC.exe
  selection_cli:
    CommandLine|contains: ' qfe'
  condition: all of selection*
provenance:
  source: SigmaHQ/sigma
  source_id: dfd2fcb7-8bd5-4daa-b132-5adb61d6ad45
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_wmic_recon_hotfix.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
