id: sigmahq-sigma-75180c5f-4ea1-461a-a4f6-6e4700c065d4
name: Windows Recall Feature Enabled - Registry
description: 'Detects the enabling of the Windows Recall feature via registry manipulation.
  Windows Recall can be enabled by setting the value of "DisableAIDataAnalysis" to
  "0".

  Adversaries may enable Windows Recall as part of post-exploitation discovery and
  collection activities.

  This rule assumes that Recall is already explicitly disabled on the host, and subsequently
  enabled by the adversary.'
severity: medium
enabled: false
tags:
  mitre:
  - T1113
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/windows/client-management/manage-recall
- https://learn.microsoft.com/en-us/windows/client-management/mdm/policy-csp-windowsai#disableaidataanalysis
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|endswith: \Software\Policies\Microsoft\Windows\WindowsAI\DisableAIDataAnalysis
    Details: DWORD (0x00000000)
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 75180c5f-4ea1-461a-a4f6-6e4700c065d4
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_enable_windows_recall.yml
falsepositives:
- Legitimate use/activation of Windows Recall
notes:
  quarantine_reason: 'upstream status: test'
