id: sigmahq-sigma-12f6b752-042d-483e-bf9c-915a6d06ad75
name: Windows Firewall Disabled via PowerShell
description: Detects attempts to disable the Windows Firewall using PowerShell
severity: medium
enabled: false
tags:
  mitre:
  - T1685
  categories:
  - endpoint
references:
- https://www.elastic.co/guide/en/security/current/windows-firewall-disabled-via-powershell.html
logsource:
  category: process_creation
  product: windows
detection:
  selection_name:
  - Image|endswith:
    - \powershell.exe
    - \pwsh.exe
    - \powershell_ise.exe
  - OriginalFileName:
    - PowerShell.EXE
    - pwsh.dll
  selection_args:
    CommandLine|contains|all:
    - 'Set-NetFirewallProfile '
    - ' -Enabled '
    - ' False'
  selection_opt:
    CommandLine|contains:
    - ' -All '
    - Public
    - Domain
    - Private
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 12f6b752-042d-483e-bf9c-915a6d06ad75
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_powershell_disable_firewall.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
