id: sigmahq-sigma-96036718-71cc-4027-a538-d1587e0006a7
name: Windows Processes Suspicious Parent Directory
description: Detect suspicious parent processes of well-known Windows processes
severity: low
enabled: false
tags:
  mitre:
  - T1036.003
  - T1036.005
  categories:
  - endpoint
references:
- https://web.archive.org/web/20180718061628/https://securitybytes.io/blue-team-fundamentals-part-two-windows-processes-759fe15965e2
- https://www.carbonblack.com/2014/06/10/screenshot-demo-hunt-evil-faster-than-ever-with-carbon-black/
- https://www.13cubed.com/downloads/windows_process_genealogy_v2.pdf
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith:
    - \svchost.exe
    - \taskhost.exe
    - \lsm.exe
    - \lsass.exe
    - \services.exe
    - \lsaiso.exe
    - \csrss.exe
    - \wininit.exe
    - \winlogon.exe
  filter_sys:
  - ParentImage|endswith:
    - \SavService.exe
    - \ngen.exe
  - ParentImage|contains:
    - \System32\
    - \SysWOW64\
  filter_msmpeng:
    ParentImage|contains:
    - \Windows Defender\
    - \Microsoft Security Client\
    ParentImage|endswith: \MsMpEng.exe
  filter_null:
  - ParentImage: null
  - ParentImage:
    - ''
    - '-'
  condition: selection and not 1 of filter_*
provenance:
  source: SigmaHQ/sigma
  source_id: 96036718-71cc-4027-a538-d1587e0006a7
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_susp_proc_wrong_parent.yml
falsepositives:
- Some security products seem to spawn these
notes:
  quarantine_reason: 'upstream status: test'
