id: sigmahq-sigma-b8fd0e93-ff58-4cbd-8f48-1c114e342e62
name: Windows Binaries Write Suspicious Extensions
description: Detects Windows executables that write files with suspicious extensions
severity: high
enabled: false
tags:
  mitre:
  - T1036
  categories:
  - endpoint
references:
- Internal Research
logsource:
  category: file_event
  product: windows
detection:
  selection_generic:
    Image|endswith:
    - \csrss.exe
    - \lsass.exe
    - \RuntimeBroker.exe
    - \sihost.exe
    - \smss.exe
    - \wininit.exe
    - \winlogon.exe
    TargetFilename|endswith:
    - .bat
    - .dll
    - .exe
    - .hta
    - .iso
    - .ps1
    - .txt
    - .vbe
    - .vbs
  selection_special:
    Image|endswith:
    - \dllhost.exe
    - \rundll32.exe
    - \svchost.exe
    TargetFilename|endswith:
    - .bat
    - .hta
    - .iso
    - .ps1
    - .vbe
    - .vbs
  filter_main_AppLockerPolicyTest:
    Image: C:\Windows\System32\dllhost.exe
    TargetFilename|contains|all:
    - :\Users\
    - \AppData\Local\Temp\__PSScriptPolicyTest_
    TargetFilename|endswith: .ps1
  filter_main_script_gpo_machine:
    Image: C:\Windows\system32\svchost.exe
    TargetFilename|contains|all:
    - C:\Windows\System32\GroupPolicy\DataStore\
    - \sysvol\
    - \Policies\
    - \Machine\Scripts\Startup\
    TargetFilename|endswith:
    - .ps1
    - .bat
  filter_main_clipchamp:
    Image: C:\Windows\system32\svchost.exe
    TargetFilename|contains|all:
    - C:\Program Files\WindowsApps\Clipchamp
    - .ps1
  filter_main_powershell_preview:
    Image:
    - C:\Windows\system32\svchost.exe
    - C:\Windows\SysWOW64\svchost.exe
    TargetFilename|startswith:
    - C:\Program Files\WindowsApps\Microsoft.PowerShellPreview
    - C:\Program Files (x86)\WindowsApps\Microsoft.PowerShellPreview
    TargetFilename|endswith: .ps1
  condition: 1 of selection_* and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: b8fd0e93-ff58-4cbd-8f48-1c114e342e62
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_shell_write_susp_files_extensions.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
