id: sigmahq-sigma-1ac14d38-3dfc-4635-92c7-e3fd1c5f5bfc
name: Winrar Compressing Dump Files
description: Detects execution of WinRAR in order to compress a file with a ".dmp"/".dump"
  extension, which could be a step in a process of dump file exfiltration.
severity: medium
enabled: false
tags:
  mitre:
  - T1560.001
  categories:
  - endpoint
references:
- https://www.crowdstrike.com/blog/overwatch-exposes-aquatic-panda-in-possession-of-log-4-shell-exploit-tools/
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - \rar.exe
    - \winrar.exe
  - Description: Command line RAR
  selection_extension:
    CommandLine|contains:
    - .dmp
    - .dump
    - .hdmp
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 1ac14d38-3dfc-4635-92c7-e3fd1c5f5bfc
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_winrar_exfil_dmp_files.yml
falsepositives:
- Legitimate use of WinRAR with a command line in which ".dmp" or ".dump" appears
  accidentally
- Legitimate use of WinRAR to compress WER ".dmp" files for troubleshooting
notes:
  quarantine_reason: 'upstream status: test'
