id: sigmahq-sigma-74a2b37d-fea4-41e0-9ac7-c9fbcf1f60cc
name: WinRAR Creating Files in Startup Locations
description: 'Detects WinRAR creating files in Windows startup locations, which may
  indicate an attempt to establish persistence by adding malicious files to the Startup
  folder.

  This kind of behaviour has been associated with exploitation of WinRAR path traversal
  vulnerability CVE-2025-6218 or CVE-2025-8088.'
severity: high
enabled: false
tags:
  mitre:
  - T1547.001
  categories:
  - endpoint
references:
- https://github.com/mulwareX/CVE-2025-6218-POC
- https://x.com/0x534c/status/1944694507787710685
- https://www.welivesecurity.com/en/eset-research/update-winrar-tools-now-romcom-and-others-exploiting-zero-day-vulnerability/
logsource:
  category: file_event
  product: windows
detection:
  selection:
    Image|endswith:
    - \WinRAR.exe
    - \Rar.exe
    TargetFilename|contains: \Start Menu\Programs\Startup\
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 74a2b37d-fea4-41e0-9ac7-c9fbcf1f60cc
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/file/file_event/file_event_win_winrar_file_creation_in_startup_folder.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: experimental'
