id: sigmahq-sigma-f033f3f3-fd24-4995-97d8-a3bb17550a88
name: WMI Persistence - Security
description: Detects suspicious WMI event filter and command line event consumer based
  on WMI and Security Logs.
severity: medium
enabled: false
tags:
  mitre:
  - T1546.003
  categories:
  - endpoint
references:
- https://twitter.com/mattifestation/status/899646620148539397
- https://www.eideon.com/2018-03-02-THL03-WMIBackdoors/
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4662
    ObjectType: WMI Namespace
    ObjectName|contains: subscription
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: f033f3f3-fd24-4995-97d8-a3bb17550a88
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/security/win_security_wmi_persistence.yml
falsepositives:
- Unknown (data set is too small; further testing needed)
notes:
  quarantine_reason: 'upstream status: test'
