id: sigmahq-sigma-493fb4ab-cdcc-4c4f-818c-0e363bd1e4bb
name: WMI Event Consumer Created Named Pipe
description: Detects the WMI Event Consumer service scrcons.exe creating a named pipe
severity: medium
enabled: false
tags:
  mitre:
  - T1047
  categories:
  - endpoint
references:
- https://github.com/RiccardoAncarani/LiquidSnake
logsource:
  product: windows
  category: pipe_created
  definition: Note that you have to configure logging for Named Pipe Events in Sysmon
    config (Event ID 17 and Event ID 18). The basic configuration is in popular sysmon
    configuration (https://github.com/SwiftOnSecurity/sysmon-config), but it is worth
    verifying. You can also use other repo, e.g. https://github.com/Neo23x0/sysmon-config,
    https://github.com/olafhartong/sysmon-modular. How to test detection? You can
    check powershell script from this site https://svch0st.medium.com/guide-to-named-pipes-and-hunting-for-cobalt-strike-pipes-dc46b2c5f575
detection:
  selection:
    Image|endswith: \scrcons.exe
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 493fb4ab-cdcc-4c4f-818c-0e363bd1e4bb
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/pipe_created/pipe_created_scrcons_wmi_consumer_namedpipe.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
