id: sigmahq-sigma-0f06a3a5-6a09-413f-8743-e6cf35561297
name: WMI Event Subscription
description: Detects creation of WMI event subscription persistence method
severity: medium
enabled: false
tags:
  mitre:
  - T1546.003
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/sysinternals/downloads/sysmon#event-id-19-wmievent-wmieventfilter-activity-detected
- https://learn.microsoft.com/en-us/sysinternals/downloads/sysmon#event-id-20-wmievent-wmieventconsumer-activity-detected
- https://learn.microsoft.com/en-us/sysinternals/downloads/sysmon#event-id-21-wmievent-wmieventconsumertofilter-activity-detected
logsource:
  product: windows
  category: wmi_event
detection:
  selection:
    EventID:
    - 19
    - 20
    - 21
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 0f06a3a5-6a09-413f-8743-e6cf35561297
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/wmi_event/sysmon_wmi_event_subscription.yml
falsepositives:
- Exclude legitimate (vetted) use of WMI event subscription in your network
notes:
  quarantine_reason: 'upstream status: test'
