id: sigmahq-sigma-0b7889b4-5577-4521-a60a-3376ee7f9f7b
name: WMI Persistence
description: Detects suspicious WMI event filter and command line event consumer based
  on WMI and Security Logs.
severity: medium
enabled: false
tags:
  mitre:
  - T1546.003
  categories:
  - endpoint
references:
- https://twitter.com/mattifestation/status/899646620148539397
- https://www.eideon.com/2018-03-02-THL03-WMIBackdoors/
logsource:
  product: windows
  service: wmi
  definition: WMI Namespaces Auditing and SACL should be configured, EventID 5861
    and 5859 detection requires Windows 10, 2012 and higher
detection:
  wmi_filter_to_consumer_binding:
    EventID: 5861
  consumer_keywords:
  - ActiveScriptEventConsumer
  - CommandLineEventConsumer
  - CommandLineTemplate
  wmi_filter_registration:
    EventID: 5859
  filter_scmevent:
    Provider: SCM Event Provider
    Query: select * from MSFT_SCMEventLogEvent
    User: S-1-5-32-544
    PossibleCause: Permanent
  condition: ( (wmi_filter_to_consumer_binding and consumer_keywords) or (wmi_filter_registration)
    ) and not filter_scmevent
provenance:
  source: SigmaHQ/sigma
  source_id: 0b7889b4-5577-4521-a60a-3376ee7f9f7b
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/wmi/win_wmi_persistence.yml
falsepositives:
- Unknown (data set is too small; further testing needed)
notes:
  quarantine_reason: 'upstream status: test'
