id: sigmahq-sigma-797011dc-44f4-4e6f-9f10-a8ceefbe566b
name: WMI Backdoor Exchange Transport Agent
description: Detects a WMI backdoor in Exchange Transport Agents via WMI event filters
severity: critical
enabled: false
tags:
  mitre:
  - T1546.003
  categories:
  - endpoint
references:
- https://twitter.com/cglyer/status/1182389676876980224
- https://twitter.com/cglyer/status/1182391019633029120
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage|endswith: \EdgeTransport.exe
  filter_conhost:
    Image: C:\Windows\System32\conhost.exe
  filter_oleconverter:
    Image|startswith: C:\Program Files\Microsoft\Exchange Server\
    Image|endswith: \Bin\OleConverter.exe
  condition: selection and not 1 of filter_*
provenance:
  source: SigmaHQ/sigma
  source_id: 797011dc-44f4-4e6f-9f10-a8ceefbe566b
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_wmi_backdoor_exchange_transport_agent.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
