id: sigmahq-sigma-ec1d5e28-8f3b-4188-a6f8-6e8df81dc28e
name: WMI Persistence - Script Event Consumer
description: Detects WMI script event consumers
severity: medium
enabled: false
tags:
  mitre:
  - T1546.003
  categories:
  - endpoint
references:
- https://www.eideon.com/2018-03-02-THL03-WMIBackdoors/
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image: C:\WINDOWS\system32\wbem\scrcons.exe
    ParentImage: C:\Windows\System32\svchost.exe
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: ec1d5e28-8f3b-4188-a6f8-6e8df81dc28e
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_wmi_persistence_script_event_consumer.yml
falsepositives:
- Legitimate event consumers
- Dell computers on some versions register an event consumer that is known to cause
  false positives when brightness is changed by the corresponding keyboard button
notes:
  quarantine_reason: 'upstream status: test'
