id: sigmahq-sigma-09658312-bc27-4a3b-91c5-e49ab9046d1b
name: WMIC Unquoted Services Path Lookup - PowerShell
description: Detects known WMI recon method to look for unquoted service paths, often
  used by pentest inside of powershell scripts attackers enum scripts
severity: medium
enabled: false
tags:
  mitre:
  - T1047
  categories:
  - endpoint
references:
- https://github.com/nccgroup/redsnarf/blob/35949b30106ae543dc6f2bc3f1be10c6d9a8d40e/redsnarf.py
- https://github.com/S3cur3Th1sSh1t/Creds/blob/eac23d67f7f90c7fc8e3130587d86158c22aa398/PowershellScripts/jaws-enum.ps1
- https://www.absolomb.com/2018-01-26-Windows-Privilege-Escalation-Guide/
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection:
    ScriptBlockText|contains:
    - 'Get-WmiObject '
    - 'gwmi '
    ScriptBlockText|contains|all:
    - ' Win32_Service '
    - Name
    - DisplayName
    - PathName
    - StartMode
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 09658312-bc27-4a3b-91c5-e49ab9046d1b
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_wmi_unquoted_service_search.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
