id: sigmahq-sigma-8028c2c3-e25a-46e3-827f-bbb5abf181d7
name: WMImplant Hack Tool
description: Detects parameters used by WMImplant
severity: high
enabled: false
tags:
  mitre:
  - T1047
  - T1059.001
  categories:
  - endpoint
references:
- https://github.com/FortyNorthSecurity/WMImplant
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection:
    ScriptBlockText|contains:
    - WMImplant
    - ' change_user '
    - ' gen_cli '
    - ' command_exec '
    - ' disable_wdigest '
    - ' disable_winrm '
    - ' enable_wdigest '
    - ' enable_winrm '
    - ' registry_mod '
    - ' remote_posh '
    - ' sched_job '
    - ' service_mod '
    - ' process_kill '
    - ' active_users '
    - ' basic_info '
    - ' power_off '
    - ' vacant_system '
    - ' logon_events '
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 8028c2c3-e25a-46e3-827f-bbb5abf181d7
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_script/posh_ps_wmimplant.yml
falsepositives:
- Administrative scripts that use the same keywords.
notes:
  quarantine_reason: 'upstream status: test'
