id: sigmahq-sigma-480421f9-417f-4d3b-9552-fd2728443ec8
name: Wow6432Node Windows NT CurrentVersion Autorun Keys Modification
description: Detects modification of autostart extensibility point (ASEP) in registry.
severity: medium
enabled: false
tags:
  mitre:
  - T1547.001
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1547.001/T1547.001.md
- https://learn.microsoft.com/en-us/sysinternals/downloads/autoruns
- https://gist.github.com/GlebSukhodolskiy/0fc5fa5f482903064b448890db1eaf9d
logsource:
  category: registry_set
  product: windows
detection:
  selection_wow_nt_current_version_base:
    TargetObject|contains: \SOFTWARE\Wow6432Node\Microsoft\Windows NT\CurrentVersion
  selection_wow_nt_current_version:
    TargetObject|contains:
    - \Windows\Appinit_Dlls
    - \Image File Execution Options
    - \Drivers32
  filter_main_empty:
    Details: (Empty)
  filter_main_null:
    Details: null
  filter_main_file_exec_options:
    Details|endswith: \Microsoft\Windows NT\CurrentVersion\Image File Execution Options
  condition: all of selection_* and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: 480421f9-417f-4d3b-9552-fd2728443ec8
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/registry/registry_set/registry_set_asep_reg_keys_modification_wow6432node_currentversion.yml
falsepositives:
- Legitimate software automatically (mostly, during installation) sets up autorun
  keys for legitimate reason
- Legitimate administrator sets up autorun keys for legitimate reason
notes:
  quarantine_reason: 'upstream status: test'
