id: sigmahq-sigma-75f7a0e2-7154-4c4d-9eae-5cdb4e0a5c13
name: Write Protect For Storage Disabled
description: 'Detects applications trying to modify the registry in order to disable
  any write-protect property for storage devices.

  This could be a precursor to a ransomware attack and has been an observed technique
  used by cypherpunk group.'
severity: medium
enabled: false
tags:
  mitre:
  - T1685
  categories:
  - endpoint
references:
- https://www.manageengine.com/products/desktop-central/os-imaging-deployment/media-is-write-protected.html
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    CommandLine|contains|all:
    - \System\CurrentControlSet\Control
    - Write Protection
    - '0'
    - storage
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 75f7a0e2-7154-4c4d-9eae-5cdb4e0a5c13
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_reg_write_protect_for_storage_disabled.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
