id: sigmahq-sigma-ae9b0bd7-8888-4606-b444-0ed7410cb728
name: Writing Of Malicious Files To The Fonts Folder
description: Monitors for the hiding possible malicious files in the C:\Windows\Fonts\
  location. This folder doesn't require admin privillege to be written and executed
  from.
severity: medium
enabled: false
tags:
  mitre:
  - T1211
  - T1059
  categories:
  - endpoint
references:
- https://thedfirreport.com/2020/04/20/sqlserver-or-the-miner-in-the-basement/
logsource:
  product: windows
  category: process_creation
detection:
  selection_1:
    CommandLine|contains:
    - echo
    - copy
    - type
    - file createnew
    - cacls
  selection_2:
    CommandLine|contains: C:\Windows\Fonts\
  selection_3:
    CommandLine|contains:
    - .sh
    - .exe
    - .dll
    - .bin
    - .bat
    - .cmd
    - .js
    - .msh
    - .reg
    - .scr
    - .ps
    - .vb
    - .jar
    - .pl
    - '.inf'
    - .cpl
    - .hta
    - .msi
    - .vbs
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: ae9b0bd7-8888-4606-b444-0ed7410cb728
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_susp_hiding_malware_in_fonts_folder.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
