id: sigmahq-sigma-ef64fc9c-a45e-43cc-8fd8-7d75d73b4c99
name: Wusa.EXE Executed By Parent Process Located In Suspicious Location
description: 'Detects execution of the "wusa.exe" (Windows Update Standalone Installer)
  utility by a parent process that is located in a suspicious location.

  Attackers could instantiate an instance of "wusa.exe" in order to bypass User Account
  Control (UAC). They can duplicate the access token from "wusa.exe" to gain elevated
  privileges.'
severity: high
enabled: false
tags:
  mitre: []
  categories:
  - endpoint
references:
- https://www.fortinet.com/blog/threat-research/konni-campaign-distributed-via-malicious-document
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
    Image|endswith: \wusa.exe
  selection_paths_1:
    ParentImage|contains:
    - :\Perflogs\
    - :\Users\Public\
    - :\Windows\Temp\
    - \Appdata\Local\Temp\
    - \Temporary Internet
  selection_paths_2:
  - ParentImage|contains|all:
    - :\Users\
    - \Favorites\
  - ParentImage|contains|all:
    - :\Users\
    - \Favourites\
  - ParentImage|contains|all:
    - :\Users\
    - \Contacts\
  - ParentImage|contains|all:
    - :\Users\
    - \Pictures\
  filter_main_msu:
    CommandLine|contains: .msu
  condition: selection_img and 1 of selection_paths_* and not 1 of filter_main_*
provenance:
  source: SigmaHQ/sigma
  source_id: ef64fc9c-a45e-43cc-8fd8-7d75d73b4c99
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_wusa_susp_parent_execution.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
