id: sigmahq-sigma-71ff406e-b633-4989-96ec-bc49d825a412
name: Zip A Folder With PowerShell For Staging In Temp - PowerShell
description: 'Detects PowerShell scripts that make use of the "Compress-Archive" Cmdlet
  in order to compress folders and files where the output is stored in a potentially
  suspicious location that is used often by malware for exfiltration.

  An adversary might compress data (e.g., sensitive documents) that is collected prior
  to exfiltration in order to make it portable and minimize the amount of data sent
  over the network.'
severity: medium
enabled: false
tags:
  mitre:
  - T1074.001
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1074.001/T1074.001.md
- https://www.cisa.gov/news-events/cybersecurity-advisories/aa23-347a
logsource:
  product: windows
  service: powershell-classic
detection:
  selection:
    Data|contains:
    - Compress-Archive -Path*-DestinationPath $env:TEMP
    - Compress-Archive -Path*-DestinationPath*\AppData\Local\Temp\
    - Compress-Archive -Path*-DestinationPath*:\Windows\Temp\
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 71ff406e-b633-4989-96ec-bc49d825a412
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/powershell/powershell_classic/posh_pc_susp_zip_compress.yml
falsepositives:
- Unknown
notes:
  quarantine_reason: 'upstream status: test'
