id: sigmahq-sigma-02c39d30-02b5-45d2-b435-8aebfe5a8629
name: A Member Was Removed From a Security-Enabled Global Group
description: Detects activity when a member is removed from a security-enabled global
  group
severity: low
enabled: true
tags:
  mitre:
  - T1098
  categories:
  - endpoint
references:
- https://www.cisecurity.org/controls/cis-controls-list/
- https://www.pcisecuritystandards.org/documents/PCI_DSS_v3-2-1.pdf
- https://nvlpubs.nist.gov/nistpubs/CSWP/NIST.CSWP.04162018.pdf
- https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventID=4729
- https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventID=633
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID:
    - 633
    - 4729
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 02c39d30-02b5-45d2-b435-8aebfe5a8629
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/security/account_management/win_security_member_removed_security_enabled_global_group.yml
falsepositives:
- Unknown
