id: sigmahq-sigma-78cc2dd2-7d20-4d32-93ff-057084c38b93
name: Antivirus Password Dumper Detection
description: 'Detects a highly relevant Antivirus alert that reports a password dumper.

  This event must not be ignored just because the AV has blocked the malware but investigate,
  how it came there in the first place.'
severity: critical
enabled: true
tags:
  mitre:
  - T1003
  - T1558
  - T1003.001
  - T1003.002
  categories:
  - endpoint
references:
- https://www.nextron-systems.com/?s=antivirus
- https://www.virustotal.com/gui/file/5fcda49ee7f202559a6cbbb34edb65c33c9a1e0bde9fa2af06a6f11b55ded619
- https://www.virustotal.com/gui/file/a4edfbd42595d5bddb442c82a02cf0aaa10893c1bf79ea08b9ce576f82749448
logsource:
  category: antivirus
detection:
  selection:
  - Signature|startswith: PWS
  - Signature|contains:
    - Certify
    - DCSync
    - DumpCreds
    - DumpLsass
    - DumpPert
    - HTool/WCE
    - Kekeo
    - Lazagne
    - LsassDump
    - Mimikatz
    - MultiDump
    - Nanodump
    - NativeDump
    - Outflank
    - PShlSpy
    - PSWTool
    - PWCrack
    - PWDump
    - PWS.
    - PWSX
    - pypykatz
    - Rubeus
    - SafetyKatz
    - SecurityTool
    - SharpChrome
    - SharpDPAPI
    - SharpDump
    - SharpKatz
    - SharpS.
    - ShpKatz
    - TrickDump
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 78cc2dd2-7d20-4d32-93ff-057084c38b93
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/category/antivirus/av_password_dumper.yml
falsepositives:
- Unlikely
