id: sigmahq-sigma-fa0c05b6-8ad3-468d-8231-c1cbccb64fba
name: Antivirus Hacktool Detection
description: 'Detects a highly relevant Antivirus alert that reports a hack tool or
  other attack tool.

  This event must not be ignored just because the AV has blocked the malware but investigate,
  how it came there in the first place.'
severity: high
enabled: true
tags:
  mitre:
  - T1204
  categories:
  - endpoint
references:
- https://www.nextron-systems.com/2021/08/16/antivirus-event-analysis-cheat-sheet-v1-8-2/
- https://www.nextron-systems.com/?s=antivirus
logsource:
  category: antivirus
detection:
  selection:
  - Signature|startswith:
    - ATK/
    - Exploit.Script.CVE
    - HKTL
    - HTOOL
    - PWS.
    - PWSX
    - SecurityTool
  - Signature|contains:
    - Adfind
    - Brutel
    - BruteR
    - Cobalt
    - COBEACON
    - Cometer
    - DumpCreds
    - FastReverseProxy
    - Hacktool
    - Havoc
    - Impacket
    - Keylogger
    - Koadic
    - Mimikatz
    - Nighthawk
    - PentestPowerShell
    - Potato
    - PowerSploit
    - PowerSSH
    - PshlSpy
    - PSWTool
    - PWCrack
    - PWDump
    - Rozena
    - Rusthound
    - Sbelt
    - Seatbelt
    - SecurityTool
    - SharpDump
    - SharpHound
    - Shellcode
    - Sliver
    - Snaffler
    - SOAPHound
    - Splinter
    - Swrort
    - TurtleLoader
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: fa0c05b6-8ad3-468d-8231-c1cbccb64fba
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/category/antivirus/av_hacktool.yml
falsepositives:
- Unlikely
