id: sigmahq-sigma-1444443e-6757-43e4-9ea4-c8fc705f79a2
name: Boot Configuration Tampering Via Bcdedit.EXE
description: Detects the use of the bcdedit command to tamper with the boot configuration
  data. This technique is often times used by malware or attackers as a destructive
  way before launching ransomware.
severity: high
enabled: true
tags:
  mitre:
  - T1490
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1490/T1490.md
- https://eqllib.readthedocs.io/en/latest/analytics/c4732632-9c1d-4980-9fa8-1d98c93f918e.html
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \bcdedit.exe
  - OriginalFileName: bcdedit.exe
  selection_set:
    CommandLine|contains: set
  selection_cli:
  - CommandLine|contains|all:
    - bootstatuspolicy
    - ignoreallfailures
  - CommandLine|contains|all:
    - recoveryenabled
    - 'no'
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: 1444443e-6757-43e4-9ea4-c8fc705f79a2
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_bcdedit_boot_conf_tamper.yml
falsepositives:
- Unlikely
