id: sigmahq-sigma-3b4b232a-af90-427c-a22f-30b0c0837b95
name: CMSTP Execution Process Access
description: Detects various indicators of Microsoft Connection Manager Profile Installer
  execution
severity: high
enabled: true
tags:
  mitre:
  - T1218.003
  - T1559.001
  categories:
  - endpoint
references:
- https://web.archive.org/web/20190720093911/http://www.endurant.io/cmstp/detecting-cmstp-enabled-code-execution-and-uac-bypass-with-sysmon/
logsource:
  product: windows
  category: process_access
detection:
  selection:
    CallTrace|contains: cmlua.dll
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 3b4b232a-af90-427c-a22f-30b0c0837b95
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_access/proc_access_win_cmstp_execution_by_access.yml
falsepositives:
- Legitimate CMSTP use (unlikely in modern enterprise environments)
