id: sigmahq-sigma-f8be3e82-46a3-4e4e-ada5-8e538ae8b9c9
name: Credential Dumping Activity By Python Based Tool
description: Detects LSASS process access for potential credential dumping by a Python-like
  tool such as LaZagne or Pypykatz.
severity: high
enabled: true
tags:
  mitre:
  - T1003.001
  categories:
  - endpoint
references:
- https://twitter.com/bh4b3sh/status/1303674603819081728
- https://github.com/skelsec/pypykatz
logsource:
  category: process_access
  product: windows
detection:
  selection:
    TargetImage|endswith: \lsass.exe
    CallTrace|contains|all:
    - _ctypes.pyd+
    - :\Windows\System32\KERNELBASE.dll+
    - :\Windows\SYSTEM32\ntdll.dll+
    CallTrace|contains:
    - python27.dll+
    - python3*.dll+
    GrantedAccess: '0x1FFFFF'
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: f8be3e82-46a3-4e4e-ada5-8e538ae8b9c9
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_access/proc_access_win_lsass_python_based_tool.yml
falsepositives:
- Unknown
