id: sigmahq-sigma-add64136-62e5-48ea-807e-88638d02df1e
name: Fsutil Suspicious Invocation
description: 'Detects suspicious parameters of fsutil (deleting USN journal, configuring
  it with small size, etc).

  Might be used by ransomwares during the attack (seen by NotPetya and others).'
severity: high
enabled: true
tags:
  mitre:
  - T1070
  - T1485
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/fsutil-usn
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1070/T1070.md
- https://eqllib.readthedocs.io/en/latest/analytics/c91f422a-5214-4b17-8664-c5fcf115c0a2.html
- https://github.com/albertzsigovits/malware-notes/blob/558898932c1579ff589290092a2c8febefc3a4c9/Ransomware/Lockbit.md
- https://blog.cluster25.duskrise.com/2023/05/22/back-in-black-blackbyte-nt
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \fsutil.exe
  - OriginalFileName: fsutil.exe
  selection_cli:
    CommandLine|contains:
    - deletejournal
    - createjournal
    - setZeroData
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: add64136-62e5-48ea-807e-88638d02df1e
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_fsutil_usage.yml
falsepositives:
- Admin activity
- Scripts and administrative tools used in the monitored environment
