id: sigmahq-sigma-3268b746-88d8-4cd3-bffc-30077d02c787
name: HackTool - Empire PowerShell UAC Bypass
description: Detects some Empire PowerShell UAC bypass methods
severity: critical
enabled: true
tags:
  mitre:
  - T1548.002
  categories:
  - endpoint
references:
- https://github.com/EmpireProject/Empire/blob/e37fb2eef8ff8f5a0a689f1589f424906fe13055/data/module_source/privesc/Invoke-EventVwrBypass.ps1#L64
- https://github.com/EmpireProject/Empire/blob/e37fb2eef8ff8f5a0a689f1589f424906fe13055/data/module_source/privesc/Invoke-FodHelperBypass.ps1#L64
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains:
    - ' -NoP -NonI -w Hidden -c $x=$((gp HKCU:Software\Microsoft\Windows Update).Update)'
    - ' -NoP -NonI -c $x=$((gp HKCU:Software\Microsoft\Windows Update).Update);'
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 3268b746-88d8-4cd3-bffc-30077d02c787
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_hktl_empire_powershell_uac_bypass.yml
falsepositives:
- Unknown
