id: sigmahq-sigma-7ec2c172-dceb-4c10-92c9-87c1881b7e18
name: HackTool - Rubeus Execution
description: Detects the execution of the hacktool Rubeus via PE information of command
  line parameters
severity: critical
enabled: true
tags:
  mitre:
  - T1003
  - T1558.003
  - T1550.003
  categories:
  - endpoint
references:
- https://blog.harmj0y.net/redteaming/from-kekeo-to-rubeus
- https://m0chan.github.io/2019/07/31/How-To-Attack-Kerberos-101.html
- https://github.com/GhostPack/Rubeus
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Image|endswith: \Rubeus.exe
  - OriginalFileName: Rubeus.exe
  - Description: Rubeus
  - CommandLine|contains:
    - 'asreproast '
    - 'dump /service:krbtgt '
    - dump /luid:0x
    - 'kerberoast '
    - 'createnetonly /program:'
    - 'ptt /ticket:'
    - '/impersonateuser:'
    - 'renew /ticket:'
    - 'asktgt /user:'
    - 'harvest /interval:'
    - 's4u /user:'
    - 's4u /ticket:'
    - 'hash /password:'
    - 'golden /aes256:'
    - 'silver /user:'
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 7ec2c172-dceb-4c10-92c9-87c1881b7e18
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_hktl_rubeus.yml
falsepositives:
- Unlikely
