id: sigmahq-sigma-058f4380-962d-40a5-afce-50207d36d7e2
name: HackTool - CrackMapExec Execution Patterns
description: Detects various execution patterns of the CrackMapExec pentesting framework
severity: high
enabled: true
tags:
  mitre:
  - T1047
  - T1053
  - T1059.003
  - T1059.001
  categories:
  - endpoint
references:
- https://github.com/byt3bl33d3r/CrackMapExec
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains:
    - cmd.exe /Q /c * 1> \\\\*\\*\\* 2>&1
    - cmd.exe /C * > \\\\*\\*\\* 2>&1
    - cmd.exe /C * > *\\Temp\\* 2>&1
    - powershell.exe -exec bypass -noni -nop -w 1 -C "
    - 'powershell.exe -noni -nop -w 1 -enc '
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 058f4380-962d-40a5-afce-50207d36d7e2
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_hktl_crackmapexec_execution_patterns.yml
falsepositives:
- Unknown
