id: sigmahq-sigma-49e5bc24-8b86-49f1-b743-535f332c2856
name: Microsoft Defender Tamper Protection Trigger
description: Detects blocked attempts to change any of Defender's settings such as
  "Real Time Monitoring" and "Behavior Monitoring"
severity: high
enabled: true
tags:
  mitre:
  - T1685
  categories:
  - endpoint
references:
- https://bhabeshraj.com/post/tampering-with-microsoft-defenders-tamper-protection
- https://learn.microsoft.com/en-us/defender-endpoint/troubleshoot-microsoft-defender-antivirus?view=o365-worldwide
logsource:
  product: windows
  service: windefend
detection:
  selection:
    EventID: 5013
    Value|endswith:
    - \Windows Defender\DisableAntiSpyware
    - \Windows Defender\DisableAntiVirus
    - \Windows Defender\Scan\DisableArchiveScanning
    - \Windows Defender\Scan\DisableScanningNetworkFiles
    - \Real-Time Protection\DisableRealtimeMonitoring
    - \Real-Time Protection\DisableBehaviorMonitoring
    - \Real-Time Protection\DisableIOAVProtection
    - \Real-Time Protection\DisableScriptScanning
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 49e5bc24-8b86-49f1-b743-535f332c2856
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/windefend/win_defender_tamper_protection_trigger.yml
falsepositives:
- Administrator might try to disable defender features during testing (must be investigated)
