id: sigmahq-sigma-f239b326-2f41-4d6b-9dfa-c846a60ef505
name: Password Dumper Remote Thread in LSASS
description: 'Detects password dumper activity by monitoring remote thread creation
  EventID 8 in combination with the lsass.exe process as TargetImage.

  The process in field Process is the malicious program. A single execution can lead
  to hundreds of events.'
severity: high
enabled: true
tags:
  mitre:
  - T1003.001
  categories:
  - endpoint
references:
- https://jpcertcc.github.io/ToolAnalysisResultSheet/details/WCE.htm
logsource:
  product: windows
  category: create_remote_thread
detection:
  selection:
    TargetImage|endswith: \lsass.exe
    StartModule: ''
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: f239b326-2f41-4d6b-9dfa-c846a60ef505
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/create_remote_thread/create_remote_thread_win_susp_password_dumper_lsass.yml
falsepositives:
- Antivirus products
