id: sigmahq-sigma-ca94a6db-8106-4737-9ed2-3e3bb826af0a
name: Password Policy Discovery - Linux
description: Detects password policy discovery commands
severity: low
enabled: true
tags:
  mitre:
  - T1201
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1201/T1201.md
- https://linux.die.net/man/1/chage
- https://man7.org/linux/man-pages/man1/passwd.1.html
- https://superuser.com/questions/150675/how-to-display-password-policy-information-for-a-user-ubuntu
logsource:
  product: linux
  service: auditd
detection:
  selection_files:
    type: PATH
    name:
    - /etc/login.defs
    - /etc/pam.d/auth
    - /etc/pam.d/common-account
    - /etc/pam.d/common-auth
    - /etc/pam.d/common-password
    - /etc/pam.d/system-auth
    - /etc/security/pwquality.conf
  selection_chage:
    type: EXECVE
    a0: chage
    a1:
    - --list
    - -l
  selection_passwd:
    type: EXECVE
    a0: passwd
    a1:
    - -S
    - --status
  condition: 1 of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: ca94a6db-8106-4737-9ed2-3e3bb826af0a
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/auditd/lnx_auditd_password_policy_discovery.yml
falsepositives:
- Legitimate administration activities
