id: sigmahq-sigma-53ad8e36-f573-46bf-97e4-15ba5bf4bb51
name: Password Change on Directory Service Restore Mode (DSRM) Account
description: 'Detects potential attempts made to set the Directory Services Restore
  Mode administrator password.

  The Directory Service Restore Mode (DSRM) account is a local administrator account
  on Domain Controllers.

  Attackers may change the password in order to obtain persistence.'
severity: high
enabled: true
tags:
  mitre:
  - T1098
  categories:
  - endpoint
references:
- https://adsecurity.org/?p=1714
- https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-10/security/threat-protection/auditing/event-4794
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4794
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 53ad8e36-f573-46bf-97e4-15ba5bf4bb51
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/security/win_security_susp_dsrm_password_change.yml
falsepositives:
- Initial installation of a domain controller.
