id: sigmahq-sigma-8eef149c-bd26-49f2-9e5a-9b00e3af499b
name: Pass the Hash Activity 2
description: Detects the attack technique pass the hash which is used to move laterally
  inside the network
severity: medium
enabled: true
tags:
  mitre:
  - T1550.002
  categories:
  - endpoint
references:
- https://github.com/iadgov/Event-Forwarding-Guidance/tree/master/Events
- https://web.archive.org/web/20170909091934/https://blog.binarydefense.com/reliably-detecting-pass-the-hash-through-event-log-analysis
- https://blog.stealthbits.com/how-to-detect-pass-the-hash-attacks/
logsource:
  product: windows
  service: security
  definition: The successful use of PtH for lateral movement between workstations
    would trigger event ID 4624
detection:
  selection_logon3:
    EventID: 4624
    SubjectUserSid: S-1-0-0
    LogonType: 3
    LogonProcessName: NtLmSsp
    KeyLength: 0
  selection_logon9:
    EventID: 4624
    LogonType: 9
    LogonProcessName: seclogo
  filter:
    TargetUserName: ANONYMOUS LOGON
  condition: 1 of selection_* and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: 8eef149c-bd26-49f2-9e5a-9b00e3af499b
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/security/account_management/win_security_pass_the_hash_2.yml
falsepositives:
- Administrator activity
