id: sigmahq-sigma-edc2f8ae-2412-4dfd-b9d5-0c57727e70be
name: Potential Powershell ReverseShell Connection
description: Detects usage of the "TcpClient" class. Which can be abused to establish
  remote connections and reverse-shells. As seen used by the Nishang "Invoke-PowerShellTcpOneLine"
  reverse shell and other.
severity: high
enabled: true
tags:
  mitre:
  - T1059.001
  categories:
  - endpoint
references:
- https://www.volexity.com/blog/2021/03/02/active-exploitation-of-microsoft-exchange-zero-day-vulnerabilities/
- https://www.microsoft.com/security/blog/2021/03/02/hafnium-targeting-exchange-servers/
- https://github.com/samratashok/nishang/blob/414ee1104526d7057f9adaeee196d91ae447283e/Shells/Invoke-PowerShellTcpOneLine.ps1
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - OriginalFileName:
    - PowerShell.EXE
    - pwsh.dll
  - Image|endswith:
    - \powershell.exe
    - \pwsh.exe
  selection_cli:
    CommandLine|contains|all:
    - ' Net.Sockets.TCPClient'
    - .GetStream(
    - .Write(
  condition: all of selection_*
provenance:
  source: SigmaHQ/sigma
  source_id: edc2f8ae-2412-4dfd-b9d5-0c57727e70be
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_powershell_reverse_shell_connection.yml
falsepositives:
- In rare administrative cases, this function might be used to check network connectivity
