id: sigmahq-sigma-66c3b204-9f88-4d0a-a7f7-8a57d521ca55
name: Potential Crypto Mining Activity
description: Detects command line parameters or strings often used by crypto miners
severity: high
enabled: true
tags:
  mitre:
  - T1496
  categories:
  - endpoint
references:
- https://www.poolwatch.io/coin/monero
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains:
    - ' --cpu-priority='
    - --donate-level=0
    - ' -o pool.'
    - ' --nicehash'
    - ' --algo=rx/0 '
    - stratum+tcp://
    - stratum+udp://
    - LS1kb25hdGUtbGV2ZWw9
    - 0tZG9uYXRlLWxldmVsP
    - tLWRvbmF0ZS1sZXZlbD
    - c3RyYXR1bSt0Y3A6Ly
    - N0cmF0dW0rdGNwOi8v
    - zdHJhdHVtK3RjcDovL
    - c3RyYXR1bSt1ZHA6Ly
    - N0cmF0dW0rdWRwOi8v
    - zdHJhdHVtK3VkcDovL
  filter:
    CommandLine|contains:
    - ' pool.c '
    - ' pool.o '
    - gcc -
  condition: selection and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: 66c3b204-9f88-4d0a-a7f7-8a57d521ca55
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_susp_crypto_mining_monero.yml
falsepositives:
- Legitimate use of crypto miners
- Some build frameworks
