id: sigmahq-sigma-7a14080d-a048-4de8-ae58-604ce58a795b
name: Remote File Copy
description: Detects the use of tools that copy files from or to remote systems
severity: low
enabled: true
tags:
  mitre:
  - T1105
  categories:
  - endpoint
references:
- https://www.cisa.gov/stopransomware/ransomware-guide
logsource:
  product: linux
detection:
  tools:
  - 'scp '
  - 'rsync '
  - 'sftp '
  filter:
  - '@'
  - ':'
  condition: tools and filter
provenance:
  source: SigmaHQ/sigma
  source_id: 7a14080d-a048-4de8-ae58-604ce58a795b
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/builtin/lnx_file_copy.yml
falsepositives:
- Legitimate administration activities
