id: sigmahq-sigma-0d2c3d4c-4b48-4ac3-8f23-ea845746bb1a
name: Ruby on Rails Framework Exceptions
description: Detects suspicious Ruby on Rails exceptions that could indicate exploitation
  attempts
severity: medium
enabled: true
tags:
  mitre:
  - T1190
  categories:
  - endpoint
references:
- http://edgeguides.rubyonrails.org/security.html
- http://guides.rubyonrails.org/action_controller_overview.html
- https://stackoverflow.com/questions/25892194/does-rails-come-with-a-not-authorized-exception
- https://github.com/rails/rails/blob/cd08e6bcc4cd8948fe01e0be1ea0c7ca60373a25/actionpack/lib/action_dispatch/middleware/exception_wrapper.rb
logsource:
  category: application
  product: ruby_on_rails
detection:
  keywords:
  - ActionController::InvalidAuthenticityToken
  - ActionController::InvalidCrossOriginRequest
  - ActionController::MethodNotAllowed
  - ActionController::BadRequest
  - ActionController::ParameterMissing
  condition: keywords
provenance:
  source: SigmaHQ/sigma
  source_id: 0d2c3d4c-4b48-4ac3-8f23-ea845746bb1a
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/application/ruby/appframework_ruby_on_rails_exceptions.yml
falsepositives:
- Application bugs
