id: sigmahq-sigma-d2d642d7-b393-43fe-bae4-e81ed5915c4b
name: Scheduled Task/Job At
description: 'Detects the use of at/atd which are utilities that are used to schedule
  tasks.

  They are often abused by adversaries to maintain persistence or to perform task
  scheduling for initial or recurring execution of malicious code'
severity: low
enabled: true
tags:
  mitre:
  - T1053.002
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1053.002/T1053.002.md
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    Image|endswith:
    - /at
    - /atd
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: d2d642d7-b393-43fe-bae4-e81ed5915c4b
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/process_creation/proc_creation_lnx_at_command.yml
falsepositives:
- Legitimate administration activities
