id: sigmahq-sigma-62510e69-616b-4078-b371-847da438cc03
name: Share And Session Enumeration Using Net.EXE
description: Detects attempts to enumerate file shares, printer shares and sessions
  using "net.exe" with the "view" flag.
severity: low
enabled: true
tags:
  mitre:
  - T1018
  categories:
  - endpoint
references:
- https://eqllib.readthedocs.io/en/latest/analytics/b8a94d2f-dc75-4630-9d73-1edc6bd26fff.html
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1018/T1018.md
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - \net.exe
    - \net1.exe
  - OriginalFileName:
    - net.exe
    - net1.exe
  selection_cli:
    CommandLine|contains: view
  filter:
    CommandLine|contains: \\\\
  condition: all of selection_* and not filter
provenance:
  source: SigmaHQ/sigma
  source_id: 62510e69-616b-4078-b371-847da438cc03
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_net_view_share_and_sessions_enum.yml
falsepositives:
- Legitimate use of net.exe utility by legitimate user
