id: sigmahq-sigma-b0524451-19af-4efa-a46f-562a977f792e
name: ShimCache Flush
description: Detects actions that clear the local ShimCache and remove forensic evidence
severity: high
enabled: true
tags:
  mitre:
  - T1112
  categories:
  - endpoint
references:
- https://medium.com/@blueteamops/shimcache-flush-89daff28d15e
logsource:
  category: process_creation
  product: windows
detection:
  selection1a:
    CommandLine|contains|all:
    - rundll32
    - apphelp.dll
  selection1b:
    CommandLine|contains:
    - ShimFlushCache
    - '#250'
  selection2a:
    CommandLine|contains|all:
    - rundll32
    - kernel32.dll
  selection2b:
    CommandLine|contains:
    - BaseFlushAppcompatCache
    - '#46'
  condition: ( selection1a and selection1b ) or ( selection2a and selection2b )
provenance:
  source: SigmaHQ/sigma
  source_id: b0524451-19af-4efa-a46f-562a977f792e
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_rundll32_susp_shimcache_flush.yml
falsepositives:
- Unknown
