id: sigmahq-sigma-42df45e7-e6e9-43b5-8f26-bec5b39cc239
name: System Information Discovery
description: Detects system information discovery commands
severity: low
enabled: true
tags:
  mitre:
  - T1082
  categories:
  - endpoint
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1082/T1082.md
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    Image|endswith:
    - /uname
    - /hostname
    - /uptime
    - /lspci
    - /dmidecode
    - /lscpu
    - /lsmod
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 42df45e7-e6e9-43b5-8f26-bec5b39cc239
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/linux/process_creation/proc_creation_lnx_system_info_discovery.yml
falsepositives:
- Legitimate administration activities
