id: sigmahq-sigma-360a1340-398a-46b6-8d06-99b905dc69d2
name: Windows Defender Grace Period Expired
description: Detects the expiration of the grace period of Windows Defender. This
  means protection against viruses, spyware, and other potentially unwanted software
  is disabled.
severity: high
enabled: true
tags:
  mitre:
  - T1685
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/defender-endpoint/troubleshoot-microsoft-defender-antivirus?view=o365-worldwide#event-id-5101
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md
- https://craigclouditpro.wordpress.com/2020/03/04/hunting-malicious-windows-defender-activity/
logsource:
  product: windows
  service: windefend
detection:
  selection:
    EventID: 5101
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 360a1340-398a-46b6-8d06-99b905dc69d2
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/windefend/win_defender_antimalware_platform_expired.yml
falsepositives:
- Unknown
