id: sigmahq-sigma-1321dc4e-a1fe-481d-a016-52c45f0c8b4f
name: Windows Defender Exclusions Added
description: Detects the Setting of Windows Defender Exclusions
severity: medium
enabled: true
tags:
  mitre:
  - T1685
  categories:
  - endpoint
references:
- https://twitter.com/_nullbind/status/1204923340810543109
logsource:
  product: windows
  service: windefend
detection:
  selection:
    EventID: 5007
    NewValue|contains: \Microsoft\Windows Defender\Exclusions
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 1321dc4e-a1fe-481d-a016-52c45f0c8b4f
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/windefend/win_defender_config_change_exclusion_added.yml
falsepositives:
- Administrator actions
