id: sigmahq-sigma-6c0a7755-6d31-44fa-80e1-133e57752680
name: Windows Defender Threat Detection Service Disabled
description: Detects when the "Windows Defender Threat Protection" service is disabled.
severity: medium
enabled: true
tags:
  mitre:
  - T1685
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/defender-endpoint/troubleshoot-microsoft-defender-antivirus
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md
logsource:
  product: windows
  service: system
detection:
  selection:
    EventID: 7036
    Provider_Name: Service Control Manager
    param1:
    - Windows Defender Antivirus Service
    - Service antivirus Microsoft Defender
    param2:
    - stopped
    - arrêté
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 6c0a7755-6d31-44fa-80e1-133e57752680
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/system/service_control_manager/win_system_defender_disabled.yml
falsepositives:
- Administrator actions
- Auto updates of Windows Defender causes restarts
