id: sigmahq-sigma-91903aba-1088-42ee-b680-d6d94fe002b0
name: Windows Defender Submit Sample Feature Disabled
description: Detects disabling of the "Automatic Sample Submission" feature of Windows
  Defender.
severity: low
enabled: true
tags:
  mitre:
  - T1685
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/defender-endpoint/troubleshoot-microsoft-defender-antivirus?view=o365-worldwide
- https://bidouillesecurity.com/disable-windows-defender-in-powershell/#DisableAntiSpyware
logsource:
  product: windows
  service: windefend
detection:
  selection:
    EventID: 5007
    NewValue|contains: \Real-Time Protection\SubmitSamplesConsent = 0x0
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 91903aba-1088-42ee-b680-d6d94fe002b0
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/windefend/win_defender_config_change_sample_submission_consent.yml
falsepositives:
- Administrator activity (must be investigated)
