id: sigmahq-sigma-686c0b4b-9dd3-4847-9077-d6c1bbe36fcb
name: Windows Defender Virus Scanning Feature Disabled
description: Detects disabling of the Windows Defender virus scanning feature
severity: high
enabled: true
tags:
  mitre:
  - T1685
  categories:
  - endpoint
references:
- https://learn.microsoft.com/en-us/defender-endpoint/troubleshoot-microsoft-defender-antivirus?view=o365-worldwide#event-id-5012
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md
- https://craigclouditpro.wordpress.com/2020/03/04/hunting-malicious-windows-defender-activity/
logsource:
  product: windows
  service: windefend
detection:
  selection:
    EventID: 5012
  condition: selection
provenance:
  source: SigmaHQ/sigma
  source_id: 686c0b4b-9dd3-4847-9077-d6c1bbe36fcb
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/builtin/windefend/win_defender_virus_scan_disabled.yml
falsepositives:
- Unknown
