id: sigmahq-sigma-d21374ff-f574-44a7-9998-4a8c8bf33d7d
name: WmiPrvSE Spawned A Process
description: Detects WmiPrvSE spawning a process
severity: medium
enabled: true
tags:
  mitre:
  - T1047
  categories:
  - endpoint
references:
- https://threathunterplaybook.com/hunts/windows/190815-RemoteServiceInstallation/notebook.html
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage|endswith: \WmiPrvSe.exe
  filter_logonid:
    LogonId:
    - '0x3e7'
    - 'null'
  filter_system_user:
    User|contains:
    - AUTHORI
    - AUTORI
  filter_wmiprvse:
    Image|endswith: \WmiPrvSE.exe
  filter_werfault:
    Image|endswith: \WerFault.exe
  filter_null:
    LogonId: null
  condition: selection and not 1 of filter_*
provenance:
  source: SigmaHQ/sigma
  source_id: d21374ff-f574-44a7-9998-4a8c8bf33d7d
  source_commit: df5c6a6
  license: DRL-1.1
  license_url: https://github.com/SigmaHQ/Detection-Rule-License
  imported_at: '2026-05-04'
  imported_by: sigma_importer
  upstream_path: rules/windows/process_creation/proc_creation_win_wmiprvse_spawning_process.yml
falsepositives:
- False positives are expected (e.g. in environments where WinRM is used legitimately)
